


$(function() {
		
	// ***************************************** L i b r a r y   I n i t i a l i z a t i o n *****************************************

	// $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ jQuery UI Library $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
	
	//$(document).tooltip();

	// ********** Tab Navigation **********
    /*
	$("#tabbed-nav").tabs({
	    collapsible: true,
	    active: 0
	});

	$("#tabbed-nav").tabs("option", "heightStyle", "content");

	$("#tabbed-nav").css({ width: "680" });

	// ********** Tab Navigation **********
	$("#Ctrl-accordion-五行分析").accordion({
	    active: 0,
	    heightStyle: "content",
	    clearStyle: true,
	    collapsible: true
	});

	$("#Ctrl-accordion-十神分析").accordion({
	    active: 0,
	    heightStyle: "content",
	    clearStyle: true,
	    collapsible: true
	});

	// additional customization on Accordion CSS
	$(".ui-accordion-content").css("padding","2px 2px 10px 2px");  //to adjust the content of the accordion

	// ********** Dialog **********
    $("#dlg流運分析").dialog({
        autoOpen: false,
        //modal: true,
        closeOnEscate: true,
        width: 700,
        buttons: [
            {
                text: "OK",
                click: function () {
                    $(this).dialog("close");
                }
            },
            {
                text: "全選",
                click: function () {
                    $(this).selectText();
                }
            }
        ]
    });

	// ########################## Bootstrap 3 ##########################
	$('[data-toggle="tooltip"]').tooltip();
	/*
    $(".btn-五行開運").click(function(){
        $(".collapse").collapse('toggle');
    });
	*/
	// ***************************** P r o g r a m   I n i t i a l i z a t i o n *****************************
    InitQuickRef();
    
    $('#DivRotQuote').quoteRotator();
    $("#BaziChart").hide();
    
    document.title = 系統.版本.網頁標題;

	//$("#tabbed-nav").hide();

    // ***************************** 節 氣  I n i t i a l i z a t i o n *****************************    
});

$(document).on("click tap", "#btnConvertBZ", function () {
    轉換八字();
});

/*
$(document).on("click", "#身強弱量規", function () {
    身強弱量規值.update(命盤.分析.強弱.印比.數據);
});
*/


function 八字排盤(西曆生日時, 性別, 國家) {
    //document.getElementById("content").innerHTML='<object type="text/html" data="home.html" ></object>';
    命盤 = new 八字命盤模塊(西曆生日時, 性別, 國家, 系統.設定);
    if (命盤.運行參數.運算.ChartNull == true) {
        $("#BaziChart").html(GenBaziChart());
        命盤.運行參數.運算.ChartNull = false;
    }
    
    $("#DivRotQuote").hide();
    $("#BaziChart").show();
    //$("#tabbed-nav").show();

    $(".大運干支格子").eq(9-命盤.運行.大運數).trigger("click"); // click 現行的大運
    命盤.運行.大運流年數 = 現行大運流年數(命盤.大運[命盤.運行.大運數].起年);
    $(".流年干支格子").eq(9-命盤.運行.大運流年數).trigger("click"); // click 現行的流年

    var 生日資訊;
    //if(命盤.生日.日光節約!="") {
    //    生日資訊 = 命盤.陽男陰女 + ", " + 命盤.生日.節氣 + ", " + 命盤.生日.日光節約;
    //}
    生日資訊 = 命盤.陽男陰女 + ", " + 命盤.生日.生肖 + ", " + 命盤.生日.星座 + ", " + 命盤.生日.節氣;
    
    var 西曆中文=命盤.生日.西曆中文;
    if(命盤.生日.交節日!="") 西曆中文 += "，（交節日）";
    
    var 橫幅附加="";
    系統.設定.用戶設定.四柱歲數.年柱="1-16"; 系統.設定.用戶設定.四柱歲數.月柱="17-32"; 系統.設定.用戶設定.四柱歲數.日柱="33-48"; 系統.設定.用戶設定.四柱歲數.時柱="49-64"; 

    if(系統.設定.用戶設定.象論盤) {
        橫幅附加=" * ";
        系統.設定.用戶設定.四柱歲數.年柱="1-15"; 系統.設定.用戶設定.四柱歲數.月柱="16-30"; 系統.設定.用戶設定.四柱歲數.日柱="31-45"; 系統.設定.用戶設定.四柱歲數.時柱="45-60"; 
    }

    $("#橫幅名稱").html(橫幅附加 + 系統.版本.平台標題+橫幅附加);
    
    $("#版本名稱").html(系統.版本.版本顯示);
    $("#CopyrightID").html(系統.版本.copyright);
    
    $("#mpxs-生日資訊").html(生日資訊);
    $("#mpxs-西曆生日").html(西曆中文);
    $("#mpxs-農曆生日").html(命盤.生日.農曆);

    var 元男元女 = (命盤.性別 == "男") ? "元男" : "元女";
    $("#mpxs-日元").html(元男元女);

    // *********** 導入 四柱歲數 範圍 ***********
    $("#mpxs-時柱歲數").html(系統.設定.用戶設定.四柱歲數.時柱);
    $("#mpxs-日柱歲數").html(系統.設定.用戶設定.四柱歲數.日柱);
    $("#mpxs-月柱歲數").html(系統.設定.用戶設定.四柱歲數.月柱);
    $("#mpxs-年柱歲數").html(系統.設定.用戶設定.四柱歲數.年柱);

    // *********** 導入 八字干支、藏干 ***********
    $("#mpxs-年干").html(命盤.年干.天干);
    $("#mpxs-年支").html(命盤.年支.地支);

    $("#mpxs-月干").html(命盤.月干.天干);
    $("#mpxs-月支").html(命盤.月支.地支);

    $("#mpxs-日干").html(命盤.日干.天干);
    $("#mpxs-日支").html(命盤.日支.地支);

    $("#mpxs-時干").html(命盤.時干.天干);
    $("#mpxs-時支").html(命盤.時支.地支);
    
    $("#mpxs-年支藏干1").html(命盤.年支.藏干1 + " " + 命盤.年支.十神1 + "<br>");
    $("#mpxs-年支藏干2").html(命盤.年支.藏干2 + " " + 命盤.年支.十神2 + "<br>");
    $("#mpxs-年支藏干3").html(命盤.年支.藏干3 + " " + 命盤.年支.十神3);
    
    $("#mpxs-月支藏干1").html(命盤.月支.藏干1 + " " + 命盤.月支.十神1 + "<br>");
    $("#mpxs-月支藏干2").html(命盤.月支.藏干2 + " " + 命盤.月支.十神2 + "<br>");
    $("#mpxs-月支藏干3").html(命盤.月支.藏干3 + " " + 命盤.月支.十神3);

    $("#mpxs-日支藏干1").html(命盤.日支.藏干1 + " " + 命盤.日支.十神1 + "<br>");
    $("#mpxs-日支藏干2").html(命盤.日支.藏干2 + " " + 命盤.日支.十神2 + "<br>");
    $("#mpxs-日支藏干3").html(命盤.日支.藏干3 + " " + 命盤.日支.十神3);

    $("#mpxs-時支藏干1").html(命盤.時支.藏干1 + " " + 命盤.時支.十神1 + "<br>");
    $("#mpxs-時支藏干2").html(命盤.時支.藏干2 + " " + 命盤.時支.十神2 + "<br>");
    $("#mpxs-時支藏干3").html(命盤.時支.藏干3 + " " + 命盤.時支.十神3);
    
    
    // *********** 導入 主星、副星 十神 ***********
    $("#mpxs-年干十神").html(命盤.年干.十神);
    $("#mpxs-月干十神").html(命盤.月干.十神);
    $("#mpxs-時干十神").html(命盤.時干.十神);
    
    if($("#mpxs-時干").html()=="-") $("#mpxs-時干十神").html("吉時"); //沒有時辰的時干十神設為 吉時
 

    // *********** 導入 運星 ***********
    if(系統.設定.用戶設定.命盤顯示.運星){
        $("#mpxs-年運星").html(命盤.年柱.運星);
        $("#mpxs-月運星").html(命盤.月柱.運星);
        $("#mpxs-日運星").html(命盤.日柱.運星);
        $("#mpxs-時運星").html(命盤.時柱.運星);
    }

     // *********** 導入 納音 ***********
    if(系統.設定.用戶設定.命盤顯示.納音){
        $("#mpxs-年柱納音").html(命盤.年柱.納音);
        $("#mpxs-月柱納音").html(命盤.月柱.納音);
        $("#mpxs-日柱納音").html(命盤.日柱.納音);
        $("#mpxs-時柱納音").html(命盤.時柱.納音);
    }

    // *********** 導入 神煞 ***********
    if(系統.設定.用戶設定.命盤顯示.神煞){
        $("#mpxs-年柱神煞").html(命盤.神煞.年柱.join("<br>"));
        $("#mpxs-月柱神煞").html(命盤.神煞.月柱.join("<br>"));
        $("#mpxs-日柱神煞").html(命盤.神煞.日柱.join("<br>"));
        $("#mpxs-時柱神煞").html(命盤.神煞.時柱.join("<br>"));
    }
    // ******** 導入 大運干支起歲 ********
    for (var j = 0; j <= 9; j++) {
        $("#mpxs-大運" + j + "干支").html(VerticalString(命盤.大運[j].大運顯示, "大運干支字"));
        $("#mpxs-大運" + j + "起歲").html(命盤.大運[j].起歲);
        $("#mpxs-大運" + j + "起年").html(命盤.大運[j].起年);
    }

    // ******** 導入 起運 、宮位********
    $("#mpxs-起運").html(命盤.分析句.起運);
    
    // ******** 導入 命盤提示 ********
    var 命盤提示內容=[];
    if(命盤.命盤提示.夏令!="") 命盤提示內容.push(命盤.命盤提示.夏令);
    命盤提示內容.push(命盤.命盤提示.上運+ "。" + 命盤.命盤提示.交脫);
    if(系統.設定.用戶設定.命盤提示.人元司令) 命盤提示內容.push(命盤.命盤提示.人元司令);
    if(系統.設定.用戶設定.命盤提示.命身胎) 命盤提示內容.push(命盤.命盤提示.宮位);
    if(系統.設定.用戶設定.命盤提示.五行四時) 命盤提示內容.push(命盤.命盤提示.五行四時);
    if(系統.設定.用戶設定.命盤提示.八字提要) 命盤提示內容.push(命盤.命盤提示.八字提要);
    $("#mpxs-命盤提示").html(Array2UnorderedList(命盤提示內容, "命盤提示"));

    if(命盤.起歲==1) $('#表格行數-0').hide();  //如果一歲起歲，隱藏大運第一行
    刷新命盤顏色();  //jQueryInitCtrl

    // ***** App & 速查按鈕 開關 ******
    //alert(系統.設定.用戶設定.App.十神格速查);
    if(系統.設定.用戶設定.App.五行開運速查) $("#btn-五行開運").show();
    if(系統.設定.用戶設定.App.精簡萬年曆) $("#btn-精簡萬年曆").show();
    if(系統.設定.用戶設定.App.十神格速查) $("#btn-十神格個性").show();
    if(系統.設定.用戶設定.App.八字流年表) $("#btn-八字流年表").show();

    //命盤內容建立(命盤);  //本命論斷
    
    //$("#身強弱量規").trigger("click"); // click to refresh liquid fill gauge new value

    //流年十二神煞(命盤.生日.農曆年, 命盤.生日.農曆月, 命盤.生日.農曆日, 命盤.生日.農曆時, "流年十二神煞論斷");
} //end function 八字排盤


function 刷新命盤顏色(){
    // ********************* 轉換字體五行顏色 *********************
    for (var i = 0; i < $(".mpxs-本命八字干支").length; i++) {
        var 干支字 = $(".mpxs-本命八字干支").eq(i).html();
		var 干支五行=干支字.substr(0,1); //取第一個字
        $(".mpxs-本命八字干支").eq(i).removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
        var 五行顏色 = 干支五行字體顏色(干支五行,"CSS");
        $(".mpxs-本命八字干支").eq(i).addClass(五行顏色);
    } //end for 本命八字干支

    for (var i = 0; i <= $(".mpxs-本命十神").length; i++) {
        var 十神星 = $(".mpxs-本命十神").eq(i).html();
        var 十神五行字 = 十神五行(命盤.日干.天干, 十神星);
        $(".mpxs-本命十神").eq(i).removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
        var 五行顏色 = 干支五行字體顏色(十神五行字,"CSS");
        $(".mpxs-本命十神").eq(i).addClass(五行顏色);
    } //end for 本命十神
	
	
	// ************ 纳音颜色 ************
    if(系統.設定.用戶設定.命盤顯示.納音){
        for (var i = 0; i < $(".mpxs-本命纳音").length; i++) {
            var 納音 = $(".mpxs-本命纳音").eq(i).html();
            var 納音五行 = 納音.substr(2,1);
            $(".mpxs-本命纳音").eq(i).removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
            var 五行顏色 = 干支五行字體顏色(納音五行,"CSS");
            $(".mpxs-本命纳音").eq(i).addClass(五行顏色);
        } //end for 纳音颜色
    } //end 納音顯示
} //end 刷新命盤顏色
    
$(document).on("click touchstart", ".大運干支格子", function () {
	$('.大運干支格子').css('background', '');
	$(this).css('background', 'yellow');

	// ******** 導入 大運干支起歲 ********
	var 大運數 = $(this).attr("data-大運數");
	命盤.運行.大運數 = 大運數;

    $("#mpxs-大運歲數").html(命盤.大運[大運數].歲數間距);

	var 大運干 = 命盤.大運[大運數].干支.substr(0, 1);
	$("#mpxs-大運干").html(大運干);
	var 大運支 = 命盤.大運[大運數].干支.substr(1, 1);
	$("#mpxs-大運支").html(大運支);

	$("#mpxs-大運十神").html(命盤.大運[大運數].天干十神);
	$("#mpxs-大運藏干1").html(命盤.大運[大運數].藏干1 + " " + 命盤.大運[大運數].地支十神1 + "<br>");
	$("#mpxs-大運藏干2").html(命盤.大運[大運數].藏干2 + " " + 命盤.大運[大運數].地支十神2 + "<br>");
	$("#mpxs-大運藏干3").html(命盤.大運[大運數].藏干3 + " " + 命盤.大運[大運數].地支十神3);

    if(系統.設定.用戶設定.命盤顯示.運星) $("#mpxs-大運運星").html(命盤.大運[大運數].運星);
    if(系統.設定.用戶設定.命盤顯示.納音) $("#mpxs-大運納音").html(命盤.大運[大運數].納音);

	// ************** update 運行的參數 & 註解 *************

	//命盤.分析.行運註解.大運 = 行運分析模塊(命盤, "大運");
	//$("#大運註解").html(命盤.分析.行運註解.大運);

	// ************** update 流年block ***********
	for (var j = 0; j <= 9; j++) {
	    $("#mpxs-流年" + j + "干支").html(VerticalString(命盤.大運[命盤.運行.大運數].流年[j].干支, "流年干支字"));
	    $("#mpxs-流年" + j + "歲數").html(命盤.大運[命盤.運行.大運數].流年[j].歲數);
	    $("#mpxs-流年" + j + "年份").html(命盤.大運[命盤.運行.大運數].流年[j].年份);
        if(系統.設定.用戶設定.命盤顯示.小運) $("#mpxs-小運" + j + "干支").html(命盤.大運[命盤.運行.大運數].流年[j].小運);

	    //var 流年十神Tooltip = "天干: " + 命盤.大運[命盤.運行.大運數].流年[j].天干十神 + ", 藏干: " + 命盤.大運[命盤.運行.大運數].流年[j].地支十神1 + " " + 命盤.大運[命盤.運行.大運數].流年[j].地支十神2 + " " + 命盤.大運[命盤.運行.大運數].流年[j].地支十神3;
	    //$("#mpxs-流年" + j + "干支").prop('title', 流年十神Tooltip);
	    //var elementTitle = $('#yourElementId').prop('title'); //to retrieve the title
	}

	// ************** 按大運後，除掉所有流年資料 ******************
	$('.流年干支格子').css('background', '');

    $("#mpxs-流年歲數").html("");
	$("#mpxs-流年干").html("");
	$("#mpxs-流年支").html("");
	$("#mpxs-流年藏干1").html("");
	$("#mpxs-流年藏干2").html("");
	$("#mpxs-流年藏干3").html("");
	$("#mpxs-流年十神").html("");

    if(系統.設定.用戶設定.命盤顯示.納音) $("#mpxs-流年納音").html("");
    if(系統.設定.用戶設定.命盤顯示.神煞) $("#mpxs-流年神煞").html("");
	
    if(系統.設定.用戶設定.命盤顯示.運星){
        $("#mpxs-流年運星").html("");
        $("#mpxs-當選流年年份").html("");
    }
    
	$("#流年註解").html(""); //清除流年註解

	命盤.運行.大運流年數 = "";
	命盤.運行.流年年份 = "";
	命盤.分析.行運註解.流年 = "";

	// ************** update 大運干支，藏干顏色 **************
	$("#mpxs-大運干").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
	$("#mpxs-大運干").addClass(干支五行字體顏色($("#mpxs-大運干").html(),"CSS"));
	$("#mpxs-大運支").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
	$("#mpxs-大運支").addClass(干支五行字體顏色($("#mpxs-大運支").html(),"CSS"));

	$("#mpxs-大運十神").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
	$("#mpxs-大運十神").addClass(干支五行字體顏色(十神五行(命盤.日干.天干, $("#mpxs-大運十神").html()),"CSS"));
	
	var 大運藏干五行1=($("#mpxs-大運藏干1").html()).substr(0,1);
	var 大運藏干五行2=($("#mpxs-大運藏干2").html()).substr(0,1);
	var 大運藏干五行3=($("#mpxs-大運藏干3").html()).substr(0,1);
	
	$("#mpxs-大運藏干1").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
	$("#mpxs-大運藏干1").addClass(干支五行字體顏色(大運藏干五行1,"CSS"));
	$("#mpxs-大運藏干2").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
	$("#mpxs-大運藏干2").addClass(干支五行字體顏色(大運藏干五行2,"CSS"));
	$("#mpxs-大運藏干3").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
	$("#mpxs-大運藏干3").addClass(干支五行字體顏色(大運藏干五行3,"CSS"));

    if(系統.設定.用戶設定.命盤顯示.納音){
    	$("#mpxs-大運納音").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    	$("#mpxs-大運納音").addClass(干支五行字體顏色($("#mpxs-大運納音").html().substr(2,1),"CSS"));
	}
    if(系統.設定.用戶設定.命盤顯示.神煞) $("#mpxs-大運神煞").html(單柱神煞(命盤, 命盤.大運[大運數].干支).join("<br>"));

	// ************** 清除流月數據 ***********
    if(系統.設定.用戶設定.命盤顯示.流月){
    	$('.流月干支格子').css('background', '');
    	命盤.運行.流月數 = "";
    	命盤.運行.流月份 = "";
    	$("#流月註解").html(""); //清除流年註解
    	命盤.分析.行運註解.流月用 = 0; // turn off 流月

    	for (var i = 0; i <= 11; i++) {
    	    $("#mpxs-流月" + i + "干支").html("-");
    	    //$("#mpxs-流月" + i + "干支").prop('title', "");
    	} //end for 流月
    } //end 顯示流月

});  // end 大運格子 on click


$(document).on("click touchstart", ".流年干支格子", function () {
    $('.流年干支格子').css('background', '#FAFAFA');
    $(this).css('background', 'yellow');

    // ******** 導入 流年干支起歲 ********
    var 流年數 = $(this).attr("data-流年數");
    var 流年干 = 命盤.大運[命盤.運行.大運數].流年[流年數].干支.substr(0, 1);
    $("#mpxs-流年干").html(流年干);
    var 流年支 = 命盤.大運[命盤.運行.大運數].流年[流年數].干支.substr(1, 1);
    $("#mpxs-流年支").html(流年支);

	$("#mpxs-流年十神").html(命盤.大運[命盤.運行.大運數].流年[流年數].天干十神);
    $("#mpxs-流年藏干1").html(命盤.大運[命盤.運行.大運數].流年[流年數].藏干1 + " " + 命盤.大運[命盤.運行.大運數].流年[流年數].地支十神1 + "<br>");
    $("#mpxs-流年藏干2").html(命盤.大運[命盤.運行.大運數].流年[流年數].藏干2 + " " + 命盤.大運[命盤.運行.大運數].流年[流年數].地支十神2 + "<br>");
    $("#mpxs-流年藏干3").html(命盤.大運[命盤.運行.大運數].流年[流年數].藏干3 + " " + 命盤.大運[命盤.運行.大運數].流年[流年數].地支十神3);

	$("#mpxs-流年歲數").html(命盤.大運[命盤.運行.大運數].流年[流年數].年份 + "/" + 命盤.大運[命盤.運行.大運數].流年[流年數].歲數);
    if(系統.設定.用戶設定.命盤顯示.運星) $("#mpxs-流年運星").html(命盤.大運[命盤.運行.大運數].流年[流年數].運星);
    if(系統.設定.用戶設定.命盤顯示.納音) $("#mpxs-流年納音").html(命盤.大運[命盤.運行.大運數].流年[流年數].納音);
    if(系統.設定.用戶設定.命盤顯示.神煞)  $("#mpxs-流年神煞").html(單柱神煞(命盤, 命盤.大運[命盤.運行.大運數].流年[流年數].干支, "流年").join("<br>"));

    命盤.運行.大運流年數 = 流年數;
    命盤.運行.流年年份 = 命盤.大運[命盤.運行.大運數].流年[流年數].年份;
    命盤.運行.歲數 = Number(Number(命盤.運行.流年年份) - Number(命盤.生日.西曆年) + 1);

    //命盤.分析.行運註解.流年 = 行運分析模塊(命盤, "流年");
    命盤.分析.行運註解.流月用 = 1; // turn on 流月
    //$("#流年註解").html(命盤.分析.行運註解.流年);
    //$("#流月註解").html(""); // 若轉換流年，刪除流月註解

    // ************** 更新 命盤數據、 流月干支 ***********
    命盤.運行.流年年份 = 命盤.大運[命盤.運行.大運數].流年[流年數].年份;
    for (var i = 0; i <= 11; i++) {
        命盤.流月[i] = new 流月模塊(命盤.運行.流年年份, 命盤.日干.天干, i);
    }

    // ************** update 流年干支，藏干顏色 **************

    $("#mpxs-流年干").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    $("#mpxs-流年干").addClass(干支五行字體顏色($("#mpxs-流年干").html(),"CSS"));
    $("#mpxs-流年支").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    $("#mpxs-流年支").addClass(干支五行字體顏色($("#mpxs-流年支").html(),"CSS"));

	$("#mpxs-流年十神").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    $("#mpxs-流年十神").addClass(干支五行字體顏色(十神五行(命盤.日干.天干, $("#mpxs-流年十神").html()),"CSS"));
	
	var 流年藏干五行1=($("#mpxs-流年藏干1").html()).substr(0,1);
	var 流年藏干五行2=($("#mpxs-流年藏干2").html()).substr(0,1);
	var 流年藏干五行3=($("#mpxs-流年藏干3").html()).substr(0,1);
    $("#mpxs-流年藏干1").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    $("#mpxs-流年藏干1").addClass(干支五行字體顏色(流年藏干五行1,"CSS"));
    $("#mpxs-流年藏干2").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    $("#mpxs-流年藏干2").addClass(干支五行字體顏色(流年藏干五行2,"CSS"));
    $("#mpxs-流年藏干3").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    $("#mpxs-流年藏干3").addClass(干支五行字體顏色(流年藏干五行3,"CSS"));

    if(系統.設定.用戶設定.命盤顯示.納音){
    	$("#mpxs-流年納音").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    	$("#mpxs-流年納音").addClass(干支五行字體顏色($("#mpxs-流年納音").html().substr(2,1),"CSS"));
    }

    // ****** clear the 流月 selection ******
    if(系統.設定.用戶設定.命盤顯示.流月){
        $('.流月干支格子').css('background', '');
        命盤.運行.流月數 = "";
        命盤.運行.流月份 = "";

        // ************** 刷新命盤上流月的顯示 ***********
        for (var j = 0; j <= 11; j++) {
            $("#mpxs-流月" + j + "干支").html(VerticalString(命盤.流月[j].干支, "流月干支字"));
            //var 流月十神Tooltip = "天干: " + 命盤.流月[j].天干十神 + ", 藏干: " + 命盤.流月[j].地支十神1 + " " + 命盤.流月[j].地支十神2 + " " + 命盤.流月[j].地支十神3;
            //$("#mpxs-流月" + j + "干支").prop('title', 流月十神Tooltip);
        } //end for 流月
    } //end 顯示流月

    // ********************* App *********************
    /*
    var 西曆流年=命盤.運行.流年年份;
    var 流年干支= 六十干支屬性((西曆流年 - 1923)%60, "干支");
    var 流年虛歲=西曆流年-命盤.生日.農曆年+1;
    var 太歲名字=六十干支屬性((西曆流年 - 1923)%60, "太歲");
    var 流年標題='<span class = "論斷單元">流年十二神煞</span>';
    var 命盤資料='<span class = "經典標題">流年：' + 西曆流年 + '（' + 流年干支 + '），太歲：' +太歲名字+ '，虛歲：' + 流年虛歲 + '</span>';
    
    流年神煞矩陣=[];
    流年神煞矩陣.push(流年標題);
    流年神煞矩陣.push(命盤資料);
    流年神煞矩陣.push(命宮流年神煞判斷(命盤.命宮, 西曆流年));
    流年神煞矩陣.push(流年十二神煞判斷(命盤.生日.農曆年, 命盤.生日.農曆月, 命盤.生日.農曆日, 命盤.生日.農曆時, 西曆流年, 2));
    
    //流年十二神煞論斷=流年十二神煞(this.生日.農曆年, this.生日.農曆月, this.生日.農曆日, this.生日.農曆時, 2016, 2);
    //命宮流年神煞論斷=命宮流年神煞判斷(this.命宮, 2016);
    
    $("#App-流年神煞").html(流年神煞矩陣.join("<br><br>"));
    */
});  // end 流年格子 on click

/*
$(document).on("click touchstart", ".流月干支格子", function () {
    if (命盤.分析.行運註解.流月用 == 1) {
        $('.流月干支格子').css('background', '#FAFAFA');
        $(this).css('background', 'yellow');
        var 流月數 = $(this).attr("data-流月數");
        命盤.運行.流月數 = 流月數;
        命盤.運行.流月份 = Number(流月數) + 1;
        //$(".流月干支格子").eq(流月數).addClass("運限背景顏色當選");

        命盤.分析.行運註解.流月 = 行運分析模塊(命盤, "流月");
        $("#流月註解").html(命盤.分析.行運註解.流月);
    }
}); //end 流年月格子 on click

$(document).on("dblclick", ".流月干支格子", function () {
    if (命盤.分析.行運註解.流月用 == 1) {
        $('.流月干支格子').css('background', '#FAFAFA');
        $(this).css('background', 'yellow');
        var 流月數 = $(this).attr("data-流月數");
        命盤.運行.流月數 = 流月數;
        命盤.運行.流月份 = Number(流月數) + 1;
        //$(".流月干支格子").eq(流月數).addClass("運限背景顏色當選");

        //命盤.分析.行運註解.流月 = 行運分析模塊(命盤, "流月");
        //$("#dlg流運分析").html(命盤.分析.行運註解.流月);
        //$("#dlg流運分析").dialog('option', 'title', '流月分析：');
        //$("#dlg流運分析").dialog("open");
        
    }
}); //end 流年月格子 on double click - dialog !!
*/
