function 命盤參數分析(命盤){
    //分析命盤的主要參數
	
	// ********************** 天干通根、地支透幹分析 ************************
	天干通根(命盤);
	地支透干(命盤);
	
	判斷干支相合(命盤);  //各柱干支是否有相合
	
    判斷刑冲合會害(命盤);
    //判斷日主強弱(命盤);

    // ************************* 神煞 **************************
    //this is temporary - to be deleted
    var 神煞數據=尋神煞(命盤.年柱.干支, 命盤.月柱.干支, 命盤.日柱.干支, 命盤.時柱.干支, 命盤.性別, 命盤.陽男陰女);
    命盤.神煞 = {
        "其他": 神煞數據[0],
        "年柱": 神煞數據[1],
        "月柱": 神煞數據[2],
        "日柱": 神煞數據[3],
        "時柱": 神煞數據[4],  //var 時柱神煞=斷特殊神煞[3].concat(斷日干神煞[3], 斷年支神煞[3], 斷日支神煞[3], 斷月支神煞[3]);
        "命盤": 神煞數據[1].concat(神煞數據[2],神煞數據[3],神煞數據[4],神煞數據[0])
    };

    判斷神煞(命盤);  //revised 神煞, to be completed !!

    // ************************* 八字力度分析 **************************
    
}

//****************** 命盤分析註解 ******************
function 命盤分析註解(命盤){

    var 命盤分析總矩陣 = [];

	$("#nrxs-基礎分析").html(命盤基本分析(命盤));

	
	干支五行十神力度分析(命盤);
    $("#nrxs-基礎分析").append(判斷日主強弱(命盤));

    //命盤分析總矩陣.push(干支克應分析(命盤));
    $("#nrxs-地支刑冲合害表").html(干支克應分析(命盤));

    $("#nrxs-地支分析註解").html(命盤刑冲合會害分析(命盤));
    
    $("#nrxs-用神喜忌表").html("<br>"+用神喜忌分析(命盤));
    
    
    //命盤分析總矩陣.push(用神喜忌分析(命盤));
    //if(命盤.系統參數.設定.Access >= 3) 命盤分析總矩陣.push(命盤刑冲合會害分析(命盤));

    if(命盤分析總矩陣.length>0) return 命盤分析總矩陣.join("<br><br>");
}

function 命盤基本分析 (命盤){
    var 命盤基本分析小結 = [];

    命盤基本分析小結.push(命盤.分析句.起運);
    命盤基本分析小結.push(命盤.分析句.人元司令);
    //命盤基本分析小結.push("節氣："+命盤.生日.節氣+"，"+二十四節氣屬性(命盤.生日.節氣, "標準註解"));
    命盤基本分析小結.push(地支特性(命盤.月令, "提綱分論"));
    if (八字全陰陽(命盤)!="") 命盤基本分析小結.push(八字全陰陽(命盤));
    命盤基本分析小結.push(命盤.分析句.庫馬花);
    命盤基本分析小結.push(判斷財庫(命盤));
    命盤基本分析小結.push(命盤.分析句.外在內在);
    命盤基本分析小結.push("命宮："+ 命盤.命宮 + "，身宮："+ 命盤.身宮 + "，胎元：" + 命盤.胎元 + "，胎息：" + 命盤.胎息 + "。");
    命盤基本分析小結.push("空亡：" + 命盤.空亡.年柱 + "（年柱），"+ 命盤.空亡.日柱 + "（日柱）。");

    var 命盤小總結 = '<span class = "論斷單元">' + '命盤分析：</span><br>';
    var 命盤小結分析單 = Array2UnorderedList(命盤基本分析小結, "基本分析：");
    return 命盤小總結 + 命盤小結分析單;
}


function 判斷日主強弱(命盤){
    //var 月令環境=日干月令對照(命盤.日柱.天干,命盤.月令,"旺相休囚死");
    //命盤.分析.強弱.環境.令=月令環境;
    //命盤.分析.強弱.環境.環境值=旺相休囚死字數轉換(月令環境);
    
    return "身"+ 命盤.分析.強弱.身.強弱 +"，日干："+ 命盤.分析.強弱.日主.強弱 + "(" + 命盤.分析.強弱.日主.數據.toFixed(0) + "%) ; 印比 / 殺剋洩：" + 命盤.分析.強弱.印比.強弱 + "(" + 命盤.分析.強弱.印比.數據.toFixed(0) +"%)<br><br>";
}


function 日主強弱分析(命盤){
    //判斷日支自身
    var 月令環境=日干月令對照(命盤.日柱.天干,命盤.月令,"旺相休囚死");
    命盤.分析.強弱.環境.令=月令環境;
    命盤.分析.強弱.環境.環境值=旺相休囚死字數轉換(月令環境);

    var 日干數據= 50 * 命盤.日干.力量 / 命盤.系統參數.運算.干支基數; //(命盤.日干.力量 *100 /(命盤.系統參數.運算.干支基數*8)).toFixed(0) ;
    命盤.分析.強弱.日主.數據=parseFloat(日干數據);

    switch(true){
        case (日干數據 < 30):
            命盤.分析.強弱.日主.強弱="極弱";
            命盤.分析.強弱.日主.強弱值=1;
            break;
        case (日干數據 >= 30 && 日干數據 < 42):
            命盤.分析.強弱.日主.強弱="弱";
            命盤.分析.強弱.日主.強弱值=2;
            break;
        case (日干數據 >= 42 && 日干數據 < 48):
            命盤.分析.強弱.日主.強弱="偏弱";
            命盤.分析.強弱.日主.強弱值=3;
            break;            
        case (日干數據 > 48 && 日干數據 <= 52):
            命盤.分析.強弱.日主.強弱="中和";
            命盤.分析.強弱.日主.強弱值=4;
            break;
         case (日干數據 > 52 && 日干數據 <= 58):
            命盤.分析.強弱.日主.強弱="偏強";
            命盤.分析.強弱.日主.強弱值=5;
            break;
         case (日干數據 > 58 && 日干數據 <= 70):
            命盤.分析.強弱.日主.強弱="強";
            命盤.分析.強弱.日主.強弱值=6;
            break;
        case (日干數據 > 70):
            命盤.分析.強弱.日主.強弱="極強";
            命盤.分析.強弱.日主.強弱值=7;
            break;
    }
    
    命盤.分析.強弱.註解.push("日干"+命盤.分析.強弱.日主.強弱);
    
    //判斷 印比vs殺剋洩 的比率，以五行的比率論斷，而非整體命盤十神
    var 命盤五行矩陣=[];
    var 五行印比, 日主五行數=五行字轉數(命盤.日主五行);
    
    命盤五行矩陣.push((100*命盤.分析.陰陽五行.木.力量比率).toFixed(1));
    命盤五行矩陣.push((100*命盤.分析.陰陽五行.火.力量比率).toFixed(1));
    命盤五行矩陣.push((100*命盤.分析.陰陽五行.土.力量比率).toFixed(1));
    命盤五行矩陣.push((100*命盤.分析.陰陽五行.金.力量比率).toFixed(1));
    命盤五行矩陣.push((100*命盤.分析.陰陽五行.水.力量比率).toFixed(1));

    for(var i=0; i<日主五行數; i++){
        var tempdata=命盤五行矩陣[0];
		命盤五行矩陣.shift();
		命盤五行矩陣.push(tempdata);
    } //end for

    五行印比=Number(命盤五行矩陣[0]) + Number(命盤五行矩陣[4]);
    命盤.分析.強弱.印比.數據=五行印比;
    命盤.分析.強弱.殺剋洩.數據=100-五行印比;
    
    switch(true){
        case (五行印比 < 25):
            命盤.分析.強弱.印比.強弱="極弱";
            命盤.分析.強弱.印比.強弱值=1;

            命盤.分析.強弱.殺剋洩.強弱="極強";
            命盤.分析.強弱.殺剋洩.強弱值=5;
            break;
        case (五行印比 >= 25 && 五行印比 < 38):
            命盤.分析.強弱.印比.強弱="弱";
            命盤.分析.強弱.印比.強弱值=2;

			if(命盤.分析.強弱.日主.強弱值>=5) 命盤.分析.強弱.身.特別情況=1;  // 印比低，但日主偏強
			
            命盤.分析.強弱.殺剋洩.強弱="強";
            命盤.分析.強弱.殺剋洩.強弱值=4;
            break;            
        case (五行印比 > 38 && 五行印比 <= 42):
            命盤.分析.強弱.印比.強弱="平";
            命盤.分析.強弱.印比.強弱值=3;

            命盤.分析.強弱.殺剋洩.強弱="平";
            命盤.分析.強弱.殺剋洩.強弱值=3;
            break;
         case (五行印比 > 42 && 五行印比 <= 50):
            命盤.分析.強弱.印比.強弱="偏強";
            命盤.分析.強弱.印比.強弱值=4;

            命盤.分析.強弱.殺剋洩.強弱="偏弱";
            命盤.分析.強弱.殺剋洩.強弱值=2;

            break;
         case (五行印比 > 50 && 五行印比 <= 60):
            命盤.分析.強弱.印比.強弱="強";
            命盤.分析.強弱.印比.強弱值=5;

            命盤.分析.強弱.殺剋洩.強弱="弱";
            命盤.分析.強弱.殺剋洩.強弱值=1;
            break;
        case (五行印比 > 60):
            命盤.分析.強弱.印比.強弱="極強";
            命盤.分析.強弱.印比.強弱值=6;

            命盤.分析.強弱.殺剋洩.強弱="弱";
            命盤.分析.強弱.殺剋洩.強弱值=0.5;
            break;
    }  
    命盤.分析.強弱.註解.push("印比對殺剋洩的比例"+命盤.分析.強弱.印比.強弱);

    // *************** 整合強弱 ***************
    //以印比、殺剋洩為主要對比的中心

	if(命盤.分析.強弱.身.特別情況==0){
		switch(命盤.分析.強弱.印比.強弱值){
			case 1:
				命盤.分析.強弱.身.強弱="弱";
				命盤.分析.強弱.身.強弱值="極弱";
				命盤.分析.強弱.註解.push("印比極弱，故斷身弱");
				命盤.分析.強弱.身.強弱數=2;
				break;
			case 2:
				命盤.分析.強弱.身.強弱="弱";
				命盤.分析.強弱.身.強弱值="弱";
				命盤.分析.強弱.註解.push("印比弱，故斷身弱");
				命盤.分析.強弱.身.強弱數=3;         
				break;
			case 3:
				命盤.分析.強弱.身.強弱="強";
				命盤.分析.強弱.身.強弱值="次強";
				命盤.分析.強弱.註解.push("印比中和，斷身強");
				命盤.分析.強弱.身.強弱數=4;
				break;
			case 4:
				命盤.分析.強弱.身.強弱="強";
				命盤.分析.強弱.身.強弱值="偏強";
				命盤.分析.強弱.註解.push("印比強，斷身強");
				命盤.分析.強弱.身.強弱數=5;
				break;
			case 5:
				命盤.分析.強弱.身.強弱="強";
				命盤.分析.強弱.身.強弱值="強";
				命盤.分析.強弱.註解.push("印比強旺，斷身強");
				命盤.分析.強弱.身.強弱數=6;
				break;
			case 6:
				命盤.分析.強弱.身.強弱="強";
				命盤.分析.強弱.身.強弱值="過旺";
				命盤.分析.強弱.註解.push("印比過旺，斷身強");
				命盤.分析.強弱.身.強弱數=7;
				break;
		}  // end switch 身強弱
	} // end if 強弱.身.特別情況， 不是特別情況

	else {  // 強弱.身.特別情況
		switch(命盤.分析.強弱.身.特別情況){
			case 1: // 特別情況，印比弱，日干偏強
				命盤.分析.強弱.身.強弱="強";
				命盤.分析.強弱.身.強弱值="次強";
				命盤.分析.強弱.註解.push("但因日主強旺而斷身強");
				命盤.分析.強弱.身.強弱數=5;
				break;
		} //end switch 特別情況
	} //end else

    $("#nrxs-身強弱標題").html("身"+命盤.分析.強弱.身.強弱);
    $("#nrxs-身強弱標題").removeClass("五行顏色木 五行顏色火 五行顏色土 五行顏色金 五行顏色水");
    $("#nrxs-身強弱標題").addClass(干支五行字體顏色(命盤.日主五行,"CSS"));
    
    $("#nrxs-身強弱標題2").html(" - "+命盤.分析.強弱.身.強弱值);
    $("#nrxs-身強弱註解").html(命盤.分析.強弱.註解.join("，")+"。");
    
    //console.log(命盤.分析.強弱.印比.強弱+"，"+日干數據 + "，" + 五行印比+ "，" + 命盤.分析.強弱.印比.強弱+"，"+五行印比+","+命盤.分析.強弱.註解.join("，"));
}



function 用神喜忌分析(命盤){
    var 天干字串 = "天干,甲,乙,丙,丁,戊,己,庚,辛,壬,癸";
    窮通寶鑑用神喜忌(命盤.日主, 命盤.月令, 命盤);

    //var 喜忌矩陣 = [];

    var 用神喜忌註解 = SpliceColumnFromArray(命盤.分析句.用神喜忌矩陣, 11, "Yes"); //remove column 1-11, left 12, should it is empty, exclude it
    var 用神喜忌註解單 = Array2UnorderedList(用神喜忌註解);

    喜忌矩陣=RemoveColumnFromArray(命盤.分析句.用神喜忌矩陣, 11);
    喜忌矩陣.unshift(天干字串);

    var ArryTblProp = {
        "Caption": true, //with caption
        "CaptionStr": "用神喜忌總結",
        "CaptionCSS": "default",
        "TableTitle": "",
        "RowHeight": 24, //px
        "ColumnWidth": [85, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42], //width for each column
        "HighligtedRow": [],
        "HighligtedCSS": "",
        "FirstRowIsTitle": true,
        "FirstColIsTitle": true,
        "RowTitleCSS": "",
        "ColTitleCSS": ""
    };

    //console.log(喜忌矩陣);
    var 喜忌表 = ArryToTable(喜忌矩陣, ArryTblProp);

    return 喜忌表+用神喜忌註解單;
}



function 判斷財庫(命盤){
    /*
　- 日柱天干為“甲、乙”，那你的財庫就是戌，假如八字的四個地支中有戌字，就說明你命裡有財庫。
　- 日柱天干為“丙、丁”，那你的財庫就是丑，假如八字的四個地支中有丑字，就說明你命裡有財庫。
　- 日柱天干為“戊、己”，那你的財庫就是辰，假如八字的四個地支中有辰字，就說明你命裡有財庫。
　- 日柱天干為“庚、辛”，那你的財庫就是未，假如八字的四個地支中有未字，就說明你命裡有財庫。
　- 日柱天干為“壬、癸”，那你的財庫就是戌，假如八字的四個地支中有戌字，就說明你命裡有財庫。
    */
    var 財庫地支, 財庫句子;
    var 財庫矩陣 = [];

    switch(命盤.日主){
        case "甲": case "乙":
            財庫地支 = "戌";
            break;
        case "丙": case "丁":
            財庫地支 = "丑";
            break;
        case "戊": case "己":
            財庫地支 = "辰";
            break;
        case "庚": case "辛":
            財庫地支 = "未";
            break;
        case "壬": case "癸":
            財庫地支 = "戌";
            break;
    }

    for(i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].地支 == 財庫地支){
            命盤.分析.四柱.四柱數據[i].財庫 = true;
            財庫矩陣.push(i);
        }
    }

    switch(財庫矩陣.length){
        case 0:
            財庫句子 = "財庫為" + 財庫地支 + "，四柱不帶財庫。";
            break;
        case 1:
            財庫句子 = "財庫為" + 財庫地支 + "，落在"+四柱名稱(財庫矩陣[0])+"。";
            break;
        case 2:
            財庫句子 = "財庫為" + 財庫地支 + "，落在"+四柱名稱(財庫矩陣[0])+"與"+四柱名稱(財庫矩陣[1])+"。";
            break;
        case 3:
            財庫句子 = "財庫為" + 財庫地支 + "，落在"+四柱名稱(財庫矩陣[0])+"、"+四柱名稱(財庫矩陣[1])+"與"+四柱名稱(財庫矩陣[2])+"。";
            break;
        case 4:
            財庫句子 = "財庫為" + 財庫地支 + "，四柱皆是財庫。";
            break;
        default:
            alert("財庫計算錯誤 ！");
    }
    return 財庫句子;
}