

function 行運分析設定(){  //用來儲存行運分析出來的註解
    this.大運 = "";
    this.流年 = "";
    this.流月 = "";
}

function 行運分析模塊(命盤, 流運) {
    var 流運標題;
    var 流運分析總矩陣 = [];
    var 流運分析小結 = [];
    var 流運分析單 = "";
    var 四柱觸動 = [0,0,0,0];

    switch(流運){
        case 0: case "合":
            break;
        case 1: case "大運":
            流運標題 = 命盤.大運[命盤.運行.大運數].干支 + "大運，"+ 命盤.大運[命盤.運行.大運數].歲數間距+"歲，"+ 命盤.大運[命盤.運行.大運數].起年+"-"+Number(Number(命盤.大運[命盤.運行.大運數].起年)+9)+"年";
            break;
        case 2: case "流年":
            流運標題 = 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].干支 + "流年，"+ 命盤.運行.歲數 + "歲，"+ 命盤.運行.流年年份 + "年";
            break;
        case 3: case "流月":
            流運標題 = 命盤.流月[命盤.運行.流月數].干支 + "流月，農曆"+ 命盤.運行.流月份 + "月";
            break;
    }

    var 流運總標題='<span class = "流運標題">' +流運標題+'</span>';

    var 流運刑冲合會害論斷 = 流運刑冲合害(命盤, 流運, 流運分析小結, 四柱觸動);
    var 走十神論斷 = 流運十神論斷(命盤, 流運, 流運分析小結);
    var 天x地x論斷=流運天x地x(命盤, 流運, 流運分析小結)
    var 流運十神坐十神論斷 = 大運配流年十神論斷(命盤, 流運, "流運十神坐十神");
    if(流運=="流年" || 流運=="流月") var 流運十神配對論斷 = 大運配流年十神論斷(命盤, 流運, "大運流年天干"); // 大運十神配流年十神，或流年十神配流月十神
    

    var 流運小總結 = '<span class = "流運標題">' + 流運 + '各柱刑冲合會害總結：</span><br>';
    //var 四柱全動="";
    if (四柱觸動[0]+四柱觸動[1]+四柱觸動[2]+四柱觸動[3]==4) 流運分析小結.unshift(流運+"四支全動！");

    流運分析單 = Array2UnorderedList(流運分析小結);
    流運小總結 = 流運小總結 + 流運分析單;

    //流運分析小結.unshift(流運小總結)

    流運分析總矩陣.push(流運總標題);
    流運分析總矩陣.push(流運小總結);
    //流運分析總矩陣.push(流運分析小結.join("<br>")+"<br><br>");

    流運分析總矩陣.push(流運刑冲合會害論斷);
    if(流運=="流年" || 流運=="流月") 流運分析總矩陣.push(流運十神配對論斷);
    流運分析總矩陣.push(流運十神坐十神論斷);
    流運分析總矩陣.push(走十神論斷);
    流運分析總矩陣.push(天x地x論斷);
    //流運分析總矩陣.push(返吟伏吟論斷);

    return 流運分析總矩陣.join("<br><br>");
}


function 流運天x地x(命盤, 流運, 流運小結) {
    var 各柱干支 = [命盤.年柱.干支, 命盤.月柱.干支, 命盤.日柱.干支, 命盤.時柱.干支];
    var 四柱名稱 = ["年柱", "月柱", "日柱", "時柱", "大運", "流年"];

    switch (流運) {
        case "大運":
            流運干支 = 命盤.大運[命盤.運行.大運數].干支;
            var 流運十神矩陣=[命盤.大運[命盤.運行.大運數].天干十神, 命盤.大運[命盤.運行.大運數].地支十神1];
	        var 天干十神矩陣 = [命盤.年干.十神, 命盤.月干.十神, "", 命盤.時干.十神];
	        var 地支十神矩陣 = [命盤.年支.十神1, 命盤.月支.十神1, 命盤.日支.十神1, 命盤.時支.十神1];
            break;
        case "流年":
            各柱干支 = [命盤.年柱.干支, 命盤.月柱.干支, 命盤.日柱.干支, 命盤.時柱.干支, 命盤.大運[命盤.運行.大運數].干支];
            流運干支 = 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].干支;
	        var 天干十神矩陣 = [命盤.年干.十神, 命盤.月干.十神, "", 命盤.時干.十神, 命盤.大運[命盤.運行.大運數].天干十神];
	        var 地支十神矩陣 = [命盤.年支.十神1, 命盤.月支.十神1, 命盤.日支.十神1, 命盤.時支.十神1, 命盤.大運[命盤.運行.大運數].地支十神1];
            break;
        case "流月":
            流運干支 = 命盤.流月[命盤.運行.流月數].干支;
	        var 天干十神矩陣 = [命盤.年干.十神, 命盤.月干.十神, "", 命盤.時干.十神, 命盤.大運[命盤.運行.大運數].天干十神, 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].天干十神];
	        var 地支十神矩陣 = [命盤.年支.十神1, 命盤.月支.十神1, 命盤.日支.十神1, 命盤.時支.十神1, 命盤.大運[命盤.運行.大運數].地支十神1, 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].地支十神1];
            break;
    }

    var 流運項目 = '<span class = "流運項目">' + 流運 + '天合、剋，地刑冲合：</span>';
    
    var 天x地x論斷矩陣 = [];
    var 伏吟論斷矩陣 = [];
    var 返吟論斷矩陣 = [];

    for(var i=0; i<各柱干支.length; i++){
        var 命盤各柱干支 = 各柱干支[i];
        var 日柱註解="";
        var 時柱註解="";

        if(干支天同地同(流運干支, 命盤各柱干支)!=""){
            伏吟論斷矩陣.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "，形成伏吟。"+伏吟註解(流運, i));
            流運小結.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "形成伏吟。");
        }

        if(干支天剋地冲(流運干支, 命盤各柱干支)!=""){
            返吟論斷矩陣.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "，形成返吟。"+返吟註解(流運, i));
            流運小結.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "形成返吟");
        }

        if(干支天合地合(流運干支, 命盤各柱干支)!=""){
            if(i==2) 日柱註解="<br>日柱為夫妻官，與日柱天合地合為『真鴛鴦合』，大都是與婚戀有關。如果天地都合化為喜，一定是大好姻緣來臨，如果都化為忌，也是緣分，為孽緣。合而不化，也表示緣分，好壞說不清楚。";
            if(i==3) 時柱註解="<br>時柱為子女宮，發生天合地合也能主姻緣，亦有可能『奉子成婚』。";
            天x地x論斷矩陣.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "形成天合地合，也叫做『鴛鴦合』，一般主桃花。"+天合地合註解(流運干支, 命盤各柱干支)+日柱註解+時柱註解);
            流運小結.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "形成天合地合");
        }

        if(干支天合地刑(流運干支, 命盤各柱干支)!=""){
            天x地x論斷矩陣.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "，形成天合地刑，為表面和好，實際卻是互相折磨之象，但卻不會分離。");
            流運小結.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "形成天合地刑");
        }  

        if(干支天剋地合(流運干支, 命盤各柱干支)!=""){
            天x地x論斷矩陣.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 +  "，形成天剋地合，表面不和，但利害關系相聯，分不開，繼續合作，但仍然會不斷的爭吵。");
            流運小結.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "形成天剋地合");
        }  

        if(干支天剋地刑(流運干支, 命盤各柱干支)!=""){
            天x地x論斷矩陣.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 +  "，形成天剋地刑，刑一般是內部矛盾，麻煩來自身邊親屬，親人之間長期不和，也能傷人。");
            流運小結.push(流運 + 流運干支 +"，" + 四柱名稱[i] + 命盤各柱干支 + "形成天剋地刑");
        }  
    }

	var 伏吟附加 = "四柱逢伏吟之年，① 不要去參加白事；② 不要去參觀新房；③ 不要去探訪醫院、探望病人。否則，晦氣降臨，百般不吉！";
    var 返吟附加 = "反吟之年，還容易傷祖輩或者父母親；重者，祖輩或者父母親死亡；輕者，有傷病之災難。";
    var 返吟伏吟附加 = "人命逢反吟、伏吟之流運，主不順利、多逆境、要麼煩心得很、麻煩事情多，不是上下關係沒有理順，就是左鄰右舍相處不安；若自己不現傷則傷他人，傷妻子或者失財，包括投資決策失誤。<br>若返伏吟中有命局之用神在內，則災難更為嚴峻。";

    // *************************************** 伏吟、返吟 附加 ***************************************
	var 伏吟返吟句子="";
    if(伏吟論斷矩陣.length >0) {
        伏吟論斷矩陣.push(伏吟附加);
        伏吟返吟句子 = 伏吟論斷矩陣.join("<br>");
    }

    if(返吟論斷矩陣.length >0) {
        返吟論斷矩陣.push(返吟附加);
        伏吟返吟句子 = (伏吟返吟句子=="")? 返吟論斷矩陣.join("<br>"): 伏吟返吟句子 + "<br>" + 返吟論斷矩陣.join("<br>");
    }

    if(伏吟返吟句子!=""){
        伏吟返吟句子 = 伏吟返吟句子 + "<br>" + 返吟伏吟附加;
        天x地x論斷矩陣.unshift(伏吟返吟句子);
    }

    if (天x地x論斷矩陣.length > 0) {
        天x地x論斷矩陣.unshift(流運項目);
        return  天x地x論斷矩陣.join("<br><br>");
    }
    else return "";
 
}

function 伏吟註解(流運, 四柱數){
	var 伏吟克應=[
		"主祖輩或父母輩有呻吟哀歎，憂愁之事。不宜遠行。",
        	"主父母或兄弟姐妹有哀歎憂愁之事，需注重身體和情緒。",
        	"本人或配偶之災，或是破財。",
        	"子息或晚年有災，注意事業或錢財之耗損。",
        	"大運與流年之干支形成伏吟，是為歲運並臨。災殃立見。要是歲運並臨與四柱再生返伏吟之變，即生大災。" 
    	];
	
	return 流運+"逢伏吟，"+伏吟克應[四柱數];

}

function 返吟註解(流運, 四柱數){
    	var 返吟克應=[
        	"不利骨肉，不宜遠行，小兒七歲時應注意災厄。",
        	"歲沖提網必有禍，六親及錢財有損，本身青年期有災。",
        	"剋配偶或中年有災，注意身體、家庭、錢財之破損。",
        	"剋子息，或本人老年時有災，尤其對錢財需加倍小心。",
        	"大運與流年之干支成返吟之年，是為歲運交爭，乃動蕩之兆。要是歲運並臨與四柱再生返伏吟之變，即生大災。"
    	];

	return 流運+"逢返吟，"+返吟克應[四柱數];
}

function 天合地合註解(干支1, 干支2){
    var 干支對1 = 干支1 + 干支2;
    var 干支對2 = 干支2 + 干支1;

    var 天合地合資料 = [
        { "二柱": "甲子己丑", "註解": "甲子、己丑～天合地合，甲天乙貴人在丑，甲己合土，貴合於己，故甲子、己丑雖吉，不若己丑、甲子為吉。"},
        { "二柱": "甲寅己亥", "註解": "甲寅、己亥～天合地合，長生合臨官，亥之月德貴人為甲，獲旺氣合，大吉。"},
        { "二柱": "甲辰己酉", "註解": "甲辰、己酉～天合地合，辰見酉為桃花，甲己土生辰酉金，六台桃花，為泄身敗合，不吉。"},
        { "二柱": "甲午己未", "註解": "甲午、己未～天合地合，甲天乙貴人在未，合午為甲死之地，貴人不幸合人死地，女命夫敗，不合。"},
        { "二柱": "甲申己巳", "註解": "甲申、己巳～天合地合，巳申合亡神，卻合於絕位，亡神臨絕地而凶禍化消，不作凶論。甲己合土，巳申火金皆與土相生，尊卑有序，論中吉。若年、月、日、時皆成蝴蝶雙飛（即命造成：甲申、己巳、甲申、己巳）則大吉。"},
        { "二柱": "甲戌己卯", "註解": "甲戌、己卯～天合地合，卯戌火生甲己土，為下生上，必得妻人親戚之助，官殺局則終能逐漸發達，食、傷局卻風韻事特多。"},
        { "二柱": "丙子辛丑", "註解": "丙子、辛丑～天合地合，丙辛合水，子丑為水地之濕土，陰合陽之六合吉，年、月、日、時，並更見吉。"},
        { "二柱": "丙寅辛亥", "註解": "丙寅、辛亥～天合地合，丙辛合水，水祿在亥，丙絕於亥，寅亥合木，絕地合入臨官，丙之天乙貴人在亥，為互換祿，貴，大吉。"},
        { "二柱": "丙辰辛酉", "註解": "丙辰、辛酉～天合地合，辰酉合金，丙制金為『財合』，尤以合在一旬五位之內，更為有情，大吉。"},
        { "二柱": "丙午辛未", "註解": "丙午、辛未～天合地合，丙辛合水在上，午未合火在下，封成水火既濟，大吉。"},
        { "二柱": "丙申辛巳", "註解": "丙申、辛巳～天合地合，雙合水局，水長在申，絕於巳，絕合長生，純一水局六合，謂有始有終，吉合。"},
        { "二柱": "丙戌辛卯", "註解": "丙戌、辛卯～天合地合，丙辛合水，成卯合火，亦為水火既濟卦象茗作吉論，能年、月、日、時成鴛鴦雙飛（即命造成：丙戌、辛卯、丙戌、辛卯），信在一旬，大吉，尤主福慧兼得風韻雅事。"},
        { "二柱": "戊子癸丑", "註解": "戊子、癸丑～天合地合，戊天乙貴人在『丑』，子丑合濕土，為陰懷德，平生多得貴人暗助，及妻女之力，作吉論。"},
        { "二柱": "戊寅癸亥", "註解": "戊寅、癸亥～天合地合，戊長生於寅，癸祿在亥，長生合臨官，天干，戊癸合火，火生戊土，大吉，月、日、時並見（即命造：戊寅、癸亥，戊寅，癸亥），上上之吉。"},
        { "二柱": "戊辰癸酉", "註解": "戊辰、癸酉～天合地合，戊癸火下克辰酉金，為順制之財，且六合於一旬之內，大富之合，大吉。"},
        { "二柱": "戊午癸未", "註解": "戊午、癸未～天合地合，干、支均合於火，命勢太過，若不能四柱全火局成『炎上』之格，平生眼高手低，懷才難遇，不吉之合矣。但幸能入於炎上格者，反為大富之造也。"},
        { "二柱": "戊申癸己", "註解": "戊申、癸己～天合地合，戊癸火下臨，己申水（此從主法已申為六合化水），『已申』即合亦帶刑，遇『寅』會三刑，以火上水下，為火水未濟，乃不吉之象，三刑只守支位，無犯上之力，為守刑之德，雖有艱辛，自制有力，先困后吉。"},
        { "二柱": "戊戌癸卯", "註解": "戊戌、癸卯～天合地合，干、支均合火，火生於土，合於一旬之中，主暗有貴人相助，但多風韻之事，女命則易變成青春偏嫁白發人或難守情操，故不祥。"},
        { "二柱": "庚子乙丑", "註解": "庚子、乙丑～天合地合，庚貴在『丑』，乙貴在『子』，互換合貴，吉。"},
        { "二柱": "庚寅乙亥", "註解": "庚寅、乙亥～天合地合，乙庚真金，寅亥長生臨官木，真金伐貴木，陶朱之富，大吉。"},
        { "二柱": "庚辰乙酉", "註解": "庚辰、乙酉～天合地合，干、支雙合金，為精金，且同在一旬之中，為六合中最吉祥之天地會，大富且大貴，人命遇之莫不至少三十載景泰歲月，若能四柱，鴛鴦鳳凰比翼六合，一品之尊，但忌行庚辰或乙酉運。"},
        { "二柱": "庚午乙未", "註解": "庚午、乙未～天合地合，為地支火反克天干金，乃敗含矣，不論是木化飛灰或烈火焚金，皆不吉。壽數不永。"},
        { "二柱": "庚申乙已", "註解": "庚申、乙已～天合地合，天干金生已申水（此從古法已申為六合化水）泄出不利，已申相刑，又見七殺，尤為不吉。但若原命地支見卯或子，則變為吉祥富格。"},
        { "二柱": "庚戌乙卯", "註解": "庚戌、乙卯～天合地合，卯戌火反制乙庚金本為不吉，卻二柱相差位僅五位，近親友克屬有情，通論中吉之兆。"},
        { "二柱": "壬子丁丑", "註解": "壬子、丁丑～天合地合，壬日旺於子，丁財來就我，富而可取。火日絕子，三面受水交攻，雖官來就我，多為寒儒。故此況壬日者優於此況丁日者。"},
        { "二柱": "壬寅丁亥", "註解": "壬寅、丁亥～天合地合，壬祿在亥，丁財逢長生，壬官逢臨官，財官既互換長生臨官，作吉論。"},
        { "二柱": "壬辰丁酉", "註解": "壬辰、丁酉～天合地合，辰月之天月雙德皆在壬，貴人聚於壬而來就我，為合貴之喜，大吉。"},
        { "二柱": "壬午丁未", "註解": "壬午、丁未～天合地合，丁壬合木，午未合火，上被下盜，下作吉論，以中平視之。"},
        { "二柱": "壬申丁己", "註解": "壬申、丁己～天合地合，可惜『已申』兼刑帶合，且羈絆繭縮，然以干支水木相生，稍解刑合，乃有富貴可取，可作中平之論。若丁為日干變為月德合，坐長生，則成大貴。"},
        { "二柱": "壬戌丁卯", "註解": "壬戌、丁卯～天合地合，丁日者優於壬日者，然皆可取貴。而壬之天乙貴人在卯，財、官、貴互換合，主官貴。"}
    ];

    var 資料索引1=_.findIndex(天合地合資料, {二柱: 干支對1});
    var 資料索引2=_.findIndex(天合地合資料, {二柱: 干支對2});

    資料註解1 = (資料索引1 != -1) ? 天合地合資料[資料索引1].註解 : "";
    資料註解2 = (資料索引2 != -1) ? 天合地合資料[資料索引2].註解 : "";

    return 資料註解1 + 資料註解2;
}


function 流運十神論斷(命盤, 流運, 流運小結) {
    var 流運十神矩陣;

    switch(流運){
        case 1: case "大運":
            流運十神矩陣=[命盤.大運[命盤.運行.大運數].天干十神, 命盤.大運[命盤.運行.大運數].地支十神1];
            break;
        case 2: case "流年":
            流運十神矩陣=[命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].天干十神, 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].地支十神1];
            break;
        case 3:case "流月":
            流運十神矩陣 = [命盤.流月[命盤.運行.流月數].天干十神, 命盤.流月[命盤.運行.流月數].地支十神1];
            break;
    }

    var 流運項目 = '<span class = "流運項目">' + 流運 + '走十神：</span><br>';
    var 索引過的十神 = [];
    var 論斷矩陣 = [];

    for (var i = 0; i < 流運十神矩陣.length; i++){
        if(i==0) var 流運干支引發="天干"; else var 流運干支引發="地支"
        if (_.indexOf(索引過的十神, 流運十神矩陣[i])<0){ //
			索引過的十神.push(流運十神矩陣[i]);
            論斷矩陣.push(流運 + 流運合出走十神(命盤, 流運十神矩陣[i], "", 流運干支引發, "走")); //沒有用到那個四柱，所以""
            流運小結.push(流運 + "走"+流運十神矩陣[i]);
        } //end if 流運合出走十神
    } //end for
    return 流運項目 + 論斷矩陣.join("<br><br>");
}

function 大運配流年十神論斷(命盤, 流運, 選項) {
    // 選項："大運流年天干"， "流運十神坐十神"
    var 大運流年天干十神對; //斷流月，就是流年流月十神對
    var 流運干支十神對;
    //var 流運十神矩陣;

    var 上運; //上個運，比方流年的上運是大運，流月的上運是流年
    var 論斷開頭句;
    var 大運天干十神 = 命盤.大運[命盤.運行.大運數].天干十神;
    var 大運地支十神 = 命盤.大運[命盤.運行.大運數].地支十神1;

    switch(流運){
        case 1:case "流年":
            var 流年天干十神 = 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].天干十神;
            var 流年地支十神 = 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].地支十神1;
            switch (選項) {
                case "大運流年天干":
                    大運流年天干十神對 = 大運天干十神 + 流年天干十神;
                    上運 = "大運";
                    論斷開頭句 = 上運 + 大運天干十神 + "逢" + 流運 + 流年天干十神 + "，";
                    break;
                case "流運十神坐十神":
                    流運干支十神對 = 流年天干十神 + 流年地支十神;
                    論斷開頭句 = "流年" + 流年天干十神 + "坐" + 流年地支十神 + "，";
                    break;
            }
            break;
        case 2:case "流月":  //八字命盤.運行.流月數  命盤.流月[j].天干十神
            var 流月天干十神 = 命盤.流月[命盤.運行.流月數].天干十神;
            var 流月地支十神 = 命盤.流月[命盤.運行.流月數].地支十神1;
            var 流年天干十神 = 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].天干十神;
            //alert(流月天干十神 +" / " + 流月地支十神);
            switch (選項) {
                case "大運流年天干":
                    大運流年天干十神對 = 流年天干十神 + 流月天干十神;
                    上運 = "流年";
                    論斷開頭句 = 上運 + 流年天干十神 + "逢" + 流運 + 流月天干十神 + "，";
                    break;
                case "流運十神坐十神":
                    流運干支十神對 = 流月天干十神 + 流月地支十神;
                    論斷開頭句 = "流月" + 流月天干十神 + "坐" + 流月地支十神 + "，";
                    break;
            }
            break;
        case 3: case "大運": //這個是給大運天干十神坐地支十神
            流運干支十神對 = 大運天干十神 + 大運地支十神;
            論斷開頭句 = "大運" + 大運天干十神 + "坐" + 大運地支十神 + "，";
            break;
    }

    var 流運十神資料 = [
        { "大運流年十神": "比肩比肩", "註解": "此年辦事多阻，圖求難成，凡是不遂。", "補注": "", "詩訣": "千裡風雲凋玉樹，三分雨露萎荊花。", "詹芸閑註解": "容易遇到敵對狀況，雙方都不服輸，競爭，角力。行事容易阻礙，迫害，壓力。多事端，難以如意，凡事應該多三思，多為朋友付出，注意錢財，感情，健康之事。(注意父親狀況)"},
        { "大運流年十神": "比肩劫財", "註解": "此年多憂愁煩悶，周轉不靈，行事反逆，易遭不幸，比肩逢劫財不吉。", "補注": "", "詩訣": "路逢蜀道多艱險，水入黃河自混濁。", "詹芸閑註解": "事多心煩，感覺鬱悶不安，容易有金錢上的煩惱或週轉不靈現象，事態呈現反覆逆轉現象，遭遇不平之事，或是意外事件，注意損財，不利財運之事，或感情，健康事件。(注意父親，老婆)"},
        { "大運流年十神": "比肩食神", "註解": "此年較好，只要勤儉努力，鴻運必開，而且當有貴人提拔。", "補注": "", "詩訣": "財進自然星月郎，春回依舊百花香。", "詹芸閑註解": "做事勤勞，努力有成果，經濟有持續成長之象，踏實經營易有貴人提拔，呈現鴻運清明之象。凡事親力親為，務實付出。切勿打高空則順利。"},
        { "大運流年十神": "比肩傷官", "註解": "此年諸多煩惱，家事不和，勞而無功，破財傷利，婚姻易變。", "補注": "", "詩訣": "貧至年關難稱福，油源不足燈亦暗。", "詹芸閑註解": "容易產生家庭紛爭不合，做事易勞而無功，事倍功半。容易犯小人之災，無妄是非，容易破財，投資失利，更應注意婚姻之間溝通協調，易生問題。切勿自以為是，氣躁情烈。"},
        { "大運流年十神": "比肩偏財", "註解": "此年要守為安，事多煩擾，運途蹇厄。易患病災，且有色情煩惱。", "補注": "比肩運不宜再走財，感情、錢財、父親、身體容易出問題。", "詩訣": "作福途中遇風雨，待放花木枝葉枯。", "詹芸閑註解": "多事多難，好事多磨，宜守舊，勿貪心，因想要太多而產生煩惱，注意身體健康，爛桃花，色澤情之事而招致麻煩，爭執，官非。(注意父親)"},
        { "大運流年十神": "比肩正財", "註解": "此年求財有利，求謀有成，時來運轉，財利雙收。正財遇比肩分奪，雖有分奪之象，但兆身主有財。", "補注": "比肩運不宜再走財，感情、錢財、身體容易出問題。", "詩訣": "雪影梅花添春色，鳥知時來報佳音。", "詹芸閑註解": "認真可以有成果。業務多忙碌，有戀愛，結婚，及財運滾滾而來的現象(若有食神結合更佳)切勿自得意滿而招嫉妒，則反而失財。(年紀長者需注意身體健康，易生病)"},
        { "大運流年十神": "比肩七殺", "註解": "此年口舌多，破財被騙，親友反目，身體欠安。七殺克身，雖比肩有助，但不為得意。", "補注": "", "詩訣": "浮雲遮日光慘淡，狂風夜雨折花枝。", "詹芸閑註解": "口舌是非，易因兄弟，朋友而惹來事端。易有無端之災難，被騙，破財，反睦，好事多磨之事項。注意自身安全及健康問題。(女:易為配偶而多勞苦，是非)"},
        { "大運流年十神": "比肩正官", "註解": "此年運氣偏好，凡謀有遂，有貴人提拔，但要三思而后行。比肩可助身，喜官克，財泄。", "補注": "", "詩訣": "雷驚天地聲千裡，彩霞春色山萬重。", "詹芸閑註解": "有爭鬥，競爭之事。或合夥及其他變動之機遇，宜多思考。作事宜井然有序，易博得他人信任，但須堅守原則才能得到完美結果。(女:易因配偶而受苦)"},
        { "大運流年十神": "比肩偏印", "註解": "此年凡事多阻，要注意身體，不可貪佔，勿為他人擔保。偏印為病星，一般是不吉祥的，乃多病之年。", "補注": "", "詩訣": "霜花鋪地露初冷，月夜孤舟雁聲淒。", "詹芸閑註解": "勿為他人擔保。不可貪心，宜守舊業，凡事須三思而行。預防小人，朋友，口舌，暗害。易枉費心力，事多阻逆，變動。比劫過多者注意婚姻之災。"},
        { "大運流年十神": "比肩正印", "註解": "此年光明幸運，求謀有成，有貴人提攜，名利雙收。正印巡回皆有喜慶之事，一般來說是吉利的，只要不是旺人到旺鄉。", "補注": "", "詩訣": "人逢喜事精神爽，月到中天分外明。", "詹芸閑註解": "求職，事業順利，光明幸運之象，易遇貴人提拔，容易獲得利益。此運與父緣較薄弱，但能得母親關愛。"},
        { "大運流年十神": "劫財比肩", "註解": "此年喜憂參半，外交不和，易被人連累，破財損妻，瑣事多端，疾病纏綿。", "補注": "", "詩訣": "東風得意扶楊柳，西邊無情折海棠。", "詹芸閑註解": "容易與人意見不和，被朋友牽連受累而破財，多煩心事，易生事端。容易有感情上的困擾發生，失戀。注意身體健康。投資宜多謹慎，注意金錢來往。"},
        { "大運流年十神": "劫財劫財", "註解": "此年家事紛紜，事業變動，口角頻生，疾病纏身。", "補注": "", "詩訣": "流水縱橫尋舊道，夕陽戀世還沉山。", "詹芸閑註解": "事業上呈現變動，分離狀況，容易有家庭風波，口角，反睦。也容易因為金錢而產生麻煩，注意父親狀況。注意本身健康，金錢，事業問題。"},
        { "大運流年十神": "劫財食神", "註解": "此年幸運到來，萬事順遂，財官進升，但要品行端正，諸多謹慎。", "補注": "", "詩訣": "花開夜朗風光好，人樂家安喜氣迎。", "詹芸閑註解": "有幸運的預兆。易有貴人扶持。做事如意順心，有進昇地位之像，要注意行事周到，保持品性良好，自然財福順利無憂。"},
        { "大運流年十神": "劫財傷官", "註解": "此年吉凶參半，凡事宜忍，不可沖動，言必有信，艱苦耐勞。", "補注": "", "詩訣": "分明月在梅枝上，尋得梅花月影無。", "詹芸閑註解": "吉凶參半，事多反覆無常變化多端。凡事須多忍耐，不可衝突，要勤勞耐苦。注意信用問題，易犯官非，麻煩之事，宜慎之。"},
        { "大運流年十神": "劫財偏財", "註解": "此年周轉不定，事業受挫，防桃色風波，先凶后吉。", "補注": "劫財運不宜再走財，感情、錢財、身體容易出問題。", "詩訣": "雲來樵子迷歸路，水大漁翁失釣鉤。", "詹芸閑註解": "容易有周轉不靈現象。注意事業上經營，容易因疏忽而招致失敗，心力交加，患得患失，易有桃花事件，外來之災，金錢上流動大，注意父親身體健康。"},
        { "大運流年十神": "劫財正財", "註解": "此年要提防小人，處處留意。有疾厄孝服臨身。", "補注": "劫財運不宜再走財，感情、錢財、身體容易出問題。", "詩訣": "烏江水亦鳴孤憤，蜀道山多訴不平。", "詹芸閑註解": "容易受騙，易受人連累遭受損失。人情似鬼。防止小人暗中設計。在金錢中易遭受損失。注意家庭中人員易有病痛，或離別之事。男女性同感情多有困擾。"},
        { "大運流年十神": "劫財七殺", "註解": "此年要警惕受騙，合作宜謹慎小心，宜守不宜攻。", "補注": "", "詩訣": "順風輕舟滿揚帆，不料江頭有險灘。", "詹芸閑註解": "凡事多成也易多敗。容易受到欺騙。合作事業易分開。切勿躁進宜守成，事多忍耐。容易有不愛工作，怠墮，投機取巧的傾向。工作上易疏忽而致失敗，注意功虧一潰。"},
        { "大運流年十神": "劫財正官", "註解": "此歲要委屈求全，防止損財破財，要尊崇仁義，防過勞致病。", "補注": "", "詩訣": "莫謂碧桃花口笑，須知綠柳帶愁根。", "詹芸閑註解": "雖能發達，但是與部屬較易產生不和，宜忍氣求財。氣短則易壞事且易破財。並易因下屬之事而受累，免職，損失等。注意工作變動，疾病，破財之災。多順從人意有助。女命易有破夫，憂愁之事。"},
        { "大運流年十神": "劫財偏印", "註解": "此歲要諸多謹慎，凡事三思，交易小心，以防受挫。", "補注": "", "詩訣": "分明是喜非為喜，恍惚聞香不是香。", "詹芸閑註解": "須事事謹慎，交易仔細思慮，容易恍惚而導致失敗事件。職業不穩定，生活不安定的現象。經營副業易失敗。劫財過多易受朋友牽累失財，切勿過於執拗易夫妻失和，子女緣薄。"},
        { "大運流年十神": "劫財正印", "註解": "此年凡事莫急，寛以待人，合作欠利，好事多磨，可望成功。", "補注": "", "詩訣": "好比白光出天外，恰似紅日正東升。", "詹芸閑註解": "表面繁榮，內心易空虛。一事急如水，應多思周轉，保持頭腦清晰，切勿自大，對人應寬容大度，記得他人恩惠，朋友交際貴在真誠。勿貪小利而因小失大。"},
        { "大運流年十神": "食神比肩", "註解": "此年順利，如大路行車，得貴人提拔，人氣機盛，婚姻有成。", "補注": "", "詩訣": "何須苦心求佳景，自有奇葩逢早春。", "詹芸閑註解": "如入無人之境，大路行車。易有貴人提拔，人氣極盛，很有經濟手腕，但不可意氣用事，會招致大損失。對朋友兄弟有情，好施，有福運。"},
        { "大運流年十神": "食神劫財", "註解": "此年風雨交襲，樂極生悲，勞力勞心，勿貪宜守。", "補注": "", "詩訣": "燕子雙飛繞畫堂，春風幾度斷肝腸。", "詹芸閑註解": "風雨交襲，吉凶參半，事多反覆，預防樂極生悲要有危機意識，如緣破反得財利，或得財業。和朋友兄弟交往雖有花費卻會從中而得利。但不宜躁進跟進，宜舊守，三思。"},
        { "大運流年十神": "食神食神", "註解": "此年合作可謀，財品兼優，利潤可觀。三思后行，事業有為。", "補注": "", "詩訣": "浮雲卷盡碧空淨，春風融和瑞氣多。", "詹芸閑註解": "財喜雙美，合作事業多，容易獲得利益。但是成功之時則應該轉為多加思考了!食神抗官殺，個性行事極倔強，槍打出頭鳥。男命需注意子女之事。女命需注意配偶之事。"},
        { "大運流年十神": "食神傷官", "註解": "此年添人進口，財力雙收，但要度勢而行，不可蠻干。", "補注": "", "詩訣": "風風雨雨皆祥瑞，萬紫千紅總是春。", "詹芸閑註解": "事業發展轉變也易有發展，才華可以展現。但需注意中途發生變化，障礙引起苦惱問題。感情，情緒容易波動衝動反覆而使家庭產生風波。易得財獲利。只要能控管好情緒。"},
        { "大運流年十神": "食神偏財", "註解": "此年似青蜓出網，辭舊迎新。保持信義，必有果得。", "補注": "", "詩訣": "撥開天上雲千裡，躍出南山月一輪。", "詹芸閑註解": "有賺眾人錢財的暗示（有買賣利潤）在金錢物質方面的享受十分豐富。男性易博得女性的青睞，女性則能博得小孩們的喜愛（有添丁暗示）與人合夥事業需注意合夥人動向。"},
        { "大運流年十神": "食神正財", "註解": "此年凶多吉少，不可自作聰明，要和氣待人。", "補注": "", "詩訣": "朔風凜凜透寒窗，衰草凋零葉更黃。", "詹芸閑註解": "能得長輩，長官愛護，做事順利易得錢財，肯付出會有所得，經營踏實，保持信用，自然有所成果。貴人運亦旺盛。"},
        { "大運流年十神": "食神七殺", "註解": "此年凶多吉少，無中生有，矛盾反目，事端多多。", "補注": "", "詩訣": "運寒是乖莫強謀，今日徒勞枉費思。", "詹芸閑註解": "生活中會有許多不滿狀況出現，容易因情緒而出事，諸事倍感壓力，且多有勞碌付出，易有反睦衝突，有子女者易有溝通上的困擾。"},
        { "大運流年十神": "食神正官", "註解": "此年順利發達，事業興旺，戀愛成功。", "補注": "", "詩訣": "春回芳草依舊綠，時到梅花自然香。", "詹芸閑註解": "容易獲得眾人信任，作事容易成功，機會也多，工商發展順暢保持平穩安定。女性易得良緣。"},
        { "大運流年十神": "食神偏印", "註解": "此年如行獨木橋，諸多不吉，家事不和，破財離散，疾病纏身。", "補注": "食神運不宜再走偏印，本身的才華施展不開，易被小人扯後腿或遭陷害，亦喜歡扯人家後腿，做事常會前功盡棄，多敗少成，常逢意外之災、血光，內心較鬱卒。", "詩訣": "雲深有月光難見，海闊無風浪自涌。", "詹芸閑註解": "易受他人牽連，也易為他人添麻煩，多紛爭，也易有損失錢財，破財，人際關係多變，不和。做事多成多敗，有離散暗示。"},
        { "大運流年十神": "食神正印", "註解": "此年一帆風順，貴人引進，有才有喜，凡謀可為。", "補注": "", "詩訣": "樓閣重重光明滿，欄杆曲曲好花艷。", "詹芸閑註解": "貴人明現，行事順利，財運順利，有食祿。"},
        { "大運流年十神": "傷官比肩", "註解": "此年心煩意亂，坐立不安，人事不睦，憂思重重。", "補注": "", "詩訣": "石燕排雲晴亦雨，江豚吹浪靜還風。", "詹芸閑註解": "家中易有紛爭，或反睦事件，婚姻亦多問題，容易因朋友，兄弟費神傷財而毫無收穫，造成金錢名譽損失。"},
        { "大運流年十神": "傷官劫財", "註解": "此年困難重重，破財損利，家事不寧。", "補注": "", "詩訣": "清風陣陣搖花落，秋雨綿綿葉飄零。", "詹芸閑註解": "合作事業有瓦解之象。婚姻亦有聚少離多或常因性的問題產生許多不必要的困擾。慎防疾病，破財，身心勞苦，或親人離別。"},
        { "大運流年十神": "傷官食神", "註解": "此年吉凶參半，不可自作聰明，凡事謹慎，適可而止，缺勿為外人擔保。", "補注": "", "詩訣": "六陰極處水凝冰，造物分明未有形。", "詹芸閑註解": "意見分歧，糾紛，甚至反睦，考驗頗多。不可自作聰明，有時助人反而利己。以和待人保安康。"},
        { "大運流年十神": "傷官傷官", "註解": "此年失業失職，破財失戀。", "補注": "", "詩訣": "紅顏命薄一虛花，春風疑不到天涯。", "詹芸閑註解": "注意身體健康，防範意外之災，易有意外之災。行事多有逆阻易有反背，暗害之事項。工作亦多變動不順，感情波動，情緒反覆激盪，投資事業應多三思，處事應低調。"},
        { "大運流年十神": "傷官偏財", "註解": "此年身心不遂，無風起浪，勞碌辛苦，易生色情風波。", "補注": "", "詩訣": "曉雲山前霧重開，驟然風起雨又來。", "詹芸閑註解": "物質上享用豐沛，在精神上欲望苦惱層出不窮，要注意感情問題，多思多勞，錢財易得，可是要懂得理財，才不會因財而產生困擾。"},
        { "大運流年十神": "傷官正財", "註解": "此年坦途走馬，美景重來，外援內助。但凡事要細心策劃", "補注": "", "詩訣": "馬走平川離險路，梅花喜開陽春時。", "詹芸閑註解": "穩健踏實經營能得內助或朋友之助而有所成果，勿損人而利己。行事正面思考則美景可期。"},
        { "大運流年十神": "傷官七殺", "註解": "此年是非多端，官訟連累，提防小人。", "補注": "", "詩訣": "一池春水今朝雨，滿地殘花昨夜風。", "詹芸閑註解": "浮沉不定，有恩亦無功。易受人毀謗，非議，受冤莫白易惹官非，凡事慎思而行。婚姻亦多不順遂，子女運不佳，預防小人。"},
        { "大運流年十神": "傷官正官", "註解": "此年愁眉難舒，謀事難成，破屋偏逢連夜雨。", "補注": "傷官運不宜再走正官運限，職位變動，會有血光、官司，不名譽的事情，不可做擔保，做事會出爾反爾，較難成功。", "詩訣": "謀事難成水截道，漏船又遇頂頭風。", "詹芸閑註解": "萬事小心變化多端。謀事未通不如意阻礙。易昇官也易丟官。容易受到牽累，被害，衝突事件，紛爭，注意身體，血光，病災。"},
        { "大運流年十神": "傷官偏印", "註解": "此年凶多吉少，損利傷財，親人反目，防婚姻有變。", "補注": "傷官運不宜再走偏印，本身的才華施展不開，易被小人扯後腿或遭陷害，亦喜歡扯人家後腿，做事常會前功盡棄，多敗少成，常逢意外之災、血光，內心較鬱卒。", "詩訣": "多因風雨花零落，欲渡清溪欠便船。", "詹芸閑註解": "隱藏著失敗，破壞，破敗的暗示。事業易損利，家庭不睦，易為子女操心，婚姻亮紅燈，潛藏著危機，凡事宜靜守。"},
        { "大運流年十神": "傷官正印", "註解": "此年煩惱頻生，諸多不順。", "補注": "", "詩訣": "災殃臨身多煩惱，月朗雲遮少光明。", "詹芸閑註解": "常會因意外誤會或急燥而遭遇失敗，思慮不周。易有不名譽事件，注意文件，文書，或言語往來而產生問題。易產生莫名財失，勞苦，居家易變動。"},
        { "大運流年十神": "偏財比肩", "註解": "此年順中有逆，勞神費力，暗箭難防，上當損財。", "補注": "", "詩訣": "展逢張帆游大海，忽然一陣頂頭風。", "詹芸閑註解": "父運不順。或與父感情不睦或父有疾。男命易生色情風波。有偏官(殺)出干者則不剋父。雖然經濟方面能夠無往不利，精神方面的苦惱卻層出不窮。兄弟易為家產而紛爭，最好從事固定行業。"},
        { "大運流年十神": "偏財劫財", "註解": "此年不利，凡事須謹慎，訪美人計，易罹病厄，親人無靠。", "補注": "", "詩訣": "七夕雲夜情難會，箭愁牛女斷肝腸。", "詹芸閑註解": "父必破財。易有經濟上困難，致家庭失和。有色情困擾。女性有再婚之象。好面子，金錢流動量大，難存，容易因愛情而產生糾紛。"},
        { "大運流年十神": "偏財食神", "註解": "此年大有良機，名望可得，一帆風順，財利亨通。", "補注": "", "詩訣": "時來勢轉命通順，運到財源似水流。", "詹芸閑註解": "財遇食神越增加福力，乃大富之兆。做事業容易成功，順利。也能得父親之助力，太太也是很有幫夫運，事業上可以擴展，順利進行，且平安。"},
        { "大運流年十神": "偏財傷官", "註解": "此年辦事亨通，財利有增，事業繁榮，注意桃色風波。", "補注": "偏財運不宜再走傷官流限，注意投資，身體，婚姻之事。", "詩訣": "財源好似春流水，事業猶似日流光。", "詹芸閑註解": "增福，食傷同樣可以增加財運。若傷官特性能夠充分發揮，則有幸福安泰，然而常為母親或配偶而產生困擾，且容易因別人損失而得到利益。"},
        { "大運流年十神": "偏財偏財", "註解": "此年順水推舟，財力雙收，事業興旺，婚姻美滿。", "補注": "", "詩訣": "財如春水源源進，福似桃花朵朵開。", "詹芸閑註解": "富有經濟手腕，發達於他鄉，具有使金錢滾滾而來的才華，善於經營合夥事業，幼年有易被送養之像，或乾父母。由於偏財重複，四柱若又出現許多偏財，則表示財運亨通，幸運吉祥。但須注意是否財多身弱，健康問題。"},
        { "大運流年十神": "偏財正財", "註解": "此年事業有變，光振門聲，思想閃光，但要節約開支。", "補注": "偏財運不宜再走正財流限，注意投資，身體，婚姻之事。", "詩訣": "改換門庭事業新，錦衣玉食福並臻。", "詹芸閑註解": "因為是二個財星的組合，可能會同時經營發展二個事業，從商可得厚利，在生活中會很受人歡迎，若除此組合外另有其他財星，則可能只是表面看起來豪富奢華，內在卻窘迫，錢要出手時，每次都能留下一些備用，就可以平安度過此運。女性卻有禍多於福之像(財養官殺)"},
        { "大運流年十神": "偏財七殺", "註解": "此年輕營發達，凡事順調，多財多利，大有余慶。", "補注": "", "詩訣": "牡丹堪稱花富貴，散向人間盡是香。", "詹芸閑註解": "經營商工業可以獲利，但是卻辛勞備至。且易為女人而散財。女命則有婚配錯誤而招致再婚之慮。在金錢的經營上能力不錯，但常會因父母或子女的問題，使其他方面得來的利益抵銷。易因任何小事而與父親翻臉。"},
        { "大運流年十神": "偏財正官", "註解": "此年會有沖突，宜安分守業，好自為之。分居散離，難從人意。", "補注": "", "詩訣": "嫩草抽芽風勢惡，全憑老草傍其身。", "詹芸閑註解": "正官的特性能強烈的發揮，因此人緣好，有責任感，在工作上能居要職，但易因部下失職而喪失要職。有訴訟頻繁的傾向。經濟，事業方面可得父親餘蔭，而獲得大發展，但是最好不要輕易與人產生衝突 ，或是言語激怒，否則易有麻煩上身。"},
        { "大運流年十神": "偏財偏印", "註解": "此年守之則安，動則不利，要等待良機，防破財傷身，六親反目。。", "補注": "偏財運不宜再走偏印流限，注意投資，身體，婚姻之事。", "詩訣": "靜坐終有福生發，動則宜防意外傷。", "詹芸閑註解": "能得小利，但是勞苦，也易人生坎坷。年幼時易有被父親遺棄，易因為他人作保或週轉金錢而遭受牽連，適合特種行業。有受到叔伯照顧恩惠比較多的暗示。"},
        { "大運流年十神": "偏財正印", "註解": "此年人事利達，平安康泰，凡事三思，不可沖動。合伙不利，求之莫急。", "補注": "", "詩訣": "穩居寶座行善德，財祿功名自有期。", "詹芸閑註解": "事業，家庭，健康各方面都很順利，在工商業易有成功的機會。"},
        { "大運流年十神": "正財比肩", "註解": "此年較好，可從無到有，多財多利，一帆風順。", "補注": "", "詩訣": "水滿池塘花滿枝，峰飛蝶舞蛙鳴時。", "詹芸閑註解": "萬事皆順利，物質環境優厚，可望有大發展。男性多半能娶賢慧妻子，因得賢內助。生活也會圓滿。會因為兄弟的事業關係或增設分支事業，而有一筆金錢上的損失。這種支出對於本人反而無害，往往能帶來更大的好運。"},
        { "大運流年十神": "正財劫財", "註解": "此年吉凶參半，交易當心，防止被騙。婚姻有變，夫妻反目。", "補注": "", "詩訣": "乍雨乍晴春不定，花開花落兩無情。", "詹芸閑註解": "父易有早亡之象，或父親事情衰微。易因為兄弟或他人作保，或借貸而遭受損失。與配偶感情不佳，因劫財會剋正財等吉星，因此萬事皆需注意防範。財運不佳，家庭中凶兆與不安頓起，亦需注意發生疾病，離別等事。"},
        { "大運流年十神": "正財食神", "註解": "此年凡謀有成，財源滾滾，銳意進取，必有所獲。", "補注": "", "詩訣": "天賜禎祥喜慶多，花前月下聽贊歌。", "詹芸閑註解": "無論工作，家庭皆很美滿，女性則會因子女的成就獲得更進一步的幸福。一般都表示吉運將臨，諸事皆能順利發展，也能博取他人的信任，可得善良之妻，為吉祥之運。"},
        { "大運流年十神": "正財傷官", "註解": "此年雖有不利，頻起家庭風波，但只要忍耐，財物有進。", "補注": "", "詩訣": "雖有浮雲掩月光，清風一陣天地暢。", "詹芸閑註解": "此運易暴起暴落，沉浮劇烈，常會一下倒閉破產卻又因他人賺回一筆，重新在事業上又站起來。這種命運安排在常人眼中似乎是極端不幸，然而這種嚐遍成功歡欣與失敗苦味的人生是一般人難以體會。"},
        { "大運流年十神": "正財偏財", "註解": "此年勞而無功，愁眉不展，碌碌無為，莫管閑事。", "補注": "", "詩訣": "走遍江山千萬裡，徒勞心計枉費功。", "詹芸閑註解": "對男性而言是享受齊人豔福的典型。在女人，金錢的欲求上極為貪婪，金錢的需求量大，對事業的要求也高，且常能賴其異常的才能獲得極大的成功。女性則主動性高，能夠牢牢抓住老公的心，也可以找到值得依賴的對象。雖然有開創事業的能力，但往往由於投資和設備所費過多，造成業績不振，結果破財，故勿貪心貪大。也常為色情之事而苦惱。宜慎之。"},
        { "大運流年十神": "正財正財", "註解": "此年不利，防止買賣倒閉，被騙破財，親人散離。", "補注": "", "詩訣": "南方走遍轉北方，求財謀利不想當。", "詹芸閑註解": "商業興隆，信用卓著，財源茂盛。無論事業或其他方面都能順利進展，容易博取他人的信任。但是家庭內注意疾病發生，有剋母之兆，死別之暗示。女命多半無子女緣份。"},
        { "大運流年十神": "正財七殺", "註解": "此年有外財，經營有利，境況宜人。", "補注": "", "詩訣": "五行秀氣遍生財，天高地闊月閃光。", "詹芸閑註解": "恩澤施於下，所費雖多，但從商可獲鉅利，能獲屬下的尊敬和愛戴，事業上大致亦順利。然而由於偏官特性不免發生作用，呈現著吉凶參半之象，為中吉之命運。若為女性，則多半成為賢內助。"},
        { "大運流年十神": "正財正官", "註解": "此年家門光彩，地位升遷，利益豐厚。", "補注": "", "詩訣": "妙筆生輝交萬方，功名利祿自輝煌。", "詹芸閑註解": "人格高尚能獲眾望，蒙上提攜，得下援助。在經濟方面運氣頗佳，同時社會地位也會逐漸昇高。女性多半能獲得幸福的婚姻，此運婚姻安定。"},
        { "大運流年十神": "正財偏印", "註解": "此年春光煥彩，事業昌盛，受人提拔。", "補注": "", "詩訣": "有財有祿享晚景，無憂無慮樂升平。", "詹芸閑註解": "偏印的特性會強烈的發生作用，因此，這種人對於任何事皆缺乏誠意，耐性。但廣交，人緣佳，若從事副業，多半能從中獲得不少利潤。"},
        { "大運流年十神": "正財正印", "註解": "此年事業不利，百困交集，損財失利。", "補注": "", "詩訣": "杆上魚兒出上鉤，忽遇雁鴨水中游。", "詹芸閑註解": "志願難達，與人競爭招禍。往往在緊要關頭或最終之時波折迭起而導致失敗。這種人多有修身養性，修正自己的心態，使人格更趨於圓滿的必要，如此才能轉凶為吉。暗示著家庭中婆媳不睦。職業則選擇最好由自己經營的自由業或不必競爭的專業性質。女性婚後最好能隱藏自己的才華。其實由於這類人聰明過人，都能技巧的抓住丈夫的心，且多半都能得到理想配偶。"},
        { "大運流年十神": "七殺比肩", "註解": "此年有不測風雲，官非易惹，疾病纏身。", "補注": "", "詩訣": "叩門聲急是非多，官司來了降病魔。", "詹芸閑註解": "易因朋友，兄弟親人拖累而招致金錢上損失，易受陷害或是非連累而生事或惹來官非。注意身體健康。女命易為丈夫之事而煩惱。"},
        { "大運流年十神": "七殺劫財", "註解": "此年平地起風波，居所遷動，工作變化，婚姻破裂。", "補注": "", "詩訣": "比翼紫燕兩分飛，如意郎君命先歸。", "詹芸閑註解": "容易得到權勢或昇官(職)但部屬(夥伴)易惹來事件麻煩。家庭中亦多事，變動(夫妻間易出問題不滿)或住所變動牽移之事(女易有再婚緣)。"},
        { "大運流年十神": "七殺食神", "註解": "此年半晴半雨，勞苦失意，損財罹病。", "補注": "", "詩訣": "一朝煙雨一朝晴，晴不多時雨又順。", "詹芸閑註解": "易為子女而擔心或困擾。婚姻上有溝通困難現象。預防小人反背暗中作怪。工作勞累辛苦，注意身體健康，心煩苦惱。"},
        { "大運流年十神": "七殺傷官", "註解": "此年口舌是非疊起，婚姻失戀，凡謀不遂。", "補注": "", "詩訣": "疾病口舌破財事，凡事謀為不稱心。", "詹芸閑註解": "心有千千結，常受人連累內心苦悶，凡事宜保守冷靜思考，家庭易動盪不安，麻煩事多。工作易有變化，變遷不安定勿亂投資。容易做出錯誤決定。"},
        { "大運流年十神": "七殺偏財", "註解": "此年惆悵頻多，產業變動，色情麻煩，一涌而上。", "補注": "", "詩訣": "心煩意亂思緒變，百結千愁事難成。", "詹芸閑註解": "感覺壓力很大，金錢上出入更需要注意來往，注意信用，或因朋錢財引起事端麻煩。注意感情問題而引來是非。投資等事更需仔細評估。或職業變動。(女命注意婆媳之事)。"},
        { "大運流年十神": "七殺正財", "註解": "此年外媒內虛，需忍耐等待，以守為安。", "補注": "", "詩訣": "黃金久掩在泥沙，待出露時自光華。", "詹芸閑註解": "此運有食神(付出)則工商事業順利，可得財利豊盈。若公職易得昇遷。若無食神(付出)則外表好看內部空虛，好看而己，只能忍耐等待机會。"},
        { "大運流年十神": "七殺七殺", "註解": "此年風雨遮日，身病受害，要防患於未然。", "補注": "", "詩訣": "花乍發時便凋謝，風雨無情鬧人間。", "詹芸閑註解": "做事辛苦，諸多阻礙困擾，無論在事業，朋友，家庭都會感到不順利。心煩事多。注意身體問題或意外事件。(女命常為丈夫，子女，公婆之事而困擾)。"},
        { "大運流年十神": "七殺正官", "註解": "此年悲喜交集，一片迷茫，凶禍破財。", "補注": "", "詩訣": "玉免催人投宿處，金雞喚客束行裝。", "詹芸閑註解": "事多反覆，遇事迷惑難以決斷，迷惘。容易受到誘惑而判斷錯誤失財，或投資看起來很有發展卻容易因而失當。金錢壓力很大，苦惱。男易為子女操心，女易為情感而苦惱。"},
        { "大運流年十神": "七殺偏印", "註解": "此年經營不利，周轉不靈，病苦喪事伴身。", "補注": "", "詩訣": "飛符為患又為災，啾唧無端兆破財。", "詹芸閑註解": "個性想法易過於偏激躁進獨斷，猶如樹木須經過寒冬考驗，適時接受他人善意建議，容易有財務上的困境，易有週轉不靈的狀況。家庭內易有病苦之事發生。"},
        { "大運流年十神": "七殺正印", "註解": "此年有不測風雲，事多纏綿，但要好事多磨，力求平和。", "補注": "", "詩訣": "無端夜雨迷秋月，不義狂風折好花。", "詹芸閑註解": "貴人運旺盛，易獲提攜而成功。但勿因為愛面子而產生不必要的金錢花費，而產生經濟困擾。凡事三思，以和為貴。"},
        { "大運流年十神": "正官比肩", "註解": "此年勿管閑事，宜守宜靜，防被暗箭所傷。", "補注": "", "詩訣": "凡事三思而后行，不可自作小聰明。", "詹芸閑註解": "比肩與正財產生作用，容易與人有紛爭。須事三思而後行，不可自作誤聰明，遇事固執不服輸，勿投機。注意他人暗箭，勿管閒事，以免公親變事主°平靜思考。"},
        { "大運流年十神": "正官劫財", "註解": "此年需防冷箭，有破敗之厄，色情之苦。", "補注": "", "詩訣": "不料烏雲遮明月，誰知冷雪透衣衫。", "詹芸閑註解": "易受友人，兄弟姐夫連累而產生困擾。無端受累，名聲地位易受損，勿投機，勿作保人，易有感情婚姻上困擾。此運也易因為面子而損財，錢財，感情，地位困擾。"},
        { "大運流年十神": "正官食神", "註解": "此年十分美景，財益名揚，但防止引火燒身，陷於險境。", "補注": "", "詩訣": "早官發財如流水，中年到底難留名。", "詹芸閑註解": "有貴人相助發展，但須務實經營，前途光明美好，上下和睦，勿好高騖遠空想。但桃花人緣也很旺盛，勿惹火上身。注意情緒控管。"},
        { "大運流年十神": "正官傷官", "註解": "此年機遇良好，要謹慎從事，仗義守信。", "補注": "正官運不宜再走傷官運限，職位變動，會有血光、官司，不名譽的事情，不可做擔保，做事會出爾反爾，較難成功。", "詩訣": "時到運通精神爽，春風處處草木英。", "詹芸閑註解": "容易因親人或他人的事而惹上麻煩，做好沒人情，做不好全是非，人情反覆，婚姻也易有此現象。無端引來事災，注意工作勿疏忽，身體注意健康行車小心，金錢來往宜三思。做事宜保守冷靜。勿衝動行事。"},
        { "大運流年十神": "正官偏財", "註解": "此年有失業失戀之厄，人情反復，疾厄多病。", "補注": "", "詩訣": "南樓雖報三更月，半夜子規尚且啼。", "詹芸閑註解": "工作能得助力而進財。盡力作事能得上司賞識，提拔。多出有利，也喜歡旅行。人際關係㓉躍，但忌亂桃花，易因而生是非損財，而影響家庭。"},
        { "大運流年十神": "正官正財", "註解": "此年出門有利，自然為福，風和日麗。", "補注": "", "詩訣": "克勤克儉稱素女，內助持家事有方。", "詹芸閑註解": "事業能順利進展，易得他人信任肯定。只要不投機，或驕縱不可一世都能平穩發展。注意母親身健健康(身弱者因為財務壓力而煩惱，夫妻關係易生變化)。女命注意子女溝通。"},
        { "大運流年十神": "正官七殺", "註解": "此年要安分守己，自重自愛，防意外不測。", "補注": "", "詩訣": "山高水深多險處，果有舟車不用行。", "詹芸閑註解": "宜安守本份，自重，工作上易有遭人排斥，誹謗或爭鬥現象。勿因迷惘而遭損害，尤其是成功之時。預防不測之災事，官非，注意安全。也注意情緒壓力起伏調整，莫因壓力而生災事。女命注重感情婚姻困擾。"},
        { "大運流年十神": "正官正官", "註解": "此年利人利己，名聲遠揚，運勢興旺。", "補注": "", "詩訣": "官貴顯通為富貴，時來運轉乘興時。", "詹芸閑註解": "名聲利益都朝正面發展，而且容易獲得利益，擴展版圖。願望易達成，若能利人利己各方面都能順利。易有職位昇官(身弱不能任財官者壓力倍增，易因不滿自己成就而情緒壓抑生災禍)(女命易因丈夫之事而倍感壓力或婚姻出現變化)"},
        { "大運流年十神": "正官偏印", "註解": "此年道路崎嶇，災難伴身，六親不和。", "補注": "", "詩訣": "運去勢衰君不知，災患並起禍罹身。", "詹芸閑註解": "適合接觸新的領域。易遭人誤解，打擊，有功無賞得不到應有的獎賞，既定之事多有變化，變卦，曲折，而人際上多有溝通不良或遭受無妄之事。女命注意親子關係，子女身健健康。"},
        { "大運流年十神": "正官正印", "註解": "此年佳境美妙，名利兼收，升格進財。", "補注": "", "詩訣": "官印相坐時運好，杏花春暖又生輝。", "詹芸閑註解": "事業成功的吉兆，前景美好，名聲地位昇格，行事順利。貴人扶持。記得多行善事積福。"},
        { "大運流年十神": "偏印比肩", "註解": "此年對己不利，災難重重，宜安分守己，小心行事。", "補注": "", "詩訣": "濱河持竿莫釣魚，風雨淒淒宜避居。", "詹芸閑註解": "此運對己不利，事事須謹慎，宜安分守己，小心行事。勞碌，波折、感覺助力微薄，注意預防保養身體健康，注意意外狀況，金錢易耗損。"},
        { "大運流年十神": "偏印劫財", "註解": "此年浮雨暗日，恩怨相害，勞而無功，宜守宜靜。", "補注": "", "詩訣": "踏遍艱險又是關，千裡跋涉路遙遠。", "詹芸閑註解": "此運浮雨暗日，恩怨相害，勞而無功，易損財，宜守宜靜。行事易判斷失誤，事多勞累，貪做易錯，注意夫妻間問題。身心易過勞。"},
        { "大運流年十神": "偏印食神", "註解": "此年身罹疾患，刑克多端，諸多不順。", "補注": "偏印運不宜再走食神流限，本身的才華施展不開，易被小人扯後腿或遭陷害，亦喜歡扯人家後腿，做事常會前功盡棄，多敗少成，常逢意外之災、血光，內心較鬱卒。", "詩訣": "花枝乍發遇冷霜，當空明月雲遮光。", "詹芸閑註解": "注意身罹疾患，刑克多事端，易犯小人，無妄事災。易產生倦怠，感覺不安無依。容易放棄原本事業工作而自斷財根。為他人作嫁衣。還遭人怨。女命易有產難及為子女之事擔憂困擾。"},
        { "大運流年十神": "偏印傷官", "註解": "此年事多反復，失職不利，防婚姻有變，疾病纏身。", "補注": "偏印運不宜再走傷官流限，本身的才華施展不開，易被小人扯後腿或遭陷害，亦喜歡扯人家後腿，做事常會前功盡棄，多敗少成，常逢意外之災、血光，內心較鬱卒。", "詩訣": "虛名虛利而無成，燕語鶯聲不稱情。", "詹芸閑註解": "虛名虛利而無成，事多反復，易事失職而不利自已，防婚姻有變化，易見疾病纏身。經濟出現困境，家庭易有狀況紛擾，災害等事而煩憂。女命為先生子女之事擔憂困擾。"},
        { "大運流年十神": "偏印偏財", "註解": "此年麻煩重重，婚戀失散，應自尊自重。", "補注": "", "詩訣": "雉鳥覓食各自飛，情人反目難和合。", "詹芸閑註解": "情人反目難和合，易有感情困擾。麻煩事一重重，婚姻戀愛失敗或各持己見，僵持不下，應自尊自重。有財進財出留不住，狀況不斷，表面好看內裡空虛。"},
        { "大運流年十神": "偏印正財", "註解": "此年得貴人提攜，事業興旺，風光自得。", "補注": "", "詩訣": "龍入碧潭增奇色，虎躍深谷振精神。", "詹芸閑註解": "易得貴人提攜如奮發努力，則事業興旺，風光自得。保持家庭和睦，自然事事順利。"},
        { "大運流年十神": "偏印七殺", "註解": "此年只宣靜守，不可強求，否則失敗難免，應棄舊圖新。", "補注": "", "詩訣": "當年樂曲不堪聞，彈出新調別有聲。", "詹芸閑註解": "不可強求，否則失敗難免，應棄舊圖新，善中求實。容易被人利用，無功反遭損害或發生紛爭。常為經濟狀況苦惱，易有無謂支出耗損，勞心勞力。"},
        { "大運流年十神": "偏印正官", "註解": "此年人事不和，職權不穩，家門不幸。", "補注": "", "詩訣": "雨落翠竹流珠淚，雪壓梅花戴素冠。", "詹芸閑註解": "此運人事不和易犯小人，致使職權不穩，或無端遭受他人批評，誹謗，攻擊。易遇不幸之事災。女命易有婚姻背棄問題。"},
        { "大運流年十神": "偏印偏印", "註解": "此年凶多吉少，災難病痛，死別離散。", "補注": "", "詩訣": "風弄竹聲驚犬吠，月移花影惹雞鳴。", "詹芸閑註解": "此運家中易有災難病痛，死別離散之事應凡事小心注意。家中生活易不安定，紛爭，易受人欺凌，損財，事態發展不順利，凡事善中求和。靜守。"},
        { "大運流年十神": "偏印正印", "註解": "此年辦事多阻，困苦徒勞，身不得按。", "補注": "", "詩訣": "風雲不甚雲淡淡，花開無奈雨淋淋。", "詹芸閑註解": "辦事多阻，身不得安寧，多遇挫折失敗。多思多想，行事反覆不定。自困愁城，事難成。常為父母之事苦惱，經濟狀況發生障礙。常感到迷惘，不知道如何取捨，凡事善中求和，靜守。"},
        { "大運流年十神": "正印比肩", "註解": "此年如平途走馬，一路順風，事業有成，計謀而生。", "補注": "", "詩訣": "后運兆示家業盛，眾星捧月樂融融。", "詹芸閑註解": "此運如平途走馬，一路順風，事業有成，計謀而生。亦有兄弟分家或合夥拆夥之事。但易因好照顧他人而產生疲累之感或支出。"},
        { "大運流年十神": "正印劫財", "註解": "此年心灰意冷，凡事持重，和氣行事。", "補注": "", "詩訣": "夫妻本是同林鳥，大難來時各自飛。", "詹芸閑註解": "此運凡事持重，和氣行事。工作上平穩發展，無論從事任何工作都能盡心奮鬥，但是注意家庭內和睦協調，勿生煩躁心，注意婆媳問題。"},
        { "大運流年十神": "正印食神", "註解": "此年吉祥如意，大有余慶，財源廣進。", "補注": "", "詩訣": "財源交換聲望重，家業興隆氣象新。", "詹芸閑註解": "凡事正向發展，財源順利廣進，利於提升名利地位受人尊重信任，人緣佳，易受上司友人之助提拔有利事業，工作發展。"},
        { "大運流年十神": "正印傷官", "註解": "此年諸多不順，破財失利，無事生非。", "補注": "", "詩訣": "維持屋裡春風滿，織棉機中度月零。", "詹芸閑註解": "維持家庭和睦相處有助運勢(家中易有意見不合，口舌之爭)。在事業上預防突發事件，易因突發事件而產生諸多不順，破財失利，無事生非，宜保持低調。"},
        { "大運流年十神": "正印偏財", "註解": "此年財源廣進，川流不息，繁榮興盛。", "補注": "", "詩訣": "南北東西皆亨通，往來有利樂無窮。", "詹芸閑註解": "財源廣進，事業繁榮興盛，適合經常事業。家庭平順，和睦相處。"},
        { "大運流年十神": "正印正財", "註解": "此年一喜一憂，一成一敗，沉著迎戰。", "補注": "", "詩訣": "花枝招展情切切，水流葉落恨茫茫。", "詹芸閑註解": "喜憂各半，注意家中婆媳問題，沉著應對，人事上較易有紛爭，在健康，金錢均易有障發生，也需注意母親或配偶健康問題。"},
        { "大運流年十神": "正印七殺", "註解": "此年才德兼備，添丁發財，婚姻如意。", "補注": "", "詩訣": "文質彬彬君子志，筆走龍蛇學子風。", "詹芸閑註解": "能忍能讓，家內和睦。財喜雙至易添丁發財，做事正直誠實，順利發展。"},
        { "大運流年十神": "正印正官", "註解": "此年謀事易成。", "補注": "", "詩訣": "好似花開當午日，恰如嫩柳遇春風。", "詹芸閑註解": "交友廣濶，與人為善，易獲貴人提發展，事業名聲節節高昇。逢印有官是吉慶之象，好好把握。"},
        { "大運流年十神": "正印偏印", "註解": "此年宜靜不宜動，勿貪勿佔，只宜固守，否則破財傷身。", "補注": "", "詩訣": "風卷弱柳無氣力，雲遮月影為分明。", "詹芸閑註解": "做事缺乏決斷力常遭失敗，易多愁善感猶豫不決缺乏信心。有常換事業傾向，家內缺乏和氣，宜靜待時機，守舊不宜動。勿因貪心而反失利，破財傷身。"},
        { "大運流年十神": "正印正印", "註解": "此年家事不寧，勞苦奔波，孝服凶災。", "補注": "", "詩訣": "口念彌陀不脫塵，在家修道散鬼神。", "詹芸閑註解": "嚴防孝服凶災注意家中長輩，子女安寧。行事勿過於自信或利己而反而易失既有利益。一善破千災。"}

    ];

    switch(選項){
        case "大運流年天干":
            var 流運項目 = '<span class = "流運項目">' + 上運 + '十神配' + 流運 + '十神：</span><br>';
            var 資料索引 = _.findIndex(流運十神資料, { 大運流年十神: 大運流年天干十神對 });
            if (資料索引 != -1) {
                var 資料註解 = 論斷開頭句 + 流運十神資料[資料索引].詹芸閑註解;    //資料註解 = 論斷開頭句+流運十神資料[資料索引].註解+流運十神資料[資料索引].補注+"詩訣：『"+流運十神資料[資料索引].詩訣+"』";
                if (流運 == "流月") 資料註解 = 資料註解.replace("此年", "此月");
                return 流運項目 + 資料註解;
            }
            else {
                alert(流運干支十神對+"：流運十神搭配 沒有搜尋到資料！");
                return "";
            }
            break;
        case "流運十神坐十神":
            var 流運項目 = '<span class = "流運項目">'+ 流運 + '天干十神坐地支十神' + '：</span><br>';
            var 資料索引 = _.findIndex(流運十神資料, { 大運流年十神: 流運干支十神對 });
            if (資料索引 != -1) {
                var 資料註解 = 論斷開頭句 + 流運十神資料[資料索引].詹芸閑註解;
                資料註解.replace("此年", "此運");
                return 流運項目 + 資料註解;
            }
            else {
                alert(流運+"天干地支十神坐十神 沒有搜尋到資料！");
                return "";
            }
            break;
        default:
                alert("流運十神對十神 選項錯誤！");
                return "";            
    } // end switch 選項
}

function 流運刑冲合害(命盤, 行運, 流運小結, 四柱觸動) {
    //日主,用以判斷合出的十神;
    //四柱,用以判斷事件, 0=年柱,1=月柱,2=日柱,3=時柱
    //行運,大運,流年,流月
    //選項：1天干合
    
    // to add, 庫馬花冲，天合地合，天剋地刑。。。。。
	var 四柱名稱=["年柱", "月柱", "日柱", "時柱"];
    var 天干矩陣 = [命盤.年干.天干, 命盤.月干.天干, 命盤.日干.天干, 命盤.時干.天干];
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
	var 天干十神矩陣 = [命盤.年干.十神, 命盤.月干.十神, "", 命盤.時干.十神];
	var 地支十神矩陣 = [命盤.年支.十神1, 命盤.月支.十神1, 命盤.日支.十神1, 命盤.時支.十神1];
    var 流運刑冲合害克應矩陣 = [];
	var 合出過的十神 = [];
	var 合掉過的十神 = [];
	
    //var 流運刑冲合害克應小結 = [];
    //var 四柱觸動 = [0,0,0,0]; //年月日時，四柱是否有被衝、合、刑、害、會， 0 主沒有動
    var 流干支;

    var 流運合各柱 = [
        "流運合到年柱，假如命主年紀小，母親會擔心他。如果命主年紀大，會擔心長上。此運/年會比較想安定下來，比較保守。注意長上身體健康，也有可能有新的事業規劃。",
        "流運合到月令（內心），會讓命主有很多想法，但卻無法施展出去。心中常感鬱悶。",
        "流運合到日主，命主的配偶在該運會比較喜歡他人意見和建議，因此命主會感覺較悶，宜多溝通，包容。未婚者易婚。",
        "流運合到時柱，要是走運就很好，懂得掌握，就容易得到幫助（賺錢）。若不懂的掌握，就會產生一種事業變動或遇到瓶頸的現象，會有想換工作的想法。可能和孩子比較不好溝通，做下屬的，心思也易浮動。"
    ];

    var 流運害各柱 = [
        "流運害到年柱，比較會抱怨長上或是為長上操心，付出，或花費金錢，或抱怨出生家庭經濟較為不好。工作上比較會被上司壓迫，事業感覺不穩定，嚴重的會經常換工作。",
        "流運害到月令，內心很煩惱，抱怨自己，比較會鬱悶而煩躁，想要抒發又有口難言。",
        "流運害到日主，夫妻會吵架，分房睡，較會有溝通困難或衝突情形發生。",
        "流運害到時柱，表示和小孩較無緣，或是和子女少溝通，意見相左。事業也比較會有波折，或想換工作。"
    ];

    var 流運冲各柱 = [
        "流運冲到年柱，而年柱代表了根，代表事業比較不穩定。假設命盤的主人是老闆,今年可能會遇到競爭對手。還有冲擊到父母,可能會產生口角。如果是單身,可能會有桃花。",
        "流運年冲到月令（內心），主情緒變化，心性、心態、人生觀之起伏變化（比方從保守變敢衝），或與父母、家人發生別離、衝突。遇到事情容易緊張，有很多事情要處理，要看是否走運才能定吉凶。若月支是印星或財星時，逢沖更驗。",
        "流運年冲到日主，主感情、婚姻發生變化，未婚者易有戀愛之事，已婚者則易與配偶發生衝突、不睦，甚至離異。沖日支亦易有災傷或病災。",
        "流運冲到時柱，主工作、職業、事業之變化（換工作、創業、拓展，事業變成不穩定，變動可以是吉或兇）。以往若事業很安定，流運被冲到事業就會不順。亦常因此而帶來住居之變化，如遠調、長期出差、受訓等。打工的做事容易被念。另亦易有體質之變化，女性則易有懷孕、生子或流產之事。"
    ]; 

    var 流運刑各柱 = [
        "流運刑到年柱，表示和長上較難溝通，互有看法，各自有事放心中，互相抱怨、折磨，宜多加交流。此運星較不如意。",
        "流運刑到月令，代表有苦難言，自己騙自己，有事放心裡不說。也有可能和兄弟意見不合，溝通較難有共識。",
        "流運刑到日支，夫妻比較會鬥氣，溝通較難，應彼此多交談溝通、包容。",
        "流運刑到時柱，表示和小孩較難溝通易有代溝，應多關心小孩。事業也會有不順暢之感，或有懷才不遇之感。"
    ];

	switch(行運){
	    case "大運":
	        流干支 = 命盤.大運[命盤.運行.大運數].干支;
	        break;
	    case "流年":
	        流干支 = 命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].干支;
	        var 流年支=命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].干支.substr(1,1);
			break;
	    case "流月":
	        流干支 = 命盤.流月[命盤.運行.流月數].干支;
	        break;
	}

    var 流運項目 = '<span class = "流運項目">' + 行運 + '刑冲合害：</span><br>';
    var 流干 = 流干支.substr(0,1);
    var 流支 = 流干支.substr(1,1);
    var 大運支=命盤.大運[命盤.運行.大運數].干支.substr(1,1);
	//alert(命盤.大運[命盤.運行.大運數].流年[命盤.運行.大運流年數].干支 + " /" + 命盤.運行.大運數); 

    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷合出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //合出的陰陽是日主陰陽的相反

    var 三刑條件矩陣 = [["寅", "巳", "申"], ["丑", "戌", "未"]];
    var 三合條件矩陣 = [["寅", "午", "戌"], ["巳", "酉", "丑"], ["申", "子", "辰"], ["亥", "卯", "未"]];
    var 三會條件矩陣 = [["寅", "卯", "辰"], ["巳", "午", "未"], ["申", "酉", "戌"], ["亥", "子", "丑"]];

    var 三刑克應字串=["寅、巳、申無恩之刑，此運限多不順暢，常有災害發生。","丑、戌、未、恃勢之刑，此運限多不順暢，常有災害發生。"];
    var 三刑克應詞=["寅、巳、申無恩之刑。","丑、戌、未，成恃勢之刑。"];
    var 三合克應詞=["寅、午、戌三合火。", "巳、酉、丑三合金。", "申、子、辰三合水。", "亥、卯、未三合木。"];
    var 三會克應詞=["寅、卯、辰三會木。", "巳、午、未三會火。", "申、酉、戌三會金。", "亥、子、丑三會水。"];

    var 流運條件; // 用意判斷流運符合某些條件，比方是否含三刑，三合的地支
    var 本命條件1, 本命條件2, 本命條件3; //用意判斷本運是否符合某些條件，比方是否含三刑，三合的地支
    var 克應1="", 克應2="", 克應3="", 克應字串="";

    // ******************** 流運湊齊三刑 *******************
    for (var i = 0; i < 三刑條件矩陣.length;i++ ){
        var 三刑判斷矩陣 = 三刑條件矩陣[i].slice(0); // clone the array !!
        流運條件 = _.indexOf(三刑判斷矩陣, 流支);
        if(流運條件!=-1){ //流運有三刑的地支
            三刑判斷矩陣.splice(流運條件,1);
            本命條件1= _.indexOf(地支矩陣, 三刑判斷矩陣[0]);
            本命條件2= _.indexOf(地支矩陣, 三刑判斷矩陣[1]);
            if(本命條件1!=-1 && 本命條件2!=-1){
                克應1=行運+"地支與"+四柱名稱[本命條件1] +"、"+ 四柱名稱[本命條件2]+ "湊齊"+三刑克應字串[i];
                流運刑冲合害克應矩陣.push(克應1);

                流運小結.push(行運+"地支與"+四柱名稱[本命條件1] +"、"+ 四柱名稱[本命條件2]+ "湊齊"+三刑克應詞[i]);
                四柱觸動[本命條件1] = 1;
                四柱觸動[本命條件2] = 1;
            }
        } 
    } // end 流運 與 本命三刑克應 for loop

    // ******************** 流運湊齊合 *******************
    for (var i = 0; i < 三合條件矩陣.length;i++ ){
        var 三合判斷矩陣 = 三合條件矩陣[i].slice(0); // clone the array !!
        流運條件 = _.indexOf(三合判斷矩陣, 流支);
        if(流運條件!=-1){ //流運有三合的地支
            三合判斷矩陣.splice(流運條件,1);
            本命條件1= _.indexOf(地支矩陣, 三合判斷矩陣[0]);
            本命條件2= _.indexOf(地支矩陣, 三合判斷矩陣[1]);
            if(本命條件1!=-1 && 本命條件2!=-1){
                克應1=行運+"地支與"+四柱名稱[本命條件1] +"、"+ 四柱名稱[本命條件2]+ "湊齊"+三合克應詞[i];
                流運刑冲合害克應矩陣.push(克應1);

                流運小結.push(行運+"地支與"+四柱名稱[本命條件1] +"、"+ 四柱名稱[本命條件2]+ "湊齊"+三合克應詞[i]);
                四柱觸動[本命條件1] = 1;
                四柱觸動[本命條件2] = 1;
            }
        } 
    } // end 流運 與 本命三合克應 for loop

    // ******************** 流運湊齊三會 *******************
    for (var i = 0; i < 三會條件矩陣.length;i++ ){
        var 三會判斷矩陣 = 三會條件矩陣[i].slice(0); // clone the array !!
        流運條件 = _.indexOf(三會判斷矩陣, 流支);
        if(流運條件!=-1){ //流運有三會的地支
            三會判斷矩陣.splice(流運條件,1);
            本命條件1= _.indexOf(地支矩陣, 三會判斷矩陣[0]);
            本命條件2= _.indexOf(地支矩陣, 三會判斷矩陣[1]);
            if(本命條件1!=-1 && 本命條件2!=-1){
                克應1=行運+"地支與"+四柱名稱[本命條件1] +"、"+ 四柱名稱[本命條件2]+ "湊齊"+三會克應詞[i];
                流運刑冲合害克應矩陣.push(克應1);

                流運小結.push(行運+"地支與"+四柱名稱[本命條件1] +"、"+ 四柱名稱[本命條件2]+ "湊齊"+三會克應詞[i]);
                四柱觸動[本命條件1] = 1;
                四柱觸動[本命條件2] = 1;
            }
        } 
    } // end 流運 與 本命三會克應 for loop


    // ******************** 斷流年、大運、本命三刑 *******************
    //var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支]; 流支
    if(行運=="流年"){
        var 流年條件, 大運條件;

        for (var i = 0; i < 2;i++ ){
            var 三刑判斷矩陣 = 三刑條件矩陣[i].slice(0); // clone the array !!
            流年條件 = _.indexOf(三刑判斷矩陣, 流年支);
            if(流年條件!=-1){ //流年有三刑的地支
                三刑判斷矩陣.splice(流年條件,1);
                    大運條件 = _.indexOf(三刑判斷矩陣, 大運支);
                    if (大運條件 != -1) { //大運也有三刑的地支{
                        三刑判斷矩陣.splice(大運條件,1);
                        本命條件1 = _.indexOf(地支矩陣, 三刑判斷矩陣[0]);
                        if (本命條件1 != -1) { //本命也有三刑的地支
                            克應1="流年、大運與"+四柱名稱[本命條件1] + "湊齊"+三刑克應字串[i];
                            流運刑冲合害克應矩陣.push(克應1);

                            流運小結.push("流年、大運與"+四柱名稱[本命條件1] + "湊齊"+三刑克應詞[i]);
                            四柱觸動[本命條件1] = 1;
                        }
                    }
            } 
        } // end 流年、大運、本命三刑克應 for loop

        for (var i = 0; i < 三合條件矩陣.length ;i++ ){
            var 三合判斷矩陣 = 三合條件矩陣[i].slice(0); // clone the array !!
            流年條件 = _.indexOf(三合判斷矩陣, 流年支);
            if(流年條件!=-1){ //流年有三合的地支
                三合判斷矩陣.splice(流年條件,1);
                    大運條件 = _.indexOf(三合判斷矩陣, 大運支);
                    if (大運條件 != -1) { //大運也有三合的地支{
                        三合判斷矩陣.splice(大運條件,1);
                        本命條件1 = _.indexOf(地支矩陣, 三合判斷矩陣[0]);
                        if (本命條件1 != -1) { //本命也有三合的地支
                            克應1="流年、大運與"+四柱名稱[本命條件1] + "湊齊"+三合克應詞[i];
                            流運刑冲合害克應矩陣.push(克應1);

                            流運小結.push("流年、大運與"+四柱名稱[本命條件1] + "湊齊"+三合克應詞[i]);
                            四柱觸動[本命條件1] = 1;
                        }
                    }
            } 
        } // end 流年、大運、本命三合克應 for loop

        for (var i = 0; i < 三會條件矩陣.length ;i++ ){
            var 三會判斷矩陣 = 三會條件矩陣[i].slice(0); // clone the array !!
            流年條件 = _.indexOf(三會判斷矩陣, 流年支);
            if(流年條件!=-1){ //流年有三會的地支
                三會判斷矩陣.splice(流年條件,1);
                    大運條件 = _.indexOf(三會判斷矩陣, 大運支);
                    if (大運條件 != -1) { //大運也有三會的地支{
                        三會判斷矩陣.splice(大運條件,1);
                        本命條件1 = _.indexOf(地支矩陣, 三會判斷矩陣[0]);
                        if (本命條件1 != -1) { //本命也有三會的地支
                            克應1="流年、大運與"+四柱名稱[本命條件1] + "湊齊"+三會克應詞[i];
                            流運刑冲合害克應矩陣.push(克應1);

                            流運小結.push("流年、大運與"+四柱名稱[本命條件1] + "湊齊"+三會克應詞[i]);
                            四柱觸動[本命條件1] = 1;
                        }
                    }
            } 
        } // end 流年、大運、本命三會克應 for loop

    } // end 流年的論斷 


    // ****************** 斷流運對本命盤的刑冲合害 ******************

    for (var i = 0; i < 地支矩陣.length; i++){
        // ******************** 天干有合化 *******************
        var 天干合化 = 天干五合(流干,天干矩陣[i]); //天干合化出來的五行
        if (天干合化 != ""){
            var 天干合出的天干 = 五行轉天干(天干合化, 合出的陰陽);
            var 天干合出的十神 = 尋十神(天干合出的天干, 命盤.日干.天干);
            var 流運干支引發="天干"; //流運天干克應出來的
            //var 天干合出的十神數= 十神字轉數(天干合出的十神);
            
            克應1 = 行運 + "天干" + "與" + 四柱名稱[i] +流干+天干矩陣[i] +"合化"+天干合化+"。<br>"+流運合各柱[i]+"<br>";
            if(i!=2) {
               var 天干被合的十神數 = 十神字轉數(天干十神矩陣[i]);
               克應2 =四柱名稱[i] + "的" + 流運合掉十神(命盤,天干十神矩陣[i],i) + "<br>"; 
            }
            else 克應2 = "";

            //流年正財合日主或月支，今年要特別注意錢與身體方面會有損失，( 女命 ) 夫妻感情會不好。
            克應3 = 流運合出走十神(命盤, 天干合出的十神, i, 流運干支引發, "合出");

            流運刑冲合害克應矩陣.push(克應1 + 克應2 + 克應3);
            流運小結.unshift(行運 + "天干" + "與" + 四柱名稱[i] +流干+天干矩陣[i] + "合化" + 天干合化 + "（" + 天干合出的十神 + "）");
            //alert(克應1 + 克應2 + 克應3);
        }

      // ******************** 地支有合化 *******************
      //var 地支對 = 流支 + String(地支矩陣[i]);
      var 二支三合化 = 地支三合(流支,地支矩陣[i]); //2個地支三合出來的五行
      var 二支六合化 = 地支六合(流支+地支矩陣[i]); //2個地支六合出來的五行
      var 二支暗合化 = 地支暗合(流支+地支矩陣[i]); //2個地支暗合出來的五行
      var 二支相害 = 地支相害(流支+地支矩陣[i]);
      var 二支相刑 = 地支相刑(流支+地支矩陣[i],"相刑","所有");
      var 二支相冲 = 地支相冲(流支+地支矩陣[i]);
		
      流運干支引發="地支";  //if(i==0) var 流運干支引發="天干"; else var 流運干支引發="地支"
	
      // *** 半合 **
      if (二支三合化 != ""){
          var 二支合出的天干 = 五行轉天干(二支三合化, 合出的陰陽);
          var 二支合出的十神 = 尋十神(二支合出的天干, 命盤.日干.天干);
          
		  
          克應1 = 行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i] +"半合"+二支三合化+"。<br>"+流運合各柱[i]+"<br>";

		  if (_.indexOf(合掉過的十神, 地支十神矩陣[i])<0){
			  合掉過的十神.push(地支十神矩陣[i]);
		  	克應2 = 四柱名稱[i] + "的" + 流運合掉十神(命盤,地支十神矩陣[i],i)+"<br>";
		  }
		  
		  if (_.indexOf(合出過的十神, 二支合出的十神)<0){
			  合出過的十神.push(二支合出的十神);
		  	  克應3 = 流運合出走十神(命盤, 二支合出的十神, i, 流運干支引發, "合出");
		  }
		  else 克應3 ="";

          //流年正財合日主或月支，今年要特別注意錢與身體方面會有損失，( 女命 ) 夫妻感情會不好。
          流運刑冲合害克應矩陣.push(克應1 + 克應2 + 克應3);

          流運小結.push(行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i] +"半合"+二支三合化 + "（" + 二支合出的十神 + "）");
          四柱觸動[i] = 1;
      }

      // *** 六合 **
      if (二支六合化 != ""){
          var 二支合出的五行 = 二支六合化.substr(2, 1);
          var 二支合出的天干 = 五行轉天干(二支合出的五行, 合出的陰陽);
          var 二支合出的十神 = 尋十神(二支合出的天干, 命盤.日干.天干);
          
          //var 二支合出的十神數= 十神字轉數(二支合出的十神);
          //var 二支被合的十神數 = 十神字轉數(地支十神矩陣[i]);

          克應1 = 行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i] +"六合"+二支合出的五行+"。<br>"+流運合各柱[i]+"<br>";
          克應2 = 四柱名稱[i] + "的" + 流運合掉十神(命盤,地支十神矩陣[i],i) + "<br>";
          克應3 = 流運合出走十神(命盤, 二支合出的十神, i, 流運干支引發, "合出"); 
          
          流運刑冲合害克應矩陣.push(克應1 + 克應2 + 克應3);

          流運小結.push(行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i] +"六合" + 二支合出的五行 + "（" + 二支合出的十神 + "）");
          四柱觸動[i] = 1;
      }

      // *** 暗合 **
      if (二支暗合化 != ""){
          var 二支合出的五行 = 二支暗合化.substr(2, 1);
          var 二支合出的天干 = 五行轉天干(二支合出的五行, 合出的陰陽);
          var 二支合出的十神 = 尋十神(二支合出的天干, 命盤.日干.天干);
          //var 二支合出的十神數= 十神字轉數(二支合出的十神);
          //var 二支被合的十神數 = 十神字轉數(地支十神矩陣[i]);
          var 暗合干=二支暗合化.substr(4, 2); //地支暗合(流支,地支矩陣[i], "合干");
          
          克應1 = 行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i]+ "（" + 暗合干 + "）暗合" + 二支合出的五行+"。<br>"+流運合各柱[i]+四地合克應(流支+地支矩陣[i])+"<br>";
          克應2 = 四柱名稱[i] + "的" + 流運合掉十神(命盤,地支十神矩陣[i],i)+"<br>";
          克應3 = 流運合出走十神(命盤, 二支合出的十神, i, 流運干支引發, "暗合出");

          流運刑冲合害克應矩陣.push(克應1 + 克應2 + 克應3);

          流運小結.push(行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i]+ "（" + 暗合干 + "）暗合" + 二支合出的五行 + "（" + 二支合出的十神 + "）");
          四柱觸動[i] = 1;
      }

      // *** 相害 **
      if (二支相害 != ""){
          克應1 = 行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i]+ "相害。"+流運害各柱[i];
          流運刑冲合害克應矩陣.push(克應1);

          流運小結.push(行運 + "地支" + "與" + 四柱名稱[i] +流支+地支矩陣[i]+ "相害（" + 地支十神矩陣[i] +"）");
          四柱觸動[i] = 1;
      }

      // *** 相刑 **
      if (二支相刑 != ""){
          var 二支相刑拆分 = 二支相刑.split(",");
          二支相刑 = 二支相刑拆分[0];

          var 二支被刑的十神數 = 十神字轉數(地支十神矩陣[i]);
          克應1 = 行運 + "地支" + "與" + 四柱名稱[i] +"（" + 地支十神矩陣[i] + "）"+流支+地支矩陣[i]+ "形成"+ 二支相刑 + "。"+流運刑各柱[i];

          var 解救 = 含神煞(命盤, "天乙貴人", "命盤");
          if (解救 !=-1) 克應1 = 克應1 +"<br>命盤帶天乙貴人可解！";
          流運刑冲合害克應矩陣.push(克應1);

          流運小結.push(行運 + "地支" + "與" + 四柱名稱[i] + 流支+地支矩陣[i]+ "形成"+ 二支相刑 + "");
          四柱觸動[i] = 1;

      }

      
      // *** 相冲 **
      if (二支相冲 != ""){
          var 二支被冲的十神數 = 十神字轉數(地支十神矩陣[i]);
          克應1 = 行運 + "地支" + "與" + 四柱名稱[i] + 流支+地支矩陣[i] + "相冲。"+流運冲各柱[i] + 流運冲十神(命盤,地支十神矩陣[i],i) + 四地冲克應(流支+地支矩陣[i]);
          流運刑冲合害克應矩陣.push(克應1);

          流運小結.push(行運 + "地支" + "與" + 四柱名稱[i] + 流支+地支矩陣[i] + "相冲（" + 地支十神矩陣[i] +"）");
          四柱觸動[i] = 1;
      }

    } // end 本命盤的刑冲合害For loop

    if (流運刑冲合害克應矩陣.length > 0) return (流運項目 + 流運刑冲合害克應矩陣.join("<br><br>"));
}


// ************************** 流運十神的 合、冲 **************************
function 流運冲十神(命盤,十神,四柱數){
    var 性別 = 命盤.性別;
    var 冲十神註解 = [];

    switch(十神){
        case "比肩":
            冲十神註解.push("比肩被冲，朋友兄弟不睦，易生糾紛。命局本人在思考、判斷上呈現不穩定，易生錯誤。");
            break;
        case "劫財":
            冲十神註解.push("劫財被冲，朋友兄弟不睦，易生糾紛。命局本人在思考、判斷上呈現不穩定，易生錯誤。");
            break;
        case "食神":
            冲十神註解.push("食神被冲，有精神勞碌，做事顛三倒四，沈悶不振。沖食傷，要注意口舌、官非，也表示聰明才智之發揮不安定。");
            break;
        case "傷官":
            冲十神註解.push("傷官被冲，有精神勞碌、做事顛三倒四，沈悶不振。沖食傷，要注意口舌、官非，也表示聰明才智之發揮不安定。");
            break;
        case "正財":
            冲十神註解.push("正財被冲，多意外支出、易耗財。財逢沖，主財不穩，流動性大，難聚財。");
            if(性別=="男") 冲十神註解.push("男命也主與配偶有衝突，分手或感情不穩地。");
            break;
        case "偏財":
            冲十神註解.push("偏財被冲，得意外之財或財原不安定，表父親身體不好。");
            if(性別=="男") {
                冲十神註解.push("男命偏財也主情人，需防配偶健康不好，或桃花事件。");
                if((命盤.分析.十神.數據[十神字轉數("正財")].天干地支==0) && ((命盤.分析.十神.數據[十神字轉數("偏財")].天干地支>0))) 冲十神註解.push("此女男無正財，故以偏財論其配偶。");            
            }
            break;
        case "七殺":
            冲十神註解.push("七殺被冲，較易變換職業、工作，求謀不利，易犯官災、口舌是非。官殺主權位，被沖則權位不穩；");
            if(性別=="男") 冲十神註解.push("男命七殺主孩子，需防子女有災。");
            if(性別=="女") {
                冲十神註解.push("女命七殺也主情人，需防丈夫有災。");
                if((命盤.分析.十神.數據[十神字轉數("正官")].天干地支==0) && ((命盤.分析.十神.數據[十神字轉數("七殺")].天干地支>0))) 冲十神註解.push("此女命無正官，故以七殺論其丈夫。");
            }
            break;
        case "正官":
            冲十神註解.push("正官被冲，官殺主權位，被沖則權位變動，可以是升遷，轉換工作，落魄，求謀不利，易犯官災、口舌是非，看喜用。");
            if(性別=="男") 冲十神註解.push("男命正官主孩子，需防子女有災。");
            if(性別=="女") 冲十神註解.push("女命正官主丈夫，需防丈夫有災。");
            break;
        case "偏印":
            冲十神註解.push("偏印被冲，易離鄉背井、情緒不穩、不想學東西，注意文書契約或權利變動的問題。也代表母親，女性長輩，帶來困擾。印星主精神食糧，逢沖則求知慾降低。偏印逢沖，則要防官司之災。");
            break;
        case "正印": //被衝，
            冲十神註解.push("正印被冲，易離鄉背井、情緒不穩、不想學東西。印星主權利，故易失去權力或權利有變動，注意文書契約問題。或失去貴人支持。印星也主精神食糧，逢沖則求知慾降低。也代表母親，女性長輩，帶來困擾。");
            break;
    }
    return 冲十神註解.join("");
}

// ----------------------------------------------------------------------------------------------------------------

function 流運合掉十神(命盤,十神,四柱數){
    var 性別 = 命盤.性別;
    var 合十神註解 = [];

    switch(十神){
        case "比肩":
            合十神註解.push("比肩被合，社交運差，喜用是沒有朋友幫忙。忌用是會造成損失財務。");
            break;
        case "劫財":
            合十神註解.push("劫財被合，社交運差，喜用是沒有朋友幫忙。忌用是會造成損失財務。");
            break;
        case "食神":
            合十神註解.push("食神被合，才華不能展現，決策易失誤，身體狀況差。提防孩子健康。");
            break;
        case "傷官":
            合十神註解.push("傷官被合，思緒比較雜亂，做事顛三倒四，迷迷糊糊，沈悶不振。提防孩子健康。");
            break;
        case "正財":
            合十神註解.push("正財被合，錢財財流失大，周轉不靈，也有可能會投資。"); 
            if(性別=="男") 合十神註解.push("男命配偶被合，未婚者容易失戀，已婚者嚴防婚變，或配偶健康不好");
            if (((命盤.分析.十神.數據[十神字轉數("偏印")].天干地支 > 0) && (命盤.分析.十神.數據[十神字轉數("食神")].天干地支 > 0)) || ((命盤.分析.十神.數據[十神字轉數("傷官")].天干地支 > 0) && (命盤.分析.十神.數據[十神字轉數("正官")].天干地支 > 0))) 合十神註解.push("正財若被流運合，又遇本命有偏印 + 食神和傷官 + 正官，會投資失敗。");
            break;
        case "偏財":
            合十神註解.push("偏財被合，沒有偏財運，開支特別大，生意也容易賠錢。投資容易失誤而造成財務上的損失。也表父親身體欠安。"); 
            if(性別=="男") {
                合十神註解.push("男命偏財也主情人，需防配偶健康不好，失戀或自身桃花事件容易出狀況。"); 
                if((命盤.分析.十神.數據[十神字轉數("正財")].天干地支==0) && ((命盤.分析.十神.數據[十神字轉數("偏財")].天干地支>0))) 合十神註解.push("此男命無正財，故以偏財論其配偶。");            
            }
            break;
        case "七殺":
            合十神註解.push("七殺被合，凡事要特別留意，易失名聲地位，失威風，氣魄，事業維艱，不容易發揮，合殺攻身，是非多，勞心又勞力。"); 
            if(性別=="男") 合十神註解.push("男命七殺主孩子，需防子女有災。");
            if(性別=="女") {
                合十神註解.push("女命七殺也主情人，需防丈夫有災。");
                if((命盤.分析.十神.數據[十神字轉數("正官")].天干地支==0) && ((命盤.分析.十神.數據[十神字轉數("七殺")].天干地支>0))) 合十神註解.push("此女命無正官，故以七殺論其丈夫。");
            }
            break;
        case "正官":
            合十神註解.push("正官被合，凡事要特別留意，易失名聲地位，失威風，氣魄；職業上變動，被牽絆，阻礙，或被奪；不利發展，不要出風頭，不要當老大。");
            if(性別=="男") 合十神註解.push("男命正官主孩子，需防子女有災。");
            if(性別=="女") 合十神註解.push("女命正官被合，注意丈夫身體變差，也該提防老公會有外遇。");
            break;
        case "偏印":
            合十神註解.push("偏印被合，易失去權力丟官罷職，口才表達會比較差，文人失文采，思緒易混亂。也對宗教少了熱忱，或產生懷疑。注意文書契約。也代表母親，女性長輩，帶來困擾。");
            break;
        case "正印":
            合十神註解.push("正印被合，易失去權力或丟官罷職，或失去貴人支持，思緒易混亂。也對宗教少了熱忱。注意文書契約。也代表母親，女性長輩，帶來困擾。");
            break;
    }

    return 合十神註解.join("");
}

// --------------------------------------------------------------------------------------------------

function 流運合出走十神(命盤,十神,四柱數, 干支引發, 引發){
    //引發： 走，合出
    var 性別 = 命盤.性別;
    var 現象註解 = [];
    var 現象="", 補注1="", 補注2="", 喜神 = "", 忌神 = "", 身強 = "", 身弱 = "", 喜用="", 強弱="", 論斷開頭句="";

    if (引發 == "走") 論斷開頭句 = "走";
    if (引發 == "合出") 論斷開頭句 = "合出";
    if (引發 == "暗合出") 論斷開頭句 = "暗合出";
    強弱 = 1; //to read from 命盤。分析

    switch(十神){
        case "比肩":
            現象 = "比肩，發生之事多與兄弟姐妹、朋友、同事、同學、競爭對手、合伙人等有關。心態多傾向於剛毅、主觀，感覺良好就好，不會太過介意回報，特別重朋友、兄弟姊妹，人情包袱很重。耳根軟，外表看起來樂觀，但內心有一點想不開，同時常會掉東西。<br>比肩剋財，不利於財運與夫妻運，失戀機會特別大，且是刻骨銘心的失戀。金錢要控制得當，易流失，或為錢煩惱。不要拿錢投資，要靠策略聯盟賺錢。感情上較不順利，夫妻相處困擾多，未婚感情較多波折。<br>再逢【財】流運需注意感情、錢財和健康問題。";
            補注1 = "①心性：較有自信、行事積極主動、一意孤行、相信朋友。②財運：不佳、易破耗。不易守財、要節流、不宜借人。③事業：升遷機會較少，宜安於現狀等待時機。競爭對手多、考運不理想、運氣不佳。④感情：較理性、易看淡、不專一、平淡。⑤生活：朋友聚會、交際應酬、玩與花錢的機會多、吵雜人多的地方。⑥運氣：需加倍的努力才會有收獲。"
            喜神 = "比肩為喜神，帶有剛健，獨立自主，重朋友的個性，有分享性，想到就做，心胸大，較不貪心，有個性，不重視財物，擇善固執，不輕易改變立場，，較自我主張的特性。易得兄弟、朋友之幫助，較有佔有慾，也有開創事業之雄心，財運亨通，合夥事業，易成功。";
            忌神 = "比肩為忌神，帶有自尊心強，不可被侵犯，易被激怒，易發生犯上，破財之事，合夥失利，錯誤叢生，易衝動，心急切，為人海派，較不思索。易受朋友兄弟牽累，或為兄弟朋友之事煩惱，容易樹敵抱怨，易與朋友發生口舌、衝突、誤會等等。會比較勞碌，易途勞無功，應做好委曲求全卑微低下的心，留意父親健康。";
                if (性別 == "男") 忌神 = 忌神 + "男人與配偶容易發生衝突或配偶易生病，或婚姻不順。";
            身強 = "身強，行比肩，易有官訟、破財、刑妻，不順之事。同時也易遭朋友、合夥人之拖累。公親變事主之嘆。<br>比肩多且身強者，如果要換職業，應以自由業或能自己作主之工作，因為過於自我。";
            身弱 = "身弱，朋友間感情不錯，又能得兄弟姊妹、同輩間的幫助。思維清清晰，能言善道，善於察顏觀色，應變力好，富社交能力，借力使力。如身弱又有財星，今年會有財源廣進的現象，凡事順利之象。但防身弱逢財，易破財，須注意身體健康。";
            喜用 = 1; //to read from 命盤。分析

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);

            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);
            break;

        case "劫財":
            現象 = "劫財，發生之事多與兄弟姐妹、朋友、同事、同學、競爭對手、事業合伙人、外遇情人等有關。心態多傾向於攻出性、投機性、冒險性、個人主義。感覺良好就好，不會太過介意回報，特別重朋友、兄弟姊妹，耳根軟，人情包袱很重。一個人時感情脆弱全湧現，是人群中的孤獨者。<br>劫財剋財，不利於財運與夫妻運，容易有分開、分離的感覺，如失戀、離婚等。較無安全感，怕流失機會，又怕會賠錢。不要拿錢投資，要靠策略聯盟賺錢。感情上較不順利，夫妻相處困擾多，未婚感情較多波折。<br>再逢【財】流運需注意感情、錢財和健康問題。";
            補注1 = "①心性：對朋友重情義、以朋友為重、表現不在乎、心性起浮大。②財運：易破財、花大錢買貴重物、為女色破財、錢或財物易被盜或毀損。③事業：不受重視、易偷懶摸魚、職業倦怠、發嘮騷。競爭者多、考運差。④感情：情海生變、相互報怨、多爭吵。⑤生活：易朋友的事拖累、外出遊玩花錢多。⑥運氣：容易受騙上當、別好管閒事惹來麻煩。"
            喜神 = "劫財為喜神，有事業心，生活向上樂觀，工作積極主動，不安心於現狀，有開創事業之魄力，勇於接受挑戰，有征服欲和佔有欲。心胸大，主動性，不重視慾望，重朋友的特性，意志堅強，剛強穩健，精力充沛，易得兄弟朋友同業之運佳，凡事水到渠成。在錢財上花銷大，主要用於生活購物及事業投資等。經商之人事業興旺，財源滾滾，發達興旺。";
            忌神 = "劫財為忌神，帶有自尊心強，不可被侵犯，易被激怒，而侵犯他人。魯莽無計劃性，有投機心態，易破財，易衝動，心急切，容易因判斷錯誤而損失。容易遭朋友陷害或同事陷害及出賣，或受朋友拖累而破財，且財物易遭他人盜竊和侵佔掠奪。經商者易跟事業合伙人發生因金錢引起的衝突，事業易倒閉。夫妻易生糾紛，或影響父親健康與運氣，易與朋友、兄弟發生衝突。";
            身強 = "身強，朋友間易有是非，或會受朋友拖累，財務來往必須注意。戀人易被爭奪，愛的人卻反羞澀說出口，而被追走了。如過財星弱，花錢如流水，財來財去，常常追錢，總是不夠花。今年不宜經商或擴大投資規模或投機行業，不宜合夥，錢拿出去就拿不回來了。";
            身弱 = "身弱，朋友間感情不錯，又能得兄弟姊妹、同輩間的幫助。思維清清晰，能言善道，善於察顏觀色，應變力好，富社交能力，借力使力。如身弱又有財星，今年會有財源廣進的現象，凡事順利之象。但防身弱逢財，易破財，須注意身體健康。";
            喜用 = 1; //to read from 命盤。分析

            if (性別 == "男") 忌神 = 忌神 + "男人與配偶容易發生衝突或配偶易生病，或婚姻不順。";

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神 );
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);
            break;

        case "食神":
            現象 = "食神，發生之事大都屬於內心才華方面，計劃，理想抱負，文藝、技術方面有關，跟子女、學生、部屬、性慾、官非訴訟、口舌、血光、婚姻、田宅、名譽等有關。<br>心態多傾向於重視精神與物質的協調，坦白率直，較傳統，不服輸，才華有所表現但無實權。適合研發及發明工作，學習能力特別強。較有食祿，但消化系統不太好。";
            補注1 = "①心性：作事謹慎細心、隨和樂觀、善解人意、客氣有禮。②財運：財易聚、投資易獲利。③事業：較忙、易身兼多職。考運有利。④感情：感受力強、易要求對方、選擇條件較苛、相互了解多。⑤生活：機會多、易得貴人幫助。⑥運氣：較順心意、努力就有收穫。"
            喜神 = "食神為喜神，個性變得溫和，心胸開闊，較具同情心，施捨心。生活工作環境多變動，學習、求知、創作收獲多，考試易中榜，學位、職稱易得，智慧與才能比平時增強。男女皆易對異性易動情。容易思異變，會積極籌劃新的事業，謀財求利，其財利多為因名而得，且求財輕鬆，少勞苦。生活中重視物質和精神享受，喜歡與朋友交往，娛樂的機會多，較易得部屬或子女之協助。";
            忌神 = "食神為忌神，生活工作上多忙碌，考試落榜，選舉、投資失敗。好意氣用事，與上級或老板容易發生對抗及口舌官非之事，爭執多，易遭致公憤，煩憂，有志難伸，易鑽牛角尖，身體容易疲勞。謀求困頓，容易丟官罷職，損名毀譽。未婚男女談戀愛易遭失敗，已婚女性易外有情人導致家庭不和。";
            身強 = "身強，今年特別靈光，跟朋友相處也特別友善，也特別會講話，反應靈敏有巧思，有很多事情會被表揚或讚賞而成為名人。顯得消化系統特別好，口慾佳，挑食。";
            身弱 = "身弱，注意身體毛病，缺乏活動力，性情不佳，沒有堅持力，易逞口舌之快。";
            喜用 = 1; //to read from 命盤。分析

            if (性別 == "女") {
                現象 = 現象 + "女命以食神、傷官論子息，流運出現食神，懷孕機會較大。";
                喜神 = 喜神 + "女命容易懷孕或生產。";
                身弱 = 身弱 + "女命身弱，要注意身體狀況疾病，特別容易失身，易懷孕。";
            }

            if (性別 == "男") {
                忌神 = 忌神 + "男命不利子女。";
                身強 = 身強 + "男易喜女色。";
            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if ((命盤.分析.十神.數據[十神字轉數("偏印")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發+"食神，逢偏印，本身的才華施展不開，易被小人扯後腿或遭陷害，亦喜歡扯人家後腿，做事常會前功盡棄，多敗少成，常逢意外之災、血光，內心較鬱卒。";
                if (性別 == "女") 補注2 = 補注2 + "女命易流產，不易生男生，或患婦女病及腫瘤。";
                if (性別 == "男") 補注2 = 補注2 + "男命易有隱疾復發，或發生致命的危險。";
                現象註解.push(補注2);
            }

            if ((命盤.分析.十神.數據[十神字轉數("傷官")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發+"食神，命帶傷官者，平時的才華施展不開，做事重邏輯，表現慾強，理解力強，多學不專，急性子，喜自由，易被感動，文武兼俱，但很難專精。";
                現象註解.push(補注2);
            }

            if ((命盤.分析.十神.數據[十神字轉數("七殺")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發+"食神，本命有七殺，因食神會制殺，權勢好像被制住，凶不起來。";
                現象註解.push(補注2);
            }
            break;

        case "傷官":
            現象 = "傷官，發生之事多與名氣，學習、求知、文藝、旅游、創作、投資、叛逆、官非口舌之事有關。<br>心態多傾向於自尊心強，愛表現，清高傲氣，喜歡追求新奇，有活力和斗志。流運有傷官，很有才華，但博學不精，缺乏耐性，頭腦好，學習能力強，追求完美，愛受別人誇讚，不喜別人批評，貪做易虧錢。做事會覺得特不順，要學做潛水艇/老二哲學，儘量不要強出頭，考運差。";
            補注1 = "①心性：我行我束、坦率直接、易粗心大意、多情、好勝心強。②財運：無法節流、易破財或無謂的開銷。③事業：與上司不合、想換工作或失業。升學考試佳、工作考試運差。④感情：愛得瘋狂、追得較累、機會多、多情。⑤生活：與長者意見不合、想的與現實有距離、得不到贊同。⑥運氣：不佳、易口舌是非、官符。"
            喜神 = "傷官為喜神，生活工作環境多變動，學習、求知、易溝通、多能有突出創作或發明，名望升高，智慧與才能比平時增強。會思異變，積極籌劃新的事業，謀財求利，其財利多為因名而得，且求財輕鬆，少勞苦，會較傲氣，喜歡說話，幽默增加，很有同情心。生活中重視物質和精神享受，喜歡與朋友交往，娛樂的機會多，易得部屬幫助。";
            忌神 = "傷官為忌神，喜自我主張且不易妥協，重名聲，虛榮心強，好勝心強，好意氣用事，善變，猜疑的特性。考試落榜，選舉、投資失敗，謀求困頓，容易丟官罷職，損名毀譽，身體容易疲勞。易以不正當手段求財而惹官非，多小人是非，說話傷人，得罪他人。或與上級或老板容易發生對抗及口舌之事，易受子女或部屬之連累，或為部屬或子女事而煩憂等等。未婚男女談戀愛易遭失敗，已婚女性易外有情人導致家庭不和，也易有感情因素而產生糾紛。";
            身強 = "身強，顯得特別聰明，很注意別人肯定與讚美。富感性，喜舒發情緒。會對社會較有不滿的情緒，標準的批評家。做事有魄力，一定要完成到底。六親方面會顯得更無話可談，易有紛爭。";
            身弱 = "身弱，有傷官，可能會傷財、傷身，如果能不要投資儘量避免。思想比較偏激，行事比較任性，說話比較誇大。才華特多，但流於雕蟲小技，難成大事之嘆。會感到受你幫助最多的人，也是最容易陷害你的人。生理需求較強，觀念較開放，要注意因情慾惹禍。注意血光、官司、破財、車關。";
            喜用 = 1; //to read from 命盤。分析

            if (性別 == "女") {
                現象 = 現象 + "女命運限有傷官，如果是未婚時會想結婚，婚後又想離婚，容易有婚變。女命以食神、傷官論子息，流運出現食神，懷孕機會較大。";
                忌神 = 忌神 + "女人容易對丈夫不滿，想管丈夫，明唸暗唸，句句傷丈夫的心。";
                喜神 = 喜神 + "女命容易懷孕或生產。";
                身弱 = 身弱 + "女命注意與先生或男朋友間感情易有波動。";
            }

            if (性別 == "男") {
                現象 = 現象 + "男命運限有傷官，今年會特別龜毛、白目，奇招特別多。"
                忌神 = 忌神 + "男命事業工作不順，不利子女。";
                身弱 = 身弱 + "男命注意跟兒女不合，若無生兒育女之打算，應特別注意避孕措施。";    
            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if ((命盤.分析.十神.數據[十神字轉數("偏印")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發+"傷官，逢偏印，本身的才華施展不開，易被小人扯後腿或遭陷害，亦喜歡扯人家後腿，做事常會前功盡棄，多敗少成，常逢意外之災、血光，內心較鬱卒。";
                現象註解.push(補注2);
            }

            if ((命盤.分析.十神.數據[十神字轉數("食神")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發+"傷官，命中又有食神，如果從事教學或組織工作，可得桃李滿天下。";
                現象註解.push(補注2);
            }

            if ((命盤.分析.十神.數據[十神字轉數("傷官")].天干 > 0) && 干支引發=="天干") {
                補注2 = "";
                if (性別 == "男") {補注2 = 補注2 + "男命帶傷走傷，情緒脾氣會特別差、特別壞，往事今年常環繞你心中。"; 現象註解.push(補注2);}
            }

            if ((命盤.分析.十神.數據[十神字轉數("正官")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發+"傷官，見本命有正官，會有血光、官司，千萬不要做擔保，做事會出爾反爾，較難成功。";
                現象註解.push(補注2);
            }
            break;

        case "正財":
            現象 = "正財，發生之事大都與工作、商業、交易、投資、金錢、父親、妻子、婚姻、物質享受、衣物、田宅、財產、貸款、物質慾等有關。心態上傾向於穩定，專心也樂於工作，賺錢上感覺比較不那麼辛苦。行動派，喜歡熱鬧的地方，也比較有賺錢機會，生意上，人緣較佳。容易見財，較有歡喜心，適合固定財源，腳踏實地賺取，保守投資。再逢【比，劫】流運，注意財不露白，勿投資。尤其財星明顯更需注意【官，印】流運，易有事，注意夫妻間溝通。";
            補注1 = "①心性：保守謹慎、做事較實在、重視金錢、易守財、較懂理財存錢。②財運：易守財、穩定的財源、財運佳。③事業：佳，工作穩定。工作考試運佳、升學考運普通。④感情：有利發展、感情易穩定。⑤生活：正當的工作、生活有規率、寢室、工作室。⑥運氣：運氣佳、易得貴人幫助。"
            喜神 = "正財為喜神，生活環境好，做事固定，重視未來，賺錢機會多，工作較穩定，較有家庭責任，愛熱鬧，好溝通的特性。工作愉快，事業順遂，有口福，娛樂的機會多，財源廣進。喜歡掌握，想擁有，有企劃能力，重視未來，但心性上會較現實，功利心重，求財心強烈，慾望較高，易購置不動產或投資。";
            忌神 = "正財為忌神，運限發生的吉凶之事反復大，易大好大壞，雖然錢財來之容易，但錢財去之亦快，易有意外破耗或財務糾紛。心中常想玩大事業，沒耐心，也喜歡投機性工作有這種特性。閒不住，缺恆心，想支配一切，較現實，重利益，只管自己，不易滿足，開銷大，會因財而生災，甚至惹禍上身。在商場上交易不順，易損失財產，或為財愁苦，男性也易因女性破財，妻子健康或母親健康或運氣受影響。逢財星流運，財克印，易為長輩之事煩憂，不利母親，本人易外遇情人。為了財利接受他人賄賂，或賄賂他人，容易招惹財務糾紛，平時身體亦欠安康，食欲不振，易消極煩惱等。";
            身強 = "身強，只要意志力夠又有耐性，想賺錢並不難。";
            身弱 = "身弱，今年要特別注意會有破財或桃色糾紛。為人不要太小心眼，要變通才會賺到錢，對錢極為保守。";
            喜用 = 1; //to read from 命盤。分析
            //
            if (性別 == "女") {
                喜神 = 喜神 + "女命比平時更熱衷化妝打扮。";
            }

            if (性別 == "男") {
                現象 = 現象 + "未婚男命，會有結婚的機會。已婚的，也較疼老婆。"
                喜神 = 喜神 + "男命有異性緣，未成家者易有戀愛，喜成熟的女人。";

            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if ((命盤.分析.十神.數據[十神字轉數("正印")].天干 > 0) && 干支引發=="天干")  {
                補注2 = "";
                if (性別 == "男") {補注2 = 補注2 + "男命，太太與母親較不合，會有婆媳問題。未婚者，可娶妻。"; 現象註解.push(補注2);}
            }

            if (((命盤.分析.十神.數據[十神字轉數("比肩")].天干 > 0) || (命盤.分析.十神.數據[十神字轉數("劫財")].天干 > 0))&& 干支引發=="天干") {
                補注2 = 引發+"正財，本命有比肩、劫財，應注意生命與身體健康，財多身弱，財多逢劫必破，應注意破財、損身，有買不動產可能。";
                現象註解.push(補注2);
            }
            break;

        case "偏財":
            現象 = "偏財，發生之事多與父親、戀人、妻子、情人、同居、結婚、身體、經商、求財、意外橫財等有關。生活中喜揮霍享受，為人注重實際，喜歡滯留在外或旅遊，心態上傾向於管理與調控，操作欲增強，較有意外之財，慷慨豪邁，疏財重義，財來財去，應注意理財。再走【偏印，傷官，正財】的流運，注意投資，身體，婚姻之事。";
            補注1 = "①心性：樂觀隨性、大方豪爽、喜即時行樂。②財運：先好後壞、宜見好就收。③事業：尚可、易有遷調職務。升學考運不佳。工作考試有利。④感情：有利感情發展。⑤生活：交際應酬多、生意場所、愉樂場、銀行、賭場。⑥運氣：喜悲起伏多、一好一壞。"
            喜神 = "偏財為喜神，活環境好，工作愉快，事業順遂，有口福，娛樂的機會多，有行動力。賺錢機會多，財源上較穩定，求財心強烈。功利心重，重視享受，慾望較高，易購置財產，也易多方面投資。";
            忌神 = "偏財為忌神，運限發生的吉凶之事反復大，易大好大壞，雖然錢財來之容易，但錢財去之亦快，易有意外破耗或財務糾紛。心中常想玩大事業，沒耐心，也喜歡投機性工作有這種特性。妻子健康或母親健康或運氣受影響，會因財而生災，甚至惹禍上身。商場交易不順，易損失財產，或為財愁苦。逢財星流運，財克印，易為長輩之事煩憂，不利母親，本人易外遇情人。為了財利接受他人賄賂，或賄賂他人，容易招惹財務糾紛，平時身體亦欠安康，食欲不振，易消極煩惱等。";
            身強 = "身強，得正職辛苦耕耘所累積的財富，亦主財運亨通。易有偏財運。特別慷慨豪爽，深諳人情世故，交際特別好。";
            身弱 = "身弱，逢財反易破財，花費大，事業機會多，但無福消受，注意專精一藝可發財。宜戒酒、戒色，控制開銷。";
            喜用 = 1; //to read from 命盤。分析

            if (性別 == "女") {
                身弱 = 身弱 + "女命身弱，走偏財，視賺錢為壓力，賺得很難過，計劃好像永遠趕不上變化。";
                喜神 = 喜神 + "女命比平時更熱衷化妝打扮。";
            }
            if (性別 == "男") {
                現象 = 現象 + "男命偏財也主情人，需防配偶健康不好，或桃花事件。";
                if (命盤.分析.十神.數據[十神字轉數("正財")].天干地支 == 0) 現象 = 現象 + "此男命無正財，故以偏財論其配偶。";
                喜神 = 喜神 + "男性女性緣佳，未成家者易有戀愛。";
                忌神 = 忌神 + "男性也易因女性破財。";
                身強 = 身強 + "男命桃花運旺，會與年紀小的女孩相戀。";
            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if (命盤.分析.十神.數據[十神字轉數("七殺")].天干地支 > 0) {
                補注2 = "";
                if ((性別 == "男") && (命盤.分析.十神.數據[十神字轉數("偏財")].天干 > 0) && 干支引發=="天干") 補注2 = 補注2 + "男命身強，走偏財，本命有七殺 + 偏財，會有名聲地位，但好色居多，養妾機率高，總是想著外面的女人。";
                if (性別 == "女") 補注2 = 補注2 + 引發+"偏財，本命有七殺，若女命身強，為人是讓人感覺風情萬種、花枝招展的樣子，很開放，易入上流社會，也懂得軟硬兼施，女命帶七殺走偏財，易養小男人 ( 賺錢養男人 )。";
                現象註解.push(補注2);
            }
            if ((命盤.分析.十神.數據[十神字轉數("偏財")].天干 > 0) && 干支引發=="天干") {
                補注2 = "";
                if (性別 == "男") { 補注2 = 補注2 + 引發+"偏財，男命本命有天干帶偏財，外面帶妾不怕人知。"; 現象註解.push(補注2); }
            }
            if (命盤.分析.十神.數據[十神字轉數("偏財")].地支 > 0) {
                補注2 = "";
                if (性別 == "男") { 補注2 = 補注2 + "男命走偏財，本命地支帶偏財，會暗地裡藏妾。"; 現象註解.push(補注2); }
            }
            if ((命盤.分析.十神.數據[十神字轉數("正財")].天干地支 == 0) && (命盤.分析.十神.數據[十神字轉數("偏財")].天干地支 == 0)) {
                補注2 = 引發+"偏財，八字無正財、偏財，為人沒有金錢及數字觀念，財來財去，不知如何賺錢，不重錢財，沒有歡喜心。";
                現象註解.push(補注2);
            }
            break;

        case "七殺":
            現象 = "七殺，發生之事多與名譽，上級、老板、子女、工作、競爭、爭權奪利、小人、壓力、血光、意外傷害、受驚嚇、官司牢獄、外來壓迫、欺詐、強取豪奪、敵對之事之事有關。宜臨事多思考，捐血，行善，佈施。";
            補注1 = "①心性：較自私、喜左右別人、權利心重、不服輸、較有個性。②財運：稍可、易覺錢不夠用、欲望多不易滿足。③事業：較忙、壓力大、易受提拔重視。考運能比預期的好。④感情：易有困擾、阻礙多、事與願違、家人干涉。⑤生活：易受指責、別人要求高、受孤立、事情多且較忙。⑥運氣：較差、易有橫禍、受傷或爭鬥、較多的壓力。";
            喜神 = "七殺為喜神，很積極，有責任感，有領導格，但常以較突然之方式出現，表現亦較剛強，萬丈雄心，充滿毅力與勇氣，在事業、權利、升遷等方面，大都經過奮鬥與競爭而達成，外出求財亦吉。";
            忌神 = "七殺為忌神，工作上壓力大，易被中傷，被壓迫，不服輸，易緊張，不被信任，心情煩躁，性格脾氣不好，容易沖動發火，易與他人發生官非口舌之事，易受人欺負，易遭小人陷害，易遭盜賊搶劫偷竊，身體上易遭傷病災。錢財花銷大，外力競爭激烈，行事較衝動，具破壞性，與人發生爭執，容易演變成作奸犯科。事業易失敗，易週轉失靈，易破產。兄弟姐妹易遭刑傷，或與兄弟姐妹關系不好。生活上無規律，喜歡遲睡、熬夜、性生活不知節制，或睡覺失眠、多惡夢，居家生活環境噪音大，多吵鬧，易為兒女之事煩心，受兒女拖累等。";
            身強 = "身強走七殺，在工作事業上表有權勢地位。";
            身弱 = "身弱，可能會產生或揮霍無度，花錢瀟灑不知節制，愛面子難收拾。";
            喜用 = 1; //to read from 命盤。分析
            //
            if (性別 == "女") {
                現象 = 現象 + "女命走七殺，比較不得老公寵愛，婚姻比較辛苦，易有失戀或婚姻煩惱。但異性緣好，會對年紀相當或年輕的對象特別好，結婚後還是一樣具男人緣，須自我控制。"
                if (命盤.分析.十神.數據[十神字轉數("正官")].天干 == 0) 現象 = 現象 + "此女命盤無正官，故以七殺論丈夫。";
            }

            if (性別 == "男") {
                現象 = 現象 + "男命易為兒女之事操心";
                喜神 = 喜神 + "已婚男命有添丁喜。";
            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if ((命盤.分析.十神.數據[十神字轉數("正官")].天干 > 0) && 干支引發=="天干") {
                補注2 = "";
                if (性別 == "男") { 補注2 = 補注2 + 引發 + "七殺，男命有正官，喜歡去風月場所，也容易鬼混在女人堆中，要記得潔身自愛。"; 現象註解.push(補注2); }
            }

            if (命盤.分析.十神.數據[十神字轉數("正官")].天干地支 > 1) {
                補注2 = 引發 + "七殺，本命七殺又多，精神顯得萎靡不振，壓力特別大。";
                現象註解.push(補注2);
            }

            if (命盤.分析.十神.數據[十神字轉數("七殺")].天干地支 > 0) {
                補注2 = 引發 + "七殺，本命又有七殺，若身弱，可能會有失業，或降級之事發生，易遭小人陷害，也可能會有破財之現象或有血光。";
                if (性別 == "女") 補注2 = 補注2 + "女命會有感情生變，惱人之事發生，甚或討小男人。";
                現象註解.push(補注2);
            }
            break;

        case "正官":
            現象 = "正官，發生之事多與參加工作、昇遷、公眾事件、煩心之事、長官、老板之壓力等事相關。心態上傾向於正直、公正、責任、順從、保守、自省、很好面子、喜歡別人讚賞，高傲孤群等。流運逢【傷官】，較有職位變動或異動，官非，車關，血光，不名譽之事。";
            補注1 = "①心性：穩重成熟、保守盡責、按步行事。②財運：佳、收入穩定、易蓄財。③事業：佳、穩定、能得到賞識。盡力就有收獲。工作考運佳。④感情：穩定、易有新進展、結婚運佳。⑤生活：易受照顧、環境單純、有規率的生活。⑥運氣：佳。";
            喜神 = "正官為喜神，有重名聲，為人忠心、順從，有理性，誠實，重聲望，守法，有責任感，守成，願受拘束，重地位，頭腦好，工作事業穩定，有光明正大的心態，理性守信守法，會有好名氣，是人人心中的好朋友，在職位或官位上較易高升，考試較易上榜，官訟較易勝訴，易得長官提拔，外出求財亦大吉。";
            忌神 = "正官為忌神，不積極，不易有功名，為人愛面子，優柔寡斷，難有發展，要求多，是非多或會有名譽上之毀損，降職、失職，與上司不合，考試落榜，求職不順，受上司之責備、連累等。";
            身強 = "身強，見官得官，不得官也會得貴。";
            身弱 = "身弱者，身體不好且會變成體弱多病，因為『身弱不得任財官』來自家庭、學業或工作上的壓力，會感覺特別大。感覺處事方面較優柔寡斷，缺乏自信，魄力不足，做事欠考慮，也較猶豫。";
            喜用 = 1; //to read from 命盤。分析
            //
            if (性別 == "女") {
                現象 = 現象 + "女命正官主丈夫，易為丈夫之事操心，未婚者先結婚。"
                喜神 = 喜神 + "未婚女性較易有戀愛及婚嫁緣。";
                忌神 = 忌神 + "女性易有失戀或婚姻煩惱。";
            }

            if (性別 == "男") {
                現象 = 現象 + "男命易為兒女之事操心。";
                喜神 = 喜神 + "已婚男命有添丁之喜。";
            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if ((命盤.分析.十神.數據[十神字轉數("傷官")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "正官，本命有傷官，較有職位變動或異動，恐怕會有血光之災，車關，注意名聲地位受損。";
                現象註解.push(補注2);
            }

            if (((命盤.分析.十神.數據[十神字轉數("正官")].天干 > 0) || (命盤.分析.十神.數據[十神字轉數("七殺")].天干 > 0)) && 干支引發=="天干") {
                補注2 = "";
                if (性別 == "女") { 補注2 = 補注2 + "女命中有正官、七殺，又逢正官歲運，易有桃色糾紛或爬出圍牆之現象。"; 現象註解.push(補注2);}
            }

            if ((命盤.分析.十神.數據[十神字轉數("食神")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "正官，命帶食神，流運行事上顯得慵懶，不積極，做什麼事都覺得不帶勁。";
                現象註解.push(補注2);
            }

            if ((命盤.分析.十神.數據[十神字轉數("正官")].天干 > 0) && (命盤.分析.十神.數據[十神字轉數("七殺")].天干 > 0) && 干支引發=="天干") {
                補注2 = "";
                if (性別 == "男") { 補注2 = 補注2 + 引發 + "正官，若身強，本命又有正官與七殺，在社會上會有兩個頭銜。"; 現象註解.push(補注2); }
            }

            if ((命盤.分析.十神.數據[十神字轉數("正官")].天干地支 == 0) && (命盤.分析.十神.數據[十神字轉數("七殺")].天干地支 == 0)) {
                補注2 = "";
                if (性別 == "男") { 補注2 = 補注2 + 引發 + "正官，身弱，本命又沒有正官、七殺，此運限會覺得壓力特大，精神也易緊張。"; 現象註解.push(補注2); }
            }
            break;

        case "偏印":
            現象 = "偏印，發生之事情大多與外在之貴人、心理層面、學習、求知慾、文書、契約、母親、長輩、老師、信用等。心態上傾向於孤獨，做事常三心兩意，有創意，領悟力，洞悉力、封閉、冷漠、偏激等。特別具有第六感，對神秘事物有強烈興趣，更善於察言觀色，喜怒不形於色，容易與易學、宗教、技藝結緣。再逢【食，傷】流運，常遭陷害，扯後腿，多敗少成，意外之災。";
            補注1 = "①心性：孤僻不好動、疑心、防禦心重、不易滿足。②財運：不佳、不利合夥投資、易做出錯誤的判斷而破財、③事業：平穩、有較長遠的計劃。考運不理想。④感情：較無趣、想的太多易顧忌不前、無法做取捨。⑤生活：生活不規率、改變新環境、晝夜巔倒、易學到錯誤的觀念。⑥運氣：差，無法自拔，得不到想要的。";
            喜神 = "偏印為喜神，生活、工作環境上較安定，舒適安逸，點子多，會想購置不動產，反應快，較沒意見的特性。容易獲得長輩或貴人之關心、協助，而升官或經商開辦公司等。在社會上容易獲得名望，考試、選舉順遂。喜歡學習新的事物，易接近宗教、五術或文學。但會較孤獨，喜獨處思考。";
            忌神 = "偏印為忌神，生活、工作環境差，愛插嘴，容易刺激人家，孤僻，做事魄力不足，抽象化，較被動，粗心，猶柔寡斷，且任性固執，不易贊同別人的想法的。凡事易遭長輩阻礙或干擾，又易與長輩與顧客發生誤會，工作事業、甚至財務皆不順遂，容易因判斷失誤而導致損失，易蒙不白之冤，事事多阻滯，有志難伸，孤苦無援，考運差。";
            身強 = "身強，走偏印，很喜外出結緣，投資在花費較兇 ，對環境敏感度較無信心。";
            身弱 = "身弱，在學業、家庭、工作上比較得貴人，可得名利雙全，但大都喜獨來獨往，較神秘。這個運限會顯得特別精明幹練。";
            喜用 = 1; //to read from 命盤。分析
            //
            if (性別 == "女") {
                忌神 = 忌神 + "女命較易有損傷子女之事。";
            }
 
            if (性別 == "男") {
            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if ((命盤.分析.十神.數據[十神字轉數("食神")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "偏印，本命有食神，今年常遭陷害，也會被扯後腿，亦好扯人後腿，做事多敗少成。";
                if (性別 == "女") 補注2 = 補注2 + "女命易得腫瘤。";
                現象註解.push(補注2);
            }
            if ((命盤.分析.十神.數據[十神字轉數("正印")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "偏印，本命有正印，對事情的敏銳度好像都是後知後覺，但對已認知的事會非常主觀，走偏印的運限特別嚴重。";
                現象註解.push(補注2);
            }

            if ((命盤.分析.十神.數據[十神字轉數("偏印")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "偏印，命中又有偏印逢偏印，若身強，思想有點奇怪，常會與人唱反調，較會自殺，也較多疑，易有燥鬱症、自閉症狀。";
                現象註解.push(補注2);
            }

            if ((命盤.分析.十神.數據[十神字轉數("七殺")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "偏印，命帶七殺，若身弱，貴人比較不容易顯現，同時母親的行動應多加注意。";
                現象註解.push(補注2);
            }
            break;

        case "正印":
            現象 = "正印，發生之事多與長輩、母親、老師、文書、學習、宗教等有關。心態上傾向於慈悲，喜歡靜，寬宏大量、得過且過，心地軟，自我封閉、固執、有依賴心、重視人格、名譽、人情、感情、友誼、責任、信諾。重視精神生活，很會思考，不喜歡動，但容易顯得慵懶。貴人較明顯，較難溝通。對易學有興趣，或容易與易學、宗教結緣。";
            補注1 = "心性：沉著、懶惰、不喜多話、學習心重。②財運：平、無偏財運。③事業：工作穩定。考運佳。④感情：不佳、若有機會多年紀較長者、進展慢。⑤生活：生活穩定而呆板。⑥運氣：平平、較無起伏。";
            喜神 = "正印為喜神，生活、工作環境上較安定，好名聲，有智慧，被尊重，慈悲、寬厚，易滿足，信任，穩重，待人親切，包容心但喜佔權。容易獲得長輩或貴人之關心、協助，而升官或經商開辦公司等。在社會上容易獲得名望，考運順遂。喜歡學習新的事物，易接近宗教、五術或文學。會想購置不動產，也同時也有可能得到祖產。";
            忌神 = "正印為忌神，好管閒事，多勞碌，不適合開創性的工作，及心軟。容易發生因判斷錯誤而受損，或受騙之事，或破財敗業。凡事易遭長輩阻礙或干擾，又易與長輩與顧客發生誤會，考運、工作事業、甚至財務皆不順遂，容易因判斷失誤而導致損失，易蒙不白之冤，事事多阻滯，有志難伸，孤苦無援。母親身體及運氣較差。";
            身強 = "身強得正印，表假貴人，煩且無法跨越。";
            身弱 = "身弱，貴人特別多。若命盤有華蓋，特別有機會接近宗教或學術易出名。";
            喜用 = 1; //to read from 命盤。分析
            //
            if (性別 == "女") {
                現象 = 現象 + "女命可以主有貴人來照顧，主桃花。"
                忌神 = 忌神 + "女命較易發生損子女之現象，多煩多憂之現象。";
            }
 
            if (性別 == "男") {
                現象 = 現象 + "男命主遇上女貴人。";
            }

            現象註解.push(論斷開頭句 + 現象 + "<br><br>" + 補注1 + "<br>");
            if (喜用 == "喜") 現象註解.push(喜神);
            if (喜用 == "忌") 現象註解.push(忌神);
            if (強弱 == "強") 現象註解.push(身強);
            if (強弱 == "弱") 現象註解.push(身弱);
            if (喜用 != "喜" && 喜用 != "忌") 現象註解.push(喜神 + "<br>" + 忌神);
            if (強弱 != "強" && 喜用 != "弱" && 喜用 != "平") 現象註解.push(身強 + "<br>" + 身弱);

            // ******************************** 命盤十神補充 ********************************
            if ((命盤.分析.十神.數據[十神字轉數("正財")].天干 > 0) && 干支引發=="天干") {
                補注2 = "本命有正財為喜用者，運限逢正印，比較容易丟掉職業，敗家業，流浪到他鄉或換行業。";
                if (性別 == "男") 補注2 = 補注2 + 引發 + "正印，男命命中又有正財，婆媳不和，先生要做公親。";
                if (性別 == "女") 補注2 = 補注2 + 引發 + "正印，女命命中又有正財，較易與母親頂嘴，做事模擬兩可，有做就算數。";
                現象註解.push(補注2);
            }
            if ((命盤.分析.十神.數據[十神字轉數("正官")].天干 > 0) && (命盤.分析.十神.數據[十神字轉數("正印")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "正印，若身強，命中有正官與正印，會顯得特別有權勢，但亦表壓力很大，願望上較難發揮有，有很多顧忌 。";
                現象註解.push(補注2);
            }
            if ((命盤.分析.十神.數據[十神字轉數("正印")].天干 > 0) && 干支引發=="天干") {
                補注2 = 引發 + "正印，身弱，本命有印，會因個性懶散，依賴心過重，任性而導致受人排擠，但處處逢貴人。";
                現象註解.push(補注2);
            }
            break;
    }

    // ******************************** 命盤十神補充1 ********************************
    // ************* 印 *****************
    if ((命盤.分析.十神.數據[十神字轉數("偏印")].天干 > 0) && (命盤.分析.十神.數據[十神字轉數("正印")].天干 > 0) && (十神=="偏印" || 十神=="正印")&& 干支引發=="天干") {
        補注2 = "八字有正印偏印,又逢正印或偏印，對工作事業缺乏專注力，易身兼數職，工作事業易變動。說話做事顛三倒四。";
        現象註解.push(補注2);
    }

    // ************* 官殺 *****************
    if (((命盤.分析.十神.數據[十神字轉數("正官")].天干 > 0) || (命盤.分析.十神.數據[十神字轉數("七殺")].天干 > 0)) && (十神=="正官" || 十神=="七殺") && (性別 == "女") && 干支引發=="天干") {
        補注2 = "女命有正官、七殺，又逢正官或七殺流運，易有外遇，容易受人欺凌，更有感情糾紛。";
        現象註解.push(補注2);
    }
 
    //if(引發=="合出" || 引發=="暗合出") 現象註解.push(內外造成因素(四柱數)); //看合那個宮位看內外因素
    return 現象註解.join("<br><br>");
}




// $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
function 四地冲克應(冲支對){
    switch(冲支對){
        case "子午": case "午子":
            return "子午桃花沖，人緣好，個性反覆不定，感情困擾。"
            break;
        case "卯酉":case "酉卯":
            return "卯酉桃花沖，人緣好，較會衡量人，第六感強，憑直覺做事。"
            break;
        case "辰戌": case "戌辰":
            return "辰戌庫冲，錢財守不住，有運賺；無運賠，辯才無礙，身體較會不好。"
            break;
        case "丑未": case "未丑": 
            return "丑未庫冲，錢財守不住，小財不斷流失，追根究底。打破砂鍋問到底。"
            break;
        case "寅申": case "申寅":
            return "寅申驛馬冲，留意車關，不宜開快車，適合外務，東奔西跑。"
            break;
        case "巳亥": case "亥巳": 
            return "巳亥驛馬冲，會抄近路，追求速度，留意車關，適合外務，辯才無礙，得理不饒人。"
            break;
        default:
            return "";
    }
}

function 四地合克應(合支對){
    switch(合支對){
        case "子午": case "午子": case "卯酉":case "酉卯":
            return "子午卯酉之合（花），。。。。。"
            break;
        case "辰戌": case "戌辰": case "丑未": case "未丑": 
            return "辰戌丑未之合（庫），就容易花錢，或投資。"
            break;
        case "寅申": case "申寅": case "巳亥": case "亥巳": 
            return "寅申巳亥之合（馬），。。。。。。"
            break;
        default:
            return "";
    }
}

function 內外造成因素(四柱){
    switch(四柱){
        case 0: case "年": case "年柱": case 1: case "月": case "月柱":
            return "多數為外界因素所造成的事件。" 
        case 2: case "日": case "日柱": case 3: case "時": case "時柱":
            return "多數為內在或家庭因素所造成的事件。"
        default:
            return "";
    }
}

// ******************* 流年十二神煞 *******************
function 流年十二神煞判斷(農曆生年, 農曆生月, 農曆生日, 農曆生時, 西曆流年, 選項){
    var 流年神煞矩陣=[];
    var 流年神煞註解=[];
    var 流年虛歲=西曆流年-農曆生年+1;
    var 年神煞數=流年虛歲%12;
    var 月神煞數=(年神煞數+農曆生月-1)%12;
    var 日神煞數=(月神煞數+農曆生日-1)%12;
    var 生時=農曆生時;
    //console.log(流年虛歲 + ", " + 農曆生年+ ", " + 農曆生月+ ", " + 農曆生日+ ", " + 農曆生時);
    if(生時=="早子" || 生時=="夜子") 生時="子"
    var 時數=地支字轉值(生時);
    if (時數==0) 時數=12;  //亥時
    var 時神煞數=(日神煞數+時數-1)%12;
    
    //var 流年標題='<span class = "論斷單元">流年十二神煞</span><br><br>';
    //var 命盤資料='<span class = "經典標題">流年：' + 西曆流年 + '（' + 流年干支 + '），虛歲：' + 流年虛歲 + '</span><br><br>';
    var 押運神=流年十二神煞(年神煞數);  //年
    var 串宮神=流年十二神煞(月神煞數);  //月
    var 守護神=流年十二神煞(日神煞數);  //日
    var 巡門神=流年十二神煞(時神煞數);  //時
    
    switch(選項){
        case 1: case "神煞":
            流年神煞矩陣.push(押運神.名稱);
            流年神煞矩陣.push(串宮神.名稱);
            流年神煞矩陣.push(守護神.名稱);
            流年神煞矩陣.push(巡門神.名稱);
            return 流年神煞矩陣;
        case 2: case "流年十二神煞論斷":
            //var 十二神煞註解;
            //十二神煞註解="押運神："+押運神.名稱+"（"+押運神.吉凶+"）："+押運神.註解1+押運神.註解2;
            流年神煞註解.push("押運神："+押運神.名稱+"（"+押運神.吉凶+"）：<br>"+押運神.註解1 + "<br>"+押運神.註解2);
            流年神煞註解.push("串宮神："+串宮神.名稱+"（"+串宮神.吉凶+"）：<br>"+串宮神.註解1 + "<br>"+串宮神.註解2);
            流年神煞註解.push("守護神："+守護神.名稱+"（"+守護神.吉凶+"）：<br>"+守護神.註解1 + "<br>"+守護神.註解2);
            流年神煞註解.push("巡門神："+巡門神.名稱+"（"+巡門神.吉凶+"）：<br>"+巡門神.註解1 + "<br>"+巡門神.註解2);
            return 流年神煞註解.join("<br><br>");
    } //end switch 選項
}

function 流年十二神煞(神煞數){
    //var 神煞數=流年虛歲%12;
    var 十二神煞屬性={"名稱": "", "吉凶": "", "註解1": "", "註解2": ""};
    var 神煞=十二神煞屬性;
    
    switch(神煞數){
        case 0:
            神煞.名稱="病符";
            神煞.吉凶="小凶";
            神煞.註解1="病符壓運很難強，事要三思免禍殃。病魔纏身使人憂，三災八難難躲藏。";
            神煞.註解2="病符入命惡重重，疾病纏身家不寧，辦事處事心不順，朝朝暮暮愁雲生，憑你是個硬神漢，也得脫上皮幾層。";
            break;
        case 1:
            神煞.名稱="太歲";
            神煞.吉凶="小凶";
            神煞.註解1="太歲當頭座，無福便有禍，防車關、刀金之傷，小人容易近身，宜安奉太歲符祈安自吉，外出遠行宜避免。";
            神煞.註解2="太歲壓運不是福就是禍，是福無限美，是禍多憂愁。太歲壓運起禍端，傷財惹氣心不甘。驚天動地禍來臨，現是現非把人纏。他人閑事莫要管，防備自己得安然。太歲運年多憂愁，口舌臨門不自由，疾病纏身小人侵，婚姻錢財莫強求。運逢太歲難行舟，勸君慎重莫遠游。";
            break;
        case 2:
            神煞.名稱="青龍";
            神煞.吉凶="吉";
            神煞.註解1="青龍是喜神，大喜有幾重，荷花生貴子，門前應挂紅。青龍入命大吉祥，創業謀事有人幫，添人進口生貴子，家中喜事一樁樁。";
            神煞.註解2="官運亨通財運好，即使有禍不為殃。忌獨斷獨行，親人失和，但因貴人高照，喜事重重，貴人提拔，遠行有財利可得，生意興隆，財利大好，一切事事如意。";
            break;            
        case 3:
            神煞.名稱="喪門";
            神煞.吉凶="凶";
            神煞.註解1="喪門是哭星，落淚有幾行。";
            神煞.註解2="喪門運年心不安，求財望喜多枉然，不是傷人就損財，憂思重重整一年，不有內孝有外孝，犯著喪門淚漣漣。喪門入宮，不利探病，並忌喪事，犯喪孝，探病帶災，防小人設計，心情浮沉不定，事事要小心，以免發生意外，要防平地起風波，凶多吉少，要注意。";
            break;
        case 4:
            神煞.名稱="六合";
            神煞.吉凶="吉";
            神煞.註解1="六合見六合，必定喜事多。有妻生貴子，無妻娶嬌娥。";
            神煞.註解2="六合入命大吉昌，萬事順隨人丁旺，多得親友來輔助，縱有逆風不起浪，求財謀利皆如意，添喜進財時運強。";
            break;
        case 5:
            神煞.名稱="官符";
            神煞.吉凶="中";
            神煞.註解1="官符為紅鸞，有喜在當年。少惹是非事，免禍在身邊。官符還代表財運和事業。";
            神煞.註解2="官符入命令人憂，是非口舌無止休，平地也會起風波，憂思如麻不斷頭，財帛易散物易損，犯了官符難自由。";
            break;
        case 6:
            神煞.名稱="小耗";
            神煞.吉凶="中";
            神煞.註解1="時運多顛倒，做事不牢靠。金銀多耗散，家財遭鬼盜。";
            神煞.註解2="小耗之年多煩惱，是非口舌幾多招，官非易起氣易惹，金銀錢財易損耗，東奔西跑無定處，辦事不遂多阻撓。";
            break;
        case 7:
            神煞.名稱="大耗";
            神煞.吉凶="凶";
            神煞.註解1="大耗定不祥，父母有人傷。今年財要損，朋友來反目。背運有人傷，落井會下石。";
            神煞.註解2="年逢歲破禍非輕，官司竊騙極易生，不是破財遭凶事，就是體弱身染病，若與白虎連一起，凶喪孝服災更重。";
            break;
        case 8:
            神煞.名稱="朱雀";
            神煞.吉凶="小凶";
            神煞.註解1="朱雀壓運凶，口舌是非多。內外來磨磋，小人當前橫。事事犯啰唆，有理無人理。有冤無處訴，還要背黑鍋。";
            神煞.註解2="朱雀入命口舌生，風波擾得心不寧，求名求財皆不利，凡事多磨少成功，幸喜紫微當頭照，逢凶化吉保太平。";
            break;           
        case 9:
            神煞.名稱="白虎";
            神煞.吉凶="凶";
            神煞.註解1="白虎當頭坐，無災也有禍。鐵羅漢落井，有力難施展。白虎下山來，先遭口舌運，又遭凶災氣。";
            神煞.註解2="白虎入命最凶險，血光傷疾度難關，更有內外孝服事，天災橫禍需防范，白虎之年心難安，一年四季不消閑。";
            break;
        case 10:
            神煞.名稱="貴神";
            神煞.吉凶="吉";
            神煞.註解1="貴神壓運事吉祥，財源廣進喜又和。春不見喜秋也見，財喜雙全不用說。男遇貴神天賜祥，女見貴神喜事多。";
            神煞.註解2="貴神入命福壽長，財運亨通身安康，善與人交受人敬，高官厚祿名遠揚，凡事都有貴人幫，運逢貴神心歡暢。";
            break;
        case 11:
            神煞.名稱="吊客";
            神煞.吉凶="中";
            神煞.註解1="吊客壓運事有凶，定有是非鬧災行。男犯吊客主不順，女犯吊客有災星。";
            神煞.註解2="吊客流年也為凶，四方親人不太平，求財謀利難如意，晦氣會有幾多重，歲逢吊客心不安，舊愁去了新愁添。";
            break;
        default:
            神煞.名稱="";
            神煞.吉凶="";
            神煞.註解1="";
            神煞.註解2="";            
    }// end switch
    return 神煞;
}


function 命宮流年神煞判斷(命宮, 西曆流年){
    //命宮地支：子、丑。。。。
    //西曆流年： 2016， 2017。。。。。
    var 命宮地支=(命宮.length==2)?命宮.substr(1,1):命宮;
    var 命宮數=地支字數轉換(命宮地支);
    var 生肖數=(西曆流年-1923)%12;
    var 神煞數=Math.abs(命宮數-生肖數)+1;
    //console.log("命宮數:" +命宮數 + ", 生肖:" + 生肖數 + ", 神煞數:" + 神煞數);
    var 命宮神煞=命宮流年神煞(神煞數);
    return "命宮在"+命宮地支+"，流年神煞："+命宮神煞.神煞群+"<br>"+命宮神煞.註解;
}  //end 命宮流年神煞判斷

function 命宮流年神煞(神煞數){
    //var 神煞數=流年虛歲%12;
    var 十二神煞屬性={"名稱": "", "神煞群": "", "註解": ""};
    var 神煞=十二神煞屬性;
    
    switch(神煞數){
        case 0:
            神煞.名稱="病符";
            神煞.神煞群="病符、凶神、陌越";
            神煞.註解="歲為病符凶神入宮，此年勿入病人家，切不可探病，勿食喪家物，防身體不安，謀事不成就，願守舊業，免有浮沈不定致損財。宜制化即安，事事如意，身體健康，財利亨昌。";
            break;
        case 1:
            神煞.名稱="太歲";
            神煞.神煞群="太歲、驚天、劍鋒";
            神煞.註解="歲為太歲入抄謂之太歲當頭坐，無災必有禍。此年正月中，以用紅紙條，標寫當年太歲星君，安奉平安自吉。當年七月十九日值年太歲星君千秋應辦清茶四果奉敬，相傳當太歲年若婚易破緣乏子息。。";
            break;
        case 2:
            神煞.名稱="太陽";
            神煞.神煞群="太陽、天空、劫殺";
            神煞.註解="歲為天空占宮，休管他人事，莫爭口舌之非，自免是非破財，官累事項，女人犯此須防色情苦惱，謹防夫妻反睦為要，出外有財利益吉。最好安置日月拱照星君，資益大吉。";
            break;            
        case 3:
            神煞.名稱="喪門";
            神煞.神煞群="喪門、地雉、地喪";
            神煞.註解="歲為喪門入宮，此年不利探病，送喪，遇喪禮出山休看，以免沾染穢氣受災禍，生不意事端，避者吉也，事事無憂，宜制凶煞星，以保平安矣。無解恐有平地起風波，凶多吉少之應，應謹慎防之免憂。";
            break;
        case 4:
            神煞.名稱="太陰";
            神煞.神煞群="太陰、勾絞、羊刃";
            神煞.註解="歲為勾絞入抄，勾絞交運事生煩惱，莫道一勻來，能興百丈風波，男多犯桃唇之人害，成受暗中箭，此年中夜間，安拜太陰星君以保吉祥，有喜無災，無喜百事來，宜制空亡妙吉。";
            break;
        case 5:
            神煞.名稱="五鬼";
            神煞.神煞群="五鬼、官符、三台";
            神煞.註解="歲為五鬼占宮，防人之災憂，人已無故生煩。此年中以制五鬼運財逢凶化吉，無改事端來，六畜不旺破錢財。生男添丁發財，合股事業不利，虧資口舌纏官符以致受災厄囚獄之苦。";
            break;
        case 6:
            神煞.名稱="死符";
            神煞.神煞群="死符、小耗、月德";
            神煞.註解="歲為死符小耗入度，謂是賊神入宮，不利與人結黨合夥勾串事業，防之小手盜偷物，勿探病人，無中生有，探病代人病，見屍恐致亡避忌為妙。制化劫財星及改脫凶煞補運為吉。";
            break;
        case 7:
            神煞.名稱="歲破";
            神煞.神煞群="歲破、大耗、月恩";
            神煞.註解="歲為度犯大耗，防人之憂，五內生悲，災退呼在月恩日拜神叩祈，事能忍耐守份自可無憂。忌動土，完婚，如有結婚者，破害夫妻半途無緣，或乏子息，色欲謹慎，事業不順破財慮。";
            break;
        case 8:
            神煞.名稱="龍德";
            神煞.神煞群="龍德、天厄、紫微";
            神煞.註解="歲為紫微星入宮，喜事重重，此年有喜逢為貴，無喜事端來，如添人進口大利(有新生兒)遠行有財事可成，欲求財利旺，此年一月十五日夜求龍德星神，事事順調。";
            break;           
        case 9:
            神煞.名稱="白虎";
            神煞.神煞群="白虎、天雄、地殺";
            神煞.註解="歲為白虎入宮為害，恐傷人口，血光病難，外傷車厄痛運，孝服及其他不測凶事。女人有喜即吉，無喜憂，此年中夜間擇用麒麟星降臨宜制化白虎凶星為妥妙吉。";
            break;
        case 10:
            神煞.名稱="福德";
            神煞.神煞群="福德、卷舌、天德";
            神煞.註解="歲為福德星入宮萬事吉祥，如有不足事，可用每月初一日或十五日，早晚敬拜福德正神，招財童子，進寺童郎，求之福臨，無求不利。";
            break;
        case 11:
            神煞.名稱="天狗";
            神煞.神煞群="天狗、八座、吊客";
            神煞.註解="歲為天狗星入度，忌看日月蝕，免逢凶災，生不測禍根，生痛與刀傷過運免致車禍傷身之慘事破財，此年中夜宜改送天狗凶星化吉，須事事小心，以防多煩惱心病痛之憂。";
            break;
        default:
            神煞.名稱="";
            神煞.神煞群="";
            神煞.註解="";     
    }// end switch
    return 神煞;
}  //end function 命宮流年神煞




// ***********

function Gen_流年表格() {
    // using bootstrap table !
    var 流年表格=[];
    var 表格行數; 
    var 大運格子名稱, 流年格子名稱;

    流年表格.push('<table class="table table-bordered table-striped">');
    //流年表格.push('<thead>');
    //流年表格.push('<tr>');
    //流年表格.push('<th>Firstname</th>');
    //流年表格.push('<th>Lastname</th>');
    //流年表格.push('<th>Email</th>');
    //流年表格.push('</tr>');
    //流年表格.push('</thead>');
    流年表格.push('<tbody>');

    for (var i=0; i<10; i++){

        大運格子名稱="流運表格-大運-"+i;
        表格行數="表格行數-" + i;
        流年表格.push('<tr id="' + 表格行數 + '">');
        流年表格.push('<td id="' + 大運格子名稱 + '" class="流年表大運格子"></td>');
        for (var j=0; j<10; j++){
            流年格子名稱=大運格子名稱+"-流年-"+j;
            流年表格.push('<td id="' + 流年格子名稱 + '" class="流年表流年格子"></td>');         
        } // end for j, 流年
        流年表格.push('</tr>');
    }  //end for i, 大運

    流年表格.push('</tbody>');
    流年表格.push('</table>');

    return 流年表格.join("");
}

function 填寫流年表(流運矩陣){
    //流運矩陣：命盤的大運矩陣，內含流年矩陣

    var 大運格子名稱, 流年格子名稱;
    var 大運格子內容, 流年格子內容;
    
    //流運矩陣[0].流年[0].干支
    for (var i=0; i<10; i++){
        大運格子名稱="流運表格-大運-"+i;
        大運格子內容="<span>" + 流運矩陣[i].歲數間距 + '</span><br><span class="流年表大運干支字">' + VerticalString(流運矩陣[i].干支, "") + '</span>';
        $("#"+大運格子名稱).html(大運格子內容);
        
        for (var j=0; j<10; j++){
            流年格子名稱=大運格子名稱+"-流年-"+j;
            流年格子內容="<span>" + 流運矩陣[i].流年[j].歲數 + '</span><br><span class="流年表流年干支字">' + VerticalString(流運矩陣[i].流年[j].干支, "") + "</span><span>" + 流運矩陣[i].流年[j].年份 + "</span>";
            $("#"+流年格子名稱).html(流年格子內容);
        } // end for j, 流年
    } //end for i, 大運
}