
var Enum六十干支 = Object.freeze({ "癸亥": 0, "甲子": 1, "乙丑": 2, "丙寅": 3, "丁卯": 4, "戊辰": 5, "己巳": 6, "庚午": 7, "辛未": 8, "壬申": 9, "癸酉": 10, "甲戌": 11, "乙亥": 12, "丙子": 13, "丁丑": 14, "戊寅": 15, "己卯": 16, "庚辰": 17, "辛巳": 18, "壬午": 19, "癸未": 20, "甲申": 21, "乙酉": 22, "丙戌": 23, "丁亥": 24, "戊子": 25, "己丑": 26, "庚寅": 27, "辛卯": 28, "壬辰": 29, "癸巳": 30, "甲午": 31, "乙未": 32, "丙申": 33, "丁酉": 34, "戊戌": 35, "己亥": 36, "庚子": 37, "辛丑": 38, "壬寅": 39, "癸卯": 40, "甲辰": 41, "乙巳": 42, "丙午": 43, "丁未": 44, "戊申": 45, "己酉": 46, "庚戌": 47, "辛亥": 48, "壬子": 49, "癸丑": 50, "甲寅": 51, "乙卯": 52, "丙辰": 53, "丁巳": 54, "戊午": 55, "己未": 56, "庚申": 57, "辛酉": 58, "壬戌": 59 })
var Enum曆法 = Object.freeze({ "干支曆法": 0, "農曆": 1, "陰曆": 2 })

function 西曆日期模塊(年, 月, 日, 時) {
    // 時="hh:mm:00, 時辰是地支,自動計算
    var TimeHolder = 時.split(":")
    var TimeValue = Number(TimeHolder[0]) + Number(TimeHolder[1]) / 60 + Number(TimeHolder[2]) / 3600;
    if (parseInt(TimeValue)==NaN) { //if (Number.isNaN(TimeValue)) {
        時 = "00:00:00";
    }
    this.年 = 年;
    this.月 = 月;
    this.日 = 日;
    this.時 = 時;
    this.時辰 = 時間轉換地支(時, 1);
    this.西曆系統 = new Date(年, 月 - 1, 日, Number(TimeHolder[0]), 0, 0, 0);
    var DisplayDateType = new 日期格式(this.西曆系統);
    //alert(DisplayDateType.西曆);
    this.西曆中文 = DisplayDateType.西曆;

}

function 流年模塊(流年, 日主, 生年) {
    // 日主=日干: 甲,乙,丙,丁......
    var BaseYear = 1924;
    var BaseYearGanZhi = 1; //甲子年干支數
    this.干支 = 六十干支屬性(干支滾動(BaseYearGanZhi, 流年 - BaseYear), 1);
    this.年份 = 流年;
    this.虛歲 = 流年 - 生年 + 1;
    this.生肖 = 地支字轉生肖(this.干支.substr(1, 1));
    this.天干十神 = 尋十神(this.干支.substr(0, 1), 日主);
    var 流年藏干 = 地支屬性(this.干支.substr(1, 1), "藏干");
    this.藏干十神1 = 尋十神(流年藏干.substr(0, 1), 日主);
    this.藏干十神2 = 尋十神(流年藏干.substr(1, 1), 日主);
    this.藏干十神3 = 尋十神(流年藏干.substr(2, 1), 日主);
    //alert(this.藏干十神3);        
}

function 尋星座(Month, Day, 選項) {
    // 輸入西曆月份、生日
    var ZodiacNum = Month * 100 + Day;
    var zodiac, symbol, longitude, 星座;

    switch (true) {
        case ((ZodiacNum >= 121) && (ZodiacNum < 220)): 星座 = "水瓶座"; zodiac = "Aquarius"; symbol = "♒"; longitude = "300"; break;
        case ((ZodiacNum >= 220) && (ZodiacNum < 321)): 星座 = "雙魚座"; zodiac = "Pisces"; symbol = "♓"; longitude = "330"; break;
        case ((ZodiacNum >= 321) && (ZodiacNum < 421)): 星座 = "白羊座"; zodiac = "Aries"; symbol = "♈"; longitude = "0"; break;
        case ((ZodiacNum >= 421) && (ZodiacNum < 522)): 星座 = "金牛座"; zodiac = "Taurus"; symbol = "♉"; longitude = "30"; break;
        case ((ZodiacNum >= 522) && (ZodiacNum < 622)): 星座 = "雙子座"; zodiac = "Gemini"; symbol = "♊"; longitude = "60"; break;
        case ((ZodiacNum >= 622) && (ZodiacNum < 723)): 星座 = "巨蟹座"; zodiac = "Cancer"; symbol = "♋"; longitude = "90"; break;
        case ((ZodiacNum >= 723) && (ZodiacNum < 823)): 星座 = "獅子座"; zodiac = "Leo"; symbol = "♌"; longitude = "120"; break;
        case ((ZodiacNum >= 823) && (ZodiacNum < 924)): 星座 = "處女座"; zodiac = "Virgo"; symbol = "♍"; longitude = "150"; break;
        case ((ZodiacNum >= 924) && (ZodiacNum < 1024)): 星座 = "天秤座"; zodiac = "Libra"; symbol = "♎"; longitude = "180"; break;
        case ((ZodiacNum >= 1024) && (ZodiacNum < 1123)): 星座 = "天蠍座"; zodiac = "Scorpio"; symbol = "♏"; longitude = "210"; break;
        case ((ZodiacNum >= 1123) && (ZodiacNum < 1222)): 星座 = "射手座"; zodiac = "Sagittarius"; symbol = "♐"; longitude = "240"; break;
        case ((ZodiacNum >= 1222) || (ZodiacNum < 121)): 星座 = "摩羯座"; zodiac = "Capricorn"; symbol = "♑"; longitude = "270"; break;
    }

    switch (選項) {
        case 1: case "星座名稱":
            return 星座;
        case 2: case "Zodiac":
            return zodiac;
        case 3: case "sign":
            return symbol;
        case 1: case "long":
            return longitude;
    }
}


function 日期格式(SystemDate) {
    this.Year = SystemDate.getFullYear();
    this.Month = SystemDate.getMonth() + 1;
    this.Day = SystemDate.getDate();
    this.Hour = SystemDate.getHours();
    this.Minute = SystemDate.getMinutes();
    this.Second = SystemDate.getSeconds();
    var TimeStr = zeroPad(this.Hour, 2) + ":" + zeroPad(this.Minute, 2) + ":" + zeroPad(this.Second, 2);
    this.時辰 = 時間轉換地支(TimeStr, 1);
    this.西曆 = this.Year + "年" + this.Month + "月" + this.Day + "日" + this.Hour + "時" + this.Minute + "分";
    this.西曆日期= this.Year + "年" + this.Month + "月" + this.Day + "日";
    this.MalaysiaDate = this.Day + "-" + this.Month + "-" + this.Year + " " + TimeStr;
}

function 日期值轉換(DayString, DateType) {
    /**
    DayString: DDMMYYYYhhmmss
    DateType:  1 - Date with Time, DDMMYYYYhhmmss
               2 - Date without Time, DDMMYYYY, Time set to default 00:00:00
               3 - Year only, YYYY, Month & Day set to 1- January, Time set to default 00:00:00
    **/
    var InputDate;
    //DateType = 4;  //change it to moment date !!

    switch (DateType) {
        case 1:
            var InputDate = new Date(DayString.substr(4, 4), Number(DayString.substr(2, 2)) - 1, DayString.substr(0, 2), DayString.substr(8, 2), DayString.substr(10, 2), DayString.substr(12, 2), 0);
            break;
        case 2:
            InputDate = new Date(DayString.substr(4, 4), Number(DayString.substr(2, 2)) - 1, DayString.substr(0, 2), 0, 0, 0, 0);
            break;
        case 3:
            InputDate = new Date(DayString.substr(4, 4), 0, 1, 0, 0, 0, 0);
        case 4:  //moment JS date
            var momentDateStr = DayString.substr(4, 4) + "-" + DayString.substr(2, 2) + "-" + DayString.substr(0, 2) + " " + DayString.substr(8, 2) + ":" + DayString.substr(10, 2);
            moment.tz.setDefault("Asia/Taipei");  //Asia/Kuala_Lumpur
            InputDate = moment.tz(momentDateStr, "Asia/Taipei").toDate();
    }

    return InputDate;
}



//     *********************************************************************************
//                                         十二運星模塊
//     *********************************************************************************
function 十二星運(天干, 地支) {
    // 天干與地支可以是不同四柱的搭配來判斷不同的事項
    var 開始地支, 順逆, 運星, 地支數, 滾動數;
    var 地支數 = 地支字轉值(地支);

    switch (天干) {
        case "甲":
            開始地支 = 地支字轉值("亥");
            順逆 = 1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "乙":
            開始地支 = 地支字轉值("午");
            順逆 = -1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "丙":
            開始地支 = 地支字轉值("寅");
            順逆 = 1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "丁":
            開始地支 = 地支字轉值("酉");
            順逆 = -1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "戊":
            開始地支 = 地支字轉值("寅");
            順逆 = 1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "己":
            開始地支 = 地支字轉值("酉");
            順逆 = -1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "庚":
            開始地支 = 地支字轉值("巳");
            順逆 = 1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "辛":
            開始地支 = 地支字轉值("子");
            順逆 = -1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "壬":
            開始地支 = 地支字轉值("申");
            順逆 = 1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        case "癸":
            開始地支 = 地支字轉值("卯");
            順逆 = -1;
            滾動數 = ((地支數 - 開始地支) >= 0) ? 地支數 - 開始地支 : 地支數 - 開始地支 + 12;
            return 地支滾動(1, 順逆 * 滾動數);
        default:
            alert(天干+": 十二運星 的天干支輸入錯誤");
            return "";
    }
}

function 十二星運數轉字(運星數) {
    switch (運星數) {
        case 0:
            return "養";
        case 1:
            return "長生";
        case 2:
            return "沐浴";
        case 3:
            return "冠帶";
        case 4:
            return "臨官";
        case 5:
            return "帝旺";
        case 6:
            return "衰";
        case 7:
            return "病";
        case 8:
            return "死";
        case 9:
            return "墓";
        case 10:
            return "絕";
        case 11:
            return "胎";
        default:
            alert(運星數 + "：十二運星數轉字 錯誤");
            return "";
    }
}

function 尋四柱運星(四柱組合, 運星, 命盤){
    //四柱組合: 四柱組合字串，比方：0123,12,23, 213.......
    //運星：該柱的運星，"死"
    var 四柱矩陣 = 四柱組合.split(",");
    for(var j=0; j<四柱矩陣.length; j++){
        var 各柱 = 四柱矩陣[j].split("");
        for(var i=0; i<各柱.length; i++){
            //alert(四柱組合+" / " + 各柱[i] + " / " + 命盤.分析.四柱.四柱數據[各柱[i]].運星);
            if (命盤.分析.四柱.四柱數據[各柱[i]].運星 == 運星) return true;
        }      
    }

    return false;
}

//     *********************************************************************************
//                                         地支模塊
//     *********************************************************************************

function 時間轉換地支(輸入時間, 選項) {
    var 地支時間, 地支時間數;
    var TimeHolder = 輸入時間.split(":")
    var TimeValue = Number(TimeHolder[0]) + Number(TimeHolder[1]) / 60 + Number(TimeHolder[2]) / 3600;

    switch (true) {
        case ((TimeValue >= 0) && (TimeValue < 1)): 地支時間 = "早子"; 地支時間數 = 1; break;
        case ((TimeValue >= 1) && (TimeValue < 3)): 地支時間 = "丑"; 地支時間數 = 2; break;
        case ((TimeValue >= 3) && (TimeValue < 5)): 地支時間 = "寅"; 地支時間數 = 3; break;
        case ((TimeValue >= 5) && (TimeValue < 7)): 地支時間 = "卯"; 地支時間數 = 4; break;
        case ((TimeValue >= 7) && (TimeValue < 9)): 地支時間 = "辰"; 地支時間數 = 5; break;
        case ((TimeValue >= 9) && (TimeValue < 11)): 地支時間 = "巳"; 地支時間數 = 6; break;
        case ((TimeValue >= 11) && (TimeValue < 13)): 地支時間 = "午"; 地支時間數 = 7; break;
        case ((TimeValue >= 13) && (TimeValue < 15)): 地支時間 = "未"; 地支時間數 = 8; break;
        case ((TimeValue >= 15) && (TimeValue < 17)): 地支時間 = "申"; 地支時間數 = 9; break;
        case ((TimeValue >= 17) && (TimeValue < 19)): 地支時間 = "酉"; 地支時間數 = 10; break;
        case ((TimeValue >= 19) && (TimeValue < 21)): 地支時間 = "戌"; 地支時間數 = 11; break;
        case ((TimeValue >= 21) && (TimeValue < 23)): 地支時間 = "亥"; 地支時間數 = 0; break;
        case ((TimeValue >= 23) && (TimeValue < 24)): 地支時間 = "夜子"; 地支時間數 = 1; break;
    }

    switch (選項) {
        case "地支": case 1: //子、丑、寅、卯 ......
            return 地支時間;
        case 2: // 1, 2, 3, ....0
            return 地支時間數;
    }
}


function 地支滾動(地支數, 滾動數) {
    if (滾動數 < 0) {
        滾動數 += 12;
    }
    return (Number(地支數) + Number(滾動數)) % 12;
}

function 地支字轉換時數(地支) {
    //回發時數
    switch (地支) {
        case "亥": return 22;
        case "子": return 0;
        case "早子": return 0;
        case "夜子": return 23;
        case "丑": return 2;
        case "寅": return 4;
        case "卯": return 6;
        case "辰": return 8;
        case "巳": return 10;
        case "午": return 12;
        case "未": return 14;
        case "申": return 16;
        case "酉": return 18;
        case "戌": return 20;
        default:
            alert(地支+"：地支字轉換時數 錯誤");
            break;
    }
}

function 地支字轉值(地支) {
	if(地支=="-" || 地支=="x" || 地支=="X" || 地支=="o" || 地支=="O" || 地支==="") return "";
    switch (地支) {
        case "亥": return 0;
        case "子": return 1;
        case "丑": return 2;
        case "寅": return 3;
        case "卯": return 4;
        case "辰": return 5;
        case "巳": return 6;
        case "午": return 7;
        case "未": return 8;
        case "申": return 9;
        case "酉": return 10;
        case "戌": return 11;
        default:
            alert(地支+"：地支字轉值 錯誤");
            break;
    }
}

function 地支字數轉換(地支){
	if(地支=="-" || 地支=="x" || 地支=="X" || 地支=="o" || 地支=="O" || 地支==="") return "";
    var 輸入數字=(isNaN(地支))? "字" : "數";  //輸入的是數還是字

    switch(輸入數字){
        case "字":
            switch(地支){
                case "亥": return 0;
                case "子": return 1;
                case "丑": return 2;
                case "寅": return 3;
                case "卯": return 4;
                case "辰": return 5;
                case "巳": return 6;
                case "午": return 7;
                case "未": return 8;
                case "申": return 9;
                case "酉": return 10;
                case "戌": return 11;
                default:
                    alert(地支+"：地支字轉值 錯誤");
                    return "";
            }
        break;
        
        case "數":
            switch(地支){
                case 0: return "亥";
                case 1: return "子";
                case 2: return "丑";
                case 3: return "寅";
                case 4: return "卯";
                case 5: return "辰";
                case 6: return "巳";
                case 7: return "午";
                case 8: return "未";
                case 9: return "申";
                case 10: return "酉";
                case 11: return "戌";
                default:
                    alert(地支數+"：地支數轉字 錯誤");
                    return "";
            }        

    }
}

function 地支字轉生肖(地支) {
	if(地支=="-" || 地支=="x" || 地支=="X" || 地支=="o" || 地支=="O" || 地支==="") return "";
	switch (地支) {
        case "亥": return "豬";
        case "子": return "鼠";
        case "丑": return "牛";
        case "寅": return "虎";
        case "卯": return "兔";
        case "辰": return "龍";
        case "巳": return "蛇";
        case "午": return "馬";
        case "未": return "羊";
        case "申": return "猴";
        case "酉": return "雞";
        case "戌": return "狗";
        default:
            alert(地支+"：地支字轉生肖 錯誤");
            break;
    }
}

function 地支數轉字(地支數) {
	if(地支數=="-" || 地支數=="x" || 地支數=="X" || 地支數=="o" || 地支數=="O" || 地支數==="" || 地支數==-1) return "";
    switch (地支數) {
        case 0: return "亥";
        case 1: return "子";
        case 2: return "丑";
        case 3: return "寅";
        case 4: return "卯";
        case 5: return "辰";
        case 6: return "巳";
        case 7: return "午";
        case 8: return "未";
        case 9: return "申";
        case 10: return "酉";
        case 11: return "戌";
        default:
            alert(地支數+"：地支數轉字 錯誤");
            break;
    }
}

function 地支六合冲害破(地支, 選項) {
    var 六合支, 冲支, 害支, 破支;

    switch (地支) {
        case "亥":
            六合支 = "寅";
            冲支 = "巳";
            害支 = "申";
            破支 = "";
            break;
        case "子":
            六合支 = "丑";
            冲支 = "午";
            害支 = "未";
            破支 = "";
            break;
        case "丑":
            六合支 = "子";
            冲支 = "未";
            害支 = "午";
            破支 = "";
            break;
        case "寅":
            六合支 = "亥";
            冲支 = "申";
            害支 = "巳";
            破支 = "";
            break;
        case "卯":
            六合支 = "戌";
            冲支 = "酉";
            害支 = "辰";
            破支 = "";
            break;
        case "辰":
            六合支 = "酉";
            冲支 = "戌";
            害支 = "卯";
            破支 = "";
            break;
        case "巳":
            六合支 = "申";
            冲支 = "亥";
            害支 = "寅";
            破支 = "";
            break;
        case "午":
            六合支 = "未";
            冲支 = "子";
            害支 = "丑";
            破支 = "";
            break;
        case "未":
            六合支 = "午";
            冲支 = "丑";
            害支 = "子";
            破支 = "";
            break;
        case "申":
            六合支 = "巳";
            冲支 = "寅";
            害支 = "亥";
            破支 = "";
            break;
        case "酉":
            六合支 = "辰";
            冲支 = "卯";
            害支 = "戌";
            破支 = "";
            break;
        case "戌":
            六合支 = "卯";
            冲支 = "辰";
            害支 = "酉";
            破支 = "";
            break;
    }

    switch (選項) {
        case 1: case "六合":
            return 六合支;
        case 2:
            return "";
        case 3: case "冲":
            return 冲支;
        case 4: case "害":
            return 害支;
        case 5: case "破":
            return 破支;
        default:
            //alert(選項 + "：地支六合冲害破 function 輸入的選項錯誤！！");
            return "";
            
    }
}

function 地支三合(地支1, 地支2){
    var 地支對 = 地支1+地支2;

    switch(地支對){
        //寅午戌
        case "寅午": case "午寅":
            return "火";
        case "午戌": case "戌午":
            return "火";
        //巳酉丑
        case "巳酉": case "酉巳":
            return "金";
        case "酉丑": case "丑酉":
            return "金";
        //申子辰
        case "申子": case "子申":
            return "水";
        case "子辰": case "辰子":
            return "水";
        //亥卯未
        case "亥卯": case "卯亥":
            return "木";
        case "卯未": case "未卯":
            return "木";
        default:
            //alert(地支對 + "：地支三合 function 輸入的地支對錯誤！！");
            return "";
    }
}

function 地支六合(地支對){
    //var 地支對 = 地支1+地支2;

    switch(地支對){
        case "子丑": case "丑子":
            return "合化土,子丑";  //東震用化火
        case "寅亥": case "亥寅":
            return "六合木,寅亥";
        case "卯戌": case "戌卯":
            return "六合火,卯戌";
        case "辰酉": case "酉辰":
            return "六合金,辰酉";
        case "巳申": case "申巳":
            return "六合水,巳申"; 
        case "午未": case "未午":
            return "六合火,午未";
        default:
            //alert(地支對 + "：地支六合 function 輸入的地支對錯誤！！");
            return "";
    }
}

function 地支半合(地支對, 命盤){
    //var 地支對 = 地支1+地支2;
    var 天干矩陣 = [命盤.年干.天干, 命盤.月干.天干, 命盤.日干.天干, 命盤.時干.天干];
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];

    switch(地支對){
        //參考：子平真詮 p135
        case "寅午": case "午寅":
            return "半合火,"+地支對;
        case "午戌": case "戌午":
            return "半合火,"+地支對;
        case "寅戌":case "戌寅":
            if ((_.indexOf(天干矩陣, "丙") >= 0) || (_.indexOf(天干矩陣, "丁") >= 0) || (_.indexOf(地支矩陣, "巳") >= 0)) return "半合火," + 地支對 + ",《子平真詮》：寅戌得丙、丁、巳可成半合火。"; else return "";
            break;
        //巳酉丑
        case "巳酉": case "酉巳":
            return "半合金,"+地支對;
        case "酉丑": case "丑酉":
            return "半合金,"+地支對;
        case "巳丑": case "丑巳":
            if((_.indexOf(天干矩陣, "庚") >= 0) || (_.indexOf(天干矩陣, "辛") >= 0)) return "半合金,"+地支對+",《子平真詮》：巳丑得庚、辛可成半合金。"; else return "";
            break;
        //申子辰
        case "申子": case "子申":
            return "半合水,"+地支對;
        case "子辰": case "辰子":
            return "半合水,"+地支對;
        case "申辰": case "辰申":
            if((_.indexOf(天干矩陣, "壬") >= 0) || (_.indexOf(天干矩陣, "癸") >= 0) || (_.indexOf(地支矩陣, "亥") >= 0)) return "半合水,"+地支對+",《子平真詮》：申辰得壬、癸、亥可成半合水。"; else return "";
            break;

        //亥卯未
        case "亥卯": case "卯亥":
            return "半合木,"+地支對;
        case "卯未": case "未卯":
            return "半合木,"+地支對;
        case "亥未": case "未亥":
            if((_.indexOf(天干矩陣, "甲") >= 0) || (_.indexOf(天干矩陣, "乙") >= 0)) return "半合木,"+地支對+",《子平真詮》：亥未得甲、乙可成半合木。"; else return "";
            break;
        default:
            //alert(地支對 + "：地支半合 function 輸入的地支對錯誤！！");
            return "";
    }
}

function 地支暗合(地支對) {
    //選項：合干、五行
    var 暗合干, 暗合五行;
    //var 地支對 = 地支1+地支2;

    switch (地支對) {     
        case "子巳": case "巳子":
            //通祿合
            return "暗合火,戊癸,"+地支對+"藏干"+"戊癸通祿暗合";
            //暗合干="戊癸";
            //暗合五行="火";
            break;
        case "寅丑": case "丑寅":
            //通合： 寅中的甲丙戊與丑中的己辛癸暗中相合
            return "暗合土,甲己,"+地支對+"藏干"+"甲己通暗合";
            //暗合干="甲己";
            //暗合五行="土";
            break;
        //case "寅午": case "午寅": //半合，故不再論暗合
            //通祿合，寅中的甲與午中的己暗中相合
            //return "暗合土,甲己,"+地支對+"藏干"+"甲己通祿暗合";
            //暗合干="甲己";
            //暗合五行="土";
            break;
        case "卯申": case "卯申":
            //通祿合，乙庚合，卯中的乙與申中的庚暗中相合
            return "暗合金,乙庚,"+地支對+"藏干"+"乙庚通祿暗合";
            //暗合干="乙庚";
            //暗合五行="金";
            break;
        case "巳酉": case "酉巳":
            //通祿合
            return "暗合水,丙辛,"+地支對+"藏干"+"丙辛通祿暗合";
            //暗合干="丙辛";
            //暗合五行="水";
            break;
        case "午亥": case "亥午":
            //通合： 亥中的壬甲與午中的丁己暗中相合
            return "暗合木,丁壬,"+地支對+"藏干"+"丁壬通暗合";
            //暗合干="丁壬";
            //暗合五行="木";
            break;
        /*
        case "子辰": case "辰子":
            //** 一般不論暗合
            return 地支對+"暗合火*,戊癸,"+地支對+"藏干"+"戊癸合*";
            break;
        case "子戌": case "戌子":
            //** 一般不論暗合
            return 地支對+"暗合火*,戊癸,"+地支對+"藏干"+"戊癸合*";
            break;
        case "巳辰": case "辰巳":
            //** 一般不論暗合
            return 地支對+"暗合火*,戊癸,"+地支對+"藏干"+"戊癸合*";
            break;
        case "寅未": case "未寅":
            //** 一般不論暗合
            return 地支對+"暗合土*,甲己,"+地支對+"藏干"+"甲己合*";
            break;
            */
        default:
            //alert(地支對 + "：地支暗合 function 輸入的地支對錯誤！！");
            return "";
            //暗合干="";
            //暗合五行="";
    }
}

function 地支半六暗合(地支1, 地支2, 暗合選項){
    //暗合選項="", 就不考慮暗合
    var 地支對 = 地支1+地支2;

    switch(地支對){
        // *********** 半合 ***********
        //寅午戌
        case "寅午": case "午寅":
            return "半合";
        case "午戌": case "戌午":
            return "半合";
        //巳酉丑
        case "巳酉": case "酉巳":
            return "半合";
        case "酉丑": case "丑酉":
            return "半合";
        //申子辰
        case "申子": case "子申":
            return "半合";
        case "子辰": case "辰子":
            return "半合";
        //亥卯未
        case "亥卯": case "卯亥":
            return "半合";
        case "卯未": case "未卯":
            return "半合";
        // *********** 六合 ***********
        case "子丑": case "丑子":
            return "六合";
        case "寅亥": case "亥寅":
            return "六合";
        case "卯戌": case "戌卯":
            return "六合";
        case "辰酉": case "酉辰":
            return "六合";
        case "巳申": case "申巳":
            return "六合"; 
        case "午未": case "未午":
            return "六合";
        //*********** 暗合 ***********
        case "子巳":case "巳子":
            //通祿合
            if (暗合選項 != "" || typeof (暗合選項) != "undefined") return "暗合"; else return "";
        case "寅丑": case "丑寅":
            //通合： 寅中的甲丙戊與丑中的己辛癸暗中相合
            if (暗合選項 != "" || typeof (暗合選項) != "undefined") return "暗合"; else return "";
        case "寅午": case "午寅":
            //通祿合，寅中的甲與午中的己暗中相合
            if (暗合選項 != "" || typeof (暗合選項) != "undefined") return "暗合"; else return "";
        case "卯申": case "卯申":
            //通祿合，乙庚合，卯中的乙與申中的庚暗中相合
            if (暗合選項 != "" || typeof (暗合選項) != "undefined") return "暗合"; else return "";
        case "巳酉": case "酉巳":
            //通祿合
            if (暗合選項 != "" || typeof (暗合選項) != "undefined") return "暗合"; else return "";
        case "午亥": case "亥午":
            //通合： 亥中的壬甲與午中的丁己暗中相合
            if (暗合選項 != "" || typeof (暗合選項) != "undefined") return "暗合"; else return "";
        default:
            //alert(地支對 + "：地支半六暗合 function 輸入的地支對錯誤！！");
            return "";
    }
}

function 地支相害(地支對){
    //var 地支對 = 地支1+地支2;

    switch(地支對){
        case "子未": case "未子":
            return "害,子未";
        case "丑午": case "午丑":
            return "害,丑午";
        case "寅巳": case "巳寅":
            return "害,寅巳";
        case "卯辰": case "辰卯":
            return "害,卯辰";
        case "申亥": case "亥申":
            return "害,申亥"; 
        case "酉戌": case "戌酉":
            return "害,酉戌";
        default:
            //alert(地支對 + "：地支相害 function 輸入的地支對錯誤！！");
            return "";
    }
}

function 地支相冲(地支對){
    //var 地支對 = 地支1+地支2;
    var 地支冲="";
    
    switch(地支對){
        case "子午": case "午子":
            return "冲,子午,四花冲";
            break;
        case "丑未": case "未丑":
            return "冲,丑未,四庫冲";
            break;
        case "寅申": case "申寅":
            return "冲,寅申,四馬冲";
            break;
        case "卯酉": case "酉卯":
            return "冲,卯酉,四花冲";
            break;
        case "辰戌": case "戌辰":
            return "冲,辰戌,四庫冲"; 
            break;
        case "巳亥": case "亥巳":
            return "冲,巳亥,四馬冲";
            break;
        default:
            return "";
            break;
    }
}

function 地支相刑(地支對, 回覆選項, 檢查選項){
    if (地支對.length < 2) alert(地支對+"：地支對 錯誤"); 
    if (回覆選項.length < 2) alert(回覆選項+"：回覆選項 錯誤"); 
    if (檢查選項.length < 2) alert(檢查選項+"：檢查選項 錯誤"); 
    //回覆選項："相刑", "相刑註解"
    //檢查選項："所有", "半刑", "自刑無禮"
    //var 地支對 = 地支1+地支2;
    //alert(回覆選項 + " / " + 檢查選項);
    var 地支刑="";
    var 相刑註解="";
    var 無恩之刑註解="無恩之刑主無人賞識，做事易被人嫌棄，替人打天下，任勞任怨，愛恨交加。";
    var 恃勢之刑註解="恃勢之刑，太自信，自負，欠考慮，憑感覺判斷。";
    var 自刑之註解="對自己不滿意，易憂愁，明知不可為而為之，自尊心強，自尋煩惱，容易鬱卒，有話不說，溝通困難。";
    //var 命盤標註;

    if(檢查選項=="所有"){
        switch(地支對){
            //寅巳申， 無恩之刑
            case "寅巳": case "巳寅":
                地支刑 = "無恩之刑,寅巳";
                相刑註解=無恩之刑註解;
                break;
            case "巳申": case "申巳":
                地支刑="無恩之刑,巳申";
                相刑註解=無恩之刑註解;
                break;
            case "寅申": case "申寅":
                地支刑= "無恩之刑,申寅";
                相刑註解=無恩之刑註解;
                break;
            //丑未戌，恃勢之刑
            case "丑未": case "未丑":
                地支刑= "恃勢之刑,未丑";
                相刑註解=恃勢之刑註解+"未丑，失敗機率高，看不見卻不斷流失。";
                break;
            case "未戌": case "戌未":
                地支刑= "恃勢之刑,戌未";
                相刑註解=恃勢之刑註解;
                break;
            case "丑戌": case "戌丑":
                地支刑= "恃勢之刑,丑戌";
                相刑註解=恃勢之刑註解;
                break;
            //自刑，辰午酉亥
            case "辰辰":
                地支刑= "自刑,辰辰";
                相刑註解=自刑之註解+"辰辰自刑，要別人聽自己，但事與願違而自鬱，請用逆向溝通，先贊同對方，才能得到認同，做事直接，但有遠觀。";
                break;
            case "午午":
                地支刑= "自刑,午午";
                相刑註解=自刑之註解+"午午自刑，常常事與願違，在決定一件事情前，請用逆向溝通方式，先贊同對方，成功率會較高，以禮相待，則好溝通。";
                break;
            case "酉酉":
                地支刑= "自刑,酉酉";
                相刑註解=自刑之註解+"酉酉自刑，常常想幫助別人。但卻得不到認同而鬱卒，常幫倒忙，卻熱心，多慮。";
                break;
            case "亥亥":
                地支刑= "自刑,亥亥";
                相刑註解=自刑之註解+"亥亥自刑，較會無理取鬧、歇斯底里、悲觀，總是想說我比別人認真，為什麼比別人歹命。如又逢流運來害月柱則更加嚴重，喜用頭腦，卻多愁多煩事，易想太多。";
                break;
            //無禮之刑，子卯
            case "子卯": case "卯子":
                地支刑= "無禮之刑,子卯";
                相刑註解="子卯無禮之刑，自命清高，眼角高，說話直接，較沒禮貌，不分尊卑，自以為氣質好";
                break;
            default:
                //return "";
                地支刑= "";
                break;
        }
    }

    if (檢查選項 == "半刑") {
        switch(地支對){
            //寅巳申， 無恩之刑
            case "寅巳": case "巳寅":
                地支刑 = "無恩之刑,寅巳";
                相刑註解=無恩之刑註解;
                break;
            case "巳申": case "申巳":
                地支刑="無恩之刑,巳申";
                相刑註解=無恩之刑註解;
                break;
            case "寅申": case "申寅":
                地支刑= "無恩之刑,申寅";
                相刑註解=無恩之刑註解;
                break;
            //丑未戌，恃勢之刑
            case "丑未": case "未丑":
                地支刑= "恃勢之刑,未丑";
                相刑註解=恃勢之刑註解+"未丑，失敗機率高，看不見卻不斷流失。";
                break;
            case "未戌": case "戌未":
                地支刑= "恃勢之刑,戌未";
                相刑註解=恃勢之刑註解;
                break;
            case "丑戌": case "戌丑":
                地支刑= "恃勢之刑,丑戌";
                相刑註解=恃勢之刑註解;
                break;
            default:
                //return "";
                地支刑= "";
                break;
        }
    }

    if (檢查選項 == "自刑無禮") {
        switch(地支對){
            //自刑，辰午酉亥
            case "辰辰":
                地支刑= "自刑,辰辰";
                相刑註解=自刑之註解+"辰辰自刑，要別人聽自己，但事與願違而自鬱，請用逆向溝通，先贊同對方，才能得到認同，做事直接，但有遠觀。";
                break;
            case "午午":
                地支刑= "自刑,午午";
                相刑註解=自刑之註解+"午午自刑，常常事與願違，在決定一件事情前，請用逆向溝通方式，先贊同對方，成功率會較高，以禮相待，則好溝通。";
                break;
            case "酉酉":
                地支刑= "自刑,酉酉";
                相刑註解=自刑之註解+"酉酉自刑，常常想幫助別人。但卻得不到認同而鬱卒，常幫倒忙，卻熱心，多慮。";
                break;
            case "亥亥":
                地支刑= "自刑,亥亥";
                相刑註解=自刑之註解+"亥亥自刑，較會無理取鬧、歇斯底里、悲觀，總是想說我比別人認真，為什麼比別人歹命。如又逢流運來害月柱則更加嚴重，喜用頭腦，卻多愁多煩事，易想太多。";
                break;
            //無禮之刑，子卯
            case "子卯": case "卯子":
                地支刑= "無禮之刑,子卯";
                相刑註解="子卯無禮之刑，自命清高，眼角高，說話直接，較沒禮貌，不分尊卑，自以為氣質好";
                break;
            default:
                //return "";
                地支刑= "";
                break;
        }
    }

    switch(回覆選項){
        case "相刑": case 1:
            return 地支刑;
            break;
        case "相刑註解": case 2:
            return 相刑註解;
            break;
        default:
            alert("地支對:" + 地支對 + "\n回覆選項:" + 回覆選項 + "\n 檢查選項: " + 檢查選項 + "\n地支相刑選項錯誤！");
            return "";
            break;
    }
}


function 地支屬性(地支, 選項) {
	if(地支=="-" || 地支=="x" || 地支=="X" || 地支=="o" || 地支=="O" || 地支==="") return "";
    var 地支數 = 地支字轉值(地支);
    var 地支 = [
        { "地支": "亥", "係數": 0, "陰陽": "陰", "五行": "水", "生肖": "豬", "藏干": "壬甲", "庫馬花": "馬", "四地": "長生地", "月建": "十", "月建數": 10, "四季": "冬", "節氣": "立冬/小雪", "字體顏色": "#00FFFF", "背景顏色": "#E0E0E0", "臟腑": "三焦", "月名": "楊月", "註解": "核也,萬物收藏,皆堅核也", "方向": "西北偏北", "角度": "330°", "時間": "21:00:00-22:59:59" },
        { "地支": "子", "係數": 1, "陰陽": "陽", "五行": "水", "生肖": "鼠", "藏干": "癸", "庫馬花": "花", "四地": "四正地", "月建": "十一", "月建數": 11, "四季": "冬", "節氣": "大雪/冬至", "字體顏色": "#00FFFF", "背景顏色": "#FDFDFD", "臟腑": "膽", "月名": "蕸月", "註解": "孳也,陽氣始萌,萬物茲萌於既動之陽氣下", "方向": "正北", "角度": "0°", "時間": "23:00:00-00:59:59" },
        { "地支": "丑", "係數": 2, "陰陽": "陰", "五行": "土", "生肖": "牛", "藏干": "己癸辛", "庫馬花": "庫", "四地": "四墓地", "月建": "十二", "月建數": 12, "四季": "冬", "節氣": "小寒/大寒", "字體顏色": "#CC6600", "背景顏色": "#E0E0E0", "臟腑": "肝", "月名": "臘月", "註解": "紐也,寒氣自屈曲也,陽氣在上未降", "方向": "東北偏北", "角度": "30°", "時間": "01:00:00-02:59:59" },
        { "地支": "寅", "係數": 3, "陰陽": "陽", "五行": "木", "生肖": "虎", "藏干": "甲丙戊", "庫馬花": "馬", "四地": "長生地", "月建": "一", "月建數": 1, "四季": "春", "節氣": "立春/雨水", "字體顏色": "#00FF00", "背景顏色": "#FDFDFD", "臟腑": "肺", "月名": "端月", "註解": "髕也,陽氣欲出,陽尚強而髕演於下,萬物始生寅然也", "方向": "東北偏東", "角度": "60°", "時間": "03:00:00-04:59:59" },
        { "地支": "卯", "係數": 4, "陰陽": "陰", "五行": "木", "生肖": "兔", "藏干": "乙", "庫馬花": "花", "四地": "四正地", "月建": "二", "月建數": 2, "四季": "春", "節氣": "驚蟄/春分", "字體顏色": "#00FF00", "背景顏色": "#E0E0E0", "臟腑": "大腸", "月名": "花月", "註解": "冒也,萬物冒地而出", "方向": "正東", "角度": "90°", "時間": "05:00:00-06:59:59" },
        { "地支": "辰", "係數": 5, "陰陽": "陽", "五行": "土", "生肖": "龍", "藏干": "戊乙癸", "庫馬花": "庫", "四地": "四墓地", "月建": "三", "月建數": 3, "四季": "春", "節氣": "清明/谷雨", "字體顏色": "#CC6600", "背景顏色": "#FDFDFD", "臟腑": "胃", "月名": "桐月", "註解": "伸也,萬物舒伸而出,物經震動而長", "方向": "東南偏東", "角度": "120°", "時間": "07:00:00-08:59:59" },
        { "地支": "巳", "係數": 6, "陰陽": "陰", "五行": "火", "生肖": "蛇", "藏干": "丙戊庚", "庫馬花": "馬", "四地": "長生地", "月建": "四", "月建數": 4, "四季": "夏", "節氣": "力夏/小滿", "字體顏色": "#FF0000", "背景顏色": "#E0E0E0", "臟腑": "脾", "月名": "梅月", "註解": "巳也,陽氣畢布已矣", "方向": "東南偏南", "角度": "150°", "時間": "09:00:00-10:59:59" },
        { "地支": "午", "係數": 7, "陰陽": "陽", "五行": "火", "生肖": "馬", "藏干": "丁己", "庫馬花": "花", "四地": "四正地", "月建": "五", "月建數": 5, "四季": "夏", "節氣": "芒種/夏至", "字體顏色": "#FF0000", "背景顏色": "#FDFDFD", "臟腑": "心包", "月名": "蒲月", "註解": "仵也,陰陽交相愕而仵,萬物盛大枝柯密布", "方向": "正南", "角度": "180°", "時間": "11:00:00-12:59:59" },
        { "地支": "未", "係數": 8, "陰陽": "陰", "五行": "土", "生肖": "羊", "藏干": "己丁乙", "庫馬花": "庫", "四地": "四墓地", "月建": "六", "月建數": 6, "四季": "夏", "節氣": "小暑/大暑", "字體顏色": "#CC6600", "背景顏色": "#E0E0E0", "臟腑": "小腸", "月名": "荔月", "註解": "眛也,日中則昃,陽向幽也,萬物皆成有滋味也", "方向": "西南偏南", "角度": "210°", "時間": "13:00:00-14:59:59" },
        { "地支": "申", "係數": 9, "陰陽": "陽", "五行": "金", "生肖": "猴", "藏干": "庚壬戊", "庫馬花": "馬", "四地": "長生地", "月建": "七", "月建數": 7, "四季": "秋", "節氣": "立秋/處暑", "字體顏色": "#FF9900", "背景顏色": "#FDFDFD", "臟腑": "膀胱", "月名": "瓜月", "註解": "伸束以成,萬物之體皆成也", "方向": "西南偏西", "角度": "240°", "時間": "15:00:00-16:59:59" },
        { "地支": "酉", "係數": 10, "陰陽": "陰", "五行": "金", "生肖": "雞", "藏干": "辛", "庫馬花": "花", "四地": "四正地", "月建": "八", "月建數": 8, "四季": "秋", "節氣": "白露/秋分", "字體顏色": "#FF9900", "背景顏色": "#E0E0E0", "臟腑": "腎", "月名": "桂月", "註解": "就也,萬物成熟", "方向": "正西", "角度": "270°", "時間": "17:00:00-18:59:59" },
        { "地支": "戌", "係數": 11, "陰陽": "陽", "五行": "土", "生肖": "狗", "藏干": "戊辛丁", "庫馬花": "庫", "四地": "四墓地", "月建": "九", "月建數": 9, "四季": "秋", "節氣": "寒露/霜降", "字體顏色": "#CC6600", "背景顏色": "#FDFDFD", "臟腑": "心包", "月名": "菊月", "註解": "滅也,萬物滅盡", "方向": "西北偏西", "角度": "300°", "時間": "19:00:00-20:59:59" }
    ];

    switch (選項) {
        case 1: case "地支":
            return 地支[地支數].地支;
        case 2: case "係數":
            return 地支[地支數].係數;
        case 3: case "陰陽":
            return 地支[地支數].陰陽;
        case 4: case "生肖":
            return 地支[地支數].生肖;
        case 5: case "五行":
            return 地支[地支數].五行;
        case 6: case "藏干":
            return 地支[地支數].藏干;
        case 7: case "庫馬花":
            return 地支[地支數].庫馬花;
        case 8: case "四地":
            return 地支[地支數].四地;
        case 9: case "月建":
            return 地支[地支數].月建;
        case 10: case "月建數":
            return 地支[地支數].月建數;
        case 11: case "四季":
            return 地支[地支數].四季;
        case 12: case "節氣":
            return 地支[地支數].節氣;
        case 13: case "月名":
            return 地支[地支數].月名;
        case 14: case "方向":
            return 地支[地支數].方向;
        case 15: case "角度":
            return 地支[地支數].角度;
        case 16: case "時間":
            return 地支[地支數].時間;
        case 17: case "方向":
            return 地支[地支數].方向;
        case 19: case "背景顏色":
            return 地支[地支數].背景顏色;
        case 20: case "註解":
            return 地支[地支數].註解;
        case 21: case "臟腑":
            return 地支[地支數].臟腑;
        default:
            alert(地支 + ", " + 選項 + "：地支屬性輸入錯誤 ！！");

    }
}

function 地支特性(地支, 選項) {
    var 地支數 = 地支字轉值(地支);
    var 地支矩陣 = [
        { "地支": "亥", "係數": 0, "五行": "水", "藏干": "壬甲", "藏干比例": "0.7:0.3", "庫馬花": "馬", "星座": "雙魚", "提綱分論": "「登明之位水源深，雨雪生寒值六陰；須待勝光方用土，不逢傳送浪多金。五湖歸聚原成象，三合羈留正有心；欲識坤乾和暖處，即從艮震巽離尋。」<br>十月亥水，為雨雪生寒之時，土至此而不暖，金至此而生寒，其象若五湖之歸聚，其用在三合之有心。欲識其坤乾和暖之方，應從艮震離巽之配合端詳之也。", "命宮含義": "命宮在亥宮的人，一般都是屬於情感濃厚，神經敏銳，待人接物很熱情，看似一個好人，但要考慮本身能力，當能力不足時，不要輕舉妄動，但有時又會逾越理智，平時無視個人財產，願與親友共享。", "一掌經星曜": "天壽星", "一掌經含義": "《天壽星》克己助人★一生衣祿，末限充足有餘。不動先懶，做事先難后易。神經敏銳，行為熱情，重義輕財，多費力勞心。性如大海之心，心性和諧，能夠克己助人，為人有情義，熱忱有禮。大體來說，這是一個比較操勞型的人。", "個性": "生於亥月，溫順，腳踏實地，平凡，長壽，安定，明理，好辯，偏見，固執，不講理，不易溝通，重享受，善利用別人。", "臟腑": "三焦", "臟腑2": "三焦、易扭到", "身弱疾病": "身弱亥月生人，所得之疾患，往往會演變成連鎖性之疾病，諸如由尿道、腎臟及排泄機能而影響到偏頭痛、頭昏腦脹等病症，平時宜多注意保養。"},
        { "地支": "子", "係數": 1, "五行": "水", "藏干": "癸", "藏干比例": "1", "庫馬花": "花", "星座": "水瓶", "提綱分論": "十二支體象詩云：「月支子水占魁名，溪澗汪洋不盡情，天道陽回行土旺，人間水湲寄金生，若逢午破應無定，縱卯相刑還有情，柱內申辰來合局，即成江海發濤聲。」<br>十一月子水，其性陰寒。子藏癸水得祿，書云：「五陰皆陰癸為至。」故子月為陰寒之至也。然陰至而陽生，萬物由此而漸露生機，水盛宜土，氣寒喜火，此乃調候之意也。", "命宮含義": "命宮在子宮的人，一般都是屬於意志堅強，而不論對人對事，不記恨，寬宏大量。處事態度愉快，文雅動人，不會消極厭世且有念舊之情，屬於夫唱婦隨，恩愛恆久型，聰明篤實，有過人之處，有時會標新立異，主觀過強，發言不當，對於事務判斷有獨特看法。", "一掌經星曜": "天貴星", "一掌經含義": "《天貴星》志向高遠★初限辛苦，中年有四方財，老運平吉有福。為人文雅，志氣非凡，心性達觀，高尚文雅，主觀較強，立性堅定，進取努力。與人多有長遠之情感，為人多情，朋友相交情深有持久之厚愛，可以不存積怨，坦誠，有度量。身防暗疾。", "個性": "生於子月，不落人後，先做再說，喜歡鑽漏洞，三分鐘熱度，極端、脾氣不好、拘謹、自私、保護自己、生存能力好，思想靈活，很會變卦。", "臟腑": "膽", "臟腑2": "膽、泌尿系统", "身弱疾病": "身弱子月生人，易罹患生殖系統之疾病，故對此方面要節制，又易患膀胱及尿道疾病或聽覺之故障。"},
        { "地支": "丑", "係數": 2, "五行": "土", "藏干": "己癸辛", "藏干比例": "0.5:0.3:0.2", "庫馬花": "庫", "星座": "摩羯", "提綱分論": "「隆冬建丑怯冰霜、誰識天時轉二陽，暖土誠能生萬物，寒金難道祇深藏，刑沖戍未非無用，類聚雞蛇信有方，若在日時多水木，直須行入巽離鄉。」<br>十二月丑土，為水之余氣，金之墓庫，蓋以土、金、水循序相生之意，寒威猶在之時也。丑戌未三刑，宜細論其全局之配合而分喜忌。苟巳酉丑三合，則以金局論。柱多水木，大喜東南。", "命宮含義": "命宮在丑宮的人，一般都是屬於舉止靜且幽默，頗有冷面笑匠之天份，志向蓬勃遠大，喜歡立功，也會不計本身利益。有時會以教訓之態度待人，也許可博得信任，但可能會因鋒芒過露，氣燄過張，容易遭受怨言及構陷，而阻礙事業之進展。", "一掌經星曜": "天厄星", "一掌經含義": "《天厄星》先難后易★此乃勞碌之命，做事大都先難後易。離祖成功，早年辛苦，晚年吉祥。小人常犯，志趣遠大，性喜立功，為人舉止文雅、靜默。一生要防處事待人因為鋒芒太露，乃致中挫之憾。", "個性": "生於丑月，穩重，以退為進，不走歪路不轉彎，負責任，腳踏實地，任勞任怨，固執、堅持、節儉、勤勞，追根究底，翻舊賬，不服輸，做事有頭有尾 。", "臟腑": "肝", "臟腑2": "肝、易扭到", "身弱疾病": "身弱丑月生人，易患胸部之疾病，且要注意肋膜，又易有胃脾虛弱之現象，而且腳部亦易生支障。"},
        { "地支": "寅", "係數": 3, "五行": "木", "藏干": "甲丙戊", "藏干比例": "0.7:0.2:0.1", "庫馬花": "馬", "星座": "射手", "提綱分論": "「艮宮之木建於春，氣象三陽火在寅；志合蛇猴三貴客，類同卯未一家人。超凡入聖惟逢午，破祿傷提獨慮申；四柱火多嫌火地，從來燥木不南奔。」<br>正月寅木，亦丙火長生之地也。三陽開泰，大地回春，寅巳申亦合亦刑，視其利害而決斷，合午戌而火而清純，忌申之沖，為鬥爭之象。苟逢火的木盛，大忌南。", "命宮含義": "命宮在寅宮的人，一般都是屬於性情活潑，舉止談吐會令人有深刻之印象，尤其在童年時，已可見稟性剛毅的個性，目光敏銳，富衝刺力，但喜抄捷徑以達目的。無論任何事如不能與人共享其成果，有可能變孤單，要謙虛待人，才不失為仁者之風度。一生交友甚廣，人緣不錯。", "一掌經星曜": "天權星", "一掌經含義": "《天權星》大器晚成★中年有權柄，是可造大器之人才。利官近貴，能招四方財。胸有志向，生性聰敏，有才能，重性剛毅，富衝動力，富行動力，做事仔細小心，人緣多佳，為人機靈，精神活潑，談吐順暢。", "個性": "生於寅月，有氣魄，武斷，不喜龜毛拖拉，具攻擊性但會壓抑，喜歡當老大，脾氣不佳，閒不住。", "臟腑": "肺", "臟腑2": "肺、大腿酸痛", "身弱疾病": "身弱寅月生人，易傷膽臟或關節、筋脈及神經系統之慢性化疾病。"},
        { "地支": "卯", "係數": 4, "五行": "木", "藏干": "乙", "藏干比例": "1", "庫馬花": "花", "星座": "天蠍", "提綱分論": "「卯木獨華氣稟深，仲春難道不嫌金；庚金多見愁申酉，亥子重來忌癸壬。禍見六沖應落葉，喜逢三合便成林；若歸時日秋金重，更向西行患不禁。」<br>二月卯木，為乙木之祿，陰柔之象也。春卉時令猶寒，喜火而忌金水。卯酉逢沖，其勢危殆，喜亥卯未之三合，党眾勢盛。金重更令西方運，弱不禁風矣。", "命宮含義": "命宮在卯宮的人，一般都是少年時體質較弱，青年期身體較強健，容易血氣方剛，神經敏銳，有時會因小事而動怒，易釀成爭端的行為。成年後，性格變為嚴謹。能克己自律，同時觀察力強，善惡分明，易吸引他人欣賞。", "一掌經星曜": "天破星", "一掌經含義": "《天破星》多情破耗★少年體弱，青年后較好，中限發高能榮。六親手足少助，獨立開花，是一個克勤克儉、自立更生之人。為人神經敏銳，易怒、易喜，觀察力敏銳，為人多情。心性慷慨，疏財大方；一生要防錢財有若蟲蛀洩漏。", "個性": "生於卯月，喜好和平，隨和，不會得罪人，淡泊名利，草根，宅男，無爭，有愛心，完美主義，善良，龜毛，愛乾淨，拘謹。", "臟腑": "大腸", "臟腑2": "大腸、胸悶", "身弱疾病": "身弱卯月生人，易患肝臟、顏面神經痛之筋脈性疾患及不眠症。或手指、腳指、膝蓋之關節性疾病。"},
        { "地支": "辰", "係數": 5, "五行": "土", "藏干": "戊乙癸", "藏干比例": "0.5:0.3:0.2", "庫馬花": "庫", "星座": "天秤", "提綱分論": "「辰當三月水泥濕，長養堪培萬物根；雖是甲衰乙餘氣，縱然壬墓癸還魂。直須一鎖能開庫，若遇戌沖即開門。水土重臨西北運，只愁厚土不能存。」<br>三月辰土，為壬水之庫，亦木之餘氣也。辰為濕潤之土，能滋生萬物。辰戌沖而開庫，苟戌多則辰自有沖損之虞焉。金水多則土虛，火土多則土健，胥視其配合而論焉。", "命宮含義": "命宮在辰宮的人，一般都是屬於性格溫和，儀表文雅，彬彬有禮的型，一生樂於為人排解爭端，凡事思慮周到，為從容中道之人，但往往熱忱過度，無暇自顧親人的感受，建議有時需量力而為。", "一掌經星曜": "天奸星", "一掌經含義": "《天奸星》事多反覆★技藝成功，有專技。做事常見反覆、緩慢，缺乏果斷力，一生多見勞碌；為人有禮，人緣多佳，性情溫和，舉止文雅，思緒周到；為人有機謀，多能、多巧。畢生注意脾、胃、腎之疾。", "個性": "生於辰月，極端，喜出風頭，渴望領導，喜當老大，腦筋靈活，較會設計，點子多，愛聽好話，不服輸，神秘，愛幻想，鐵齒，做事有頭無尾，大起大落 。", "臟腑": "胃", "臟腑2": "胃、手腳易受傷", "身弱疾病": "身弱辰月生人，食量大，易患消化系統或高血壓之疾病。另外脊髓、腎及皮膚等也不可忽視。"},
        { "地支": "巳", "係數": 6, "五行": "火", "藏干": "丙戊庚", "藏干比例": "0.7:0.2:0.1", "庫馬花": "馬", "星座": "處女", "提綱分論": "「巳當初夏火增光，造化流行正六陽；失令庚金生賴母，得時戊土祿隨娘。三刑傳送翻無害，一遇登明便有傷；行到東南生發地，煬天炎焰不尋常。」<br>四月巳火，為丙火之祿元，庚金之長生，蓋中藏丙火，戊土，庚金循序相生也。時值火炎土燥，最忌甲木再生，則烈炎沖天矣；最喜金水之潤澤，忌見東南。", "命宮含義": "命宮在巳宮的人，一般都是屬於態度蠻沉靜，思慮細膩之人，有時喜吹毛求疵，以致輕重失當。做事業的手段精明，處事有條不紊，經商往往能積小成大，是一個前途無量之格。", "一掌經星曜": "天文星", "一掌經含義": "《天文星》文采振發★初限平凡，中限平步青雲，晚年榮富，自立家風。此命心性不定，好交朋友，口才多佳。人命逢此，必有文采。女命可嫁好夫。", "個性": "生於巳月，善於周旋人群中，善利用人家，悶燒型，愛說話，喜聊天，好辯，雙重性格，城府深，外冷內熱，冷靜，守本分但保護自己，對他不可得寸進尺。", "臟腑": "脾", "臟腑2": "脾、五十肩、酸痛", "身弱疾病": "身弱巳月生人，此月生人咽喉較弱，也常有牙痛之患。"},
        { "地支": "午", "係數": 7, "五行": "火", "藏干": "丁己", "藏干比例": "0.7:0.3", "庫馬花": "花", "星座": "獅子", "提綱分論": "「五月炎炎火正升，六陽氣逐一陰生；庚金失位生無用，己土歸垣祿有成。甲子齊來能戰伐，戌寅同見越光明。東南正是身強地，西北休囚己喪刑。」<br>五月午火，丁己臨官之位，雖謂炎熱之極，然亦陽極而陰生之時也。庚金逢敗，力不從心。寅午戌會局，火勢炎燥，忌子水之沖，反惹沖激之患，金木至此，均屬休囚。", "命宮含義": "命宮在午宮的人，一般都是屬於天生具有高貴性格，充滿野心和熱誠之特質。意志堅強，不顧險阻，衝動熱情，理想高，傲氣盛。為了目的會企圖用投機的方法來達成出人頭地的目的，不願屈就。待人雖和藹可親，無非是想以籠絡之手段來取悅他人，以達到利己之發展。如能戒除驕傲的本質自能成功。", "一掌經星曜": "天福星", "一掌經含義": "《天福星》風流之命★此乃榮貴之命，一生有財運，可謂百福齊聚，命多貴人接引。權勢威風，性情自我，心性伶俐，多見男女情愛。傲氣較盛，能屈能伸之人。只是生性稍有自私，多利己。", "個性": "生於午月，倔強的脾氣，具爆發力，意志強，急躁，猛烈，不喜被壓抑，好勝心強，愛聽好話，脾氣很扭，奔波，勞碌，有衝勁，熱情，易被設計。", "臟腑": "心包", "臟腑2": "心、偏頭痛、頭痛", "身弱疾病": "身弱午月生人，心臟普遍不佳，宜避免過度刺激，同時要多注意味覺與視覺之保養。"},
        { "地支": "未", "係數": 8, "五行": "土", "藏干": "己丁乙", "藏干比例": "0.5:0.3:0.2", "庫馬花": "庫", "星座": "巨蟹", "提綱分論": "「未月陰深火漸衰，藏官藏印又藏財；近無卯亥形難變，遠帶刑沖庫亦開。無火怕行金水去，多寒偏愛丙丁來；用神喜忌當分曉，莫把圭璋作石猜。」<br>六月未土，火之余氣甚盛，且為木之墓庫，木火相生而土更旺焉。逢亥卯則化木，見丑戌則刑開。柱無火土則忌寒濕，苟金水氣盛，反喜溫暖之方。", "命宮含義": "命宮在未宮的人，一般都是屬於辦事嚴謹，工作謹慎，且有很好之領悟力和觀察力，在您的一舉一動中，看外表有點畏怯，但性格則是敏感而易怒，外貌柔順，內心則極堅強，不肯輕易接納他人意見。有時喜沉思，想像力豐富，有時易沉迷於聲色之地。", "一掌經星曜": "天驛星", "一掌經含義": "《天驛星》離祖成功★一生多見勞苦，離祖平安之命。身有藝業，初限有財，中限吉祥，末限能高。為人謙讓，敏感，容易發怒；外柔內剛，機謀太重，做事謹慎，有時候很難接受他人意見，記憶力佳。", "個性": "生於未月，包容性強，個性溫馴，柔順平和，合群，孝順，追根究底（打破沙鍋問到底），喜歡鑽牛角尖，膽小。", "臟腑": "小腸", "臟腑2": "小腸、五十肩、酸痛", "身弱疾病": "身弱未月生人，此常有健忘症或疲倦感，胃脾亦不太健康，平時宜注意保養。同時常 有嘴唇歪斜之現象，不可忽視。"},
        { "地支": "申", "係數": 9, "五行": "金", "藏干": "庚壬戊", "藏干比例": "0.7:0.2:0.1", "庫馬花": "馬", "星座": "雙子", "提綱分論": "「申金剛健月支逢，水土長生在此宮；巳午爐中成劍戟，子辰局中得風光。木多無火終能勝，土重埋金卻有凶。欲識斯神何所以，溫柔珠玉不相同。」<br>七月申金，中藏得祿之金，長生之壬，更得戊土寄生，土金水循序生，清輝而健朗，陰氣盛而能制木，土逢生，忌其再厚而埋金，苟金水順生，則金白水清而全美焉。", "命宮含義": "命宮在申宮的人，一般都是屬於具有雙重性格之人，有時自信樂觀，有時多疑且考慮過多，自我矛盾。為人反應極為機警，能提出新穎建議。剛開始從事行業時，不宜存有太大的得失利害之心，以免半途而廢，那成功就離您愈來愈遠了。", "一掌經星曜": "天孤星", "一掌經含義": "《天孤星》修行造福★此命先天六親緣疏，兄弟朋友少見助益，初限平平，中年能見吉順亨通之命。不宜早婚。口才好，多具語言表達能力，思想敏銳。心性比較孤獨，大都具有雙重個性，有時達觀，有時悲愁。女命，婚緣早見恐怕妨夫。", "個性": "生於申月，頭腦敏捷，點子多，能創造，坐不住，聰明，善模仿，學習與領悟力強。", "臟腑": "膀胱", "臟腑2": "膀胱、手腳易受傷", "身弱疾病": "身弱申月生人，常有肺臟、呼吸系統等之常期罹患疾病，容易成爲隱疾。另外大腸也 宜多注意保養。"},
        { "地支": "酉", "係數": 10, "五行": "金", "藏干": "辛", "藏干比例": "1", "庫馬花": "花", "星座": "金牛", "提綱分論": "「八月從魁巳得名，羨他金白水流清；火多東去愁寅卯，木旺南行怕丙丁。柱見水泥應有用，運臨西北豈無情；假饒三合能堅銳，不比頑金未煉成。」<br>八月酉金，為辛金臨官，庚金帝旺之位。木火多則忌重見東南，庶能保珠玉之質，然苟局全巳酉丑，則喜火煉秋金，水來泄秀，冰雪聰明，尤稱超特之士。", "命宮含義": "命宮在酉宮的人，一般都是屬於個性沉默且思考細膩，思慮深遠，心地善良，忠實可靠之人，但有時暴躁且固執己見，如不改進就會不好。一般有過人之處，有時又會標新立異，主觀過強，發言不當之情況發生，對於事務判斷，也有獨特看法。", "一掌經星曜": "天刃星", "一掌經含義": "《天刃星》自立自成★離祖成功之命也。眼目有神，多情破敗，性情剛毅、難屈，固執己見，主觀強。愛好大自然，沉靜，達觀。惜者！命理小人常見，時有是非、紛爭，此事要防。", "個性": "生於酉月，剛強好爭鬥，腦筋很好，容易看不起別人，自信，不聽意見，樹大招風，挑吃，雞婆，急躁，熱心，有人緣，第六感強，口疏。", "臟腑": "腎", "臟腑2": "腎、胸悶", "身弱疾病": "身弱酉月生人，常有突發之疾病，諸如腦溢血、吐血、下血、中風等突發性疾病，不可掉以輕心，胃腸注意保養。"},
        { "地支": "戌", "係數": 11, "五行": "土", "藏干": "戊辛丁", "藏干比例": "0.5:0.3:0.2", "庫馬花": "庫", "星座": "牡羊", "提綱分論": "「九月河魁性最剛，漫云此物易收藏；洪爐巨火能成就，鈍鐵頑金賴主張。海窟沖龍生雨露，山頭合虎動文章；天羅雖是迷魂陣，火命逢之獨有傷。」<br>九月戌土，為金之餘氣，火之墓庫。金旺賴其煆煉，水旺賴其止流，故沖辰開庫而吉凶顯明焉。寅午戌全則以火論，丙臨戌宮入墓，須得潤澤，方得吉祥。", "命宮含義": "命宮在戌宮的人，一般都是屬於舉止行動靈敏，工作充滿熱誠，事情計劃就緒即會全力以赴，不囉唆，顧慮不周，缺乏忍耐性，有時會壞事。故須善自控制自己，不要太躁進，一切才能納入正軌而行以至成功。", "一掌經星曜": "天藝星", "一掌經含義": "《天藝星》藝道揚名★一生六親難靠，不如朋友有情；但，防招人是非。性好立功，權威近貴，多智多能，幹練果斷，做事勤奮，具工作熱忱，舉止靈敏熱忱，稍乏耐性。姻緣刑剋，晚婚大吉。注意！宜培養冷靜之處事態度。", "個性": "生於戌月，個性強，固執，多才多藝，恃才傲物，詭計多端，外柔內剛，有交際手腕，喜歡當老大，忠心，講義氣，重感情，固執。", "臟腑": "心包", "臟腑2": "心包、大腿酸痛", "身弱疾病": "身弱戌月生人，常與下半身有關，對於女性而言是白帶、陰部、子宮、腎臟等。而男性則是腎衰弱、性無能、性感染、痔瘡等。另外腳部之腳跟、腳指等易生支障。"}
    ];

    switch (選項) {
        case 1: case "地支":
            return 地支矩陣[地支數].地支;
        case 2: case "係數":
            return 地支矩陣[地支數].係數;
        case 3: case "五行":
            return 地支矩陣[地支數].五行;
        case 4: case "藏干":
            return 地支矩陣[地支數].藏干;
        case 5: case "藏干比率":
            return 地支矩陣[地支數].藏干比例;
        case 6: case "星座":
            return 地支矩陣[地支數].星座;
        case 7: case "提綱分論":
            return "提綱十二支分論："+地支矩陣[地支數].提綱分論;
        case 8: case "命宮含義":
            return 地支矩陣[地支數].命宮含義;
        case 9: case "一掌經星曜":
            return 地支矩陣[地支數].一掌經星曜;
        case 10: case "一掌經含義":
            return "命宮在"+地支+"為"+地支矩陣[地支數].一掌經星曜+"。"+地支矩陣[地支數].一掌經含義;
        case 11: case "個性":
            return 地支矩陣[地支數].個性;
        case 12: case "臟腑":
            return 地支矩陣[地支數].臟腑;
        case 13: case "臟腑2":
            return 地支矩陣[地支數].臟腑2;
        case 14: case "身弱疾病":
            return 地支矩陣[地支數].身弱疾病;
        default:
            alert(選項 + "：地支選項錯誤 ！！");
    }
}

function 藏干力量比率(地支, 藏干數){
    //藏干數：1，2，3 藏干1，2，3
    var 藏干比率=地支特性(地支, "藏干比率");
    var 藏干比率矩陣= 藏干比率.split(":");

    if(藏干數>0 &&　藏干數<4 && 藏干數<=藏干比率矩陣.length) {
        return parseFloat(藏干比率矩陣[藏干數-1]);
    } else return 0;
}

function 人元司令分野(節, 天數){
    switch(節){
        case "立春": //寅
            switch (true) {
                case ((天數 >= 1) && (天數 < 8)):
                    return "戊";
                case ((天數 >= 8) && (天數 < 15)):
                    return "丙";
                case ((天數 >= 15) && (天數 <= 30)):
                    return "甲";
                case (天數 > 30): //adjustment
                    return "甲";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "驚蟄": //卯
            switch (true) {
                case ((天數 >= 1) && (天數 < 11)):
                    return "甲";
                case ((天數 >= 11) && (天數 <= 30)):
                    return "乙";
                case (天數 > 30): // adjustment
                    return "乙";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "清明": //辰
            switch (true) {
                case ((天數 >= 1) && (天數 < 10)):
                    return "乙";
                case ((天數 >= 10) && (天數 < 13)):
                    return "癸";
                case ((天數 >= 13) && (天數 <= 30)):
                    return "戊";
                case (天數 > 30): // adjustment
                    return "戊";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "立夏": //巳
            switch (true) {
                case ((天數 >= 1) && (天數 < 6)):
                    return "戊";
                case ((天數 >= 6) && (天數 < 15)):
                    return "庚";
                case ((天數 >= 15) && (天數 <= 30)):
                    return "丙";
                case (天數 > 30): // adjustment
                    return "丙";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "芒種": //午
            switch (true) {
                case ((天數 >= 1) && (天數 < 11)):
                    return "丙";
                case ((天數 >= 11) && (天數 < 20)):
                    return "己";
                case ((天數 >= 20) && (天數 <= 30)):
                    return "丁";
                case (天數 > 30): // adjustment
                    return "丁";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "小暑": //未
            switch (true) {
                case ((天數 >= 1) && (天數 < 10)):
                    return "丁";
                case ((天數 >= 10) && (天數 < 13)):
                    return "乙";
                case ((天數 >= 13) && (天數 <= 30)):
                    return "己";
                case (天數 > 30): // adjustment
                    return "己";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "立秋": //申
            switch (true) {
                case ((天數 >= 1) && (天數 < 8)):
                    return "己";
                case ((天數 >= 8) && (天數 < 11)):
                    return "戊";
                case ((天數 >= 11) && (天數 < 14)):
                    return "壬";
                case ((天數 >= 14) && (天數 <= 30)):
                    return "庚";
                case (天數 > 30): // adjustment
                    return "庚";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "白露": //酉
            switch (true) {
                case ((天數 >= 1) && (天數 < 11)):
                    return "庚";
                case ((天數 >= 11) && (天數 <= 30)):
                    return "辛";
                case (天數 > 30): // adjustment
                    return "辛";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "寒露": //戌
            switch (true) {
                case ((天數 >= 1) && (天數 < 10)):
                    return "辛";
                case ((天數 >= 10) && (天數 < 13)):
                    return "丁";
                case ((天數 >= 13) && (天數 <= 30)):
                    return "戊";
                case (天數 > 30): // adjustment
                    return "戊";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "立冬": //亥
            switch (true) {
                case ((天數 >= 1) && (天數 < 8)):
                    return "戊";
                case ((天數 >= 8) && (天數 < 13)):
                    return "甲";
                case ((天數 >= 13) && (天數 <= 30)):
                    return "壬";
                case (天數 > 30): // adjustment
                    return "壬";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "大雪": //子
            switch (true) {
                case ((天數 >= 1) && (天數 < 11)):
                    return "壬";
                case ((天數 >= 11) && (天數 <= 30)):
                    return "癸";
                case (天數 > 30): // adjustment
                    return "癸";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        case "小寒": //丑
            switch (true) {
                case ((天數 >= 1) && (天數 < 10)):
                    return "癸";
                case ((天數 >= 10) && (天數 < 13)):
                    return "辛";
                case ((天數 >= 13) && (天數 <= 30)):
                    return "己";
                case (天數 > 30): // adjustment
                    return "己";
                default:
                    alert(節 + "，" + 天數 + "超出該節氣的天數");
            }
            break;
        default:
            alert(節 + "節，" + 天數 + "天，人元司令沒有相關的資料，輸入節日可能有錯誤");
            return "";
            break;
    }    
}


//     *********************************************************************************
//                                         天干模塊
//     *********************************************************************************

function 天干數轉字(天干數) {
    switch (天干數) {
        case 0: return "癸";
        case 1: return "甲";
        case 2: return "乙";
        case 3: return "丙";
        case 4: return "丁";
        case 5: return "戊";
        case 6: return "己";
        case 7: return "庚";
        case 8: return "辛";
        case 9: return "壬";
        default:
            alert(天干數+"：天干數轉字 錯誤");
            break;
    }
}

function 天干字轉值(天干) {
    switch (天干) {
        case "癸": return 0;
        case "甲": return 1;
        case "乙": return 2;
        case "丙": return 3;
        case "丁": return 4;
        case "戊": return 5;
        case "己": return 6;
        case "庚": return 7;
        case "辛": return 8;
        case "壬": return 9;
        default:
            alert(天干+"：天干字轉值 錯誤");
    }
}

function 天干字數轉換(天干){
    var 輸入數字=(isNaN(天干))? "字" : "數";  //輸入的是數還是字

    switch(輸入數字){
        case "字":
            switch(天干){
                case "癸": return 0;
                case "甲": return 1;
                case "乙": return 2;
                case "丙": return 3;
                case "丁": return 4;
                case "戊": return 5;
                case "己": return 6;
                case "庚": return 7;
                case "辛": return 8;
                case "壬": return 9;
                default:
                    alert(天干+"：天干字轉值 錯誤");
                    return "";
            }
        break;
        
        case "數":
            switch(天干){
                case 0: return "癸";
                case 1: return "甲";
                case 2: return "乙";
                case 3: return "丙";
                case 4: return "丁";
                case 5: return "戊";
                case 6: return "己";
                case 7: return "庚";
                case 8: return "辛";
                case 9: return "壬";
                default:
                    alert(天干數+"：天干數轉字 錯誤");
                    return "";
            }        

    }
}


function 天干生剋合(天干, 選項) {
    var 合干, 生干, 我剋, 剋我;

    switch (天干) {
        case "癸":
            合干 = "戊";
            生干 = "甲";
            我剋 = "丁";
			剋我 = "己";
            break;
        case "甲":
            合干 = "己";
            生干 = "丁";
            我剋 = "戊";
			剋我 = "庚";
            break;
        case "乙":
            合干 = "庚";
            生干 = "丙";
            我剋 = "己";
			剋我 = "辛";
            break;
        case "丙":
            合干 = "辛";
            生干 = "己";
            我剋 = "庚";
			剋我 = "壬";
            break;
        case "丁":
            合干 = "壬";
            生干 = "戊";
            我剋 = "辛";
			剋我 = "癸";
            break;
        case "戊":
            合干 = "癸";
            生干 = "辛";
            我剋 = "壬";
			剋我 = "甲";
            break;
        case "己":
            合干 = "甲";
            生干 = "庚";
            我剋 = "癸";
			剋我 = "乙";
            break;
        case "庚":
            合干 = "乙";
            生干 = "癸";
            我剋 = "甲";
			剋我 = "丙";
            break;
        case "辛":
            合干 = "丙";
            生干 = "壬";
            我剋 = "乙";
			剋我 = "丁";
            break;
        case "壬":
            合干 = "丁";
            生干 = "乙";
            我剋 = "丙";
			剋我 = "戊";
            break;
        default:
            alert(天干+"：天干生剋合function的天干輸入錯誤 ！");
    }

    switch (選項) {
        case 1: case "合":
            return 合干;
        case 2: case "生":
            return 生干;
        case 3: case "我剋":
            return 我剋;
        case 4: case "剋我":
            return 剋我;
        default:
            alert(天干+"：天干生剋合function的選項輸入錯誤 ！");
    }
}

function 天干生合剋(天干1, 天干2, 選項) {
    var 天干對 = 天干1+天干2;
    var 天干合 = "";
    var 天干生 = "";
    var 天干剋 = "";

    天干合 = 天干五合(天干1, 天干2);
}

// ****************************** 干支冲合刑剋 ******************************
function 干支天剋地冲2(干支, 選項){
    //選項：剋我、我剋
	var 天干=干支.substr(0,1);
	var 地支=干支.substr(1,1);
	var 剋我我剋;

    switch(選項){
        case 0:case "剋我":
            剋我我剋 = "剋我";
            break;
        case 1:case "我剋":
            剋我我剋 = "我剋";
            break;
        default:
            剋我我剋 = "剋我";
            break;
    }
	
	var 剋干=天干生剋合(天干, 剋我我剋);
	var 冲支=地支六合冲害破(地支, "冲");
				
	return 剋干+冲支;
}

function 干支天同地同(干支1, 干支2){
    //選項：剋我、我剋
	var 天干1=干支1.substr(0,1);
	var 地支1=干支1.substr(1,1);

	var 天干2=干支2.substr(0,1);
	var 地支2=干支2.substr(1,1);

	var 天同 = (天干1 == 天干2) ? "天同" : "";
    var 地同 = (地支1 == 地支2) ? "地同" : "";

	if (天同 != "" && 地同 != "") return "伏吟"; else return "";	
}

function 干支天剋地冲(干支1, 干支2){
    //選項：剋我、我剋
	var 天干1=干支1.substr(0,1);
	var 地支1=干支1.substr(1,1);

	var 天干2=干支2.substr(0,1);
	var 地支2=干支2.substr(1,1);

	var 天剋 = 天干十剋(天干1, 天干2);
    var 地冲 = 地支相冲(地支1+地支2);

	if (天剋 != "" && 地冲 != "") return "返吟"; else return "";	
}

function 干支天合地合(干支1, 干支2){
    //選項：剋我、我剋
	var 天干1=干支1.substr(0,1);
	var 地支1=干支1.substr(1,1);

	var 天干2=干支2.substr(0,1);
	var 地支2=干支2.substr(1,1);

	var 天合 = 天干五合(天干1, 天干2);
	var 地合 = 地支半六暗合(地支1, 地支2, ""); //不考量地支暗合

	if (天合 != "" && 地合 != "") return "天合地合"; else return "";
}

function 干支天合地刑(干支1, 干支2){
    //選項：剋我、我剋
	var 天干1=干支1.substr(0,1);
	var 地支1=干支1.substr(1,1);

	var 天干2=干支2.substr(0,1);
	var 地支2=干支2.substr(1,1);

	var 天合 = 天干五合(天干1, 天干2);
	var 地刑 = 地支相刑(地支1+地支2, "相刑", "所有");

	if (天合 != "" && 地刑 != "") return "天合地刑"; else return "";
}

function 干支天剋地合(干支1, 干支2){
    //選項：剋我、我剋
	var 天干1=干支1.substr(0,1);
	var 地支1=干支1.substr(1,1);

	var 天干2=干支2.substr(0,1);
	var 地支2=干支2.substr(1,1);

	var 天剋 = 天干十剋(天干1, 天干2);
    var 地合 = 地支半六暗合(地支1, 地支2, ""); //不考量地支暗合

	if (天剋 != "" && 地合 != "") return "天剋地合"; else return "";	
}

function 干支天剋地刑(干支1, 干支2){
    //選項：剋我、我剋
	var 天干1=干支1.substr(0,1);
	var 地支1=干支1.substr(1,1);

	var 天干2=干支2.substr(0,1);
	var 地支2=干支2.substr(1,1);

	var 天剋 = 天干十剋(天干1, 天干2);
    var 地刑 = 地支相刑(地支1+地支2, "相刑", "所有");

	if (天剋 != "" && 地刑 != "") return "天剋地刑"; else return "";	
}

// ***************************************************************************
function 天干五合(天干1, 天干2){
    //選項：剋我、我剋
    var 天干對 = 天干1+天干2;

    switch(天干對){
        case "甲己": case "己甲":
            return "土";
            break;
        case "乙庚": case "庚乙":
            return "金";
            break;
        case "丙辛": case "辛丙":
            return "水";
            break;
        case "丁壬": case "壬丁":
            return "木";
            break;
        case "戊癸": case "癸戊":
            return "火";
            break;
        default:
            return "";
            break;
    }
}


function 天干合化(天干對, 命盤){
    var 月令 = 命盤.月令;
    var 日時干 = 命盤.日干.天干 + 命盤.時干.天干;
    var 合化 = "";
    var 合化註解 = "";

    var 三命地支條件 = "";
    var 三命月干條件 = "";
    var 三命吉的條件 = "";
    var 三命凶的條件 = "";
    var 三命化否 = "";
    var 三命註解="";

    switch(天干對){
        case "甲己": case "己甲":

            //if ((月令 == "辰" || 月令 == "戌" || 月令 == "丑" || 月令 == "未") && (命盤.分析.地支.地支數據[地支字轉值("寅")].數量 == 0 && 命盤.分析.地支.地支數據[地支字轉值("卯")].數量 == 0) && (命盤.分析.天干.天干數據[天干字轉值("甲")].天干 == 0 && 命盤.分析.天干.天干數據[天干字轉值("乙")].天干 == 0)) {
            //    合化 = "土";
            //    合化註解 = "生於辰、戌、丑、未月，不見木，合化成格。";
            //}
            // ************************* 三命通會 *************************
            三命地支條件 = "甲己不生於辰、戌、丑、未，午月，故不化土。";
            if (月令 == "辰" || 月令 == "戌" || 月令 == "丑" || 月令 == "未" || 月令 == "午") {
                三命地支條件 = "甲己合，月支為辰、戌、丑、未，午，符合化土的環境。";
                三命化否 = "土";
            }
            if (命盤.月干.天干 == "戊") {
                三命月干條件 = "月干逢戊則不化。";
                三命化否 = ""; //不化
            }

            if ((命盤.分析.地支.地支數據[地支字轉值("亥")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("卯")].數量 > 0) || (命盤.分析.地支.地支數據[地支字轉值("亥")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("未")].數量 > 0) || (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0)) 三命吉的條件 = "柱中逢亥卯、亥未、戊癸相合皆吉。";
            if (日時干 == "丁壬" || 日時干 == "壬丁") 三命凶的條件 = "忌日時天干為丁壬相合。";

            三命註解 = 三命地支條件 + 三命月干條件 + 三命吉的條件 + 三命凶的條件;
            // ************************************************************

            return "天干合,土,甲己," + 三命化否 + "," + 三命註解;
            break;

        case "乙庚":case "庚乙":

            //if ((月令 == "巳" || 月令 == "申" || 月令 == "酉" || 月令 == "丑") && (命盤.分析.地支.地支數據[地支字轉值("午")].數量 == 0) && (命盤.分析.天干.天干數據[天干字轉值("丙")].天干 == 0 && 命盤.分析.天干.天干數據[天干字轉值("丁")].天干 == 0)) {
            //    合化 = "金";
            //    合化註解 = "生於巳、酉、丑、申月，不見火，合化成格。";
            //}
            // ************************* 三命通會 *************************
            三命地支條件 = "乙庚不生於巳、酉、丑、申月，故不化金。";
            if (月令 == "巳" || 月令 == "酉" || 月令 == "丑" || 月令 == "申") {
                三命地支條件 = "乙庚合，月支為巳、酉、丑、申，符合化金的環境。";
                三命化否 = "金";
            }
            if (命盤.月干.天干 == "甲") {
                三命月干條件 = "月干逢甲則不化。";
                三命化否 = ""; //不化
            }

            if ((命盤.分析.地支.地支數據[地支字轉值("亥")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("卯")].數量 > 0) || (命盤.分析.地支.地支數據[地支字轉值("亥")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("未")].數量 > 0) || (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0)) 三命吉的條件 = "柱中逢亥卯、亥未、戊癸相合皆吉。";
            if (日時干 == "丁壬" || 日時干 == "壬丁") 三命凶的條件 = "忌日時天干為丁壬相合。";
            三命註解 = 三命地支條件 + 三命月干條件 + 三命吉的條件 + 三命凶的條件;
            // ************************************************************

            return "天干合,金,乙庚," + 三命化否 + "," + 三命註解;
            break;

        case "丙辛": case "辛丙":

            //if ((月令 == "申" || 月令 == "子" || 月令 == "辰" || 月令 == "亥") && (命盤.分析.地支.地支數據[地支字轉值("丑")].數量 == 0 && 命盤.分析.地支.地支數據[地支字轉值("未")].數量 == 0 && 命盤.分析.地支.地支數據[地支字轉值("戌")].數量 == 0) && (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 == 0 && 命盤.分析.天干.天干數據[天干字轉值("己")].天干 == 0)) {
            //    合化 = "水";
            //    合化註解 = "生於申、子、辰、亥月，不見土，合化成格。";
            //}
            // ************************* 三命通會 *************************
            三命地支條件 = "丙辛不生於申、子、辰、亥月，故不化水。";
            if (月令 == "申" || 月令 == "子" || 月令 == "辰" || 月令 == "亥") {
                三命地支條件 = "丙辛合，月支為申、子、辰、亥，符合化水的環境。";
                三命化否 = "水";
            }
            if (命盤.月干.天干 == "丁") {
                三命月干條件 = "月干逢丁則不化。";
                三命化否 = ""; //不化
            }

            if ((命盤.分析.地支.地支數據[地支字轉值("辰")].數量 > 0 || 命盤.分析.地支.地支數據[地支字轉值("戌")].數量 > 0) || (命盤.分析.地支.地支數據[地支字轉值("丑")].數量 > 0 || 命盤.分析.地支.地支數據[地支字轉值("未")].數量 > 0) || (命盤.分析.天干.天干數據[天干字轉值("乙")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("庚")].天干 > 0)) 三命吉的條件 = "柱中逢辰戌丑未諸土、乙庚皆吉。";
            if (日時干 == "甲己" || 日時干 == "己甲") 三命凶的條件 = "忌日時天干為甲己相合。";
            三命註解 = 三命地支條件 + 三命月干條件 + 三命吉的條件 + 三命凶的條件;
             // ************************************************************

            return "天干合,水,丙辛," + 三命化否 + "," + 三命註解;
            break;

        case "丁壬": case "壬丁":

            //if ((月令 == "亥" || 月令 == "卯" || 月令 == "未" || 月令 == "寅") && (命盤.分析.地支.地支數據[地支字轉值("申")].數量 == 0 && 命盤.分析.地支.地支數據[地支字轉值("酉")].數量 == 0) && (命盤.分析.天干.天干數據[天干字轉值("庚")].天干 == 0 && 命盤.分析.天干.天干數據[天干字轉值("辛")].天干 == 0)) {
            //    合化 = "木";
            //    合化註解 = "生於亥、卯、未、寅月，不見金，合化成格。";
            //}
            // ************************* 三命通會 *************************
            三命地支條件 = "丁壬不生於亥、卯、未、寅月，故不化木。";
            if (月令 == "亥" || 月令 == "卯" || 月令 == "未" || 月令 == "寅") {
                三命地支條件 = "丁壬合，月支為亥、卯、未、寅，符合化木的環境。";
                三命化否 = "木";
            }
            if (命盤.月干.天干 == "丙") {
                三命月干條件 = "月干逢丙則不化。";
                三命化否 = ""; //不化
            }

            if ((命盤.分析.地支.地支數據[地支字轉值("申")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("酉")].數量 > 0) || (命盤.分析.天干.天干數據[天干字轉值("庚")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) || (命盤.分析.天干.天干數據[天干字轉值("丙")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) ) 三命吉的條件 = "柱中逢庚辛、申酉、丙辛相合皆吉。";
            if (日時干 == "乙庚" || 日時干 == "庚乙") 三命凶的條件 = "忌日時天干為乙庚相合。";
            三命註解 = 三命地支條件 + 三命月干條件 + 三命吉的條件 + 三命凶的條件;
            // ************************************************************

            return "天干合,木,丁壬," + 三命化否 + "," + 三命註解;
            break;

        case "戊癸": case "癸戊":

            //if ((月令 == "寅" || 月令 == "午" || 月令 == "戌" || 月令 == "巳") && (命盤.分析.地支.地支數據[地支字轉值("亥")].數量 == 0 && 命盤.分析.地支.地支數據[地支字轉值("子")].數量 == 0) && (命盤.分析.天干.天干數據[天干字轉值("壬")].天干 == 0 && 命盤.分析.天干.天干數據[天干字轉值("癸")].天干 == 0)) {
            //    合化 = "火";
            //    合化註解 = "生於寅、午、戌、巳月，不見水，合化成格。";
            //}
            // ************************* 三命通會 *************************
            三命地支條件 = "戊癸不生於寅、午、戌、巳月，故不化火。";
            if (月令 == "寅" || 月令 == "午" || 月令 == "戌" || 月令 == "巳") {
                三命地支條件 = "戊癸合，月支為寅、午、戌、巳，符合化火的環境。";
                三命化否 = "火";
            }
            if (命盤.月干.天干 == "己") {
                三命月干條件 = "月干逢己則不化。";
                三命化否 = "";  //不化
            }

            if ((命盤.分析.地支.地支數據[地支字轉值("亥")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("子")].數量 > 0) || (命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0) || (命盤.分析.天干.天干數據[天干字轉值("丁")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 0)) 三命吉的條件 = "柱中逢壬癸、亥子、丁壬相合皆吉。";
            if (日時干 == "丙辛" || 日時干 == "辛丙") 三命凶的條件 = "忌日時天干為丙辛相合。";
            三命註解 = 三命地支條件 + 三命月干條件 + 三命吉的條件 + 三命凶的條件;
            // ************************************************************

            return "天干合,火,戊癸," + 三命化否 + "," + 三命註解;
            break;

        default:
            return "";
            break;
    }
}


function 天干十剋(天干1, 天干2){
    var 天干對 = 天干1+天干2;

    switch(天干對){
        case "甲戊": case "甲戊": 
	        return "剋";
	        break;
        case "乙己": case "己乙": 
	        return "剋";
	        break;
        case "丙庚": case "庚丙": 
	        return "剋";
	        break;
        case "丁辛": case "辛丁": 
	        return "剋";
	        break;
        case "戊壬": case "壬戊": 
	        return "剋";
	        break;
        case "己癸": case "癸己": 
	        return "剋";
	        break;
        case "庚甲": case "甲庚": 
	        return "剋";
	        break;
        case "辛乙": case "乙辛": 
	        return "剋";
	        break;
        case "壬丙": case "丙壬": 
	        return "我";
	        break;
        case "癸丁": case "丁癸": 
	        return "剋";
	        break;
	    default:
	        return "";
	        break;
    }
}

function 天干滾動(天干數, 滾動數) {
    if (滾動數 < 0) {
        滾動數 += 10;
    }
    return (Number(天干數) + Number(滾動數)) % 10;
}

function 天干屬性(天干, 選項) {
	if(天干=="-" || 天干=="x" || 天干=="X" || 天干=="o" || 天干=="O" || 天干==="") return "";
	
    var 天干數 = 天干字轉值(天干);
    var 天干 = [
        { "天干": "癸", "係數": 0, "陰陽": "陰", "五行": "水", "字體顏色": "#00FFFF", "背景顏色": "#E0E0E0", "臟腑": "腎", "註解": "萬物可揆度" },
        { "天干": "甲", "係數": 1, "陰陽": "陽", "五行": "木", "字體顏色": "#00FF00", "背景顏色": "#FDFDFD", "臟腑": "膽", "註解": "萬物剖符甲而出也" },
        { "天干": "乙", "係數": 2, "陰陽": "陰", "五行": "木", "字體顏色": "#00FF00", "背景顏色": "#E0E0E0", "臟腑": "肝", "註解": "萬物出生,抽軋而出" },
        { "天干": "丙", "係數": 3, "陰陽": "陽", "五行": "火", "字體顏色": "#FF0000", "背景顏色": "#FDFDFD", "臟腑": "小腸", "註解": "萬物炳然著見" },
        { "天干": "丁", "係數": 4, "陰陽": "陰", "五行": "火", "字體顏色": "#FF0000", "背景顏色": "#E0E0E0", "臟腑": "心", "註解": "萬物丁壯" },
        { "天干": "戊", "係數": 5, "陰陽": "陽", "五行": "土", "字體顏色": "#CC6600", "背景顏色": "#FDFDFD", "臟腑": "脾", "註解": "萬物茂盛" },
        { "天干": "己", "係數": 6, "陰陽": "陰", "五行": "土", "字體顏色": "#CC6600", "背景顏色": "#E0E0E0", "臟腑": "胃", "註解": "萬物有形可紀識" },
        { "天干": "庚", "係數": 7, "陰陽": "陽", "五行": "金", "字體顏色": "#FF9900", "背景顏色": "#FDFDFD", "臟腑": "大腸", "註解": "萬物收斂有實" },
        { "天干": "辛", "係數": 8, "陰陽": "陰", "五行": "金", "字體顏色": "#FF9900", "背景顏色": "#E0E0E0", "臟腑": "肺", "註解": "萬物初新皆收成" },
        { "天干": "壬", "係數": 9, "陰陽": "陽", "五行": "水", "字體顏色": "#00FFFF", "背景顏色": "#FDFDFD", "臟腑": "膀胱", "註解": "陽氣任養萬物之下" }
    ];

    switch (選項) {
        case 1: case "天干":
            return 天干[天干數].天干;
        case 2: case "係數":
            return 天干[天干數].係數;
        case 3: case "陰陽":
            return 天干[天干數].陰陽;
        case 4: case "臟腑":
            return 天干[天干數].臟腑;
        case 5: case "五行":
            return 天干[天干數].五行;
        case 6: case "字體顏色":
            return 天干[天干數].字體顏色;
        case 7: case "背景顏色":
            return 天干[天干數].背景顏色;
        case 8: case "註解":
            return 天干[天干數].註解;
		default:
			alert(天干 + "，" + 選項 + "：天干屬性輸入錯誤");
			return "";
    }
}


//     *********************************************************************************
//                                         陰陽,五行模塊
//     *********************************************************************************
function 是天干(元件){
    if(元件=="甲" || 元件=="乙" || 元件=="丙" || 元件=="丁" || 元件=="戊" || 元件=="己" || 元件=="庚" || 元件=="辛" || 元件=="壬" || 元件=="癸"){
        return true;
    }
    else {return false;}
}

function 是地支(元件){
    if(元件=="子" || 元件=="丑" || 元件=="寅" || 元件=="卯" || 元件=="辰" || 元件=="巳" || 元件=="午" || 元件=="未" || 元件=="申" || 元件=="酉" || 元件=="戌" || 元件=="亥") return true; else return false;
}

function 干支轉五行(干支元件){
    //輸入天干或地支，轉換成五行
    switch(干支元件){
        case "甲": case "乙": case "寅": case "卯":
            return "木";
        case "丙": case "丁": case "巳": case "午":
            return "火";
        case "戊": case "己": case "丑": case "辰": case "未": case "戌":
            return "土";
        case "庚": case "辛": case "申": case "酉":
            return "金";
        case "壬": case "癸": case "亥": case "子":
            return "水";
        default:
            alert(干支元件 + "：干支轉五行 function 的輸入干支元件錯誤！");
            return "";
    }
}

function 陰陽同性(五行元件1, 五行元件2){
    var 陰陽屬性1, 陰陽屬性2;
    if(是天干(五行元件1)) {陰陽屬性1=天干屬性(五行元件1, "陰陽");}
    if(是天干(五行元件2)) {陰陽屬性1=天干屬性(五行元件2, "陰陽");}
    
    if(是地支(五行元件1)) {陰陽屬性1=地支屬性(五行元件1, "陰陽");}
    if(是地支(五行元件2)) {陰陽屬性1=地支屬性(五行元件2, "陰陽");}
    
    if(陰陽屬性1==陰陽屬性2){return true;} else {return false;}
    }

function 五行轉天干(五行, 陰陽){
	// 陰陽="陽", "陰"
    //alert(五行 + " / " + 陰陽);
	switch(五行){
		case "木":
			if(陰陽=="陽") return "甲";
			if(陰陽=="陰") return "乙";
			break;
		case "火":
			if(陰陽=="陽") return "丙";
			if(陰陽=="陰") return "丁";
			break;
		case "土":
			if(陰陽=="陽") return "戊";
			if(陰陽=="陰") return "己";
			break;			
		case "金":
			if(陰陽=="陽") return "庚";
			if(陰陽=="陰") return "辛";
			break;
		case "水":
			if(陰陽=="陽") return "壬";
			if(陰陽=="陰") return "癸";
			break;
		default:
			alert("五行轉天干錯誤");
			return "";
	}
}


function 五行字轉數(五行) {
    switch (五行) {
        case "木": return 0; 
        case "火": return 1; 
        case "土": return 2; 
        case "金": return 3; 
        case "水": return 4; 
    }
}


function 五行數轉字(五行數) {
    switch (五行數) {
        case 0: return "木"; 
        case 1: return "火"; 
        case 2: return "土"; 
        case 3: return "金"; 
        case 4: return "水"; 
    }
}

function 五行四季旺相休囚死(五行, 四季, 月令){
    /*
        五行在一年四時不同的宇宙時空狀態下，其存在的狀態也不同，由盛轉衰的過程用旺、相、休、囚、死來表示。 

        時 木 火 水 金 土
        ----------------------
        春 旺 相 休 囚 死
        夏 休 旺 囚 死 相
        季 囚 休 死 相 旺
        秋 死 囚 相 旺 休
        冬 相 死 旺 休 囚

        旺：事物發展至鼎盛時期的狀態。如木在春季寅卯月，得時秉令，為一年四季最旺之時。
        相：事物處於受生受益時期正適宜發展的狀態。如木於冬季亥子月水旺之時，吸納水氣而受益，為生長發育提供了條件，處於次旺狀態。 
        休： 一事物因生另一事物而被泄氣，走入衰敗的狀態。如木被夏季巳午月旺火盜泄其氣而衰敗。 
        囚：事物失去生的源泉又克制不了當令之事物，導致自身力量比“休”更弱的狀態。如四季月之木，生木的水被當令之旺土重克，使木失去水之生力，木克土被土耗氣，但又戰不過旺土，故以失敗告終，像戰俘一樣反被囚禁起來。 
        死： 一事物受到力量極強旺的另一事物重克，元氣傷盡，走向滅亡的狀態。如秋申酉月木被旺金重克而致毀折。 

        旺、相、休、囚、死的旺衰次序為：旺為最旺，相為次旺，休為小衰，囚為中衰，死為最衰。 
        記憶規律：當令者旺，令生者相，生令者休，克令者囚，令克者死。 

        旺為當令之氣；相為旺者之所生，間接有氣；休為旺者之前氣，表示功成身退之意；囚為克我者無力之氣，有時反而會被我所虜；死為我克之氣，我當旺之時彼最弱，所以以死喻之。
        土為什麼到每季的最后一個月才會興旺呢？這是因為木沒有土就不能生長，火沒有土就不光亮，金沒有土就不能形成，水沒有土就不能高升。所以金木水火要興旺，是離不開土的。所以土的特點是興旺於四季，位居中央，不固定在某個季節。
    */

    var 四時=四季;
    if (月令=="辰" || 月令=="未" || 月令=="戌" || 月令=="丑") 四時="季";

    switch (五行) {
        case "木":
            switch(四時){
                case "春": 
                    return "旺";
                case "夏": 
                    return "休";
                case "秋": 
                    return "死";
                case "冬": 
                    return "相";
                case "季": 
                    return "囚";
            }
        case "火":
            switch(四時){
                case "春": 
                    return "相";
                case "夏": 
                    return "旺";
                case "秋": 
                    return "囚";
                case "冬": 
                    return "死";
                case "季": 
                    return "休";
            }
        case "土":
            switch(四時){
                case "春": 
                    return "死";
                case "夏": 
                    return "相";
                case "秋": 
                    return "休";
                case "冬": 
                    return "囚";
                case "季": 
                    return "旺";
            }
        case "金":
            switch(四時){
                case "春": 
                    return "囚";
                case "夏": 
                    return "死";
                case "秋": 
                    return "旺";
                case "冬": 
                    return "休";
                case "季": 
                    return "相";
            }
        case "水":
            switch(四時){
                case "春": 
                    return "休";
                case "夏": 
                    return "囚";
                case "秋": 
                    return "相";
                case "冬": 
                    return "旺";
                case "季": 
                    return "死";
            }
    }

}


function 五行滾動(五行, 滾動數) {
    if (滾動數 < 0) 滾動數 += 5;
    
    var 變化五行數= (五行字轉數(五行) + Number(滾動數)) % 5;
    return 五行數轉字(變化五行數);
}

function 五行生剋字轉數(五行生剋) {
    switch (五行生剋) {
        case "同我": return 0;
        case "我生": return 1;
        case "我剋": return 2;
        case "剋我": return 3;
        case "生我": return 4;
    }
}

function 五行生剋(日元五行, 他干五行) {
    // return 五行生剋關係, 同我, 我生, 我剋, 生我

    switch (日元五行) {
        case "木":
            switch (他干五行) {
                case "木":
                    return "同我";
                case "火":
                    return "我生";
                case "土":
                    return "我剋";
                case "金":
                    return "剋我";
                case "水":
                    return "生我";
            }

        case "火":
            switch (他干五行) {
                case "木":
                    return "生我";
                   
                case "火":
                    return "同我";
                   
                case "土":
                    return "我生";
                   
                case "金":
                    return "我剋";
                   
                case "水":
                    return "剋我";
                   
            }

        case "土":
            switch (他干五行) {
                case "木":
                    return "剋我";
                   
                case "火":
                    return "生我";
                   
                case "土":
                    return "同我";
                   
                case "金":
                    return "我生";
                   
                case "水":
                    return "我剋";
                   
            }

        case "金":
            switch (他干五行) {
                case "木":
                    return "我剋";
                   
                case "火":
                    return "剋我";
                   
                case "土":
                    return "生我";
                   
                case "金":
                    return "同我";
                   
                case "水":
                    return "我生";
                   
            }

        case "水":
            switch (他干五行) {
                case "木":
                    return "我生";
                   
                case "火":
                    return "我剋";
                   
                case "土":
                    return "剋我";
                   
                case "金":
                    return "生我";
                   
                case "水":
                    return "同我";
                   
            }
    }
}

function 生剋五行(輸入五行, 五行生剋){
    //輸入五行: 木=0, 火=1, 土=2, 金=3, 水=4
    //五行生剋: 我生, 我剋, 剋我, 生我, 同我
    // 生剋五行("木", "我剋"), return 土
    var 五行生剋數=五行生剋字轉數(五行生剋);
    return 五行滾動(輸入五行,五行生剋數);
}


function 四柱名稱(四柱數, 選項){
    switch(四柱數){
        case 0: case "0":
            if(選項=="" || 選項=="1" || 選項=="柱名" || typeof 選項 == 'undefined') return "年柱";
			if(選項=="2" || 選項=="天干") return "年干";
			if(選項=="3" || 選項=="地支") return "年支";
        case 1: case "1": 
            if(選項=="" || 選項=="1" || 選項=="柱名" || typeof 選項 == 'undefined') return "月柱";
			if(選項=="2" || 選項=="天干") return "月干";
			if(選項=="3" || 選項=="地支") return "月支";
        case 2: case "2": 
            if(選項=="" || 選項=="1" || 選項=="柱名" || typeof 選項 == 'undefined') return "日柱";
			if(選項=="2" || 選項=="天干") return "日干";
			if(選項=="3" || 選項=="地支") return "日支";
        case 3: case "3": 
            if(選項=="" || 選項=="1" || 選項=="柱名" || typeof 選項 == 'undefined') return "時柱";
			if(選項=="2" || 選項=="天干") return "時干";
			if(選項=="3" || 選項=="地支") return "時支";
        case 4: case "3": 
            if(選項=="" || 選項=="1" || 選項=="柱名" || typeof 選項 == 'undefined') return "大運";
			if(選項=="2" || 選項=="天干") return "大運干";
			if(選項=="3" || 選項=="地支") return "大運支";
        case 5: case "5": 
            if(選項=="" || 選項=="1" || 選項=="柱名" || typeof 選項 == 'undefined') return "流年";
			if(選項=="2" || 選項=="天干") return "流年干";
			if(選項=="3" || 選項=="地支") return "流年支";
        case 6: case "6": 
            if(選項=="" || 選項=="1" || 選項=="柱名" || typeof 選項 == 'undefined') return "流月";
			if(選項=="2" || 選項=="天干") return "流月干";
			if(選項=="3" || 選項=="地支") return "流月支";
        default:
            alert("四柱名稱輸入錯誤！！");
            return "";
    }
}

function 四柱屬性(命盤, 柱數, 屬性選項){
    //柱數：0年柱，1月柱，2日柱，3時柱
    //選項："天干"，"地支",十二長生，納音，天干十神，地支十神1，2，3......

    switch(柱數){
        case 0: //年柱
            switch (屬性選項) {
                case "天干":
                    return 命盤.年干.天干;
                case "地支":
                    return 命盤.年支.地支;
                case "天干十神":
                    return 命盤.年干.十神;
                case "地支十神1":
                    return 命盤.年支.十神1;
                case "地支十神2":
                    return 命盤.年支.十神2;
                case "地支十神3":
                    return 命盤.年支.十神3;
                default:
                    alert(屬性選項 + "：輸入的屬性選項錯誤 ！");
                    return "";
                   
            }
        case 1: //月柱
            switch (屬性選項) {
                case "天干":
                    return 命盤.月干.天干;
                case "地支":
                    return 命盤.月支.地支;
                case "天干十神":
                    return 命盤.月干.十神;
                case "地支十神1":
                    return 命盤.月支.十神1;
                case "地支十神2":
                    return 命盤.月支.十神2;
                case "地支十神3":
                    return 命盤.月支.十神3;
                default:
                    alert(屬性選項 + "：輸入的屬性選項錯誤 ！");
                    return "";
            }
        case 2: //日柱
            switch (屬性選項) {
                case "天干":
                    return 命盤.日干.天干;
                case "地支":
                    return 命盤.日支.地支;
                case "天干十神":
                    return 命盤.日干.十神;
                case "地支十神1":
                    return 命盤.日支.十神1;
                case "地支十神2":
                    return 命盤.日支.十神2;
                case "地支十神3":
                    return 命盤.日支.十神3;
                default:
                    alert(屬性選項 + "：輸入的屬性選項錯誤 ！");
                    return "";
            }
        case 3: //時柱
            switch (屬性選項) {
                case "天干":
                    return 命盤.時干.天干;
                case "地支":
                    return 命盤.時支.地支;
                case "天干十神":
                    return 命盤.時干.十神;
                case "地支十神1":
                    return 命盤.時支.十神1;
                case "地支十神2":
                    return 命盤.時支.十神2;
                case "地支十神3":
                    return 命盤.時支.十神3;
                default:
                    alert(屬性選項 + "：輸入的屬性選項錯誤 ！");
                    return "";
            }
        default:
            alert(柱數 + "：輸入的四柱數錯誤 ！");
    }
}

//     *********************************************************************************
//                                         十神模塊
//     *********************************************************************************

function 十神數轉字(十神數) {
    switch (十神數) {
        case 0: return "比肩";
        case 1: return "劫財";
        case 2: return "食神";
        case 3: return "傷官";
        case 4: return "偏財";
        case 5: return "正財";
        case 6: return "七殺";
        case 7: return "正官";
        case 8: return "偏印";
        case 9: return "正印";
    }
}

function 十神字轉數(十神) {
    switch (十神) {
        case "比肩": return 0;
        case "劫財": return 1;
        case "食神": return 2;
        case "傷官": return 3;
        case "偏財": return 4;
        case "正財": return 5;
        case "七殺": return 6;
        case "正官": return 7;
        case "偏印": return 8;
        case "正印": return 9;
    }
}

function 十神單字(十神) {
    switch (十神) {
        case "比肩": return "比";
        case "劫財": return "劫";
        case "食神": return "食";
        case "傷官": return "傷";
        case "正財": return "財";
        case "偏財": return "才";
        case "正官": return "官";
        case "七殺": return "殺";
        case "正印": return "印";
        case "偏印": return "梟";
        default: return "";
    }
}

function 十神轉五神(十神) {
    switch (十神) {
        case "比肩": return "比劫";
        case "劫財": return "比劫";
        case "食神": return "食傷";
        case "傷官": return "食傷";
        case "正財": return "財才";
        case "偏財": return "財才";
        case "正官": return "官殺";
        case "七殺": return "官殺";
        case "正印": return "印梟";
        case "偏印": return "印梟";
        default:
            alert(十神 + "：十神轉五神，輸入的十神錯誤");
            return "";
    }
}

function 五行轉五神(日主五行, 五行) {
    var 五行關係 = 五行生剋(日主五行, 五行);

    switch (五行關係) {
        case "同我": return "比劫";
        case "我生": return "食傷";
        case "我剋": return "財才";
        case "剋我": return "官殺";
        case "生我": return "印梟";
        default:
            alert(五行關係 + "：五行轉五神，五行生剋關係錯誤");
            return "";
    }
}


function 尋十神(天干, 日主) {
    // 輸入要尋十神的天干與日主的天干,尋十神("乙", "甲")

    if (天干 == "" || 天干 == "-") return "";

    var 天干陰陽 = 天干屬性(天干, "陰陽");
    var 日主陰陽 = 天干屬性(日主, "陰陽");
    var 天干五行 = 天干屬性(天干, "五行");
    var 日主五行 = 天干屬性(日主, "五行");
    var 十神;

    var 陰陽同性 = (天干陰陽 == 日主陰陽) ? true : false;
    var 五行關係 = 五行生剋(日主五行, 天干五行);

    switch (五行關係) {
        case "同我":
            十神 = 陰陽同性 ? "比肩" : "劫財";
            break;
        case "我生":
            十神 = 陰陽同性 ? "食神" : "傷官";
            break;
        case "我剋":
            十神 = 陰陽同性 ? "偏財" : "正財";
            break;
        case "剋我":
            十神 = 陰陽同性 ? "七殺" : "正官";
            break;
        case "生我":
            十神 = 陰陽同性 ? "偏印" : "正印";
            break;
    }
    return 十神;
    //alert("十神：" + 十神 + ",關係：" + 五行關係 + " / " + 天干陰陽 + 天干五行 + "/" + 日主陰陽 + 日主五行);
}

function 十神天干(日主, 十神) {
    switch (日主) {
        case "甲":
            switch (十神) {
                case "比肩": return "甲";
                case "劫財": return "乙";
                case "食神": return "丙";
                case "傷官": return "丁";
                case "正財": return "己";
                case "偏財": return "戊";
                case "正官": return "辛";
                case "七殺": return "庚";
                case "正印": return "癸";
                case "偏印": return "壬";
            }          
           
        case "乙":
            switch (十神) {
                case "比肩": return "乙";
                case "劫財": return "甲";
                case "食神": return "丁";
                case "傷官": return "丙";
                case "正財": return "戊";
                case "偏財": return "己";
                case "正官": return "庚";
                case "七殺": return "辛";
                case "正印": return "壬";
                case "偏印": return "癸";
            }          
           
        case "丙":
            switch (十神) {
                case "比肩": return "丙";
                case "劫財": return "丁";
                case "食神": return "戊";
                case "傷官": return "己";
                case "正財": return "辛";
                case "偏財": return "庚";
                case "正官": return "癸";
                case "七殺": return "壬";
                case "正印": return "乙";
                case "偏印": return "甲";
            }
                       
        case "丁":
            switch (十神) {
                case "比肩": return "丁";
                case "劫財": return "丙";
                case "食神": return "己";
                case "傷官": return "戊";
                case "正財": return "庚";
                case "偏財": return "辛";
                case "正官": return "壬";
                case "七殺": return "癸";
                case "正印": return "甲";
                case "偏印": return "乙";
            }
                           
        case "戊":
            switch (十神) {
                case "比肩": return "戊";
                case "劫財": return "己";
                case "食神": return "庚";
                case "傷官": return "辛";
                case "正財": return "癸";
                case "偏財": return "壬";
                case "正官": return "乙";
                case "七殺": return "甲";
                case "正印": return "丁";
                case "偏印": return "丙";
            }
                 
        case "己":
            switch (十神) {
                case "比肩": return "己";
                case "劫財": return "戊";
                case "食神": return "辛";
                case "傷官": return "庚";
                case "正財": return "壬";
                case "偏財": return "癸";
                case "正官": return "甲";
                case "七殺": return "乙";
                case "正印": return "丙";
                case "偏印": return "丁";
            }
           
        case "庚":
            switch (十神) {
                case "比肩": return "庚";
                case "劫財": return "辛";
                case "食神": return "壬";
                case "傷官": return "癸";
                case "正財": return "乙";
                case "偏財": return "甲";
                case "正官": return "丁";
                case "七殺": return "丙";
                case "正印": return "己";
                case "偏印": return "戊";
            }
                       
        case "辛":
            switch (十神) {
                case "比肩": return "辛";
                case "劫財": return "庚";
                case "食神": return "癸";
                case "傷官": return "壬";
                case "正財": return "甲";
                case "偏財": return "乙";
                case "正官": return "丙";
                case "七殺": return "丁";
                case "正印": return "戊";
                case "偏印": return "己";
            }
                        
        case "壬":
            switch (十神) {
                case "比肩": return "壬";
                case "劫財": return "癸";
                case "食神": return "甲";
                case "傷官": return "乙";
                case "正財": return "丁";
                case "偏財": return "丙";
                case "正官": return "己";
                case "七殺": return "戊";
                case "正印": return "辛";
                case "偏印": return "庚";
            }
             
        case "癸":
            switch (十神) {
                case "比肩": return "癸";
                case "劫財": return "壬";
                case "食神": return "乙";
                case "傷官": return "甲";
                case "正財": return "丙";
                case "偏財": return "丁";
                case "正官": return "戊";
                case "七殺": return "己";
                case "正印": return "庚";
                case "偏印": return "辛";
            }
            
            
        default:
            alert("十神轉換天干出現錯誤！！");
           
    }
}

function 十神五行(日主, 十神){
    var 日主五行=天干屬性(日主, "五行");
    switch (十神) {
        case "比肩": case "劫財":  case "比劫":
            //if(十神=="比劫") console.log(十神 + " / " + 日主五行 + " / " + 五行滾動(日主五行, 0));
            return 五行滾動(日主五行, 0); // 同我
        case "食神": case "傷官":  case "食傷":
            return 五行滾動(日主五行, 1); // 我生
                       
        case "正財": case "偏財": case "財才":
            return 五行滾動(日主五行, 2); // 我剋
             
        case "正官": case "七殺":  case "官殺":
            return 五行滾動(日主五行, 3); // 剋我
             
        case "正印": case "偏印":  case "印梟":
            return 五行滾動(日主五行, 4); // 生我
    }
}


function 十神刑冲合害(十神, 干支, 刑冲合害, 命盤) {
    // 十神：要測試的十神，"正官"
    // 干支：測試天干或地支，"天干"、"地支"、"干支"(天干或地支)
    // 刑冲合害：測試該十神是否有刑冲合害，"刑"、"冲"、"合"、"亥"。合包括任何一種合
    var 克應 = false;

    for(var i=0; i<4; i++){
        switch(true){
            case ((干支 == "地支") && (刑冲合害 == "合") && (命盤.分析.四柱.四柱數據[i].地支十神1 == 十神)):
                if (命盤.分析.四柱.四柱數據[i].三合 != "" || 命盤.分析.四柱.四柱數據[i].半合 != "" || 命盤.分析.四柱.四柱數據[i].六合 != "" || 命盤.分析.四柱.四柱數據[i].暗合 != "") return true;
                break;
            case ((干支 == "地支") && (刑冲合害 == "刑") && (命盤.分析.四柱.四柱數據[i].地支十神1 == 十神)):
                if (命盤.分析.四柱.四柱數據[i].三刑 != "" || 命盤.分析.四柱.四柱數據[i].半刑 != "") return true;
                break;
            case ((干支 == "地支") && (刑冲合害 == "冲") && (命盤.分析.四柱.四柱數據[i].地支十神1 == 十神)):
                if (命盤.分析.四柱.四柱數據[i].相冲 != "") return true;
                break;
            case ((干支 == "地支") && (刑冲合害 == "害") && (命盤.分析.四柱.四柱數據[i].地支十神1 == 十神)):
                if (命盤.分析.四柱.四柱數據[i].相害 != "") return true;
                break;
            case ((干支 == "天干") && (刑冲合害 == "合") && (命盤.分析.四柱.四柱數據[i].天干十神 == 十神)):
                if (命盤.分析.四柱.四柱數據[i].天干五合 != "") return true;
                break;

            // ************************* 天干 或 地支 都納入計算 ****************************
            case ((干支 == "干支") && (刑冲合害 == "合") && ((命盤.分析.四柱.四柱數據[i].天干十神 == 十神) || 命盤.分析.四柱.四柱數據[i].地支十神1 == 十神)):
                if (命盤.分析.四柱.四柱數據[i].三合 != "" || 命盤.分析.四柱.四柱數據[i].半合 != "" || 命盤.分析.四柱.四柱數據[i].六合 != "" || 命盤.分析.四柱.四柱數據[i].暗合 != "") return true;
                break;
            case ((干支 == "干支") && (刑冲合害 == "冲") && ((命盤.分析.四柱.四柱數據[i].天干十神 == 十神) || 命盤.分析.四柱.四柱數據[i].地支十神1 == 十神)):
                if (命盤.分析.四柱.四柱數據[i].相冲 != "") return true;
                break;
        }
    }
    return false;
}


//     *********************************************************************************
//                                         六十干支
//     *********************************************************************************

function 六十干支字轉值(干支) {
	if(干支=="--" || 干支=="xx" || 干支=="XX" || 干支=="oo" || 干支=="OO" || 干支=="") return "";
    switch (干支) {
        case "癸亥": return 0;
        case "甲子": return 1;
        case "乙丑": return 2;
        case "丙寅": return 3;
        case "丁卯": return 4;
        case "戊辰": return 5;
        case "己巳": return 6;
        case "庚午": return 7;
        case "辛未": return 8;
        case "壬申": return 9;
        case "癸酉": return 10;
        case "甲戌": return 11;
        case "乙亥": return 12;
        case "丙子": return 13;
        case "丁丑": return 14;
        case "戊寅": return 15;
        case "己卯": return 16;
        case "庚辰": return 17;
        case "辛巳": return 18;
        case "壬午": return 19;
        case "癸未": return 20;
        case "甲申": return 21;
        case "乙酉": return 22;
        case "丙戌": return 23;
        case "丁亥": return 24;
        case "戊子": return 25;
        case "己丑": return 26;
        case "庚寅": return 27;
        case "辛卯": return 28;
        case "壬辰": return 29;
        case "癸巳": return 30;
        case "甲午": return 31;
        case "乙未": return 32;
        case "丙申": return 33;
        case "丁酉": return 34;
        case "戊戌": return 35;
        case "己亥": return 36;
        case "庚子": return 37;
        case "辛丑": return 38;
        case "壬寅": return 39;
        case "癸卯": return 40;
        case "甲辰": return 41;
        case "乙巳": return 42;
        case "丙午": return 43;
        case "丁未": return 44;
        case "戊申": return 45;
        case "己酉": return 46;
        case "庚戌": return 47;
        case "辛亥": return 48;
        case "壬子": return 49;
        case "癸丑": return 50;
        case "甲寅": return 51;
        case "乙卯": return 52;
        case "丙辰": return 53;
        case "丁巳": return 54;
        case "戊午": return 55;
        case "己未": return 56;
        case "庚申": return 57;
        case "辛酉": return 58;
        case "壬戌": return 59;
        default:
            alert("六十干支輸入名稱有問題！！")
    }
}

function 干支滾動(干支數, 滾動數) {
	//if(干支數==-1) return "";
    if (滾動數 < 0) {
        滾動數 += 60;
    }
    return (Number(干支數) + Number(滾動數)) % 60;
}

function 六十干支屬性(干支值, 選項) {
	if(干支值=="--" || 干支值=="xx" || 干支值=="XX" || 干支值=="oo" || 干支值=="OO" || 干支值==-1 || 干支值==="") return "";
    var 干支數;
    if (isNaN(干支值)) 干支數 = 六十干支字轉值(干支值); else 干支數=干支值;
    if (干支數<0 || 干支數>59 || 干支數 === undefined){
        alert(干支值 + "：六十干支屬性 function 輸入的干支值 錯誤！");
        return "";
    }

    var 六十干支 = [
        { "干支": "癸亥", "係數": 0, "生肖": "豬", "五行": "水", "納音": "大海水", "十二運": "水臨", "自運": "自臨", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "己巳", "生肖2": "林下之豬", "太歲": "虞程大將軍"},
        { "干支": "甲子", "係數": 1, "生肖": "鼠", "五行": "金", "納音": "海中金", "十二運": "金死", "自運": "自死", "干支關係": "支生干", "天干力度": 0.2, "地支力度": -0.2, "天剋地冲": "庚午", "生肖2": "屋上之鼠", "太歲": "金辯大將軍"},
        { "干支": "乙丑", "係數": 2, "生肖": "牛", "五行": "金", "納音": "海中金", "十二運": "金墓", "自運": "自墓", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.5, "天剋地冲": "辛未", "生肖2": "海內之牛", "太歲": "陳材大將軍"},
        { "干支": "丙寅", "係數": 3, "生肖": "虎", "五行": "火", "納音": "爐中火", "十二運": "火生", "自運": "自生", "干支關係": "支生干", "天干力度": 0.3, "地支力度": -0.3, "天剋地冲": "壬申", "生肖2": "山木之虎", "太歲": "耿章大將軍"},
        { "干支": "丁卯", "係數": 4, "生肖": "兔", "五行": "火", "納音": "爐中火", "十二運": "火敗", "自運": "自敗", "干支關係": "支生干", "天干力度": 0.2, "地支力度": -0.2, "天剋地冲": "癸酉", "生肖2": "望月之兔", "太歲": "沈興大將軍"},
        { "干支": "戊辰", "係數": 5, "生肖": "龍", "五行": "木", "納音": "大林木", "十二運": "木衰", "自運": "自衰", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "甲戌", "生肖2": "清溫之龍", "太歲": "趙達大將軍"},
        { "干支": "己巳", "係數": 6, "生肖": "蛇", "五行": "木", "納音": "大林木", "十二運": "木病", "自運": "自病", "干支關係": "支生干", "天干力度": 0.3, "地支力度": -0.3, "天剋地冲": "乙亥", "生肖2": "福氣之蛇", "太歲": "郭燦大將軍"},
        { "干支": "庚午", "係數": 7, "生肖": "馬", "五行": "土", "納音": "路旁土", "十二運": "土旺", "自運": "自旺", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "丙子", "生肖2": "堂裹之馬", "太歲": "王濟大將軍"},
        { "干支": "辛未", "係數": 8, "生肖": "羊", "五行": "土", "納音": "路旁土", "十二運": "土衰", "自運": "自衰", "干支關係": "支生干", "天干力度": 0.2, "地支力度": -0.2, "天剋地冲": "丁丑", "生肖2": "得祿之羊", "太歲": "李素大將軍"},
        { "干支": "壬申", "係數": 9, "生肖": "猴", "五行": "金", "納音": "劍鋒金", "十二運": "金臨", "自運": "自臨", "干支關係": "支生干", "天干力度": 0.3, "地支力度": -0.3, "天剋地冲": "戊寅", "生肖2": "清透之猴", "太歲": "劉旺大將軍"},
        { "干支": "癸酉", "係數": 10, "生肖": "雞", "五行": "金", "納音": "劍鋒金", "十二運": "金旺", "自運": "自旺", "干支關係": "支生干", "天干力度": 0.2, "地支力度": -0.2, "天剋地冲": "己卯", "生肖2": "樓宿之雞", "太歲": "康志大將軍"},
        { "干支": "甲戌", "係數": 11, "生肖": "狗", "五行": "火", "納音": "山頭火", "十二運": "火墓", "自運": "自墓", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.5, "天剋地冲": "庚辰", "生肖2": "守身之狗", "太歲": "施廣大將軍"},
        { "干支": "乙亥", "係數": 12, "生肖": "豬", "五行": "火", "納音": "山頭火", "十二運": "火絕", "自運": "自絕", "干支關係": "支生干", "天干力度": 0.3, "地支力度": -0.3, "天剋地冲": "辛巳", "生肖2": "過往之豬", "太歲": "任保大將軍"},
        { "干支": "丙子", "係數": 13, "生肖": "鼠", "五行": "水", "納音": "澗下水", "十二運": "水旺", "自運": "自旺", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "壬午", "生肖2": "田內之鼠", "太歲": "郭嘉大將軍"},
        { "干支": "丁丑", "係數": 14, "生肖": "牛", "五行": "水", "納音": "澗下水", "十二運": "水衰", "自運": "自衰", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "癸未", "生肖2": "湖內之牛", "太歲": "汪文大將軍"},
        { "干支": "戊寅", "係數": 15, "生肖": "虎", "五行": "土", "納音": "城頭土", "十二運": "土生", "自運": "自生", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "甲申", "生肖2": "過山之虎", "太歲": "魯先大將軍"},
        { "干支": "己卯", "係數": 16, "生肖": "兔", "五行": "土", "納音": "城頭土", "十二運": "土敗", "自運": "自敗", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "乙酉", "生肖2": "山林之兔", "太歲": "龍仲大將軍"},
        { "干支": "庚辰", "係數": 17, "生肖": "龍", "五行": "金", "納音": "白蠟金", "十二運": "金養", "自運": "自養", "干支關係": "支生干", "天干力度": 0.2, "地支力度": -0.2, "天剋地冲": "丙戌", "生肖2": "恕性之龍", "太歲": "董德大將軍"},
        { "干支": "辛巳", "係數": 18, "生肖": "蛇", "五行": "金", "納音": "白蠟金", "十二運": "金生", "自運": "自生", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "丁亥", "生肖2": "冬藏之蛇", "太歲": "鄭但大將軍"},
        { "干支": "壬午", "係數": 19, "生肖": "馬", "五行": "木", "納音": "楊柳木", "十二運": "木死", "自運": "自死", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "戊子", "生肖2": "軍中之馬", "太歲": "陸明大將軍"},
        { "干支": "癸未", "係數": 20, "生肖": "羊", "五行": "木", "納音": "楊柳木", "十二運": "木墓", "自運": "自墓", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "己丑", "生肖2": "群內之羊", "太歲": "魏仁大將軍"},
        { "干支": "甲申", "係數": 21, "生肖": "猴", "五行": "水", "納音": "井泉水", "十二運": "水生", "自運": "自生", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "庚寅", "生肖2": "過樹之猴", "太歲": "方傑大將軍"},
        { "干支": "乙酉", "係數": 22, "生肖": "雞", "五行": "水", "納音": "井泉水", "十二運": "水敗", "自運": "自敗", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "辛卯", "生肖2": "唱午之雞", "太歲": "蔣崇大將軍"},
        { "干支": "丙戌", "係數": 23, "生肖": "狗", "五行": "土", "納音": "屋上土", "十二運": "土墓", "自運": "自墓", "干支關係": "干生支", "天干力度": -0.25, "地支力度": 0.3, "天剋地冲": "壬辰", "生肖2": "自眠之狗", "太歲": "白敏大將軍"},
        { "干支": "丁亥", "係數": 24, "生肖": "豬", "五行": "土", "納音": "屋上土", "十二運": "土絕", "自運": "自絕", "干支關係": "支剋干", "天干力度": -0.5, "地支力度": -0.25, "天剋地冲": "癸巳", "生肖2": "過山之豬", "太歲": "封濟大將軍"},
        { "干支": "戊子", "係數": 25, "生肖": "鼠", "五行": "火", "納音": "霹靂火", "十二運": "火胎", "自運": "自胎", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "甲午", "生肖2": "倉內之鼠", "太歲": "鄒鐺大將軍"},
        { "干支": "己丑", "係數": 26, "生肖": "牛", "五行": "火", "納音": "霹靂火", "十二運": "火養", "自運": "自養", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "乙未", "生肖2": "欄內之牛", "太歲": "傅佑大將軍"},
        { "干支": "庚寅", "係數": 27, "生肖": "虎", "五行": "木", "納音": "鬆柏木", "十二運": "木臨", "自運": "自臨", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "丙申", "生肖2": "出山之虎", "太歲": "鄔桓大將軍"},
        { "干支": "辛卯", "係數": 28, "生肖": "兔", "五行": "木", "納音": "鬆柏木", "十二運": "木旺", "自運": "自旺", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "丁酉", "生肖2": "蟾窟之兔", "太歲": "范甯大將軍"},
        { "干支": "壬辰", "係數": 29, "生肖": "龍", "五行": "水", "納音": "長流水", "十二運": "水墓", "自運": "自墓", "干支關係": "支剋干", "天干力度": -0.4, "地支力度": -0.3, "天剋地冲": "戊戌", "生肖2": "行雨之龍", "太歲": "彭泰大將軍"},
        { "干支": "癸巳", "係數": 30, "生肖": "蛇", "五行": "水", "納音": "長流水", "十二運": "水絕", "自運": "自絕", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "己亥", "生肖2": "草中之蛇", "太歲": "徐單大將軍"},
        { "干支": "甲午", "係數": 31, "生肖": "馬", "五行": "金", "納音": "沙中金", "十二運": "金敗", "自運": "自敗", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "庚子", "生肖2": "雲中之馬", "太歲": "章詞大將軍"},
        { "干支": "乙未", "係數": 32, "生肖": "羊", "五行": "金", "納音": "沙中金", "十二運": "金冠", "自運": "自冠", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.5, "天剋地冲": "辛丑", "生肖2": "敬重之羊", "太歲": "楊仙大將軍"},
        { "干支": "丙申", "係數": 33, "生肖": "猴", "五行": "火", "納音": "山下火", "十二運": "火病", "自運": "自病", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "壬寅", "生肖2": "山上之猴", "太歲": "管仲大將軍"},
        { "干支": "丁酉", "係數": 34, "生肖": "雞", "五行": "火", "納音": "山下火", "十二運": "火死", "自運": "自死", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "癸卯", "生肖2": "獨立之雞", "太歲": "唐傑大將軍"},
        { "干支": "戊戌", "係數": 35, "生肖": "狗", "五行": "木", "納音": "平地木", "十二運": "木養", "自運": "自養", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "甲辰", "生肖2": "進山之狗", "太歲": "姜武大將軍"},
        { "干支": "己亥", "係數": 36, "生肖": "豬", "五行": "木", "納音": "平地木", "十二運": "木生", "自運": "自生", "干支關係": "干剋支", "天干力度": -0.3, "地支力度": -0.45, "天剋地冲": "乙巳", "生肖2": "道院之豬", "太歲": "謝太大將軍"},
        { "干支": "庚子", "係數": 37, "生肖": "鼠", "五行": "土", "納音": "壁上土", "十二運": "土旺", "自運": "自旺", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "丙午", "生肖2": "梁上之鼠", "太歲": "盧秘大將軍"},
        { "干支": "辛丑", "係數": 38, "生肖": "牛", "五行": "土", "納音": "壁上土", "十二運": "土養", "自運": "自養", "干支關係": "支生干", "天干力度": 0.3, "地支力度": -0.3, "天剋地冲": "丁未", "生肖2": "路途之牛", "太歲": "楊信大將軍"},
        { "干支": "壬寅", "係數": 39, "生肖": "虎", "五行": "金", "納音": "金箔金", "十二運": "金絕", "自運": "自絕", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "戊申", "生肖2": "過林之虎", "太歲": "賀諤大將軍"},
        { "干支": "癸卯", "係數": 40, "生肖": "兔", "五行": "金", "納音": "金箔金", "十二運": "金胎", "自運": "自胎", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "己酉", "生肖2": "山林之兔", "太歲": "皮時大將軍"},
        { "干支": "甲辰", "係數": 41, "生肖": "龍", "五行": "火", "納音": "覆燈火", "十二運": "火冠", "自運": "自冠", "干支關係": "干剋支", "天干力度": 0, "地支力度": -0.7, "天剋地冲": "庚戌", "生肖2": "伏潭之龍", "太歲": "李誠大將軍"},
        { "干支": "乙巳", "係數": 42, "生肖": "蛇", "五行": "火", "納音": "覆燈火", "十二運": "火臨", "自運": "自臨", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "辛亥", "生肖2": "出穴之蛇", "太歲": "吳遂大將軍"},
        { "干支": "丙午", "係數": 43, "生肖": "馬", "五行": "水", "納音": "天河水", "十二運": "水胎", "自運": "自胎", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "壬子", "生肖2": "行路之馬", "太歲": "文哲大將軍"},
        { "干支": "丁未", "係數": 44, "生肖": "羊", "五行": "水", "納音": "天河水", "十二運": "水養", "自運": "自養", "干支關係": "干生支", "天干力度": 0, "地支力度": 0.3, "天剋地冲": "癸丑", "生肖2": "失群之羊", "太歲": "繆丙大將軍"},
        { "干支": "戊申", "係數": 45, "生肖": "猴", "五行": "土", "納音": "大驛土", "十二運": "土病", "自運": "自病", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "甲寅", "生肖2": "獨立之猴", "太歲": "徐浩大將軍"},
        { "干支": "己酉", "係數": 46, "生肖": "雞", "五行": "土", "納音": "大驛土", "十二運": "土死", "自運": "自死", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "乙卯", "生肖2": "報曉之雞", "太歲": "程寶大將軍"},
        { "干支": "庚戌", "係數": 47, "生肖": "狗", "五行": "金", "納音": "釵釧金", "十二運": "金衰", "自運": "自衰", "干支關係": "支生干", "天干力度": 0.3, "地支力度": -0.3, "天剋地冲": "丙辰", "生肖2": "寺觀之狗", "太歲": "倪秘大將軍"},
        { "干支": "辛亥", "係數": 48, "生肖": "豬", "五行": "金", "納音": "釵釧金", "十二運": "金病", "自運": "自病", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "丁巳", "生肖2": "圈裡之豬", "太歲": "葉堅大將軍"},
        { "干支": "壬子", "係數": 49, "生肖": "鼠", "五行": "木", "納音": "桑拓木", "十二運": "木敗", "自運": "自敗", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "戊午", "生肖2": "山上之鼠", "太歲": "丘德大將軍"},
        { "干支": "癸丑", "係數": 50, "生肖": "牛", "五行": "木", "納音": "桑拓木", "十二運": "木冠", "自運": "自冠", "干支關係": "支剋干", "天干力度": -0.4, "地支力度": -0.3, "天剋地冲": "己未", "生肖2": "欄內之牛", "太歲": "朱得大將軍"},
        { "干支": "甲寅", "係數": 51, "生肖": "虎", "五行": "水", "納音": "大溪水", "十二運": "水病", "自運": "自病", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "庚申", "生肖2": "立定之虎", "太歲": "張朝大將軍"},
        { "干支": "乙卯", "係數": 52, "生肖": "兔", "五行": "水", "納音": "大溪水", "十二運": "水死", "自運": "自死", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "辛酉", "生肖2": "得道之兔", "太歲": "萬清大將軍"},
        { "干支": "丙辰", "係數": 53, "生肖": "龍", "五行": "土", "納音": "沙中土", "十二運": "土冠", "自運": "自冠", "干支關係": "干生支", "天干力度": -0.3, "地支力度": 0.3, "天剋地冲": "壬戌", "生肖2": "天上之龍", "太歲": "辛亞大將軍"},
        { "干支": "丁巳", "係數": 54, "生肖": "蛇", "五行": "土", "納音": "沙中土", "十二運": "土臨", "自運": "自臨", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "癸亥", "生肖2": "塘內之蛇", "太歲": "楊彥大將軍"},
        { "干支": "戊午", "係數": 55, "生肖": "馬", "五行": "火", "納音": "天上火", "十二運": "火旺", "自運": "自旺", "干支關係": "支生干", "天干力度": 0.3, "地支力度": -0.3, "天剋地冲": "甲子", "生肖2": "廊內之馬", "太歲": "黎卿大將軍"},
        { "干支": "己未", "係數": 56, "生肖": "羊", "五行": "火", "納音": "天上火", "十二運": "火衰", "自運": "自衰", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "乙丑", "生肖2": "草野之羊", "太歲": "傅黨大將軍"},
        { "干支": "庚申", "係數": 57, "生肖": "猴", "五行": "木", "納音": "石榴木", "十二運": "木絕", "自運": "自絕", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "丙寅", "生肖2": "食果之猴", "太歲": "毛梓大將軍"},
        { "干支": "辛酉", "係數": 58, "生肖": "雞", "五行": "木", "納音": "石榴木", "十二運": "木胎", "自運": "自胎", "干支關係": "專氣", "天干力度": 0.5, "地支力度": 0.5, "天剋地冲": "丁卯", "生肖2": "籠內之雞", "太歲": "石政大將軍"},
        { "干支": "壬戌", "係數": 59, "生肖": "狗", "五行": "水", "納音": "大海水", "十二運": "水冠", "自運": "自冠", "干支關係": "支剋干", "天干力度": -0.4, "地支力度": -0.3, "天剋地冲": "戊辰", "生肖2": "顧家之狗", "太歲": "洪充大將軍"}
    ];
	
    switch (選項) {
        case 1: case "干支":
            return 六十干支[干支數].干支;
        case 2: case "五行":
            return 六十干支[干支數].五行;
        case 3: case "納音":
            return 六十干支[干支數].納音;
        case 4: case "太歲":
            return 六十干支[干支數].太歲;
        case 5: case "干支關係":
            return 六十干支[干支數].干支關係;
        case 6: case "天干力度":
            return 六十干支[干支數].天干力度;
        case 7: case "地支力度":
            return 六十干支[干支數].地支力度;
        case 8: case "天剋地冲":
            return 六十干支[干支數].天剋地冲;
        case 9: case "生肖":
            return 六十干支[干支數].生肖;
        case 10: case "生肖2":
            return 六十干支[干支數].生肖2;
        default:
            alert(選項 + "：六十干支屬性 function 選項輸入錯誤！！");
            return "";
    }
}

function 干支相合(干支){
    switch(干支){
        case "甲午":
            return "干支合,土,甲午,甲己";
        case "乙巳":
            return "干支合,金,乙巳,乙庚";
        case "丙戌":
            return "干支合,水,丙戌,丙辛";
        case "丁亥":
            return "干支合,木,丁亥,丁壬";
        case "戊子":
            return "干支合,火,戊子,戊癸";
        case "戊辰":
            return "干支合,火,戊辰,戊癸";
        case "己亥":
            return "干支合,土,己亥,己甲";
        case "庚辰":
            return "干支合,金,庚辰,庚乙";
        case "辛巳":
            return "干支合,水,辛巳,辛丙";
        case "壬午":
            return "干支合,木,壬午,壬丁";
        case "壬戌":
            return "干支合,木,壬戌,壬丁";
        case "癸巳":
            return "干支合,火,癸巳,癸戊";
        default:
            return "";
           
    }
}


function 節氣字轉值(節氣) {
    /*    if (isNaN(干支值)) 干支數 = 六十干支字轉值(干支值); else 干支數=干支值;
    if (干支數<0 || 干支數>59 || 干支數 === undefined){
        alert(干支值 + "：六十干支屬性 function 輸入的干支值 錯誤！");
        return "";
    }
    */
    switch (節氣) {
        case "立春": return 0;
        case "雨水": return 1;
        case "驚蟄": return 2;
        case "春分": return 3;
        case "清明": return 4;
        case "穀雨": return 5;
        case "立夏": return 6;
        case "小滿": return 7;
        case "芒種": return 8;
        case "夏至": return 9;
        case "小暑": return 10;
        case "大暑": return 11;
        case "立秋": return 12;
        case "處暑": return 13;
        case "白露": return 14;
        case "秋分": return 15;
        case "寒露": return 16;
        case "霜降": return 17;
        case "立冬": return 18;
        case "小雪": return 19;
        case "大雪": return 20;
        case "冬至": return 21;
        case "小寒": return 22;
        case "大寒": return 23;
        default:
            alert(節氣+"：節氣名稱 出現錯誤");
    }
}

function 二十四節氣屬性(節氣, 選項) {
    var 節氣值 = 節氣字轉值(節氣);

    var 節氣資料 = [
        { "節氣": "立春", "農曆": "正月節", "黃經": "315", "四季": "春季", "三候": "立春之日東風解凍，又五日蟄蟲始振，又五日魚上冰（魚陟負冰）。", "註解1": "立是開始的意思，立春就是春季的開始。", "英文註解": "Spring begins", "氣候": "開始進入春天，萬物復蘇。"},
        { "節氣": "雨水", "農曆": "正月中", "黃經": "330", "四季": "春季", "三候": "雨水之日獺祭魚，又五日鴻雁來（候雁北），又五日草木萌動。", "註解1": "降雨開始，雨量漸增。", "英文註解": "The rains", "氣候": "這時春風遍吹，天氣漸暖，冰雪溶化，空氣濕潤，雨水增多。"},
        { "節氣": "驚蟄", "農曆": "二月節", "黃經": "345", "四季": "春季", "三候": "驚蟄之日桃始華，又五日倉庚鳴，又五日鷹化為鳩。", "註解1": "蟄是藏的意思。驚蟄指春雷乍動，驚醒了蟄伏在土中冬眠的動物。", "英文註解": "Insects awaken", "氣候": "天氣轉暖，春雷震響，蟄伏在泥土裏的各種冬眠動物蘇醒過來及開始活動，大部分地區進入春耕。"},
        { "節氣": "春分", "農曆": "二月中", "黃經": "0", "四季": "春季", "三候": "春分之日玄鳥至，又五日雷乃發聲，又五日始電。", "註解1": "分是平分的意思。春分表示晝夜平分。", "英文註解": "Vernal equinox", "氣候": "大部分地區越冬作物進入春季生長階段。"},
        { "節氣": "清明", "農曆": "三月節", "黃經": "15", "四季": "春季", "三候": "清明之日桐始華，又五日田鼠化為鴽，又五日虹始見。", "註解1": "天氣晴朗，草木繁茂。", "英文註解": "Clear and bright", "氣候": "天氣晴朗溫暖，草木始發新枝芽，萬物開始生長。"},
        { "節氣": "穀雨", "農曆": "三月中", "黃經": "30", "四季": "春季", "三候": "谷雨之日萍始生，又五日鳴鳩拂其羽，又五日戴勝降於桑。", "註解1": "雨生百谷。雨量充足而及時，谷類作物能茁壯成長。", "英文註解": "Grain rain", "氣候": "天氣較暖，雨量增加，因為有雨水滋潤，是大地春耕作物播種的好季節。"},
        { "節氣": "立夏", "農曆": "四月節", "黃經": "45", "四季": "夏季", "三候": "立夏之日螻蟈鳴，又五日蚯蚓出，又五日王瓜生。", "註解1": "夏季的開始。", "英文註解": "Summer begins.", "氣候": "夏天開始，雨水增多，農作物生長漸旺。"},
        { "節氣": "小滿", "農曆": "四月中", "黃經": "60", "四季": "夏季", "三候": "小滿之日苦菜秀，又五日靡草死，又五日小暑至（麥秋生，麥秋至）。", "註解1": "麥類等夏熟作物籽粒開始飽滿。", "英文註解": "Grain buds", "氣候": "夏收的農作物已經結果、籽粒飽滿，但尚未成熟，所以叫小滿。"},
        { "節氣": "芒種", "農曆": "五月節", "黃經": "75", "四季": "夏季", "三候": "芒種之日螳螂生，又五日鵙始鳴，又五日反舌無聲。", "註解1": "麥類等有芒作物成熟。", "英文註解": "Grain in ear", "氣候": "芒種表明小麥等有芒作物成熟，宜開始秋播。某些地區開始連綿陰雨。"},
        { "節氣": "夏至", "農曆": "五月中", "黃經": "90", "四季": "夏季", "三候": "夏至之日鹿角解，又五日蜩始鳴，又五日半夏生。", "註解1": "炎熱的夏天來臨。", "英文註解": "Summer solstice", "氣候": "進入炎熱季節，萬物生長最旺盛，雜草害蟲也迅速滋長。"},
        { "節氣": "小暑", "農曆": "六月節", "黃經": "105", "四季": "夏季", "三候": "小暑之日溫風至，又五日蟋蟀居壁，又五日鷹乃學習（鷹始擊）。", "註解1": "暑是炎熱的意思。小暑就是氣候開始炎熱。", "英文註解": "Slight heat", "氣候": "正值初伏前後，天氣很熱但尚未酷熱。"},
        { "節氣": "大暑", "農曆": "六月中", "黃經": "120", "四季": "夏季", "三候": "大暑之日腐草為螢，又五日土潤溽暑，又五日大雨時行。", "註解1": "一年中最熱的時候。", "英文註解": "Great heat", "氣候": "正值中伏前後，一年最炎熱時期，喜溫作物迅速生長；雨水甚多。"},
        { "節氣": "立秋", "農曆": "七月節", "黃經": "135", "四季": "秋季", "三候": "立秋之日涼風至，又五日白露降，又五日寒蟬鳴。", "註解1": "秋季的開始。", "英文註解": "Autumn begins", "氣候": "秋天開始，氣溫逐漸下降；早稻收割，晚稻開始移栽。"},
        { "節氣": "處暑", "農曆": "七月中", "黃經": "150", "四季": "秋季", "三候": "處暑之日鷹乃祭鳥，又五日天地始肅，又五日禾乃登。", "註解1": "處是終止、躲藏的意思。處暑是表示炎熱的暑天結束。", "英文註解": "Stopping the heat", "氣候": "氣候變涼的象徵，表示暑天終止，夏季火熱已經到了盡頭。"},
        { "節氣": "白露", "農曆": "八月節", "黃經": "165", "四季": "秋季", "三候": "白露之日鴻雁來，又五日玄鳥歸，又五日群鳥養羞。", "註解1": "天氣轉涼，露凝而白。", "英文註解": "White dews", "氣候": "天氣轉涼，地面水汽結露。"},
        { "節氣": "秋分", "農曆": "八月中", "黃經": "180", "四季": "秋季", "三候": "秋分之日雷始收聲，又五日蟄蟲培坯戶，又五日水始涸。", "註解1": "晝夜平分。", "英文註解": "Autumnal equinox", "氣候": "北半球晝短夜長的現象將越來越明顯，白天逐漸變短；晝夜溫差逐漸加大，氣溫逐日下降，一天比一天冷，逐漸步入深秋季節。"},
        { "節氣": "寒露", "農曆": "九月節", "黃經": "195", "四季": "秋季", "三候": "寒露之日鴻雁來賓，又五日雀入大水為蛤，又五日菊有黃華。", "註解1": "露水以寒，將要結冰。", "英文註解": "Cold dews", "氣候": "天氣轉涼，露水日多。"},
        { "節氣": "霜降", "農曆": "九月中", "黃經": "210", "四季": "秋季", "三候": "霜降之日豺乃祭獸，又五日草木黃落，又五日蟄蟲咸俯。", "註解1": "天氣漸冷，開始有霜。", "英文註解": "Hoar-frost falls", "氣候": "天氣已冷，開始有霜凍，所以叫霜降。"},
        { "節氣": "立冬", "農曆": "十月節", "黃經": "225", "四季": "冬季", "三候": "立冬之日水始冰，又五日地始凍，又五日雉入大水為蜃。", "註解1": "冬季的開始。", "英文註解": "Winter begins", "氣候": "進入冬季，作物收割之後要收藏起來。"},
        { "節氣": "小雪", "農曆": "十月中", "黃經": "240", "四季": "冬季", "三候": "小雪之日虹藏不見，又五日天氣上騰地氣下降，又五日閉塞而成冬。", "註解1": "開始下雪。", "英文註解": "Light snow", "氣候": "氣溫下降，黃河流域開始降雪；北方已進入封凍季節。"},
        { "節氣": "大雪", "農曆": "十一月節", "黃經": "255", "四季": "冬季", "三候": "大雪之日鶡旦不鳴，又五日虎始交，又五日荔挺生（荔挺出）。", "註解1": "降雪量增多，地面可能積雪。", "英文註解": "Heavy snow", "氣候": "天氣更越來越冷，下雪量大，範圍也廣，故名大雪。"},
        { "節氣": "冬至", "農曆": "十一月中", "黃經": "270", "四季": "冬季", "三候": "冬至之日蚯蚓結，又五日麋角解，又五日水泉動。", "註解1": "寒冷的冬天來臨。", "英文註解": "Winter solstice", "氣候": "冬天來臨，過了冬至，白晝一天比一天長，陽氣回升，是一個節氣迴圈的開始"},
        { "節氣": "小寒", "農曆": "十二月節", "黃經": "285", "四季": "冬季", "三候": "小寒之日雁北鄉，又五日鵲始巢，又五日雉始鴝（雉始雊）。", "註解1": "氣候開始寒冷。", "英文註解": "Slight cold", "氣候": "開始進入寒冷季節。冷氣積久而寒，大部分地區進入嚴寒時期。"},
        { "節氣": "大寒", "農曆": "十二月中", "黃經": "300", "四季": "冬季", "三候": "大寒之日雞始乳，又五日鷲鳥厲疾（征鳥厲疾），又五日水澤腹堅。", "註解1": "一年中最冷的時候。", "英文註解": "Great cold", "氣候": "大寒就是天氣寒冷到了極點的意思。大寒前後是一年中最冷的時候。"}
    ];

    var 資料索引=_.findIndex(節氣資料, {節氣: 節氣});
    
    if (資料索引 != -1) {
        switch (選項) {
            case 1: case "黃經":
                return 節氣資料[資料索引].黃經;
               
            case 2: case "四季":
                return 節氣資料[資料索引].四季;
               
            case 3: case "三候":
                return 節氣資料[資料索引].三候;
               
            case 4: case "英文":
                return 節氣資料[資料索引].英文註解;
               
            case 5: case "氣候":
                return 節氣資料[資料索引].氣候;
               
            default:
                alert("二十四節氣 選項輸入錯誤");
        }
        //var 資料註解 = 節氣資料[資料索引].註解;
	    //return 資料註解;
	}
}

// ***************************** 尋 命宮、身宮、胎元 *******************************
function 尋命宮(年干, 農曆月數, 時支, 節氣數, 計算模式) {
    //若問命主何命宮,子起正月逆查行。生月支上起生時,順查至卯是命宮。生月天干兩頭查,順逆宮支天干停。
    // 命宮計算的另一個模式是以生月中氣為月支的計算標準，比方過了雨水才是一月
    // 計算模式：節、氣，設置要以生月節還是中氣為計算命盤的標準

    if(計算模式==undefined) 計算模式="節";
    var 時支數 = 地支字轉值(時支);
    var 逆數月數, 命宮地支數, 時轉數;
    var 命宮起支;  //中氣計算採用

    if(時支=="-" || 時支=="") return "";  //如果沒有輸入時支，就沒有命宮
    
    switch(計算模式){
        case "節":
            逆數月數=(-1)*(農曆月數-1);
            命宮地支數 = 地支滾動(1, 逆數月數); //正月子宮開始, 逆數生月
            時轉數 = ((4 - 時支數) >= 0) ? 4 - 時支數 : 4 - 時支數 + 12; //從生時, 順數到卯時
            命宮地支數 = 地支滾動(命宮地支數, 時轉數); //從生月位置, 順數生時到卯時
            break;
        case "氣": case "中氣":
            switch(節氣數){
                case 23: case 0:  //大寒、立春
                    命宮起支=5;   //辰
                    break;
                case 1: case 2:  //雨水、驚蟄
                    命宮起支=4;  //卯
                    break;                
                case 3: case 4:  //春分、清明
                    命宮起支=3;
                    break;
                case 5: case 6:  //穀雨、立夏
                    命宮起支=2;
                    break;
                case 7: case 8:  //小滿、芒種
                    命宮起支=1;
                    break;
                case 9: case 10:  //夏至、小暑
                    命宮起支=0;
                    break;
                case 11: case 12:  //大暑、立秋
                    命宮起支=11;
                    break;
                case 13: case 14:  //處暑、白露
                    命宮起支=10;
                    break;
                case 15: case 16:  //秋分、寒露
                    命宮起支=9;
                    break;
                case 17: case 18:  //霜降、立冬
                    命宮起支=8;
                    break;
                case 19: case 20:  //小雪、大雪
                    命宮起支=7;
                    break;
                case 21: case 22:  //冬至、小寒
                    命宮起支=6;
                    break;
				default:
					alert("農曆月數：" + 農曆月數 + "，" + "時：" + 時支 + "節氣數：" + 節氣數 + "，命宮地支：" + 命宮起支);
            }  // end switch 節氣數
            命宮地支數 = 地支滾動(命宮起支, (-1)* 時支數);
            break;

    }
    var 命宮地支=地支數轉字(命宮地支數);
    var 命宮 = 月柱判斷(年干, 命宮地支); //月柱判斷就是五虎遁, function at 曆法.js
    return 命宮;
}

function 尋身宮(年干, 農曆月數, 時支) {
    //身宮口訣記心中,子起正月順查行。生月支上起生時,逆推到酉知身宮。月建天干兩頭數,順推逆推干五行。
    // function 計算不以歌訣, 對照身宮速查表
    var 身宮地支數 = 地支滾動(3, 農曆月數-1); //寅宮起正月, 順數
    var 時支數 = 地支字轉值(時支);
    var 生月子時起數=地支滾動(4, 農曆月數-1); //正月卯宮起子時, 順數
    身宮地支數 = 地支滾動(生月子時起數, 時支數-1); //從生月子時起數, 順數生時
    var 身宮地支=地支數轉字(身宮地支數);

    var 身宮 = 月柱判斷(年干, 身宮地支); //月柱判斷就是五虎遁, function at 曆法.js
    return 身宮;
}

function 尋胎元(農曆生月干支) {
    // 尋胎元的方法,月柱天干數+1,地支數+3
    // 胎元'生'命為吉,剋命不利。既胎元的納音屬性與年柱的納音屬性相生為吉,相剋不吉。胎元干支與時柱的納音相生,則長壽,如果與刑冲剋害,則壽短,胎元臨帝旺,必然高壽。
    var 月柱天干數 = 天干字轉值(農曆生月干支.substr(0, 1));
    var 月柱地支數 = 地支字轉值(農曆生月干支.substr(1, 1));
    var 胎元 = 天干數轉字(天干滾動(月柱天干數, 1)) + 地支數轉字(地支滾動(月柱地支數, 3));
    return 胎元;
}

function 尋胎息(日柱) {
    // 以日柱干支為基準,取與日柱干支相合者（天干五合,地支六合）之干支,即為「胎息」。例如：辛巳日生人,息元便是丙申矣
    return 天干生剋合(日柱.substr(0, 1), "合") + 地支六合冲害破(日柱.substr(1, 1), "六合");
}


function 尋陽男陰女(性別, 年支) {
    var 性別陰陽;

    switch (年支) {
        case "子": case "寅": case "辰": case "午": case "申": case "戌":
            if (性別 == "男") { 性別陰陽 = "陽男"; }
            if (性別 == "女") { 性別陰陽 = "陽女"; }
            break;
        case "丑": case "卯": case "巳": case "未": case "酉": case "亥":
            if (性別 == "男") { 性別陰陽 = "陰男"; }
            if (性別 == "女") { 性別陰陽 = "陰女"; }
            break;
    }
    return 性別陰陽;
}

    
// ******************** jQuery & CSS Functions **********************
function 干支五行字體顏色(干支五行, 選項){
    var CSS, ColorCode;
    
        switch(干支五行){
            case "木": case "甲": case "乙": case "寅": case "卯":
                CSS = "五行顏色木";
                ColorCode="#009900";
                ColorLight="#98FB98";
                ColorMedium="#32CD32";
                ColorAlt="#00FA9A";
                break;
            case "火": case "丙": case "丁": case "巳": case "午":
                CSS = "五行顏色火";
                ColorCode="#CC0000";
                ColorLight="#FFDDDD"; //wave
                ColorMedium="#FF4444"; //text color
                ColorAlt="#FFAAAA"; //wave text color
                break;
            case "土": case "戊": case "己": case "丑": case "辰": case "未": case "戌":
                CSS = "五行顏色土";
                ColorCode="#663300";
                ColorLight="#DEB887";
                ColorMedium="#B8860B";
                ColorAlt="#CD853F";
                break;
            case "金": case "庚": case "辛": case "申": case "酉":
                CSS = "五行顏色金";
                ColorCode="#FF9900";
                ColorLight="#F5DEB3";
                ColorMedium="#FFA500";
                ColorAlt="#FFD700";
                break;
            case "水": case "壬": case "癸": case "亥": case "子":
                CSS = "五行顏色水";
                ColorCode="#0066FF";
                ColorLight="#ADD8E6";
                ColorMedium="#00FFFF";
                ColorAlt="#E0FFFF";
                break;
            //default:
            //    alert(干支五行 + "：干支五行字體顏色 function 的 干支五行 輸入錯誤 ！");
            //    return "";
        }
        
        switch(選項){
            case "CSS" :
                return CSS;
            case "ColorCode":
                return ColorCode;
            case "ColorLight":
                return ColorLight;
            case "ColorMedium":
                return ColorMedium;
            case "ColorAlt":
                return ColorAlt;
            default:
                alert(選項 + "：干支五行字體顏色 function 的 選項 輸入錯誤 ！");
                return "";
        }  
}

// ****************************** *******************************

function 日干月令對照(日主,月令,選項){
	var 旺相休囚死;

	switch(日主){
	    case "甲":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="旺";
	                break;
	            case "卯":
	                旺相休囚死="旺";
	                break;
	            case "辰":
	                旺相休囚死="囚";
	                break;
	            case "巳":
	                旺相休囚死="休";
	                break;
	            case "午":
	                旺相休囚死="休";
	                break;
	            case "未":
	                旺相休囚死="囚";
	                break;
	            case "申":
	                旺相休囚死="死";
	                break;
	            case "酉":
	                旺相休囚死="死";
	                break;
	            case "戌":
	                旺相休囚死="囚";
	                break;
	            case "亥":
	                旺相休囚死="相";
	                break;
	            case "子":
	                旺相休囚死="相";
	                break;
	            case "丑":
	                旺相休囚死="囚";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
	        break;
		case "乙":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="旺";
	                break;
	            case "卯":
	                旺相休囚死="旺";
	                break;
	            case "辰":
	                旺相休囚死="囚";
	                break;
	            case "巳":
	                旺相休囚死="休";
	                break;
	            case "午":
	                旺相休囚死="休";
	                break;
	            case "未":
	                旺相休囚死="囚";
	                break;
	            case "申":
	                旺相休囚死="死";
	                break;
	            case "酉":
	                旺相休囚死="死";
	                break;
	            case "戌":
	                旺相休囚死="囚";
	                break;
	            case "亥":
	                旺相休囚死="相";
	                break;
	            case "子":
	                旺相休囚死="相";
	                break;
	            case "丑":
	                旺相休囚死="囚";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "丙":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="相";
	                break;
	            case "卯":
	                旺相休囚死="相";
	                break;
	            case "辰":
	                旺相休囚死="休";
	                break;
	            case "巳":
	                旺相休囚死="旺";
	                break;
	            case "午":
	                旺相休囚死="旺";
	                break;
	            case "未":
	                旺相休囚死="休";
	                break;
	            case "申":
	                旺相休囚死="囚";
	                break;
	            case "酉":
	                旺相休囚死="囚";
	                break;
	            case "戌":
	                旺相休囚死="休";
	                break;
	            case "亥":
	                旺相休囚死="死";
	                break;
	            case "子":
	                旺相休囚死="死";
	                break;
	            case "丑":
	                旺相休囚死="休";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "丁":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="相";
	                break;
	            case "卯":
	                旺相休囚死="相";
	                break;
	            case "辰":
	                旺相休囚死="休";
	                break;
	            case "巳":
	                旺相休囚死="旺";
	                break;
	            case "午":
	                旺相休囚死="旺";
	                break;
	            case "未":
	                旺相休囚死="休";
	                break;
	            case "申":
	                旺相休囚死="囚";
	                break;
	            case "酉":
	                旺相休囚死="囚";
	                break;
	            case "戌":
	                旺相休囚死="休";
	                break;
	            case "亥":
	                旺相休囚死="死";
	                break;
	            case "子":
	                旺相休囚死="死";
	                break;
	            case "丑":
	                旺相休囚死="休";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "戊":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="死";
	                break;
	            case "卯":
	                旺相休囚死="死";
	                break;
	            case "辰":
	                旺相休囚死="旺";
	                break;
	            case "巳":
	                旺相休囚死="相";
	                break;
	            case "午":
	                旺相休囚死="相";
	                break;
	            case "未":
	                旺相休囚死="旺";
	                break;
	            case "申":
	                旺相休囚死="休";
	                break;
	            case "酉":
	                旺相休囚死="休";
	                break;
	            case "戌":
	                旺相休囚死="旺";
	                break;
	            case "亥":
	                旺相休囚死="囚";
	                break;
	            case "子":
	                旺相休囚死="囚";
	                break;
	            case "丑":
	                旺相休囚死="旺";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "己":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="死";
	                break;
	            case "卯":
	                旺相休囚死="死";
	                break;
	            case "辰":
	                旺相休囚死="旺";
	                break;
	            case "巳":
	                旺相休囚死="相";
	                break;
	            case "午":
	                旺相休囚死="相";
	                break;
	            case "未":
	                旺相休囚死="旺";
	                break;
	            case "申":
	                旺相休囚死="休";
	                break;
	            case "酉":
	                旺相休囚死="休";
	                break;
	            case "戌":
	                旺相休囚死="旺";
	                break;
	            case "亥":
	                旺相休囚死="囚";
	                break;
	            case "子":
	                旺相休囚死="囚";
	                break;
	            case "丑":
	                旺相休囚死="旺";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "庚":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="囚";
	                break;
	            case "卯":
	                旺相休囚死="囚";
	                break;
	            case "辰":
	                旺相休囚死="相";
	                break;
	            case "巳":
	                旺相休囚死="死";
	                break;
	            case "午":
	                旺相休囚死="死";
	                break;
	            case "未":
	                旺相休囚死="相";
	                break;
	            case "申":
	                旺相休囚死="旺";
	                break;
	            case "酉":
	                旺相休囚死="旺";
	                break;
	            case "戌":
	                旺相休囚死="相";
	                break;
	            case "亥":
	                旺相休囚死="休";
	                break;
	            case "子":
	                旺相休囚死="休";
	                break;
	            case "丑":
	                旺相休囚死="相";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "辛":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="囚";
	                break;
	            case "卯":
	                旺相休囚死="囚";
	                break;
	            case "辰":
	                旺相休囚死="相";
	                break;
	            case "巳":
	                旺相休囚死="死";
	                break;
	            case "午":
	                旺相休囚死="死";
	                break;
	            case "未":
	                旺相休囚死="相";
	                break;
	            case "申":
	                旺相休囚死="旺";
	                break;
	            case "酉":
	                旺相休囚死="旺";
	                break;
	            case "戌":
	                旺相休囚死="相";
	                break;
	            case "亥":
	                旺相休囚死="休";
	                break;
	            case "子":
	                旺相休囚死="休";
	                break;
	            case "丑":
	                旺相休囚死="相";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "壬":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="休";
	                break;
	            case "卯":
	                旺相休囚死="休";
	                break;
	            case "辰":
	                旺相休囚死="死";
	                break;
	            case "巳":
	                旺相休囚死="囚";
	                break;
	            case "午":
	                旺相休囚死="囚";
	                break;
	            case "未":
	                旺相休囚死="死";
	                break;
	            case "申":
	                旺相休囚死="相";
	                break;
	            case "酉":
	                旺相休囚死="相";
	                break;
	            case "戌":
	                旺相休囚死="死";
	                break;
	            case "亥":
	                旺相休囚死="旺";
	                break;
	            case "子":
	                旺相休囚死="旺";
	                break;
	            case "丑":
	                旺相休囚死="死";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
		case "癸":
	        switch (月令) {
	            case "寅":
	                旺相休囚死="休";
	                break;
	            case "卯":
	                旺相休囚死="休";
	                break;
	            case "辰":
	                旺相休囚死="死";
	                break;
	            case "巳":
	                旺相休囚死="囚";
	                break;
	            case "午":
	                旺相休囚死="囚";
	                break;
	            case "未":
	                旺相休囚死="死";
	                break;
	            case "申":
	                旺相休囚死="相";
	                break;
	            case "酉":
	                旺相休囚死="相";
	                break;
	            case "戌":
	                旺相休囚死="死";
	                break;
	            case "亥":
	                旺相休囚死="旺";
	                break;
	            case "子":
	                旺相休囚死="旺";
	                break;
	            case "丑":
	                旺相休囚死="死";
	                break;
                default:
                    alert(月令+"：日干月令對照 function, 月令輸入錯誤！");
	        }
            break;
        default:
            alert(日主+"：日干月令對照 function, 日干輸入錯誤！");
            break;
    } // end of 日干 switch

    switch(選項){
        case "旺相休囚死":
            return 旺相休囚死;
        default:
            alert(選項+"：日干月令對照 function, 選項輸入錯誤！");
    }
}


function 旺相休囚死字數轉換(令){
    var 輸入數字=(isNaN(令))? "字" : "數";  //輸入的是數還是字

    switch(輸入數字){
        case "字":
            switch(令){
                case "旺": return 5;
                case "相": return 4;
                case "休": return 3;
                case "囚": return 2;
                case "死": return 1;
                default:
                    alert(令+"：旺相休囚死字數轉換 錯誤");
                    return "";
            }
        break;
        case "數":
            switch(令){
                case 5: return "旺";
                case 4: return "相";
                case 3: return "休";
                case 2: return "囚";
                case 1: return "死";
                default:
                    alert(令+"：旺相休囚死字數轉換 錯誤");
                    return "";
            }        

    }
}



//----------------------
function 量規更新數據(){
    return 99;
}