
function 干支五行十神力度分析(命盤){
	
	// 1. ----- 計算天干、地支的個別力度 -------
	$("#nrxs-天干力度表").html(天干力度分析(命盤));
	$("#nrxs-地支力度表").html(地支力度分析(命盤));
    var 五行合化分析=五行合化力度分析(命盤);
	if(五行合化分析!="") $("#nrxs-合化力度表").html(五行合化分析);
	// 2. ----- 計算五行的力度----------------
    $("#nrxs-五行力度總結").html("<br>"+五行力量分佈總結計算(命盤));
	
	十神力度分析(命盤);  //十干五行分析
	
    //clone 五行elements into array form
    命盤.分析.陰陽五行.數據[0]= (JSON.parse(JSON.stringify(命盤.分析.陰陽五行.木)));
    命盤.分析.陰陽五行.數據[1]= (JSON.parse(JSON.stringify(命盤.分析.陰陽五行.火)));
    命盤.分析.陰陽五行.數據[2]= (JSON.parse(JSON.stringify(命盤.分析.陰陽五行.土)));
    命盤.分析.陰陽五行.數據[3]= (JSON.parse(JSON.stringify(命盤.分析.陰陽五行.金)));
    命盤.分析.陰陽五行.數據[4]= (JSON.parse(JSON.stringify(命盤.分析.陰陽五行.水)));
    
	五行力量排列(命盤);
    五行強弱等級(命盤);
    日主強弱分析(命盤);
    五行具足(命盤);

    $("#nrxs-五行論斷").html(日主五行基本分析(命盤));
 
    五行圖表分析(命盤);    
    十神圖表分析(命盤);
}

function 日主五行基本分析(命盤){
    var 五行論斷矩陣=[];

    var 論斷項目='<span class = "論斷單元">五行基本分析</span><br>';
    
    五行論斷矩陣.push(五行個性(命盤)+"<br>");
    
    四時調候(命盤.日主五行, 命盤.生日.四季, 命盤);
	窮通寶鑑五行四時(命盤.日主五行, 命盤.生日.四季, 命盤);
    三命通會五行月令宜忌(命盤.日主五行, 命盤.月令, 命盤);
	千里命稿五行分類四季喜忌(命盤.日主五行,命盤);

    var 韋千里八字提要論斷 = 韋千里八字提要(命盤.日干.天干 + 命盤.月支.地支 + 命盤.時柱.干支);
    //if(韋千里八字提要論斷 != "") 五行論斷矩陣.push(韋千里八字提要論斷);

    var 三命通會日柱生時論斷 = 三命通會日柱生時(命盤.日柱.干支 + 命盤.時柱.干支);
    //if(三命通會日柱生時論斷 != "") 五行論斷矩陣.push(三命通會日柱生時論斷);

    $("#nrxs-八字提要與三命日時").html(韋千里八字提要論斷+"<br><br>"+三命通會日柱生時論斷);

    $("#nrxs-五行喜忌表").html(五行喜忌總結(命盤));

    var 五行疾病論斷=五行疾病(命盤);
    if(五行疾病論斷 != "") 五行論斷矩陣.push(五行疾病論斷);


	//var 開運喜忌=五行開運(命盤);
	//if(開運喜忌 != "") $("#nrxs-五行開運").html(開運喜忌);

/*
	var 韋千里八字提要論斷 = 韋千里八字提要(命盤.日干.天干 + 命盤.月支.地支 + 命盤.時柱.干支);
	if(韋千里八字提要論斷 != "") 五行論斷矩陣.push(韋千里八字提要論斷);

	var 三命通會日柱生時論斷 = 三命通會日柱生時(命盤.日柱.干支 + 命盤.時柱.干支);
	if(三命通會日柱生時論斷 != "") 五行論斷矩陣.push(三命通會日柱生時論斷);
*/
    //$("#nrxs-窮通寶鑑").html(窮通寶鑑(命盤.月支.地支 + "月" + 命盤.日干.天干));

    return 論斷項目 + 五行論斷矩陣.join("<br><br>")+"<br><br>";
}

function 五行個性(命盤){
	var 個性矩陣=[];

	switch(命盤.日主五行){
		case "木":
			個性矩陣.push("<span class = '經典古文'>《淵海子平 - 論性情》木曰曲直，味酸主仁，惻隱之心，慈祥愷悌，濟物利民，恤孤念寡，恬靜清高。人物清秀體長，面色青白，故云木盛多仁。太過則折，執拗性偏。不及少仁，心生妒意。</span><br>");

			if(命盤.日主=="甲") 個性矩陣.push("陽木（甲）性質而有仁心，柔順而愛好和平，且有向上發展的上進心，心地仁慈而正直富有側隱之心，好華美的事物而有風雅的性格，有照顧他人之美德，無論進退皆有情有義，處事負責，但缺乏敏捷應變的能力，又因常煩惱，故做事多勞苦。<br>");
			if(命盤.日主=="乙") 個性矩陣.push("陰木（乙）性柔順，慈愛而喜行善事、有利人益我之仁心，且有同情心，性情和藹，善與人結交朋友，外表謙虛，但內心的佔有欲望強，雖有才能，但常煩心。<br>");

			if(命盤.分析.陰陽五行.木.力量形態數 >=5 && 命盤.分析.陰陽五行.木.力量形態數 <=6) 個性矩陣.push("木性調和旺相者，性格上有定見有主見、肯接受他人意見作理智分析，穩重敦厚而富有博愛惻隱之心，慈祥愷悌之意，濟物利人，喜歡説明貧苦孤寡之人，直爽樸實而清高，並主其人好仁，嫉惡如仇，有崇高之道德觀念，舉止端莊秀麗，壽命長且宅心仁厚，精神瀟灑，福源深廣，老尤健康，一生多愉快佳境。<br>");
			if(命盤.分析.陰陽五行.木.力量形態數 >=7) 個性矩陣.push("木氣太過者，主其人性情暴戾執拗性偏，剛強不屈，自信心過強而固執，難以與人合群相處，而且容易因為外來的刺激而激動，且有嫉妒心，見不得別人比自己好，所以一生阻礙重重。<br>");
			if(命盤.分析.陰陽五行.木.力量形態數 <=4) 個性矩陣.push("木氣不及而弱者，主其人意志薄弱和牆頭之草、飄忽不定，易為外力所支配，隨波逐流，對事情的處理方式缺乏條理，雜亂無章，且無慷慨曠達之心量，易斤斤記較於小物，無遠大之志向。<br>");
			if(命盤.分析.陰陽五行.木.力量形態數 >=5 && 命盤.分析.陰陽五行.火.力量形態數 >=5) 個性矩陣.push("木日干出生的人，身旺火多時，為人豪爽資質聰敏，長相秀麗，天賦特厚，思想遠大，心性和平，能在社會上佔有相當的地位，而為人望之所歸。如木火太多時，雖然資質聰敏，但是多是一些小聰明，聰明不能為其所用，其人尤其喜歡修飾表面，自我陶醉，個性十分敏感，其審美觀念，雖然濃厚但有強烈之虛榮心，虛而不實。<br>");
			if(命盤.分析.陰陽五行.土.力量形態數 >=5) 個性矩陣.push("木日干的人土太多時，常打高空，不切實際，自負且自信，對於錢財物質感情方面很執著，喜鑽牛角尖。對於事情的處理方式常有寬以待己，嚴發律他之傾向。其雖待人懷有好意，但事後常有疑心他人之毛病。<br>");
			if(命盤.分析.陰陽五行.金.力量形態數 >=5) 個性矩陣.push("木日干的人金太旺時主其人思想自我清高，帶有幾分傲氣，很容易因受挫而灰心喪志而對任何事皆不感興趣、往往無端憂鬱，而影響前途。<br>");
			if(命盤.分析.陰陽五行.水.力量形態數 >=5) 個性矩陣.push("木日干的人水太旺時，主其人思想常多改變，朝三暮四，朝令夕改，言行不一致，好奇心重、愛管閒事，做事不實在、疏忽怠慢、雜亂無章，易見異思遷，反復無常，身性不定之傾向。<br>");
			
			個性矩陣.push("木形人在形體上，其膚色蒼白，體質修長而高大，手足纖細，口尖發美，顏面長而頭小，聲音尖銳軒昂此則因為木盛多仁之義。");
			if(命盤.分析.陰陽五行.木.力量形態數 <5 && 旺相休囚死字數轉換(命盤.生日.旺相休囚死)<=3) 個性矩陣.push("木形人木氣太弱而休囚者，主體格瘦長而且頭髮稀少，心性偏激，固執拗性偏心、而且常懷有嫉妒之心，此則木衰情寡之義。");
			if(命盤.分析.陰陽五行.木.力量形態數 <4 && 命盤.分析.強弱.印比.強弱值<2) 個性矩陣.push("木形人木氣偏枯者，生性悻逆，主其人眉眼不正，貌醜體格矮小，俚酸卑鄙而吝嗇，頸長而咽喉凸結，肌膚乾燥且坐臥行止得不穩定。");
			
            //個性矩陣.push("木主仁，日干屬木的人，有博愛、惻隱之心，質樸清高，骨骼修長的特點。心地善良好施舍，性格倔強，意志力堅定不移。本性柔軟，性情隨和，感情豐富，舉止灑脫，心胸寬廣，生活樂觀，善交朋友，清高自信，外貌高碩，體長潔白，豐姿美貌，儀表俊雅，氣宇軒昂，語音柔和，面色清白，口尖發美。");
            //個性矩陣.push("屬木的人善用機會，外表斯文、內斂，富有相當創意的構思，是個仁義道德者，有悲天憫人的胸懷，對於各種事物之分析相當透徹，由於心存善念，故能扶助弱者。心中盤算的大計劃，需能付諸行動才會成功，但缺點是缺乏耐心和毅力，面對一些挫折，容易顯礙畏怯，因此要勇敢的面對挫折，保持計劃的持續性，才會漸進佳境。");
			break;

		case "火":
			個性矩陣.push("<span class = '經典古文'>《淵海子平 - 論性情》火曰炎上，味苦主禮，辭讓之心，恭敬威儀，質重淳樸人物。面上尖下圓，印堂窄，鼻露房，精神閃爍，言語辭急，意速心焦，面色或青赤，坐則搖膝。太過則鞠恭聰明，性躁須赤。不及則黃瘦，奸巧妒毒，有始無終。</span><br>");
			if(命盤.日主=="丙") 個性矩陣.push("陽火（丙）性質急躁，猛烈，重表現，性喜多辯論、比較衝動魯莽，每有輕挑的舉動所以意氣容易受到的挫折，並且說話急促，不善考慮，缺乏忍耐力，而自尊心強。<br>");
			if(命盤.日主=="丁") 個性矩陣.push("陰火（丁）生性柔和，消極，重犧牲，萬事顧慮周到，思維細膩富有同情心與智慧，並有進取之氣概，為人非常守道德禮教相規，但是多疑與心機是其缺點。<br>");

			if(命盤.分析.陰陽五行.火.力量形態數 >=5 && 命盤.分析.陰陽五行.火.力量形態數 <=6) 個性矩陣.push("火日干調和旺相者主有辭讓端謹之風，恭敬謙和之氣，威儀凜烈，淳樸尊敬長上，言行稍有急躁現象、凡事出手大方，喜好修飾，善於寫文 章而有聰明敏捷之才華，作事明快與實在而沒有惡意，並主其人有奮鬥之精神，強烈敏捷之反應力，不畏艱險，不憚煩勞，而於世態之炎涼，人情之虛偽，社會之不 公正，悵觸尤深，常發不平之鳴，其人富有創造力，範圍廣大，前程似錦，財祿豐隆。<br>");
			if(命盤.分析.陰陽五行.火.力量形態數 >=7) 個性矩陣.push("火太過者。性情暴躁，處事容易過度傷害別人，易於衝動，稍遇拂意之事，如火加油，非理智所能控制，所以多後悔，其所處的環境，每易發生劇變，而親戚朋友，反而為煩惱之源，由此心理失其平衡，恐將釀成輕微腦病，並易衝動而犯錯誤，必致釀成父母詬病，家庭紛擾之局面，並主其人家庭不和、時多爭執，夫婦間 雖非怨側，終苦琴瑟失調，容易身道橫禍，突致死亡，其險特甚，宜修心養性、調和理智與感情。<br>");
			if(命盤.分析.陰陽五行.火.力量形態數 <=4) 個性矩陣.push("火不及而弱者，性情好機巧、內心奸詐，喜弄小手腕與手段，對於事物常不瞭解，且抱懷疑的心理，未能當機立斷，因而延誤時機，小事有成，大事無成，做事有始無終，容易半途而廢，其人爆炸性與不耐煩之心理，將修人處事理方面，因欠缺圓滿而惹人反感，甚至損害其前途。<br>");
			if(命盤.分析.陰陽五行.木.力量形態數 >=7) 個性矩陣.push("火日干出生的人，木氣太多時，其人對於自己評價很高，擅機變之才華，百變權謀，精於精打細算，自私自利，且會仗著自己的勢力而威嚇別人，小有才能，唯恐人不之知，矜誇自負，喜歡議論他人之是非，思想敏捷，有應變之才，惟心常不足，一得寸進尺，多多益善，多好冒險，又喜見異思遷，或以蒙混手法，掩蔽其廬山真面目，如能改進這些缺點的話，可以達成他的志願，而有所發展。<br>");
			if(命盤.分析.陰陽五行.土.力量形態數 >=7) 個性矩陣.push("火日干的人，土大多時，其人性急口快，天真，凡事不能保守秘密，且言行反復不一致，利害不易均衡，行動不穩重而輕浮，因洩氣過甚，雖曆奔波勞碌之苦困境終難自脫，如能遇災，卯、辰運的話，可得良佳影響，能望平安渡過。<br>");
			if(命盤.分析.陰陽五行.金.力量形態數 >=7) 個性矩陣.push("火日干的人，金氣太旺因而日主衰弱者，其人自負心強而剛愎自用，性情暴燥，喜怒無常，並主其人心高腦活，計畫多，改變也多，終歲營營，精神難轉寧貼，容易在言語或行動上非禮，所以容易遭到譭謗打擊。<br>");
			if(命盤.分析.陰陽五行.水.力量形態數 >=7) 個性矩陣.push("火日干的人，水太多時，其人雖有德行，但是缺乏均衡分辨的能力，並主其人名至而實不歸，表理未能相稱，喜歡機巧而不實在好打高空，雖然交遊甚廣，對於鞏精雖然計畫周到，而其結果反而遭受禍害，對於本身事業，則根基不穩，變動無常，殊無持久希望，區區虛譽，恐怕不容易保全；若是身旺之命式，則其人聰明，事業容易得到權利及名聲；因而名利雙收，處世嚴正，不苟，能保守中庸之道。若是火日干衰時，做事則有挫折，不容易成功。<br>");
			if(命盤.分析.陰陽五行.火.力量形態數 <=4) 個性矩陣.push("火氣偏枯，生化悖逆時，主其人喜走極端，不利婚姻，交友也多凶終隙未，生來勞碌，心常不足，財帛之來，無非過手，忽聚忽散，難於保有，並且其人凶頑成性，奸詐不忠，難與交往。<br>");


			個性矩陣.push("火形人在形體上，面貌上尖下闊，形體頭小腳長背部多肉，腹部良好廣大，其面部肉厚而平板，印堂窄而眉濃，鼻准豐而稍大，消神閃爍，語言急速，性燥無毒。");
			if(命盤.分析.陰陽五行.火.力量形態數 >5) 個性矩陣.push("火太過則聲焦而面帶紅，性質急躁，搖膝好動，說話快速，常常靜不一睞，血氣旺盛且發粗而濃。");
			if(命盤.分析.陰陽五行.火.力量形態數 <5) 個性矩陣.push("火不及者臉色呈黃色，體形瘦小而失，詭詐妒毒，常語無倫次，言語妄誕。");
			if(命盤.分析.陰陽五行.火.力量形態數 <5  && 命盤.分析.強弱.印比.強弱值<2) 個性矩陣.push("火形之人火氣偏枯，生化悖逆。面部瘦小而黑，身體坡而醜，毛髮粗硬，面色紅黃，體略矮而堅，體貌不揚。");

			//個性矩陣.push("火主禮，日干屬火的人，待人總是彬彬有禮，有謙讓之風，神采奕奕，性急而聰明的特點。性情剛烈，感情易動，性急如火，熱情爽快，待人耿直，善交朋友，分外熱情，尊老愛幼，見弱不欺，逢惡不怕，見義勇為，缺乏冷靜，外貌瘦小，面尖下圓，印堂狹窄，鼻孔易露，說話太急，語音激昂，言語妄誕，有始無終。");
            //個性矩陣.push("屬火的人大多有統御領導能力及旺盛的企圖心，在團體中能肩挑大梁；企圖心強，做事果決，能一心一意，迅速達到組織的目標。而且會隨著火焰的漸漸燃燒，愈來愈旺盛，始終能勇於面對考驗與挫折。缺點是為了達成自己的目標，會採行壓倒性強迫他人的手段，採取利己之意見，很少在意他人之立場。鋒芒太露，容易樹立敵人。講話時直接了當，不會拐彎抹角，心裡想什麼就說出來，在人生競爭之舞台上，不失為一個好的競賽者。但往往急功近利，忽略了人情世故，雖然會擁有好的部屬，卻難以拉近彼此距離。屬火的人，本質上是相當重感情的，在朋友有難時，會相當熱心能夠挺身而出。");
			break;

		case "土":
			個性矩陣.push("<span class = '經典古文'>《淵海子平 - 論性情》土曰稼稿勾陳，味甘主信，誠責之心，敦厚至誠，言行相顧，好敬神佛。主人背圓腰闊，鼻大口方，眉目清秀，面如牆壁，面色黃，處事不輕，度量寬厚。太過則愚樸固執如癡。不及則顔色似憂，鼻低面偏，聲重濁，樸實執拗；太過則孤介硬吝，不得衆情，沈毒恨戾，失信顛倒。</span><br>");
			if(命盤.日主=="戊") 個性矩陣.push("陽土（戊）誠實，厚重，性情篤實沉穩。為人憨直。<br>");
            if(命盤.日主=="己") 個性矩陣.push("陰土（己）重視內涵，多才多藝，行事依循規律，用心規矩，然度量欠廣，易生疑心。<br>");

            if(命盤.分析.陰陽五行.土.力量形態數 >=5 && 命盤.分析.陰陽五行.土.力量形態數 <=6) 個性矩陣.push("土氣調和旺相者，主其人信用，有誠實之心，敦厚至誠，言行相顧，責任感強，且敬神佛而有信仰心度並主人度量寬廣，能守道德規範，處事不輕，自信心 強，心性覺和重信用，與人相交以誠，能夠兼顧自己的言語與行為，性喜安靜，不喜權勢，待人隨和少年成老，作事富有耐心與責任心，並有堅忍之性；深機保密且 器量宏大，能化敵為友。<br>");
			if(命盤.分析.陰陽五行.土.力量形態數 >=7) 個性矩陣.push("土氣太過者，凡事固執不與他人商量，固執如癡，孤介硬吝，不得眾情，性情偏屈，不明理義，性質不敏，對事的反應差，且不能隨機應變，性格上易現「慢與拖」常因此錯過機會，不知反省，自以為是。其人極喜孤居，有避世脫俗之念，其工作往往不為人知，乖僻過甚，易滋嫌怨，故易進小人之害，而遭刑害。並主其人交遊甚寡，即有一、二，終亦舍之而去。<br>");
			if(命盤.分析.陰陽五行.土.力量形態數 <4 && 命盤.分析.強弱.印比.強弱值<2) 個性矩陣.push("土氣生性悖道，而偏枯者，退縮怕事不講理而自私自利，事理不通，不得眾情也不在意，顛倒失信，內心陰沉，對事情貪心吝嗇，膽大妄為，言語虛偽沒有誠心與信用，詭狡自縱，神秘莫測，行為多超常軌。<br>");
			if(命盤.分析.陰陽五行.木.力量形態數 >=7) 個性矩陣.push("土日干出生的人，木氣太多時，做事易事倍功半，而徒勞無功，頭腦反應愚鈍，命孤而多勞碌，奔波流離之命。<br>");
			if(命盤.分析.陰陽五行.土.力量形態數 >=5 && 命盤.分析.陰陽五行.火.力量形態數 >=5) 個性矩陣.push("土日干的人日元旺相而火太多時，其人很有義氣，缺乏社交手腕，與親切感，對人不能信任，多疑消忌，致使從叛親離，常常口惠而不實，承諾常不實現，性自私，斤斤計較的缺點。<br>");
			if(命盤.分析.陰陽五行.金.力量形態數 >=7) 個性矩陣.push("土日干的人過金太多時洩氣多時，思想清高，無形中會養成自負不凡的習性、喜做事、重信義、性情剛強帶有幾分燥氣，具有感性，任性不拘，缺乏穩重而輕怫，對事的處理忍耐力小。<br>");
			if(命盤.分析.陰陽五行.水.力量形態數 >=7) 個性矩陣.push("土日干的人水太多時，對名利非常執著，容易從事投機性的事業，因而輕舉妄動，而遭致意外的損失，並主其人追求財帛，不得不肯罷手，但如欲壑難填，蠅營狗苟或因朋比為奸，爾詐我虞，反遭重大損失，其人可於旦夕之間，成為富室，也可於旦夕之間，成為窮人，財來財去。但若能使之培養道德心，則可以行善事，而為人所稱。<br>");
			
			if(命盤.分析.陰陽五行.土.力量形態數 >=5 && 命盤.分析.陰陽五行.土.力量形態數 <=6) 個性矩陣.push("土形人旺相適中者，主人背圓腰肌鼻大口方、麵肥色黃，聲音重濁，眉毛淡而眼不秀。");
			if(命盤.分析.陰陽五行.土.力量形態數 >=7) 個性矩陣.push("土太過者則愚樸重濁，麵肥色黃。");
			if(命盤.分析.陰陽五行.土.力量形態數 <5) 個性矩陣.push("土不及者主其人臉色常帶憂愁之色，鼻低，聲音重濁，樸實執拗，體格瘦小，色黑黃。");

	        //個性矩陣.push("土主信，日干屬土的人，有言行一致，說一不二，忠孝至誠，嚴守信譽，好敬神佛的特點。講信用，說到做到，不虛偽，待人忠濃老實，對人寬宏大量，有忍勁和耐力，做事總是堅持不懈，有始有終，同時為人質樸，勤勞節約，辦事踏實肯干。性情溫濃，感情純樸，待人誠實，講信守譽，不講假話，談吐謹慎，做事細心，膽小怕事，背圓腰闊，鼻大口方，面胖色黃。");
            //個性矩陣.push("屬土的人是信守承諾之人，有相當強的親和力。務實的態度會為自己贏得大眾的支持。具有精打細算的能力，以非常有自知之明的眼光衡量自己，並充分發揮自己的能力。個性沉穩、工作投入，做事認真絲毫不馬虎，天生具有組織能力。但太務實的性格，比較遲緩，比較保守，句句都是不順耳的實言。不喜歡夸大其詞，客觀且凡事小心翼翼；缺點是缺乏豐富想象力，無法對事情做大膽之假設，或去追尋更大的夢想，但是嚴以律己，自愛自重，頗受同事間及上司的喜愛，對於上級交付之任務，均能圓滿達成。");
            break;

		case "金":
			個性矩陣.push("<span class = '經典古文'>《淵海子平 - 論性情》金曰從革，味辛辣也，主義。羞惡之心，仗義疏財，則勇敢豪傑，知廉恥，主人中庸，骨肉相應，方面白色，眉高眼深，高鼻耳仰，聲音清響，剛毅有決。太過則自無仁心，好鬥貪欲。不及則多三思，少果決，慳吝，作事挫志。</span><br>");
			if(命盤.日主=="庚") 個性矩陣.push("陽金（庚）精神粗曠豪爽，意氣輕燥，性情剛烈而重義氣、個性好勝，具有破壞性，人緣佳，容易相處。<br>");
			if(命盤.日主=="辛") 個性矩陣.push("陰金（辛）性較陰沉，溫潤秀氣，重感情，虛榮心強而愛好面子，有強烈的自尊心，一所以每有悔恨之情。氣質佳，但缺乏堅強的得志力。<br>");

			if(命盤.分析.陰陽五行.金.力量形態數 >=5 && 命盤.分析.陰陽五行.金.力量形態數 <=6) 個性矩陣.push("金氣調和旺相者，主其人有羞惡之心，仗義疏財，勇敢豪傑，知廉恥，處事有決斷力，剛毅果決，有人品與權威，重名譽而通人情事故，此人乃為中康正大光明之人也，文才華麗、於音樂及藝術兩途，尤能作天才之發展，並象徵其人善於交際，周旋社團結納友好，富有才幹。<br>");
			if(命盤.分析.陰陽五行.金.力量形態數 >=7) 個性矩陣.push("金氣太過時。主其人好勇而無謀，重義氣，易有言多語速快，仗義執言，並不一定經過深思，言多必失，費力不討好諸情況，臨事容易衝動，容易因太剛強而遭受挫折、損傷，而且遇事稍微刻薄不講情面，喜淫好殺。<br>");
			if(命盤.分析.陰陽五行.金.力量形態數 <=4) 個性矩陣.push("金氣不及而弱者，凡事容易猶疑易有寡言慎語，格格不入，孤芳自賞，獨立別樹一幟等情形以致考慮過度難以決斷而失去良機，做事容易挫志而心灰意懶，雖然重義氣，然口惠不實，難以實行。<br>");
			if(命盤.分析.陰陽五行.木.力量形態數 >=7) 個性矩陣.push("金日干的人，木氣太多時，對於金錢名利方面限在乎，而有執著心，好算計他人，不肯吃虧，沒有實行道德的勇氣，事業易因挫敗而灰心喪志，常常言與行不能兼顧。<br>");
			if(命盤.分析.陰陽五行.火.力量形態數 >=7) 個性矩陣.push("金日主的人，火太多時，做事缺乏耐心，極欲速成而挫敗，做事急躁，有小聰明，事業也不大穩定，與人交遊，時而和諧，時而破裂，難以全始全終。如果金旺而可以敵火剋時，主其人立剛直之性，忠於所事，善與人同，眾望所歸，名為世重。<br>");
			if(命盤.分析.陰陽五行.土.力量形態數 >=7) 個性矩陣.push("金日主的人，土太旺時，其人心中無主見，人云亦云，易見風轉舵，做事無長遠計畫，言行常不一致，凡事遲疑，須經多方顧慮，方敢進行。<br>");
			if(命盤.分析.陰陽五行.水.力量形態數 >=7) 個性矩陣.push("金日干的人，水太多時，為人聰明，剛強而任性，患得患失之心重，自以為聰明，自信心太高，所以臨事常受到挫訴或打擊。蓋金水旺的人，男的一定英俊瀟酒，女的一定漂亮誘人。<br>");
			
			if(命盤.分析.陰陽五行.金.力量形態數 >=5 && 命盤.分析.陰陽五行.金.力量形態數 <=6) 個性矩陣.push("金形人旺相適中者。面色方圓而色白淨、眉毛高而限稍深透，鼻子挺直而高，耳朵帶紅，聲音清亮而悠揚，體格壯碩而堅朗，清廉潔白，並主面貌秀美，身體豐滿。");
			if(命盤.分析.陰陽五行.金.力量形態數 >=7) 個性矩陣.push("金太過時，體格碩而松肥，聲音清中帶濁，並主其人好勇無謀，貪欲不仁。");
			if(命盤.分析.陰陽五行.金.力量形態數 <5) 個性矩陣.push("金不及或偏枯，生化悖逆。主其人身材瘦小，面貌不正而醜陋，性情暴躁，寡義和多疑之人也。");

			//個性矩陣.push("金主義，日干屬金的人，有英雄豪傑、仗義疏財，講究禮儀廉恥、性格好強、剛愎自用的特點。講義氣，重視名節，自尊心很強，性格孤傲，不卑不亢，針鋒相對，剛直易折。行動穩成，外表嚴肅，剛毅果決，內心熱情，待人耿直，重情重義，辦事認真，秉公執政，脾氣古怪，固執保守，體健神清，面方白細，膚色黝黑，眉高眼深，鼻高耳仰。");
            //個性矩陣.push("屬金的人本質是較重意氣，個性有棱有角，且非常堅強，是個野心家，想得到的東西，無論大小，夜以繼日，一心一意朝著目標勇往直前，對於事情的反應很強烈，追求權利及財富的企圖心極旺盛，就象金屬的銳利光芒，反應在人你關系上，幽默、機智、活潑，有口才，所以多方面的才能可超越眾人，但容易堅持己見。常以笑容迎人，但是重名利，佔有欲強，追求財富、權利的企圖心旺盛，因此內心隱藏著強烈的斗志，隨時都想和人一較長短。");
            break;
		case "水":
			個性矩陣.push("<span class = '經典古文'>《淵海子平 - 論性情》水曰潤下，味咸主智，是非之心，智足多謀，機關深遠，文學聰明，詭詐飄蕩，無力傾覆，陰謀好惡。不及則膽小無謀，反主人 物瘦小。</span><br>");
			if(命盤.日主=="壬") 個性矩陣.push("陽水（壬）生性憊懶，富依賴心，樂觀，外向，度量寬宏，富於勇氣，雖然聰明卻縱欲任性。<br>");
			if(命盤.日主=="癸") 個性矩陣.push("陰水（癸）平靜，柔和，內向，勤勉力行，然而每愛好消聰，注重原則，不務實際，故內心常畜不平，並時有破壞性，並且有重情調，喜鑽牛角尖的傾向。<br>");

			if(命盤.分析.陰陽五行.水.力量形態數 >=5 && 命盤.分析.陰陽五行.水.力量形態數 <=6) 個性矩陣.push("水氣調和旺相者。主其人智慧高，度量寬大性情善良，凡事皆能深思熟慮，多深謀遠慮，其思慮非常細密，且有見識、有學問、有道德、記憶力強且腦力很好，富於愛情，並主其人志趣高超，潛心學問，對於事務之研究，常從深層著眼，富於商業腦筋。<br>");
			if(命盤.分析.陰陽五行.水.力量形態數 >=7) 個性矩陣.push("水氣太多時，為人不拘小節，不大守禮教道德，性情猶豫，行動矛盾，好妄動，富於小聰明，恃才傲物，缺於自尊，其心不定，愛不專，並主其人心靈對於外界事物，感染迅速，以致變化無定，幻想強烈，有時饒舌多言好強辯，有時則沉默緘口，易做多情樣。<br>");
			if(命盤.分析.陰陽五行.水.力量形態數 <=4) 個性矩陣.push("水不及時，做人反復無常而不定向，膽小而無長遠的智慧，且智慧不高而蔽塞，易於改變計畫，富於依賴心，每聽人擺佈，且性情不定而曖昧。<br>");
			if(命盤.分析.陰陽五行.木.力量形態數 >=7) 個性矩陣.push("水日干的人木太多而洩氣時，主其人易於意氣用事，感情用事，性情軟弱，喜歡多學技巧，而不精，心中無一定之方針，只想人家益我，而不想利於別人。<br>");
			if(命盤.分析.陰陽五行.火.力量形態數 >=7) 個性矩陣.push("水日干的人火太多時，主其人對金錢的處理無條理，而漫無節制，對事的處理方式喜裝飾表面往往流於空洞形式和虛假。並主其人思想，不切實際，缺乏信心，易為人左右，做事情多反悔，精神散漫，故無大的成就。<br>");
			if(命盤.分析.陰陽五行.土.力量形態數 >=7) 個性矩陣.push("水日干的人土太多時，主其人意志薄弱，顛倒反復，經常遇事而不決、猶疑，雖有忍耐力，然而卻愚笨不能舉一反三，如果有金氣的扶助，則可承現活力而開朗，於事業，前途有莫大的幫助。<br>");
			if(命盤.分析.陰陽五行.金.力量形態數 >=7) 個性矩陣.push("水日干的人金太多時，主其人有高度的智慧反應靈敏而英氣盛，自我期望高，不喜歡反省自己，自信力強，縱橫馳騁、不樂受人管制，並且主其人好高而務遠，眼高而手低。<br>");

			個性矩陣.push("水形人在形體上，面貌不平而頭大，肩小腹大，且手腳常動，於步行時，身體也會搖動不定，語言清和。並主人眉目清秀，體肥而碩大，且多毛髮。若命局好時則皮膚細而白。");
			if(命盤.分析.陰陽五行.水.力量形態數 >=7) 個性矩陣.push("水太過者，主其人點碩大而貪淫，一生多是非好動，人多智謀，少決斷，浮氣狡猾而多疑心。");
			if(命盤.分析.陰陽五行.水.力量形態數 <=4) 個性矩陣.push("水少者或偏枯，生化悖逆。主其人矮小，黑而醜，行事反復，性情不常，膽小而無謀略。");

			//個性矩陣.push("水主智，日干屬水的人，足智多謀，聰明好學，有謀略，好思索，坐不住，易變動。好動健談，行動敏捷，靈活多變，能剛能柔，軟中有硬，以柔剋剛，剛柔相濟，命帶桃花，風流多情，外形矮小，面色青黑，語言清和。");
            //個性矩陣.push("屬水的人平時沉默寡言，但若說起話來便會滔滔不絕，分析事有條有理，詞鋒犀利，不宜太堅持己見，否則容易樹立敵人。水本質柔順，所以缺點是在精神狀態方面會表現出庸懶現象，對事物只眼開；只眼閉，不敢勇於面對現實。雖處事圓融，但因缺乏己見及自信，凡事需依賴他人決策，故容易變得優柔寡斷或人云亦云，甚至被人牽著鼻子走。");
			break;
	} // end switch

		個性矩陣.push("<br>"+五行分類註解(命盤));
		var 旺五行流通否=五行旺與流通(命盤); if (旺五行流通否!="") 個性矩陣.push("<br>"+旺五行流通否);

		個性矩陣.unshift('<span class = "經典標題"><br>'+ 命盤.日主五行 +'行人個性<br></span>');
		return 個性矩陣.join("<br>");
}

//****************** 五行論斷模塊 ******************
function 五行分類註解(命盤){
    var 五行分類矩陣=[];
    var 五行強弱;
    var 五行形態數=命盤.分析.陰陽五行.數據[五行字轉數(命盤.日主五行)].力量形態數;


    switch(命盤.日主五行){
        case "木":
            switch(true){
                case (五行形態數==0):  //全無
                	五行分類矩陣.push("");
                    break;
                case (五行形態數>0 && 五行形態數<4):  //欠缺
                	五行分類矩陣.push("木氣欠缺之人無惻隱之心，缺乏目標，貪婪，吝嗇小氣，出事缺少情理。");
                    break;
                case (五行形態數==4):  //弱
                	五行分類矩陣.push("木氣偏弱之人執性太柔，不吃虧，治事無規，胸懷不正，吝嗇堅鄙，性格偏狹難容人。");
                    break;
                case (五行形態數==5):  //中和
                	五行分類矩陣.push("木氣平和之人善深思，處事平穩，冷靜。");
                    break;
                case (五行形態數==6):  //旺相
                	五行分類矩陣.push("木氣旺相之人仁慈厚敏，心懷惻隱，資質秀麗，樂善好施，多學不實。");
                    break;
                case (五行形態數>6 && 五行形態數<9):  //太過
                    五行分類矩陣.push("木氣太旺之人性拗心偏，嫉妒不仁，計慮繁亂，襟懷瑣破，少愛心，心狠手辣。");
            }
            break;

        case "火":
            switch(true){
                case (五行形態數==0):  //全無
                	五行分類矩陣.push("");
                    break;
                case (五行形態數>0 && 五行形態數<4):  //欠缺
                	五行分類矩陣.push("火氣欠缺之人，無禮，缺乏熱情，欠缺上進心，內向柔弱，不喜社交，消極，三分鐘熱度，不善表達，不苟言笑。"); 
                    break;
                case (五行形態數==4):  //弱
                	五行分類矩陣.push("火氣偏弱之人狂言妄語，缺乏誠信，做事有始無終，生性巧佞，僅畏守禮，小有辯才，大事無決。");
                    break;
                case (五行形態數==5):  //中和
                	五行分類矩陣.push("火氣平和之人熱情有壯志，積極向上好衝動。");
                    break;
                case (五行形態數==6):  //旺相
                	五行分類矩陣.push("火氣旺相之人性速辨明，文章明敏，好事華飾，謙和淳樸，時而急躁。");
                    break;
                case (五行形態數>6 && 五行形態數<9):  //太過
                    五行分類矩陣.push("火氣太旺之人酷烈傷物，放縱急躁，語速快，外向熱情，為人真誠。");
            }
            break;
        case "土":
            switch(true){
                case (五行形態數==0):  //全無
                	五行分類矩陣.push("");
                    break;
                case (五行形態數>0 && 五行形態數<4): 
                	五行分類矩陣.push("土氣欠缺之人，沒自信、原則，為人自我，不通事理，缺乏誠信，不重視承諾。");
                    break;
                case (五行形態數==4):  //弱
                	五行分類矩陣.push("土氣偏弱之人較無安全感、沒信心，原則性差，善變，常給人一種很好相處的錯覺，聲音混濁。");
                    break;
                case (五行形態數==5):  //中和
                	五行分類矩陣.push("土氣中和之人能力強，守信容物，厲害敢為，但易招毀謗。");
                    break;
                case (五行形態數==6):  //旺相
                	五行分類矩陣.push("土氣旺相之人厚重可貴，度量寬大，不爽信約，忠孝至誠，篤信宗教。");
                    break;
                case (五行形態數>6 && 五行形態數<9):  //太過
                    五行分類矩陣.push("土氣太旺之人古樸倔強，僵化笨拙，內向，執而不返，閉塞不明，喜靜不喜動。");
            }            
            break;
        case "金":
              switch(true){
                case (五行形態數==0):  //全無
                	// do nothing
                    break;
                case (五行形態數>0 && 五行形態數<4):
                	五行分類矩陣.push("金氣欠缺之人，不易親近，沒義氣，無遠見，較沒禮貌，刻薄奸詐。"); 
                    break;
                case (五行形態數==4):  //弱
                	五行分類矩陣.push("金氣偏弱之人思深決少，固執，自持己見，欠冷靜，性雖好義，為之不終。");
                    break;
                case (五行形態數==5):  //中和
                	五行分類矩陣.push("金氣中和之人體健神清，敏感正直急躁，見義勇為，言語銳利，比較不講人情。");
                    break;
                case (五行形態數==6):  //旺相
                	五行分類矩陣.push("金氣旺相之人威武剛烈，臨事果決，豪氣仗義，過不自知，思禮好勝。");
                    break;
                case (五行形態數>6 && 五行形態數<9):  //太過
                    五行分類矩陣.push("金氣太旺之應過於剛健而變成脆弱，缺乏仁義，刻薄，貪欲好殺。");
            }           
            break;
        case "水":
               switch(true){
                case (五行形態數==0):  //全無
                	五行分類矩陣.push("");
                    break;
                case (五行形態數>0 && 五行形態數<4):  //欠缺
                	五行分類矩陣.push("水氣欠缺之人，包容力差，傲性，智識閉塞，反复無常。");
                    break;
                case (五行形態數==4):  //弱
                	五行分類矩陣.push("水氣偏弱之人反复無常，膽小無略，性昏無賴。");
                    break;
                case (五行形態數==5):  //中和
                	五行分類矩陣.push("水氣中和之人執性聰明，善於應變，服務群眾，正直行事少衝鋒。"); 
                    break;
                case (五行形態數==6):  //旺相
                	五行分類矩陣.push("水氣旺相之人智高量遠，計深慮密，敏而好學，學識過人，沉潛伏弱，舉一反三。");
                    break;
                case (五行形態數>6 && 五行形態數<9):  //太過
                    五行分類矩陣.push("水氣太旺之人機詐詭譎，體態豐肥，平生多波折，人生起伏較大。其性情躁急，易出禍端。");
            }
    }

    var 其他五行對比=其他五行過多註解(命盤.日主五行,命盤);
    if(其他五行對比!="") 五行分類矩陣.push(其他五行對比);

    return 五行分類矩陣.join("");
    //console.log(五行形態數);
}

function 其他五行過多註解(判斷五行,命盤){
	var 日主五行數=五行字轉數(判斷五行);
	var 其他五行過多論斷=[];
	var 過多的比率=2;  //過多的五行要多過日主2倍才算多
	var 力量順序對比=3;  //該過多的五行力度，最少要排在第三（第二大）以上。因為如果日主太弱，幾乎每個五行都可能是它的2倍

	for(var i=0; i<5; i++){
		//if(i==1) console.log(五行數轉字(i) +", "+命盤.分析.陰陽五行.數據[i].力量順序);
		if(日主五行數!=i && 命盤.分析.陰陽五行.數據[i].力量順序 >=力量順序對比 && (命盤.分析.陰陽五行.數據[i].力量比率>=過多的比率*命盤.分析.陰陽五行.數據[日主五行數].力量比率)){
			//console.log(i + "," + 命盤.分析.陰陽五行.數據[i].力量順序 + ", " + 五行數轉字(i));
			其他五行過多論斷.push(日主五行對比其他五行(判斷五行, 五行數轉字(i)));
		} // end if
	} // end for

	if(其他五行過多論斷.length>0) 
		return 其他五行過多論斷.join("");
	else
		return "";
}


function 日主五行對比其他五行(日主五行, 對比五行){
	//console.log(日主五行 + ", " + 對比五行);
	switch(日主五行){
		case "木":
			switch(對比五行){
				case "木":
					// do nothing
					break;
				case "火":
					return "火多，馳聘聰明，好學不切，明知故犯，善決發論。";
				case "土":
					return "土多，取檢自信，奢而不奔，伏柔伏烈，言必鑑人。";
				case "金":
					return "金多，剋制憔悴，剛而無斷，動思靜悔，舉義不常。";
				case "水":
					return "水多，漂流不定，言行相違，處事不寧，趨時委曲。";
			}  // end switch 對比五行
			break;
		case "火":
			switch(對比五行){
				case "木":
					return "木多，自恃威福，聰明志懦，靜則志明，好辯是非。";
				case "火":
					// do nothing
					break;
				case "土":
					return "土多，立用沉密，利害敢為，言清行濁，執而不變。";
				case "金":
					return "金多，志不自好，勝辯而剛，禮儀失中，直而造謗。";
				case "水":
					return "水多，漂流不定，言行相違，處事不寧，趨時委曲。";
			}  // end switch 對比五行
			break;
		case "土":
			switch(對比五行){
				case "木":
					return "木多，形勞志大，雜用狂從，用柔爽信，曲直黨情。";
				case "火":
					return "火多，施義忘親，外明少斷，奢儉失中，好禮口惠。";
				case "土":
					// do nothing
					break;
				case "金":
					return "金多，信而好義，剛而多躁，不能持重，處事無容。";
				case "水":
					return "水多，貪功好進，凡順伏機，志善若昏，愛惡無義。";
			}  // end switch 對比五行
			break;
		case "金":
			switch(對比五行){
				case "木":
					return "木多，辯分曲直，利害兼資，置德懷念，朋友失意。";
				case "火":
					return "火多，口才辯利，好禮寡義，動止寬和，心中吝嗇。";
				case "土":
					return "土多，無中有成，口儉心慈，作為暗昧，多處嫌疑。";
				case "金":
					// do nothing
					break;
				case "水":
					return "水多，計慮不勝，為人無恩，臨事齷齪，或是或非。";
			}  // end switch 對比五行
			break;

		case "水":
			switch(對比五行){
				case "木":
					return "木多，流而不止，執志反柔，臨事汗漫，奢儉失中。";
				case "火":
					return "火多，崇禮伉餐，深慮多憂，猛斷後悔，粟六少成。";
				case "土":
					return "土多，沉潛窒塞，內利外鈍，忍而多恨，信義無決。";
				case "金":
					return "金多，好意不實，志大多淫，智勝義負，賦性靈強。";
				case "水":
					// do nothing
					break;
			}  // end switch 對比五行
			break;
	}

}

function 五行疾病(命盤){
    var 疾病矩陣=[];
	var 比率多=2;
    var curdate=new Date();
    var 小兒=(命盤.生日.虛歲 < 10) ? true : false;
    var 老年=(命盤.生日.虛歲 > 50) ? true : false;

    //**************** 木 *********************剋
    if(命盤.分析.陰陽五行.木.力量形態數>0 && (命盤.分析.陰陽五行.金.力量形態數>6 || (命盤.分析.陰陽五行.金.力量比率 > 比率多 * 命盤.分析.陰陽五行.木.力量比率))) 疾病矩陣.push("木見金多，在內主肝膽驚悸、手足頑麻、筋骨疼痛；在外主頭目眩暈、口頭歪斜、四肢受傷、易掉頭髮。<br>金剋木而太過者，應多留意肝膽、驚悸疾擦、手足顧麻損傷、筋骨疼痛、頭目眩暈、口眼歪斜、跌補損傷，嚴重的話，有患、瘋疾殘症、肝膽。膽石症、損傷四肢的可能。");
    if(命盤.分析.陰陽五行.木.力量形態數<4 && 命盤.分析.陰陽五行.木.力量形態數>0 && 命盤.分析.陰陽五行.土.力量形態數>6) 疾病矩陣.push("木弱土旺，木折損，容易跌倒跌傷，左癱右瘓。");
    if(命盤.分析.陰陽五行.木.力量形態數<4 && 命盤.分析.陰陽五行.木.力量形態數>0 && 命盤.分析.陰陽五行.火.力量形態數>6 && 命盤.分析.陰陽五行.水.力量形態數<3) {
        var 綜合論斷="木見火多，少水相濟，肝硬化，中風，皮膚乾燥，內熱口乾。";
        if(命盤.性別=="女") 綜合論斷 += "婦女主氣血欠調。";
        if(小兒) 綜合論斷 += "小兒主急慢驚風，夜啼咳嗽，面色黑黯。";
        疾病矩陣.push(綜合論斷);
    }

    if((命盤.分析.陰陽五行.木.力量形態數<4 && 五行四季旺相休囚死("木", 命盤.生日.四季, 命盤.月令)=="死") || (命盤.分析.陰陽五行.木.力量形態數==0)) 疾病矩陣.push("木太弱或死絕者，多有暈眩，血不調暢，兩鬢消疏而發稀、神經痛的現象。如果嚴重一點的話，多有肝膽失常、眼病、眩暈筋疾、爪甲枯黃、腿足損傷的可能。所以平時應多注意，肝、膽、手足、神經及筋脈的維護及保養。");

    if((100*(命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.木.力量比率) > 50) && 命盤.分析.陰陽五行.水.力量形態數>4 && 命盤.分析.陰陽五行.木.力量形態數>4) 疾病矩陣.push("水木相生面太旺者則，應多預防嘔吐、胃虛、惡心、口臭、暖氣、流涎、口及咽喉有違和感，並有食欲減退。身體衰弱、脈沉弱、腹部軟弱無力、顏面缺乏血色的疾病。");
    if((100*(命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.木.力量比率) < 25) && 命盤.分析.陰陽五行.水.力量形態數>0 && 命盤.分析.陰陽五行.木.力量形態數>0) 疾病矩陣.push("水木相生而太弱或死絕者，應多注意頭痛、腰痛、倦怠、盜汗並覺口渴，口中發粘思飲水，嚴重一點的話有嘔吐、腹瀉、胸內苦悶，四肢厥冷、尿意頻數、口舌干燥；不令脾腫，肝也肥大，並覺有耳嗚重聽者，又往往發生支氣管炎的現象。");


    //**************** 火 *********************
    if(命盤.分析.陰陽五行.火.力量形態數<4) 疾病矩陣.push("缺火者，血液循環不順暢、畏寒、手腳冰冷、腦神經衰弱、頭暈。");
    if(命盤.分析.陰陽五行.火.力量形態數>6) 疾病矩陣.push("火旺者，臉色容易潮紅，容易形成心律不齊，高血壓，腦溢血。");
    if(命盤.分析.陰陽五行.火.力量形態數<4 && 命盤.分析.陰陽五行.火.力量形態數>0 && 命盤.分析.陰陽五行.木.力量形態數>6) 疾病矩陣.push("木多火弱形成反剋，性質麻痺。");
    if(命盤.分析.陰陽五行.火.力量形態數>0 && 命盤.分析.陰陽五行.水.力量形態數>6 || (命盤.分析.陰陽五行.水.力量比率 > 比率多 * 命盤.分析.陰陽五行.火.力量比率)){
        var 綜合論斷="火見水多，在內主心氣疼痛、癲癇舌強、口痛咽啞、急慢驚風、言語蹇澀；在外主潮熱發狂、眼昏失明、小腸疝氣。輕者視力欠佳、近視、散光、亂視。<br>";
        綜合論斷 += "水剋火而太過者，應該預防貧血、心臟虛弱、心肌梗塞、心悸等之心臟病，年紀輕或正值壯年者，卻主腸胃不好，如果行運不佳的話，外主易潮熱發狂，眼暗之疾，小腸漲氣、瘡胰膿血、小便淋濁。";
        if(命盤.性別=="女") 綜合論斷 += "婦女主乾血癆、淋症頻尿、經脈不調。";
        if(小兒) 綜合論斷 += "小兒主痘疹、疥廯、面色紅赤。";
        疾病矩陣.push(綜合論斷);
        }

    if(命盤.分析.陰陽五行.火.力量形態數>6 && 命盤.分析.陰陽五行.土.力量形態數<4 && 命盤.分析.陰陽五行.土.力量形態數>0 && 命盤.分析.陰陽五行.水.力量形態數<4) 疾病矩陣.push("火盛土少，又缺水制，心神容易恍惚。");

    if( (命盤.分析.陰陽五行.火.力量形態數<4 && 五行四季旺相休囚死("火", 命盤.生日.四季, 命盤.月令)=="死")  || (命盤.分析.陰陽五行.火.力量形態數==0) ) {
        var 綜合論斷="火太弱或死絕者，寒冬調候之火氣受水澆熄，主貧血、心臟虛弱、心肌梗塞、心膜等等之心臟病，年紀輕或正值壯年者，卻主腸胃不好；行運不佳的話，應注意損傷頭卻，腦神經之患。";
        if(命盤.性別=="女") 綜合論斷 += "女人並有經期不暢，難產的可能，所以平時應多注意此方面的調養。";
        疾病矩陣.push(綜合論斷);
    }

    if((100*(命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率) > 50) && 命盤.分析.陰陽五行.木.力量形態數>4 && 命盤.分析.陰陽五行.火.力量形態數>4) 疾病矩陣.push("木火相生而太旺者則，易患火氣上盛、目赤、頭風、偏頭痛、耳鳴、眩暈、注意散漫、心臟部壓迫感，氣促等循環系症狀，此外並有肩凝、便秘、下肢麻木感、風濕樣疼痛，再進至相當程度時，可出現狹心症，心臟性喘息、下肢浮腫、夜尿頻繁等疾。");
    if((100*(命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率) < 25) && 命盤.分析.陰陽五行.木.力量形態數>0 && 命盤.分析.陰陽五行.火.力量形態數>0) 疾病矩陣.push("木火相生而太弱或死絕者，則應多注意頭痛、頭暈、四肢發冷、倦怠、不眠、盜汗、作狂、悶亂之疾。");


    //**************** 土 *********************
    if(命盤.分析.陰陽五行.土.力量形態數>0 && (命盤.分析.陰陽五行.木.力量形態數>6 || (命盤.分析.陰陽五行.木.力量比率 > 比率多 * 命盤.分析.陰陽五行.土.力量比率))) {
        var 綜合論斷="土受剋，在內主脾胃不佳，翻胃膈展、胃穿孔、胃出血、胃潰瘍；在外主皮肉受傷。<br>";
        綜合論斷 += "木剋土而太過者，應多留意，脾、胃、腸、皮膚、齒、瘡毒的可能，如果行運不佳的話，內主有脾胃不和、翻胃腸食、氣噎易漲、嘔吐噁心、擇揀飲食、洩瀉黃膽的毛病，外主有右心沉重、濕毒流注，胸腹痞塞。";
        if(命盤.性別=="女") 綜合論斷 += "女人大都有飲食不甘，吞酸虛弱、呵欠困倦的現象。";
        疾病矩陣.push(綜合論斷); 
    }

    if(命盤.分析.陰陽五行.土.力量形態數>0 && (命盤.分析.陰陽五行.火.力量形態數>6 || (命盤.分析.陰陽五行.火.力量比率 > 比率多 * 命盤.分析.陰陽五行.土.力量比率))) {
        var 綜合論斷="火多土燥，皮膚病、富貴手。";
        if(命盤.生日.四季=="冬") 綜合論斷 += "生冬天脾胃不能吸收，不長肉。"; 
        疾病矩陣.push(綜合論斷);
    }
    if(命盤.分析.陰陽五行.金.力量形態數>6 && 命盤.分析.陰陽五行.土.力量形態數>0 && 命盤.分析.陰陽五行.土.力量形態數<4) 疾病矩陣.push("土弱金多，胃虛、營養不能吸收、脂肉或肌肉有硬塊、胃壁薄。");
    if(命盤.分析.陰陽五行.水.力量形態數>6 && 命盤.分析.陰陽五行.土.力量形態數>0 && 命盤.分析.陰陽五行.土.力量形態數<4) 疾病矩陣.push("土弱水旺，土崩，胃酸過多、胃下垂、多水。*遇火結石。");

    if((命盤.分析.陰陽五行.土.力量形態數<4 && 五行四季旺相休囚死("土", 命盤.生日.四季, 命盤.月令)=="死") || (命盤.分析.陰陽五行.土.力量形態數==0)) 疾病矩陣.push("土太弱或死絕者。時有面黃、減食、隔塞吐逆、肢體怠惰、喜臥嗜睡、多思足慮、神濁健忘、不喜動作的現象，並常有浮腫、腳氣、口臭、齒痛的毛病，如果嚴重一點的話，有患，腸消化系統、脾、皮膚病、瘡毒的可能，所以平時應多人患此方面的調養。");

    if((100*(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率) > 50) && 命盤.分析.陰陽五行.火.力量形態數>4 && 命盤.分析.陰陽五行.土.力量形態數>4) 疾病矩陣.push("火土相生而太旺者，胃實症，常覺症狀有胃部膨滿感，度量雖不異常稍進食即感飽滿或重壓，往往暖氣、噁心，唯不大嘔吐。");
    if((100*(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率) < 25) && 命盤.分析.陰陽五行.火.力量形態數>0 && 命盤.分析.陰陽五行.土.力量形態數>0) 疾病矩陣.push("火土相生而太弱或死絕者，易發生嘴唇焦紅、氣熱結、大便不利，同時有腸管無力，往往多便秘或秘結，也有腹瀉者，一般都有頭痛、目眩、倦怠的現象。");


    //**************** 金 *********************

    if(命盤.分析.陰陽五行.金.力量形態數>0 && (命盤.分析.陰陽五行.火.力量形態數>6 || (命盤.分析.陰陽五行.火.力量比率 > 比率多 * 命盤.分析.陰陽五行.金.力量比率))) {
        var 綜合論斷="火旺剋金，在內主便秘、痔瘡、便血、火氣大牙齦腫痛、過敏性鼻炎、流鼻血。<br>";
        綜合論斷 += "火剋金而太過者，應多預防大腸、肺、腦、紅班性狼瘡、呼吸系統的毛病，行運不佳的話，內主易患，腸風痔漏、便后出血、痰火咳嗽、兩顴發赤，舌紅無苔、昏眩。鼻病、呼吸病，及損傷肺腸之事；外主易患虛煩痺症，皮膚枯燥、肺風界線、形腫發背、膿血、嘔血。";
        if(命盤.分析.陰陽五行.水.力量形態數<4) 綜合論斷 += "火炎土燥，強火尅金，皮膚病、瘡毒。";
        if(命盤.性別=="女") 綜合論斷 += "婦人多有痰嗽血產。";
        if(小兒) 綜合論斷 += "小兒多主膿血痢疾、面色黃白之疾。";
        疾病矩陣.push(綜合論斷);
    }

    if(命盤.分析.陰陽五行.金.力量形態數>0 && (命盤.分析.陰陽五行.土.力量形態數>6 || (命盤.分析.陰陽五行.土.力量比率 > 比率多 * 命盤.分析.陰陽五行.金.力量比率))) 疾病矩陣.push("土旺金埋，呼吸系統欠佳，鼻子過敏。*若水多過濕則鼻塞；火多過乾則鼻竇炎。");


    if((100*(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率) > 50) && 命盤.分析.陰陽五行.金.力量形態數>4 && 命盤.分析.陰陽五行.水.力量形態數>4){
        var 綜合論斷="金水過旺，金水過多則傾瀉，腎經虛，腰酸背痛、較多情重色。";
        if(命盤.性別=="男") 綜合論斷 += "男命容易早洩、陽痿。";
        if(命盤.性別=="女") 綜合論斷 += "女命易子宮寒冷，下半身多分泌物、白帶多、不孕。在外則較愛哭，淚水汪汪，唾液多，白血球過多。*尤其是在年月特別明顯。";
        疾病矩陣.push(綜合論斷);
    }
    
    if((命盤.分析.陰陽五行.金.力量形態數<4 && 五行四季旺相休囚死("金", 命盤.生日.四季, 命盤.月令)=="死") || (命盤.分析.陰陽五行.金.力量形態數==0)) 疾病矩陣.push("金太弱或死絕者，應多注意，氣虛、咳嗽、皮毛焦燥、骨節疼痛、涕淚、大腸瀉痢便血、呼吸系統的毛病，並常有呼吸不暢，常受感冒之患，潮熱、溢汗的現象，如果嚴重一點的話，並有得肺病的可能，平時應多注意，肺、大腸、腦部、呼吸系統的維護與保養。");

    if((100*(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率) > 50) && 命盤.分析.陰陽五行.土.力量形態數>4 && 命盤.分析.陰陽五行.金.力量形態數>4) 疾病矩陣.push("土金相生太旺者，氣常多虛，常有腹滿、便秘、口渴、尿色紅之症狀，所以平常應多注意此方面的調養。");
    if((100*(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率) < 25) && 命盤.分析.陰陽五行.土.力量形態數>0 && 命盤.分析.陰陽五行.金.力量形態數>0) 疾病矩陣.push("土金相生而太弱或死絕者，常有胃腸不好的現象，患此症者，胃腸腹部常感疼痛。腹部膨滿、腸嗚、吞酸，有壓倦感，較嚴重一點的話，則體形衰弱、貧血、瀛弱等症狀。");

    //**************** 水 *********************
    if(命盤.分析.陰陽五行.水.力量形態數>0 && (命盤.分析.陰陽五行.土.力量形態數>6 || (命盤.分析.陰陽五行.土.力量比率 > 比率多 * 命盤.分析.陰陽五行.水.力量比率))) {
        var 綜合論斷="土旺剋水，心悸、心煩、貧血、胸悶。遇濕土耳炎，乾土則骨刺。<br>";
        綜合論斷 += "土剋水而太過者，應多預防腎臟、生殖系統的疾病，並多注意脾濕瀉中滿，痰嗽不利之疾，如果行運不佳的話，內主患遺精盜汗、胃疾、白濁虛損、寒戰咬牙、耳目之疾，傷風感冒；外主患風虫牙痛、偏墜腎氣、腰痛膝痛、淋瀝吐瀉、怕冷惡寒。";
        if(命盤.性別=="女") 綜合論斷 += "婦女主白帶多，經水不調。";
        if(小兒) 綜合論斷 += "小兒主小腸疼痛，耳中生瘡，夜間吵鬧。";
        疾病矩陣.push(綜合論斷);
    }

    if(命盤.分析.陰陽五行.水.力量形態數>0 && (命盤.分析.陰陽五行.火.力量形態數>6 || (命盤.分析.陰陽五行.火.力量比率 > 比率多 * 命盤.分析.陰陽五行.水.力量比率))) 疾病矩陣.push("旺火剋弱水，常有心氣盛而煩悶不安的現象，腎氣不常不能平衡，血壓高、貧血、頭痛、眼皮或足部浮腫的疾病，所以平時應多注意腎方面的調養。");

    if(命盤.分析.陰陽五行.水.力量形態數>0 && 命盤.分析.陰陽五行.水.力量形態數<4) 疾病矩陣.push("水弱，腰駝，水絕腎氣不足、腰、足、便秘之疾。");
    if(命盤.分析.陰陽五行.水.力量形態數>0 && (命盤.分析.陰陽五行.木.力量形態數>6 || (命盤.分析.陰陽五行.木.力量比率 > 比率多 * 命盤.分析.陰陽五行.水.力量比率))) 疾病矩陣.push("水弱木旺，小便白濁、腎虛。");
    if(命盤.分析.陰陽五行.火.力量形態數>0 && (命盤.分析.陰陽五行.水.力量形態數>6 || (命盤.分析.陰陽五行.水.力量比率 > 比率多 * 命盤.分析.陰陽五行.火.力量比率))) 疾病矩陣.push("水旺火弱，心腎不交。");

    if((命盤.分析.陰陽五行.水.力量形態數<4 && 五行四季旺相休囚死("水", 命盤.生日.四季, 命盤.月令)=="死") || (命盤.分析.陰陽五行.火.力量形態數>5 && 命盤.分析.陰陽五行.土.力量形態數>5) || (命盤.分析.陰陽五行.水.力量形態數==0)){
        var 綜合論斷="水太弱或死絕者，炎夏調候之腎水受燥土剋，或逢火激土剋水，皆致腎臟及泌尿系統之患。";
        if(命盤.性別=="女") 綜合論斷 += "女性則有婦女病，患者多有胰臟尿道、便溺不利之疾。";
        疾病矩陣.push(綜合論斷);
    }

    if((100*(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率) > 50) && 命盤.分析.陰陽五行.金.力量形態數>4 && 命盤.分析.陰陽五行.水.力量形態數>4) 疾病矩陣.push("金水相生而太旺者，應多注意氣滯、鼻汗分泌、哮喘、咳嗽、鼻塞或感氣上沖，微覺煩燥不安，往往自覺胸骨下有創傷。並往往有呼吸迫促、口渴、喘嗚的現象。");
    if((100*(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率) < 25) && 命盤.分析.陰陽五行.金.力量形態數>0 && 命盤.分析.陰陽五行.水.力量形態數>0) 疾病矩陣.push("金水相生而太弱或死絕者，應多留意膀胱腎下腹，腎方面的疾病，患之者，常有尿意頻數、疼痛性淋漓，膀眈部有疼痛及壓迫感，初期輕症，尿數多，尿濁、口渴等嚴重一點的活，並有疼痛劇烈兼有出血的現象。");


    if((100*(命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.木.力量比率) < 30) && 命盤.分析.陰陽五行.水.力量形態數>0 && 命盤.分析.陰陽五行.土.力量形態數>0 && 命盤.分析.陰陽五行.木.力量形態數>0) 疾病矩陣.push("水土木無氣或死絕相沖剋者，容易有蠱氣腸脹吐逆之疾，腹部常覺有膨滿感不快、壓重的感覺，嚴重一點的，有嘔吐、腹瀉、腹痛之疾，所以平時應多注意腸、胃的調養。");
    if((100*(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.火.力量比率) < 30) && 命盤.分析.陰陽五行.金.力量形態數>0 && 命盤.分析.陰陽五行.水.力量形態數>0 && 命盤.分析.陰陽五行.火.力量形態數>0) 疾病矩陣.push("金水火無氣或死絕而相沖剋者，主容易得痢疾之病，腹部常覺柔軟無力，腹瀉痛，有時也會有發燒，四肢抽慉厥冷，顏色蒼白的現象，所以平時應多注意此方面的調養。");

    if(命盤.分析.陰陽五行.火.力量形態數>6 && 命盤.分析.陰陽五行.土.力量形態數>3 && 命盤.分析.陰陽五行.金.力量形態數==0) 疾病矩陣.push("火旺生土剋水，而無金者，身體上容易有腎臟及泌尿系統之患，患者常覺口渴、全心倦怠，精神不快、貧血、眩暈、食欲不振、浮腫等現象。");
    if(命盤.分析.陰陽五行.土.力量形態數>6 && 命盤.分析.陰陽五行.金.力量形態數>3 && 命盤.分析.陰陽五行.水.力量形態數==0) 疾病矩陣.push("土旺生金剋木，而無水者，身體上容易有肝、膽之疾，患之者常覺有嘔意，便秘、傷風感冒、倦怠感、食欲不振、氣色不佳、右上腹有痛感，所以平時應多注意肝臟方面的調養。");
    if(命盤.分析.陰陽五行.金.力量形態數>6 && 命盤.分析.陰陽五行.水.力量形態數>3 && 命盤.分析.陰陽五行.木.力量形態數==0) 疾病矩陣.push("金旺生水剋火，而無木者，容易患有小腸、咽喉病、心臟衰弱症，及扁桃腺之病，患者常覺心臟衰弱無力感，及壓迫性的疼痛，關節常因易得風濕而有酸痛感、及耳嗚、失眠等現象。");
    if(命盤.分析.陰陽五行.水.力量形態數>6 && 命盤.分析.陰陽五行.木.力量形態數>3 && 命盤.分析.陰陽五行.火.力量形態數==0) 疾病矩陣.push("水旺生木剋土，而無火者，容易患有胃、脾之疾，患之者常覺得，時常有腹痛胸口感到發燒難過，常打呃、口臭、全身倦怠感或有皮膚病、腸病、齒痛，等現象，所以平時應多注意腸、胃方面的調養。");
    if(命盤.分析.陰陽五行.木.力量形態數>6 && 命盤.分析.陰陽五行.火.力量形態數>3 && 命盤.分析.陰陽五行.土.力量形態數==0) 疾病矩陣.push("木旺生火剋金，而無生土，容易患有肺、支氣管、大腸、皮膚方面的疾病，患者常見得有咳嗽。痰多、打噴嚏、流鼻涕、傷風感冒、頭痛或氣喘的現象，所以平時應多注意肺部的調養。");

    if(疾病矩陣.length>0){
        var 疾病標題='<span class = "論斷單元">五 行 疾 病</span><br><br>';
        return 疾病標題+疾病矩陣.join("<br><br>");        
    }
}


function 五行喜忌總結(命盤){

	var 五行喜忌矩陣 = 命盤.分析.陰陽五行.五行喜忌總結; 
	var offset=1; //0 is subject, 五行start from 1, 木=1 ......

	for(var i=1; i<6; i++){
		var 喜忌力量=0; //忌的力量=0; 
		for(var j=0; j<五行喜忌矩陣.length; j++){
			if(五行喜忌矩陣[j][i]=="喜") {
                switch(五行喜忌矩陣[j][0]){
                    case "調侯喜忌":
                        喜忌力量+=4;
                        break;
                    case "窮通寶鑑":
                        喜忌力量+=2;
                        break;
                    case "三命通會":
                        喜忌力量+=4;
                        break;
                    default:
                       喜忌力量+=1; 
                }  //end switch 喜
            }  //end if 喜


			if(五行喜忌矩陣[j][i]=="忌") {
                switch(五行喜忌矩陣[j][0]){
                    case "調侯喜忌":
                        喜忌力量-=4;
                        break;
                    case "窮通寶鑑":
                        喜忌力量-=2;
                        break;
                    case "三命通會":
                        喜忌力量-=4;
                        break;
                    default:
                       喜忌力量-=1; 
                } //end switch 忌
            } //end if 忌
		} //end for

		//console.log(五行數轉字(i-offset) + 喜忌力量);
		if(喜忌力量>1) 命盤.分析.陰陽五行.數據[i-offset].喜忌="喜";
		if(喜忌力量<-1) 命盤.分析.陰陽五行.數據[i-offset].喜忌="忌";
        if(喜忌力量<=1 && 喜忌力量>=-1) 命盤.分析.陰陽五行.數據[i-offset].喜忌="";
	}
	
	var 喜忌總結=["喜忌總結", 命盤.分析.陰陽五行.數據[0].喜忌, 命盤.分析.陰陽五行.數據[1].喜忌, 命盤.分析.陰陽五行.數據[2].喜忌, 命盤.分析.陰陽五行.數據[3].喜忌, 命盤.分析.陰陽五行.數據[4].喜忌,""];
	五行喜忌矩陣.push(喜忌總結);


	// ** 總結喜忌 **
    var 五行喜="", 五行忌="";

    命盤.分析.陰陽五行.五行喜忌.木=	命盤.分析.陰陽五行.數據[0].喜忌; 命盤.分析.陰陽五行.木.喜忌 = 命盤.分析.陰陽五行.數據[0].喜忌;
    命盤.分析.陰陽五行.五行喜忌.火= 命盤.分析.陰陽五行.數據[1].喜忌; 命盤.分析.陰陽五行.火.喜忌 = 命盤.分析.陰陽五行.數據[1].喜忌;
    命盤.分析.陰陽五行.五行喜忌.土= 命盤.分析.陰陽五行.數據[2].喜忌; 命盤.分析.陰陽五行.土.喜忌 = 命盤.分析.陰陽五行.數據[2].喜忌;
    命盤.分析.陰陽五行.五行喜忌.金= 命盤.分析.陰陽五行.數據[3].喜忌; 命盤.分析.陰陽五行.金.喜忌 = 命盤.分析.陰陽五行.數據[3].喜忌;
    命盤.分析.陰陽五行.五行喜忌.水= 命盤.分析.陰陽五行.數據[4].喜忌; 命盤.分析.陰陽五行.水.喜忌 = 命盤.分析.陰陽五行.數據[4].喜忌;

	if(命盤.分析.陰陽五行.數據[0].喜忌=="喜") 五行喜 += "木"; if(命盤.分析.陰陽五行.數據[0].喜忌=="忌") 五行忌 += "木"; 
	if(命盤.分析.陰陽五行.數據[1].喜忌=="喜") 五行喜 += "火"; if(命盤.分析.陰陽五行.數據[1].喜忌=="忌") 五行忌 += "火"; 
	if(命盤.分析.陰陽五行.數據[2].喜忌=="喜") 五行喜 += "土"; if(命盤.分析.陰陽五行.數據[2].喜忌=="忌") 五行忌 += "土"; 
	if(命盤.分析.陰陽五行.數據[3].喜忌=="喜") 五行喜 += "金"; if(命盤.分析.陰陽五行.數據[3].喜忌=="忌") 五行忌 += "金"; 
	if(命盤.分析.陰陽五行.數據[4].喜忌=="喜") 五行喜 += "水"; if(命盤.分析.陰陽五行.數據[4].喜忌=="忌") 五行忌 += "水"; 
	
	命盤.分析.陰陽五行.五行喜忌.五行喜=五行喜;
	命盤.分析.陰陽五行.五行喜忌.五行忌=五行忌;


	var 五行喜忌註解=SpliceColumnFromArray(五行喜忌矩陣, 6, "Yes");
	var 五行喜忌註解單=Array2UnorderedList(五行喜忌註解);

	var 五行喜忌=RemoveColumnFromArray(五行喜忌矩陣, 6);

	五行喜忌.unshift("五行,木,火,土,金,水");

    var ArryTblProp = {
        "Caption": true, //with caption
        "CaptionStr": "五行喜忌表",
        "CaptionCSS": "default",
        "TableTitle": "",
        "RowHeight": 24, //px
        "ColumnWidth": [130, 50, 50, 50, 50, 50], //width for each column
        "HighligtedRow": [],
        "HighligtedCSS": "",
        "FirstRowIsTitle": true,
        "FirstColIsTitle": true,
        "RowTitleCSS": "",
        "ColTitleCSS": ""
    };

    var 五行喜忌表=ArryToTable(五行喜忌, ArryTblProp);
    var 五行四時宜忌標題='<span class = "論斷單元">五 行 四 時 宜 忌</span><br><br>';

    return 五行四時宜忌標題+五行喜忌註解單+五行喜忌表;

}


function 五行力量分佈總結計算(命盤){
    var 八字元件 = [];
    var 木力量 = 0, 火力量 = 0, 土力量 = 0, 金力量 = 0, 水力量 = 0, 整體五行力量=0;
	var 基本木力量 = 0, 基本火力量 = 0, 基本土力量 = 0, 基本金力量 = 0, 基本水力量 = 0;
	
	// ××××× 以八字五行直接斷五行力量，不考慮藏干 ×××××
    八字元件.push([命盤.年干.天干, 干支轉五行(命盤.年干.天干), 命盤.年干.力量]);
    八字元件.push([命盤.月干.天干, 干支轉五行(命盤.月干.天干), 命盤.月干.力量]);
    八字元件.push([命盤.日干.天干, 干支轉五行(命盤.日干.天干), 命盤.日干.力量]);
    八字元件.push([命盤.時干.天干, 干支轉五行(命盤.時干.天干), 命盤.時干.力量]);
	八字元件.push([命盤.年支.地支, 干支轉五行(命盤.年支.地支), 命盤.年支.力量]);
	八字元件.push([命盤.月支.地支, 干支轉五行(命盤.月支.地支), 命盤.月支.力量]);
	八字元件.push([命盤.日支.地支, 干支轉五行(命盤.日支.地支), 命盤.日支.力量]);
	八字元件.push([命盤.時支.地支, 干支轉五行(命盤.時支.地支), 命盤.時支.力量]);

    for (var i = 0; i < 八字元件.length;i++){
        //var 五行 = 八字元件[i][1];
        switch(八字元件[i][1]){ //五行 
            case "木":
            	基本木力量 += Number(八字元件[i][2]);
                break;
            case "火":
                基本火力量 += Number(八字元件[i][2]);
                break;
            case "土":
                基本土力量 += Number(八字元件[i][2]);
                break;
            case "金":
                基本金力量 += Number(八字元件[i][2]);
                break;
            case "水":
                基本水力量 += Number(八字元件[i][2]);
                break;
            default:
                alert(五行 + "：五行力量分佈總結計算 function 的 八字元件錯誤 ！");
        }
    } // end for

// ××××× 以八字五行力量計算，地支以藏干分佈 ×××××
    var 十干元件 = [];
    var 十干木力量 = 0, 十干火力量 = 0, 十干土力量 = 0, 十干金力量 = 0, 十干水力量 = 0;
	
    命盤.年支.藏干1力量=Number(藏干力量比率(命盤.年支.地支, 1))*命盤.年支.力量;
    命盤.年支.藏干2力量=Number(藏干力量比率(命盤.年支.地支, 2))*命盤.年支.力量;
    命盤.年支.藏干3力量=Number(藏干力量比率(命盤.年支.地支, 3))*命盤.年支.力量;
	
    命盤.月支.藏干1力量=藏干力量比率(命盤.月支.地支, 1)*命盤.月支.力量;
    命盤.月支.藏干2力量=藏干力量比率(命盤.月支.地支, 2)*命盤.月支.力量;
    命盤.月支.藏干3力量=藏干力量比率(命盤.月支.地支, 3)*命盤.月支.力量;

    命盤.日支.藏干1力量=藏干力量比率(命盤.日支.地支, 1)*命盤.日支.力量;
    命盤.日支.藏干2力量=藏干力量比率(命盤.日支.地支, 2)*命盤.日支.力量;
    命盤.日支.藏干3力量=藏干力量比率(命盤.日支.地支, 3)*命盤.日支.力量;

    命盤.時支.藏干1力量=藏干力量比率(命盤.時支.地支, 1)*命盤.時支.力量;
    命盤.時支.藏干2力量=藏干力量比率(命盤.時支.地支, 2)*命盤.時支.力量;
    命盤.時支.藏干3力量=藏干力量比率(命盤.時支.地支, 3)*命盤.時支.力量;
	
	// ××××× 以八字五行力量, 地支以藏干比率分佈天干的力量 ×××××
    十干元件.push([命盤.年干.天干, 干支轉五行(命盤.年干.天干), 命盤.年干.力量]);
  	十干元件.push([命盤.月干.天干, 干支轉五行(命盤.月干.天干), 命盤.月干.力量]);
    十干元件.push([命盤.日干.天干, 干支轉五行(命盤.日干.天干), 命盤.日干.力量]);
    十干元件.push([命盤.時干.天干, 干支轉五行(命盤.時干.天干), 命盤.時干.力量]);
	
	十干元件.push([命盤.年支.藏干1, 干支轉五行(命盤.年支.藏干1), 命盤.年支.藏干1力量]);
	if(命盤.年支.藏干2力量>0) 十干元件.push([命盤.年支.藏干2, 干支轉五行(命盤.年支.藏干2), 命盤.年支.藏干2力量]);
	if(命盤.年支.藏干3力量>0) 十干元件.push([命盤.年支.藏干3, 干支轉五行(命盤.年支.藏干3), 命盤.年支.藏干3力量]);

	十干元件.push([命盤.年支.藏干1, 干支轉五行(命盤.月支.藏干1), 命盤.月支.藏干1力量]);
	if(命盤.月支.藏干2力量>0) 十干元件.push([命盤.月支.藏干2, 干支轉五行(命盤.月支.藏干2), 命盤.月支.藏干2力量]);
	if(命盤.月支.藏干3力量>0) 十干元件.push([命盤.月支.藏干3, 干支轉五行(命盤.月支.藏干3), 命盤.月支.藏干3力量]);

	十干元件.push([命盤.日支.藏干1, 干支轉五行(命盤.日支.藏干1), 命盤.日支.藏干1力量]);
	if(命盤.日支.藏干2力量>0) 十干元件.push([命盤.日支.藏干2, 干支轉五行(命盤.日支.藏干2), 命盤.日支.藏干2力量]);
	if(命盤.日支.藏干3力量>0) 十干元件.push([命盤.日支.藏干3, 干支轉五行(命盤.日支.藏干3), 命盤.日支.藏干3力量]);

	十干元件.push([命盤.時支.藏干1, 干支轉五行(命盤.時支.藏干1), 命盤.時支.藏干1力量]);
	if(命盤.時支.藏干2力量>0) 十干元件.push([命盤.時支.藏干2, 干支轉五行(命盤.時支.藏干2), 命盤.時支.藏干2力量]);
	if(命盤.時支.藏干3力量>0) 十干元件.push([命盤.時支.藏干3, 干支轉五行(命盤.時支.藏干3), 命盤.時支.藏干3力量]);

    for (var i = 0; i < 十干元件.length;i++){
        switch(十干元件[i][1]){  //五行
            case "木":
            	十干木力量 += Number(十干元件[i][2]);
                break;
            case "火":
                十干火力量 += Number(十干元件[i][2]);
                break;
            case "土":
                十干土力量 += Number(十干元件[i][2]);
                break;
            case "金":
                十干金力量 += Number(十干元件[i][2]);
                break;
            case "水":
                十干水力量 += Number(十干元件[i][2]);
                break;
            default:
                alert(五行 + "：五行力量分佈總結計算 function 的 八字元件錯誤 ！");
        }
    } // end for
	
	
	if(命盤.系統參數.設定.地支五行用藏干===true){
		// 以地支藏干計算出來的力度為程式的五行力量
		木力量 = 十干木力量;
		火力量 = 十干火力量;
		土力量 = 十干土力量;
		金力量 = 十干金力量;
		水力量 = 十干水力量;	
	}
	else {
		// 以八字五行的力量計算出來的力度為程式的五行力量，不納入地支藏干比率分佈
		木力量 = 基本木力量;
		火力量 = 基本火力量;
		土力量 = 基本土力量;
		金力量 = 基本金力量;
		水力量 = 基本水力量;
	}
	
    // ***** 加入合化出來的力度 ****
    木力量 += Number(命盤.分析.陰陽五行.木.合化);
    火力量 += Number(命盤.分析.陰陽五行.火.合化);
    土力量 += Number(命盤.分析.陰陽五行.土.合化);
    金力量 += Number(命盤.分析.陰陽五行.金.合化);
    水力量 += Number(命盤.分析.陰陽五行.水.合化);

    整體五行力量 = 木力量 + 火力量 + 土力量 + 金力量 + 水力量;

    // ***** 導入命盤架構 ****
    命盤.分析.陰陽五行.五行力量總和 = 整體五行力量;  //整體五行力量的總和

    命盤.分析.陰陽五行.木.力量 = 木力量;
    命盤.分析.陰陽五行.木.力量比率 = 木力量/整體五行力量;
    命盤.分析.陰陽五行.火.力量 = 火力量;
    命盤.分析.陰陽五行.火.力量比率 = 火力量/整體五行力量;
    命盤.分析.陰陽五行.土.力量 = 土力量;
    命盤.分析.陰陽五行.土.力量比率 = 土力量/整體五行力量;
    命盤.分析.陰陽五行.金.力量 = 金力量;
    命盤.分析.陰陽五行.金.力量比率 = 金力量/整體五行力量;
    命盤.分析.陰陽五行.水.力量 = 水力量;
    命盤.分析.陰陽五行.水.力量比率 = 水力量/整體五行力量;

	命盤.分析.陰陽五行.五行總和比率=parseFloat(命盤.分析.陰陽五行.木.力量比率) + parseFloat(命盤.分析.陰陽五行.火.力量比率) + parseFloat(命盤.分析.陰陽五行.土.力量比率) + parseFloat(命盤.分析.陰陽五行.金.力量比率) + parseFloat(命盤.分析.陰陽五行.水.力量比率); // check sum ！！


	
	var 五行力量矩陣=[];
	五行力量矩陣.push("木："+(命盤.分析.陰陽五行.木.力量比率 * 100).toFixed(1) +"%（" + 命盤.分析.陰陽五行.木.力量.toFixed(2)+"）" );
	五行力量矩陣.push("火："+(命盤.分析.陰陽五行.火.力量比率 * 100).toFixed(1) +"%（" + 命盤.分析.陰陽五行.火.力量.toFixed(2)+"）" );	
	五行力量矩陣.push("土："+(命盤.分析.陰陽五行.土.力量比率 * 100).toFixed(1) +"%（" + 命盤.分析.陰陽五行.土.力量.toFixed(2)+"）" );	
	五行力量矩陣.push("金："+(命盤.分析.陰陽五行.金.力量比率 * 100).toFixed(1) +"%（" + 命盤.分析.陰陽五行.金.力量.toFixed(2)+"）" );
	五行力量矩陣.push("水："+(命盤.分析.陰陽五行.水.力量比率 * 100).toFixed(1) +"%（" + 命盤.分析.陰陽五行.水.力量.toFixed(2)+"）" );	
	
    var 五行力量總結 = Array2UnorderedList(五行力量矩陣, "五行力量總結：");
	
    return 五行力量總結;
    
}

function 五行圖表分析(命盤){
	
	var 五行圖表數據=命盤圖形資料組件(命盤,"五行","doughnut",true);
	var 五行圖表屬性={"Container": "nrxs-五行圖表分析", "Title": "五 行 分 佈", "bgColor": "#ECECEC"};
	
	五行十神圖表(五行圖表屬性, 五行圖表數據);
	
}

function 十神圖表分析(命盤){
	var 五神圖表數據=命盤圖形資料組件(命盤,"十神","doughnut",false);  //命盤,DataType, Chart Type, 日主在上的五行是否需要挪到最上方
	var 五神圖表屬性={"Container": "nrxs-五神圖表分析", "Title": "十 神 分 佈", "bgColor": "#ECECEC"};
	
	var 十神圖表數據=命盤圖形資料組件(命盤,"十神","bar",false);  //命盤,DataType, Chart Type, 日主在上的五行是否需要挪到最上方
    var 十神圖表屬性={"Container": "nrxs-十神圖表分析", "Title": "十 神 分 佈", "bgColor": "#ECECEC"};
    
	五行十神圖表(五神圖表屬性, 五神圖表數據);
    cjsBarChart(十神圖表屬性, 十神圖表數據);
}


function 月令旺相休囚死力度(旺相休囚死){
    switch(旺相休囚死){
        case "旺":
            return 0.5;
        case "相":
            return 0.25;
        case "休":
            return -0.15;
        case "囚":
            return -0.3;
        case "死":
            return -0.5;
    }
}

function 五行位置輸入矩陣(五行, 數據, offset, subject, NullChar){
	// this table is mean to arrange the 五行 in the table/array columnm
    //off set is to off set position from the left, especially for the subject/description
    
    var 五行矩陣=[];
    五行矩陣.push(subject);
    var pos = 五行字轉數(五行);
    for(var i=0; i<5; i++){
        if (i == pos) 五行矩陣.push(數據); else 五行矩陣.push(NullChar);
    }
    return 五行矩陣;
}


function 命盤圖形資料組件(命盤,項目,選項,日主在上){
	//項目: 1 五行, 2 十神
	//選項：1 doughnut chart
	//日主在上：true/false, 日主在上，就自動挪日主在第一位
	var MPDataObj=[];

	switch(項目){
		case "五行":
			switch(選項){
				case "doughnut":
					// no label for 五行 doughnut
					var toolTip木="五行：木<br\>喜忌：" + 命盤.分析.陰陽五行.數據[0].喜忌 + "<br\>數量：" + 命盤.分析.陰陽五行.木.數量 + "<br\>十神：" + 命盤.分析.陰陽五行.木.五神 + "<br\> 顏色：青<br\>方向：東<br\>卦：震<br\>五德：仁<br\>五味：酸<br\>五臟：心<br\>五腑：膽<br\>五邪：風";
					var toolTip火="五行：火<br\>喜忌：" + 命盤.分析.陰陽五行.數據[1].喜忌 + "<br\>數量：" + 命盤.分析.陰陽五行.火.數量 + "<br\>十神：" + 命盤.分析.陰陽五行.火.五神 + "<br\> 顏色：赤<br\>方向：南<br\>卦：離<br\>五德：禮<br\>五味：苦<br\>五臟：肝<br\>五腑：小腸<br\>五邪：熱";
					var toolTip土="五行：土<br\>喜忌：" + 命盤.分析.陰陽五行.數據[2].喜忌 + "<br\>數量：" + 命盤.分析.陰陽五行.土.數量 + "<br\>十神：" + 命盤.分析.陰陽五行.土.五神 + "<br\> 顏色：黃<br\>方向：中<br\>卦：坤<br\>五德：信<br\>五味：甘<br\>五臟：脾<br\>五腑：胃<br\>五邪：濕";
					var toolTip金="五行：金<br\>喜忌：" + 命盤.分析.陰陽五行.數據[3].喜忌 + "<br\>數量：" + 命盤.分析.陰陽五行.金.數量 + "<br\>十神：" + 命盤.分析.陰陽五行.金.五神 + "<br\> 顏色：白<br\>方向：西<br\>卦：兌<br\>五德：義<br\>五味：辛<br\>五臟：肺<br\>五腑：大腸<br\>五邪：燥";
					var toolTip水="五行：水<br\>喜忌：" + 命盤.分析.陰陽五行.數據[4].喜忌 + "<br\>數量：" + 命盤.分析.陰陽五行.水.數量 + "<br\>十神：" + 命盤.分析.陰陽五行.水.五神 + "<br\> 顏色：黑<br\>方向：北<br\>卦：坎<br\>五德：智<br\>五味：鹹<br\>五臟：腎<br\>五腑：膀胱<br\>五邪：寒";

					MPDataObj.push({"x": (100*命盤.分析.陰陽五行.木.力量比率).toFixed(1), "y": 命盤.分析.陰陽五行.木.力量, "name": "木", "label": "", "color": 干支五行字體顏色("木", "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": toolTip木});
					MPDataObj.push({"x": (100*命盤.分析.陰陽五行.火.力量比率).toFixed(1), "y": 命盤.分析.陰陽五行.火.力量, "name": "火", "label": "", "color": 干支五行字體顏色("火", "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": toolTip火});
					MPDataObj.push({"x": (100*命盤.分析.陰陽五行.土.力量比率).toFixed(1), "y": 命盤.分析.陰陽五行.土.力量, "name": "土", "label": "", "color": 干支五行字體顏色("土", "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": toolTip土});
					MPDataObj.push({"x": (100*命盤.分析.陰陽五行.金.力量比率).toFixed(1), "y": 命盤.分析.陰陽五行.金.力量, "name": "金", "label": "", "color": 干支五行字體顏色("金", "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": toolTip金});
					MPDataObj.push({"x": (100*命盤.分析.陰陽五行.水.力量比率).toFixed(1), "y": 命盤.分析.陰陽五行.水.力量, "name": "水", "label": "", "color": 干支五行字體顏色("水", "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": toolTip水});
					break;
				case "bar":
					break;
			}
            
            if(日主在上){
                var 日主五行數=五行字轉數(命盤.日主五行);
                for(var i=0; i<日主五行數; i++){
                    //var tempdata={"x": MPDataObj[0].x, "y": MPDataObj[0].y, "name":MPDataObj[0].name, "label": MPDataObj[0].label, "color": MPDataObj[0].color};
                    var tempdata=MPDataObj[0];
                    MPDataObj.shift();
                    MPDataObj.push(tempdata);
                } //end for
            } //end if
            break;  //五行項目
		case "十神":
			switch(選項){
				case "doughnut":
					// no label for 五行 doughnut
					MPDataObj.push({"x": (100*命盤.分析.五神.比劫.力量比率).toFixed(1), "y": parseFloat((命盤.分析.五神.比劫.力量).toFixed(1)), "name": "比劫", "label": "", "color": 干支五行字體顏色(命盤.分析.五神.比劫.五行, "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": 命盤.分析.五神.比劫.五行});
					MPDataObj.push({"x": (100*命盤.分析.五神.食傷.力量比率).toFixed(1), "y": parseFloat((命盤.分析.五神.食傷.力量).toFixed(1)), "name": "食傷", "label": "", "color": 干支五行字體顏色(命盤.分析.五神.食傷.五行, "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": 命盤.分析.五神.食傷.五行});
					MPDataObj.push({"x": (100*命盤.分析.五神.財才.力量比率).toFixed(1), "y": parseFloat((命盤.分析.五神.財才.力量).toFixed(1)), "name": "財才", "label": "", "color": 干支五行字體顏色(命盤.分析.五神.財才.五行, "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": 命盤.分析.五神.財才.五行});
					MPDataObj.push({"x": (100*命盤.分析.五神.官殺.力量比率).toFixed(1), "y": parseFloat((命盤.分析.五神.官殺.力量).toFixed(1)), "name": "官殺", "label": "", "color": 干支五行字體顏色(命盤.分析.五神.官殺.五行, "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": 命盤.分析.五神.官殺.五行});
					MPDataObj.push({"x": (100*命盤.分析.五神.印梟.力量比率).toFixed(1), "y": parseFloat((命盤.分析.五神.印梟.力量).toFixed(1)), "name": "印梟", "label": "", "color": 干支五行字體顏色(命盤.分析.五神.印梟.五行, "ColorCode"), "legendText": "{name} {x}%", "toolTipContent": 命盤.分析.五神.印梟.五行});
					//console.log(100*命盤.分析.五神.比劫.力量比率);
                    //console.log(MPDataObj);
                    break;
				case "bar":
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[9].力量比率).toFixed(1)), "name": "正印", "label": "正印", "color": 干支五行字體顏色(命盤.分析.五神.印梟.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "正印")+"（"+天干屬性(十神天干(命盤.日主, "正印"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[8].力量比率).toFixed(1)), "name": "偏印", "label": "偏印", "color": 干支五行字體顏色(命盤.分析.五神.印梟.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "偏印")+"（"+天干屬性(十神天干(命盤.日主, "偏印"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[7].力量比率).toFixed(1)), "name": "正官", "label": "正官", "color": 干支五行字體顏色(命盤.分析.五神.官殺.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "正官")+"（"+天干屬性(十神天干(命盤.日主, "正官"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[6].力量比率).toFixed(1)), "name": "七殺", "label": "七殺", "color": 干支五行字體顏色(命盤.分析.五神.官殺.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "七殺")+"（"+天干屬性(十神天干(命盤.日主, "七殺"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[5].力量比率).toFixed(1)), "name": "正財", "label": "正財", "color": 干支五行字體顏色(命盤.分析.五神.財才.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "正財")+"（"+天干屬性(十神天干(命盤.日主, "正財"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[4].力量比率).toFixed(1)), "name": "偏財", "label": "偏財", "color": 干支五行字體顏色(命盤.分析.五神.財才.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "偏財")+"（"+天干屬性(十神天干(命盤.日主, "偏財"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[3].力量比率).toFixed(1)), "name": "傷官", "label": "傷官", "color": 干支五行字體顏色(命盤.分析.五神.食傷.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "傷官")+"（"+天干屬性(十神天干(命盤.日主, "傷官"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[2].力量比率).toFixed(1)), "name": "食神", "label": "食神", "color": 干支五行字體顏色(命盤.分析.五神.食傷.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "食神")+"（"+天干屬性(十神天干(命盤.日主, "食神"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[1].力量比率).toFixed(1)), "name": "劫財", "label": "劫財", "color": 干支五行字體顏色(命盤.分析.五神.比劫.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "劫財")+"（"+天干屬性(十神天干(命盤.日主, "劫財"), "臟腑")+"）", "indexLabel": "{y}%"});
					MPDataObj.push({"y": parseFloat((100*命盤.分析.十神.數據[0].力量比率).toFixed(1)), "name": "比肩", "label": "比肩", "color": 干支五行字體顏色(命盤.分析.五神.比劫.五行, "ColorCode"), "legendText": "{name} {y}%", "toolTipContent": 十神天干(命盤.日主, "比肩")+"（"+天干屬性(十神天干(命盤.日主, "比肩"), "臟腑")+"）", "indexLabel": "{y}%"});
					//console.log(MPDataObj);
                    break;
			}
			break; //十神項目
            
	} // end switch(項目)
	
	return MPDataObj;
}

function 五行強弱等級(命盤){
	var 五行計算力度;
	
	五行計算力度=強弱等級(命盤.分析.陰陽五行.木.力量比率*100); 命盤.分析.陰陽五行.木.力量形態=五行計算力度.形態; 命盤.分析.陰陽五行.木.力量形態數=五行計算力度.形態數; 命盤.分析.陰陽五行.數據[0].力量形態數=五行計算力度.形態數;
	五行計算力度=強弱等級(命盤.分析.陰陽五行.火.力量比率*100); 命盤.分析.陰陽五行.火.力量形態=五行計算力度.形態; 命盤.分析.陰陽五行.火.力量形態數=五行計算力度.形態數; 命盤.分析.陰陽五行.數據[1].力量形態數=五行計算力度.形態數;
	五行計算力度=強弱等級(命盤.分析.陰陽五行.土.力量比率*100); 命盤.分析.陰陽五行.土.力量形態=五行計算力度.形態; 命盤.分析.陰陽五行.土.力量形態數=五行計算力度.形態數; 命盤.分析.陰陽五行.數據[2].力量形態數=五行計算力度.形態數;
	五行計算力度=強弱等級(命盤.分析.陰陽五行.金.力量比率*100); 命盤.分析.陰陽五行.金.力量形態=五行計算力度.形態; 命盤.分析.陰陽五行.金.力量形態數=五行計算力度.形態數; 命盤.分析.陰陽五行.數據[3].力量形態數=五行計算力度.形態數;
	五行計算力度=強弱等級(命盤.分析.陰陽五行.水.力量比率*100); 命盤.分析.陰陽五行.水.力量形態=五行計算力度.形態; 命盤.分析.陰陽五行.水.力量形態數=五行計算力度.形態數; 命盤.分析.陰陽五行.數據[4].力量形態數=五行計算力度.形態數;
	
	//console.log(命盤.分析.陰陽五行);
}

function 強弱等級(五行力量){
    //五行力量比率，%
    var 等級;
	var 等級數;
		
    switch(true){
        case (五行力量==0):
            等級="全無";
            等級數=0;
            break;
        case (五行力量>0 && 五行力量<9):
            等級="極弱";
            等級數=3;
            break;
        case (五行力量>=9 && 五行力量<18):
            等級="弱";
            等級數=4;
            break;
        case (五行力量>=18 && 五行力量<22):
            等級="中和";
            等級數=5;
            break;
        case (五行力量>=22 && 五行力量<31):
            等級="旺相";
            等級數=6;
            break;
        case (五行力量>=31 && 五行力量<39):
            等級="太過";
            等級數=7;
            break;
        case (五行力量>=39):
            等級="極強";
            等級數=8;
            break;
    } // end switch
    return {"形態":等級, "形態數":等級數};
}


function 五行力量排列(命盤){
	var 五行矩陣=[
			{"五行": 命盤.分析.陰陽五行.木.五行, "力量": (parseFloat(命盤.分析.陰陽五行.木.力量比率)*100), "五行順序": 0, "力量順序": -1},
			{"五行": 命盤.分析.陰陽五行.火.五行, "力量": (parseFloat(命盤.分析.陰陽五行.火.力量比率)*100), "五行順序": 1,  "力量順序": -1},
			{"五行": 命盤.分析.陰陽五行.土.五行, "力量": (parseFloat(命盤.分析.陰陽五行.土.力量比率)*100), "五行順序": 2,  "力量順序": -1},
			{"五行": 命盤.分析.陰陽五行.金.五行, "力量": (parseFloat(命盤.分析.陰陽五行.金.力量比率)*100), "五行順序": 3,  "力量順序": -1},
			{"五行": 命盤.分析.陰陽五行.水.五行, "力量": (parseFloat(命盤.分析.陰陽五行.水.力量比率)*100), "五行順序": 4,  "力量順序": -1}
		];

	sortArrOfObjectsByParam(五行矩陣, "力量", true);

	五行矩陣[0].力量順序=0; 五行矩陣[1].力量順序=1; 五行矩陣[2].力量順序=2; 五行矩陣[3].力量順序=3; 五行矩陣[4].力量順序=4;

	命盤.分析.陰陽五行.數據[五行矩陣[0].五行順序].力量順序=五行矩陣[0].力量順序;
	命盤.分析.陰陽五行.數據[五行矩陣[1].五行順序].力量順序=五行矩陣[1].力量順序;
	命盤.分析.陰陽五行.數據[五行矩陣[2].五行順序].力量順序=五行矩陣[2].力量順序;
	命盤.分析.陰陽五行.數據[五行矩陣[3].五行順序].力量順序=五行矩陣[3].力量順序;
	命盤.分析.陰陽五行.數據[五行矩陣[4].五行順序].力量順序=五行矩陣[4].力量順序;
	
	//  ----------- 測 五行是否有流通，該五行有生則流通，如果下個五行是0，或是太小，則不流通
	/* 
		五行生剋制化宜忌：
		金：金旺得火，方成器皿。
		金能生水，水多金沉；強金得水，方挫其鋒。
		金能剋木，木多金缺；木弱逢金，必為砍折。
		金賴土生，土多金埋；土能生金，金多土變。
		火：火旺得水，方成相濟。
		火能生土，土多火晦；強火得土，方止其焰。
		火能剋金，金多火熄；金弱遇火，必見銷熔。
		火賴木生，木多火熾；木能生火，火多木焚。
		水：水旺得土，方成池沼。
		水能生木，木多水縮；強水得木，方洩其勢。
		水能剋火，火多水幹；火弱遇水，必不熄滅。
		水賴金生，金多水濁；金能生水，水多金沉。
		土：土旺得水，方能疏通。
		土能生金，金多土變；強土得金，方制其壅。
		土能剋水，水多土流；水弱逢土，必為淤塞。
		土賴火生，火多土焦；火能生土，土多火晦。
		木：木旺得金，方成棟樑。
		木能生火，火多木焚；強木得火，方化其頑。
		木能剋土，土多木折；土弱逢木，必為傾陷。
		木賴水生，水多木漂；水能生木，木多水縮。
	*/
	var 流通倍數=10;
	
	// ×× 木火關係 ××
	if(命盤.分析.陰陽五行.木.力量!=0){
		if((流通倍數 * 命盤.分析.陰陽五行.火.力量 > 命盤.分析.陰陽五行.木.力量) && (流通倍數 * 命盤.分析.陰陽五行.木.力量 > 命盤.分析.陰陽五行.火.力量)){
			命盤.分析.陰陽五行.木.流通=true;
			命盤.分析.陰陽五行.數據[0].流通=true;
		}
	}

	// ×× 火土關係 ××
	if(命盤.分析.陰陽五行.火.力量!=0){
		if((流通倍數 * 命盤.分析.陰陽五行.土.力量 > 命盤.分析.陰陽五行.火.力量) && (流通倍數 * 命盤.分析.陰陽五行.火.力量 > 命盤.分析.陰陽五行.土.力量)){
			命盤.分析.陰陽五行.火.流通=true;
			命盤.分析.陰陽五行.數據[1].流通=true;

		}
	}

	// ×× 土金關係 ××
	if(命盤.分析.陰陽五行.土.力量!=0){
		if((流通倍數 * 命盤.分析.陰陽五行.金.力量 > 命盤.分析.陰陽五行.土.力量) && (流通倍數 * 命盤.分析.陰陽五行.土.力量 > 命盤.分析.陰陽五行.金.力量)){
			命盤.分析.陰陽五行.土.流通=true;
			命盤.分析.陰陽五行.數據[2].流通=true;
		}
	}

	// ×× 金水關係 ××
	if(命盤.分析.陰陽五行.金.力量!=0){
		if((流通倍數 * 命盤.分析.陰陽五行.水.力量 > 命盤.分析.陰陽五行.金.力量) && (流通倍數 * 命盤.分析.陰陽五行.金.力量 > 命盤.分析.陰陽五行.水.力量)){
			命盤.分析.陰陽五行.金.流通=true;
			命盤.分析.陰陽五行.數據[3].流通=true;
		}
	}
	
	// ×× 水木關係 ××
	if(命盤.分析.陰陽五行.水.力量!=0){
		if((流通倍數 * 命盤.分析.陰陽五行.木.力量 > 命盤.分析.陰陽五行.水.力量) && (流通倍數 * 命盤.分析.陰陽五行.水.力量 > 命盤.分析.陰陽五行.木.力量)){
			命盤.分析.陰陽五行.水.流通=true;
			命盤.分析.陰陽五行.數據[4].流通=true;
		}
	}
	
	//clone 五行力量順序排列好的五行矩陣去命盤
	命盤.分析.陰陽五行.五行力量順序=JSON.parse(JSON.stringify(五行矩陣));
	//console.log(命盤.分析.陰陽五行.數據);
}

function 窮通寶鑑五行四時(日主五行, 四季, 命盤) {
    var 四時五行矩陣=[];
    var 四時五行論斷={"四時五行": "", "值令": "",  "註解": "", "木": "", "火": "", "土": "", "金": "", "水": ""};
	var 五行相對旺比率=1.5;
	var 少的比率=0.15;

    switch(日主五行){
        case "木":
            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春木"; 四時五行論斷.值令="旺";
                    四時五行論斷.註解="木生於春，餘寒猶存，喜火溫暖，則無盤屈之患。藉水資扶，而有舒暢之美。春初不宜水盛，陰濃則根損枝枯。春木陽氣煩燥，無水則葉槁根乾，是以水火二物，旣濟方佳，土多而損力，土薄則財豐。忌逢金重，傷殘尅伐，一生不閑，設使木旺，得金則良 ，終身獲福。";
                    四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="喜";
                    
                    if(命盤.分析.陰陽五行.火.力量形態數>5) 四時五行論斷.火="忌";
                    if(命盤.分析.陰陽五行.水.力量形態數>5) 四時五行論斷.水="忌";
                    if(命盤.分析.陰陽五行.土.力量形態數<4) 四時五行論斷.土="喜"; if(命盤.分析.陰陽五行.土.力量形態數>5) 四時五行論斷.土="忌";
                    if(命盤.分析.陰陽五行.金.力量形態數>5) 四時五行論斷.金="忌";
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) 四時五行論斷.金="喜";
                    break;
					
                case "夏":
                    四時五行論斷.四時五行="夏木"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="根乾葉燥，盤而且直，屈而能伸，欲得水盛而成滋潤之力。誠不可缺少，切忌火旺而招焚化之憂，故以爲凶。土宜在薄，不可厚重，厚則反爲災咎，惡在金多，不可欠缺，缺則不能琢削，重重見木，徒以成林，疊疊逢華，終無結果。";
                    四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";

                    if(命盤.分析.陰陽五行.火.力量形態數>5) 四時五行論斷.火="忌";
                    //if(命盤.分析.陰陽五行.土.力量形態數<4) 四時五行論斷.土="喜"; if(命盤.分析.陰陽五行.土.力量形態數>5) 四時五行論斷.土="忌";
					if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 四時五行論斷.土="喜"; else 四時五行論斷.土="忌";
                    if(命盤.分析.陰陽五行.金.力量形態數>5) 四時五行論斷.金="忌";
                    if(命盤.分析.陰陽五行.木.力量形態數>5) 四時五行論斷.木="忌";
                    
                    break;
                case "秋":
                    四時五行論斷.四時五行="秋木"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="氣漸淒涼，形漸凋敗，初秋之時，火氣未除，尤喜水土以相滋。中秋之令，果已成實，欲得剛金而修削。霜降後不宜水盛，水盛則木漂。寒露節又喜火炎，火炎則木實，木多有多材之美，土厚無自任之能。";
                    四時五行論斷.木="喜"; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(節氣字轉值(命盤.生日.節氣)<節氣字轉值("秋分")) {
                        四時五行論斷.水="喜";
                        四時五行論斷.土="喜"; 
                    }

                    if(節氣字轉值(命盤.生日.節氣)>=節氣字轉值("秋分")) 四時五行論斷.金="喜";
                    if(節氣字轉值(命盤.生日.節氣)>=節氣字轉值("寒露")) 四時五行論斷.火="喜";
                    if(節氣字轉值(命盤.生日.節氣)>=節氣字轉值("霜降")) {
                        if(命盤.分析.陰陽五行.水.力量形態數>5) 四時五行論斷.水="忌";
                    }

                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率) 四時五行論斷.土="忌";

                    break;

                case "冬":
                    四時五行論斷.四時五行="冬木"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="盤屈在地，欲土多而培養，惡水盛而忘形，金縱多不能尅伐，火重見溫燠有功，歸根復命之時，木病安能輔助須忌死絕之地，只宜生旺之方。";
                    四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="喜"; 四時五行論斷.水="";
                    
                    if(命盤.分析.陰陽五行.水.力量形態數>5) {
                        四時五行論斷.水="忌";
                        四時五行論斷.金=""
                    }
                    break;      
            }
            break;

        case "火":
            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春火"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="母旺子相，勢力並行，喜木生扶，不宜過旺，旺則火炎，欲水旣濟，不愁興盛，盛則沾恩。土多則蹇塞埋光，火盛則傷多烈燥。見金可以施功，縱重見，才富尤遂。";
                    
                    四時五行論斷.木="喜"; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";
                    if(命盤.分析.陰陽五行.木.力量形態數>5) 四時五行論斷.木="忌";
                    if(命盤.分析.陰陽五行.土.力量形態數>5) 四時五行論斷.土="忌";
                    if(命盤.分析.陰陽五行.火.力量形態數>5) 四時五行論斷.火="忌";

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 四時五行論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";

                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5){
                            四時五行論斷.金="忌";
                            四時五行論斷.水="忌";
                        }
                    }
                    break;

                case "夏":
                    四時五行論斷.四時五行="夏火"; 四時五行論斷.值令="旺";
                    四時五行論斷.註解="秉令乘權，逢水制則免自焚之咎，見木助，必招夭折之患。遇金必作良工，得土遂成稼穡，金土雖爲美利，無水則金燥土焦，再加木助，太過傾危。";
                    四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";
                    
                    if(命盤.分析.陰陽五行.水.力量形態數==0 && 命盤.分析.陰陽五行.木.力量形態數>5){
                        四時五行論斷.金="";
                        四時五行論斷.土="";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 四時五行論斷.木="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 >=5) 四時五行論斷.火="忌";
                        四時五行論斷.金="喜";
                        四時五行論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.金="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 四時五行論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5) {
                        if(命盤.分析.陰陽五行.金.力量形態數 >=5 && (命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 四時五行論斷.金="忌";
                        if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 四時五行論斷.水="忌";
                    }
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="性息體休，得木生則有復明之慶。遇水尅難免隕滅之災。土重而掩息其光，金多而損傷其勢。火見火以光輝，縱疊見而必利。";
                    四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 四時五行論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.金="忌";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.土="忌";
                    if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.金="忌";
                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.水="忌";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.土.力量比率*五行相對旺比率) 四時五行論斷.土="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率*五行相對旺比率) 四時五行論斷.金="喜";
                    break;

                case "冬":
                    四時五行論斷.四時五行="冬火"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="體絕形亡，喜木生而有救，遇水尅以爲殃，欲土制爲榮。愛火比爲利，見金則難任財，無金而不遭害，天地雖傾，火水難成。";
                    四時五行論斷.木="喜"; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="忌"; 四時五行論斷.水="忌";
                    
                    break;
            }
            break;
        case "土":
            //四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";
            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.土.力量形態數 <5) {
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    四時五行論斷.土="喜";
                    四時五行論斷.水="忌";
                }
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    四時五行論斷.土="喜";
                    四時五行論斷.木="忌";
                }
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    四時五行論斷.土="喜";
                    四時五行論斷.金="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                if(命盤.分析.陰陽五行.土.力量形態數 <5) 四時五行論斷.土="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.火.力量形態數 >5) 四時五行論斷.火="忌";
                if(命盤.分析.陰陽五行.土.力量形態數 >5) 四時五行論斷.土="忌";
            }
            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.土.力量比率)) 四時五行論斷.水="喜";
            
            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春土"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="其勢虛浮，喜火生扶，惡木太過，忌水泛濫，喜土比助，得金而制木爲祥，金太多仍盜土氣。";
                    四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="喜"; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.木.力量形態數>5) 四時五行論斷.木="忌";
                    if(命盤.分析.陰陽五行.水.力量形態數>5) 四時五行論斷.水="忌";
                    if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) 四時五行論斷.金="忌";
                    break;

                case "夏":
                    四時五行論斷.四時五行="夏土"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="其勢燥烈，得盛水滋潤成功。忌旺火煆煉焦坼。木助火炎，水尅無礙，金生水泛，妻才有益，見比肩蹇滞不通，如太過又宜木尅。";
                    四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.土.力量形態數 <5) {
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                            四時五行論斷.土="喜";
                            四時五行論斷.水="忌";
                        }
                        if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                            四時五行論斷.土="喜";
                            四時五行論斷.木="忌";
                        }
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 >0.3) {
                        四時五行論斷.火="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.5){
                            if(命盤.分析.陰陽五行.金.力量形態數 <5) 四時五行論斷.金="喜";
                            if(命盤.分析.陰陽五行.水.力量形態數 <=5) 四時五行論斷.水="喜";
                        }
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數 >5 && 命盤.分析.陰陽五行.水.力量比率>0.1) 四時五行論斷.木="喜"; 
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋土"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="子旺母衰，金多而耗盜其氣，木盛須制伏純良，火重重而不厭，水泛泛而不祥。得比肩則能助力，至降霜不比無妨。";
                    四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.金.力量形態數>5) 四時五行論斷.金="忌";
                    if(命盤.分析.陰陽五行.水.力量形態數>5) 四時五行論斷.水="忌";
                    if(節氣字轉值(命盤.生日.節氣)<節氣字轉值("霜降")) 四時五行論斷.土="喜";
                    if(節氣字轉值(命盤.生日.節氣)>=節氣字轉值("霜降") && 命盤.分析.陰陽五行.土.力量形態數>5) 四時五行論斷.土="忌";
                    break;

                case "冬":
                    四時五行論斷.四時五行="冬土"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="外寒內溫，水旺才豐，金多子秀，火盛有榮，木多無咎，再加比肩扶助爲佳，更喜身主康強足壽。";
                    //四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金="喜"; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 >=5){
                        if(命盤.分析.陰陽五行.水.力量形態數 <6) 四時五行論斷.水="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 <6) 四時五行論斷.金="喜";
                        if(命盤.分析.陰陽五行.木.力量形態數 <6) 四時五行論斷.木="喜";
                    }
                    break;    
            }
            break;

        case "金":
            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.金.力量形態數 <5) {
                if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    四時五行論斷.金="喜";
                    四時五行論斷.火="忌";
                }
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    四時五行論斷.金="喜";
                    四時五行論斷.木="忌";
                }
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    四時五行論斷.金="喜";
                    四時五行論斷.水="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.金.力量形態數 <5) 四時五行論斷.金="喜";
                if(命盤.分析.陰陽五行.土.力量形態數 <5) 四時五行論斷.土="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.金.力量形態數 >5) 四時五行論斷.金="忌";
                if(命盤.分析.陰陽五行.土.力量形態數 >5) 四時五行論斷.土="忌";
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.木="喜";

            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春金"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="餘寒未盡，貴乎火氣爲榮，性柔體弱，欲得厚土輔助。水盛增寒，難施鋒銳之勢。木旺損力，有剉鈍之危，金來比助，扶持最妙，比而無火，失類非良。";
                    //四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="喜"; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) {
                            四時五行論斷.木="忌";
                            if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                            四時五行論斷.金="喜";
                        }
                        if(命盤.分析.陰陽五行.水.力量形態數 >5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) {
                            四時五行論斷.水="忌";
                            if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                            四時五行論斷.金="喜";
                        }
                    }
                    break;

                case "夏":
                    四時五行論斷.四時五行="夏金"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="尤爲柔弱，形質未具，尤嫌死絕，火多而卻爲不厭，水盛而滋潤呈祥，見木而助鬼傷身，遇金而扶持精壯，土薄而最爲有用，土厚而埋沒無光。";
                    //四時五行論斷.木="忌"; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";

                    if(命盤.分析.陰陽五行.水.力量形態數<=6 && (命盤.分析.陰陽五行.水.力量比率 <= 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.水="喜";
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 四時五行論斷.木="忌";
                        if(命盤.分析.陰陽五行.金.力量形態數 <5) 四時五行論斷.金="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數<5 && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.土="喜";
                    if(命盤.分析.陰陽五行.土.力量形態數>=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.土="忌";
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋金"; 四時五行論斷.值令="旺";
                    四時五行論斷.註解="當權得令，火來煆鍊，遂成鍾鼎之材，土多培養，反惹頑濁之氣。見水則精神，越秀，逢木則琢削施威。金助愈剛，剛過則決，氣重愈旺，旺極則衰。";
                    //四時五行論斷.木="喜"; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";

                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.土="忌";
                    if(命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.水="喜";
                    if(命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.木="喜";
                    if(命盤.分析.陰陽五行.金.力量形態數>5) 四時五行論斷.金="忌";
                    break;

                case "冬":
                    四時五行論斷.四時五行="冬金"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="形寒性冷，木多則難施琢削之功，水盛而未免沈潛之患，土能制水，金體不寒，火來助土，子母成功，喜比肩聚氣相扶，欲官印溫養爲利。";
                    //四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.木.力量形態數 >=5) 四時五行論斷.木="";
                    if(命盤.分析.陰陽五行.水.力量形態數 >=5) 四時五行論斷.水="忌";
                    if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.土.力量形態數 <=5) 四時五行論斷.土="喜";
                    if(命盤.分析.陰陽五行.金.力量形態數 <=5 && 命盤.分析.陰陽五行.火.力量形態數>0 && 命盤.分析.陰陽五行.土.力量形態數>0) 四時五行論斷.金="喜";
                    break;
            }
            break;

        case "水":
            四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.水.力量形態數 <5) {
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //印重身輕
                    四時五行論斷.水="喜";
                    四時五行論斷.金="忌";
                }
                if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //財重身輕
                    四時五行論斷.水="喜";
                    四時五行論斷.火="忌";
                }
                if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //官重身輕
                    四時五行論斷.水="喜";
                    四時五行論斷.土="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.水.力量形態數 <5) 四時五行論斷.水="喜";
                if(命盤.分析.陰陽五行.金.力量形態數 <5) 四時五行論斷.金="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.水.力量形態數 >5) 四時五行論斷.水="忌";
                if(命盤.分析.陰陽五行.金.力量形態數 >5) 四時五行論斷.金="忌";

                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 < 0.4) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率)) 四時五行論斷.木="喜";  //喜食傷
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 < 0.4) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率)) 四時五行論斷.火="喜"; //喜財
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 < 0.4)) 四時五行論斷.土="喜"; //喜官殺
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.火="喜";

            // *************** 通則-5：官殺強，印弱，喜印 ***************
            if((命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.金="喜";

            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春水"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="性濫滔淫，再逢水助，必有崩堤之勢，若加土盛，則無泛漲之憂。喜金生扶，不宜金盛，欲火旣濟，不要火多，見木而可施功，無土仍愁散漫。";
                    //四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金=""; 四時五行論斷.水="忌";

                    if(命盤.分析.陰陽五行.水.力量形態數 >5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4)) {
                        四時五行論斷.水="忌";
                        四時五行論斷.土="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量形態數 <=5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率)) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.木.力量形態數 <=5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率)) 四時五行論斷.木="喜";
                    break;

                case "夏":
                    四時五行論斷.四時五行="夏水"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="執性歸源，時當涸際，欲得比肩，喜金生而助體，忌火旺而炥乾，木盛則盗其氣，土旺則制其流。";
					
					// 喜印比已建立在通則
					if(命盤.分析.陰陽五行.火.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.火="忌";
					if(命盤.分析.陰陽五行.木.力量形態數 >=5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.木="忌";
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.土="忌";
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋水"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="母旺子相，表裏晶瑩，得金助則淸澄，逢土旺而混濁，火多而財盛，木重而子榮，重重見水，增其泛濫之憂，疊疊逢土，始得淸平之意。";
                    
					if(命盤.分析.陰陽五行.金.力量形態數 <=5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 < 0.4)) 四時五行論斷.金="喜";
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.土="忌";
					if(命盤.分析.陰陽五行.火.力量形態數 <=5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.火="喜";
					if(命盤.分析.陰陽五行.木.力量形態數 <=5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.木="喜";
					if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4)) {
						四時五行論斷.水="忌";
						四時五行論斷.土="喜";
					}
                    break;

                case "冬":
                    四時五行論斷.四時五行="冬水"; 四時五行論斷.值令="旺";
                    四時五行論斷.註解="司令當權，遇火，則增暖除寒，見土，則形藏歸化，金多，反曰無義。木盛，是謂有情，土太過，勢成涸轍，水氾濫，喜土堤防。";
                    
					if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.土="忌";
					if(命盤.分析.陰陽五行.金.力量形態數 >=5 && (命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.金="忌";
					if(命盤.分析.陰陽五行.木.力量形態數 <=5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.木="喜";
					if(命盤.分析.陰陽五行.水.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.土="喜";
                    break;      
            }
            break;
    }
	
	var 五行值令=四時五行論斷.四時五行+"，值"+四時五行論斷.值令+"令，";
    var 總結註解="《窮通寶鑑》：" + 五行值令 + 四時五行論斷.註解;
    var 總結矩陣=["窮通寶鑑", 四時五行論斷.木, 四時五行論斷.火, 四時五行論斷.土, 四時五行論斷.金, 四時五行論斷.水, 總結註解];

	
    命盤.分析.陰陽五行.五行喜忌總結.push(總結矩陣);

    /*
    var 五行喜="", 五行忌="";
    // 五行的喜忌以窮通寶鑑的喜忌為標準
    命盤.分析.陰陽五行.五行喜忌.木=四時五行論斷.木;
    命盤.分析.陰陽五行.五行喜忌.火=四時五行論斷.火;
    命盤.分析.陰陽五行.五行喜忌.土=四時五行論斷.土;
    命盤.分析.陰陽五行.五行喜忌.金=四時五行論斷.金;
    命盤.分析.陰陽五行.五行喜忌.水=四時五行論斷.水;
	
	if(四時五行論斷.木=="喜") 五行喜 += "木"; if(四時五行論斷.木=="忌") 五行忌 += "木"; 
	if(四時五行論斷.火=="喜") 五行喜 += "火"; if(四時五行論斷.火=="忌") 五行忌 += "火"; 
	if(四時五行論斷.土=="喜") 五行喜 += "土"; if(四時五行論斷.土=="忌") 五行忌 += "土"; 
	if(四時五行論斷.金=="喜") 五行喜 += "金"; if(四時五行論斷.金=="忌") 五行忌 += "金"; 
	if(四時五行論斷.水=="喜") 五行喜 += "水"; if(四時五行論斷.水=="忌") 五行忌 += "水"; 
	
	命盤.分析.陰陽五行.五行喜忌.五行喜=五行喜;
	命盤.分析.陰陽五行.五行喜忌.五行忌=五行忌;
    */
}

function 四時調候(日主五行, 四季, 命盤) {
    //var 四時五行矩陣=[];
    //var 五行相對旺比率=1.5;
	var 少的比率=0.15; //overall less than 15%
    var 四時五行論斷={"四時五行": "", "值令": "",  "註解": "", "木": "", "火": "", "土": "", "金": "", "水": ""};
    var 五行相對旺比率=1.5;

    switch(日主五行){
        case "木":
            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春木"; 四時五行論斷.值令="旺";
					if(命盤.月令=="寅") {
						四時五行論斷.註解="初春，木尚寒，一定要用火暖之，水扶之，但水火都不宜多，用火可以缺水，調侯專用丙火。初春木嫩，不宜土厚剋水，土薄財豐；且不宜見金剋伐。";
						四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="忌"; 四時五行論斷.水="喜";
                        if(命盤.分析.陰陽五行.水.力量比率> 命盤.分析.陰陽五行.木.力量比率) 四時五行論斷.水="忌";
                        if(命盤.分析.陰陽五行.火.力量比率> 命盤.分析.陰陽五行.木.力量比率) 四時五行論斷.火="忌";
                        if(命盤.分析.陰陽五行.土.力量比率> 命盤.分析.陰陽五行.木.力量比率 || 命盤.分析.陰陽五行.土.力量比率> 命盤.分析.陰陽五行.水.力量比率) 四時五行論斷.土="忌";
					}
					
 					if(命盤.月令=="卯") {
						四時五行論斷.註解="仲春，喜火，但不能無水，調侯丙丁皆宜。仲春木旺，得點庚金，有薄土生之則貴。金多氣雜的情況，有丁火制之亦貴。";
						四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";
                        
                        if(命盤.分析.陰陽五行.水.力量比率> 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.水="";
                        if(命盤.分析.陰陽五行.金.力量比率> 命盤.分析.陰陽五行.木.力量比率) 四時五行論斷.金="忌";
                        if(命盤.分析.陰陽五行.土.力量比率> 命盤.分析.陰陽五行.木.力量比率) 四時五行論斷.土="忌";
					}

                    if(命盤.月令=="辰") {
                        四時五行論斷.註解="季春木老，必須用庚金，更宜有水配合，為上命。";
                        四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";
                    }

					break;

                case "夏":
                    四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土="喜"; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";

                    四時五行論斷.四時五行="夏木"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="夏木無論取那個用神，都一定要有水。夏天木弱，土厚則無力剋制，財多身弱。如無水治夏天的火，則以薄土洩火氣。夏木宜薄金生水，因水在巳、午、未月為絕、胎、養，金多則傷木。夏天的木多（比劫）亦無用，因為木在病、死、墓。";
					
                    if(命盤.分析.陰陽五行.金.力量比率> 命盤.分析.陰陽五行.木.力量比率) 四時五行論斷.金="忌";
					if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 四時五行論斷.土="喜"; else 四時五行論斷.土="忌";
					
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋木"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="秋木喜比劫為助，亦喜薄土輔助。四柱見比劫多，更有食傷，名身強煞旺有制，必為上格。秋木無力疏厚土，財多身弱，為無自任之能 。";
                    四時五行論斷.木="喜"; 四時五行論斷.火=""; 四時五行論斷.土="喜"; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.月令=="申") {
                        四時五行論斷.註解 +="初秋，木絕於申，用水不能無土。";
                        if(命盤.分析.陰陽五行.土.力量比率> 命盤.分析.陰陽五行.木.力量比率) 四時五行論斷.土="忌";
                    }

                    if(命盤.月令=="酉") {
                        四時五行論斷.註解 +="中秋，母的外象凋殘，但生氣內斂，用庚金斫削而成梁棟。水滋不生，火炎自焚。";
                        四時五行論斷.金="喜"; 四時五行論斷.火="忌"; 四時五行論斷.水="";
                    }

                    if(命盤.月令=="戌") {
                        四時五行論斷.註解 +="墓秋，用金須有火制，用水用土，皆宜火為配合來鞏固木之根起。水旺則必須用火。";
                        四時五行論斷.水="喜"; 四時五行論斷.土="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數>4) 四時五行論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率> 命盤.分析.陰陽五行.木.力量比率) 四時五行論斷.火="喜";
                    }
					break;

                case "冬":
                    四時五行論斷.四時五行="冬木"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="冬木最喜火，多亦無妨，亦喜戌未火土，不宜辰丑濕土。冬水反而剋木。冬金氣洩，且木氣在地，故金多亦無用。喜年日支臨東南木火生旺之地（寅卯辰已午未）；忌西北死絕之地。";
					四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";
                    break;      
            }
            break;

        case "火":
            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春火"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="初火余寒未盡，喜木生扶。二三兩月陽氣增盛，喜少木使之通明，但木多火塞，宜水調劑。以水火溉既為主要。水太盛，用土（食傷）制之，但失調和，故春火用食制煞，非上格。土多晦光，火土傷官，難言秀氣。丙火畏戊土（食傷），不畏壬水（官殺）。火炎土燥，用劫用財，皆不可無水，喜少濕土（辰丑）。喜見金（財），因金的氣勢微弱，多亦不能困火，財為我用，富格。";
                    四時五行論斷.木="喜"; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";

                    if((命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 > 0.4) || (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.火.力量比率)) {
                        四時五行論斷.水="喜"; 四時五行論斷.木="忌";
                    }

                    if(命盤.分析.陰陽五行.水.力量比率> 命盤.分析.陰陽五行.火.力量比率) {
                        四時五行論斷.土="喜"; 四時五行論斷.水="忌";
                    }

                    if(命盤.分析.陰陽五行.土.力量比率> 命盤.分析.陰陽五行.火.力量比率) {
                        四時五行論斷.土="忌";
                    }

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 四時五行論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";

                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5){
                            四時五行論斷.金="忌";
                            四時五行論斷.水="忌";
                        }
                    }
					break;

                case "夏":
                    四時五行論斷.四時五行="夏火"; 四時五行論斷.值令="旺";
                    四時五行論斷.註解="夏火，水（官殺）為真用神。不喜木（印）生，引至自焚。夏火炎，金弱，故喜金（官殺），鉅富之格。亦喜土（食傷）洩火之氣成稼穡格。金土皆需水潤。";
					四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 四時五行論斷.木="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 >=5) 四時五行論斷.火="忌";
                        四時五行論斷.金="喜";
                        四時五行論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.金="喜";
                    if((命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.土.力量比率) && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率))  四時五行論斷.土="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 四時五行論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5) {
                        if(命盤.分析.陰陽五行.金.力量形態數 >=5 && (命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 四時五行論斷.金="忌";
                        if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 四時五行論斷.水="忌";
                    }
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋火"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="秋天火氣已衰，喜木（印），忌水（官殺）。秋火用官殺必需有印。不喜土（食傷）旺晦其光。亦不喜金（財）多而損其勢。需用比劫助身方能用食傷、用財。";
					四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 四時五行論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.金="忌";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.土="忌";
                    if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.金="忌";
                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 四時五行論斷.水="忌";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.土.力量比率*五行相對旺比率) 四時五行論斷.土="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率*五行相對旺比率) 四時五行論斷.金="喜";
                    break;

                case "冬":
                    四時五行論斷.四時五行="冬火"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="冬火喜木生，最忌水，也不喜金（財）生水（官殺）。亦喜土制水，更喜丙丁比劫相助，火土相資。";
                    if(命盤.月令=="丑" && 命盤.日主=="丙") 四時五行論斷.註解 +="十二月丙火而見比劫，反作旺論。";
					四時五行論斷.木="喜"; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="忌"; 四時五行論斷.水="忌";
                    break;      
            }
            break;

        case "土":
            四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";
            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.土.力量形態數 <5) {
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    四時五行論斷.土="喜";
                    四時五行論斷.水="忌";
                }
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    四時五行論斷.土="喜";
                    四時五行論斷.木="忌";
                }
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    四時五行論斷.土="喜";
                    四時五行論斷.金="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                if(命盤.分析.陰陽五行.土.力量形態數 <5) 四時五行論斷.土="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.火.力量形態數 >5) 四時五行論斷.火="忌";
                if(命盤.分析.陰陽五行.土.力量形態數 >5) 四時五行論斷.土="忌";
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.土.力量比率)) 四時五行論斷.水="喜";

            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春土"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="春木旺則土弱，喜火生扶，化剋為生，為殺印相生格。忌木、水過旺。喜得比可制治水。土旺則喜金洩，但多則洩土氣。";
                    四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.木.力量比率> 命盤.分析.陰陽五行.土.力量比率) 四時五行論斷.木="忌";
                    if(命盤.分析.陰陽五行.水.力量比率> 命盤.分析.陰陽五行.土.力量比率) 四時五行論斷.水="忌";

                    if(命盤.分析.陰陽五行.土.力量形態數 > 5) {
                        四時五行論斷.土="忌";
                        四時五行論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量比率> 命盤.分析.陰陽五行.土.力量比率) 四時五行論斷.金="忌";
					break;

                case "夏":
                    四時五行論斷.四時五行="夏土"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="夏季火土同行，喜水滋潤以成土之用，忌火毀滅土之生機。木雖能生火，若四柱有水而成水火相資，生機勃然。土旺喜水，雖夏土不能生金，但金卻能生水於絕地。土重以木疏之。";
					四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.土.力量形態數 <5) {
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                            四時五行論斷.土="喜";
                            四時五行論斷.水="忌";
                        }
                        if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                            四時五行論斷.土="喜";
                            四時五行論斷.木="忌";
                        }
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 >0.3) {
                        四時五行論斷.火="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.5){
                            if(命盤.分析.陰陽五行.金.力量形態數 <5) 四時五行論斷.金="喜";
                            if(命盤.分析.陰陽五行.水.力量形態數 <=5) 四時五行論斷.水="喜";
                        }
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數 >5) {
                        四時五行論斷.水="喜";
                        if(命盤.分析.陰陽五行.水.力量比率>0.1) 四時五行論斷.木="喜";

                    }
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋土"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="秋季金旺土衰，故秋土最喜火生剋金。忌水旺，喜比劫（霜降之前）。";
                    四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="忌";

                    if(節氣字轉值(命盤.生日.節氣)<節氣字轉值("霜降")) 四時五行論斷.土="喜";
					break;

                case "冬":
                    四時五行論斷.四時五行="冬土"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="冬土最喜火溫，無火則生機盡失。得火溫暖之土，見水旺則才豐，見金多則子秀，重見火，見木亦無妨。更喜比劫生扶。若無火，水旺則潰，金多則虛，木多則凶，得比劫生扶亦無用。";
					//四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 >=5){
                        if(命盤.分析.陰陽五行.水.力量形態數 <6) 四時五行論斷.水="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 <6) 四時五行論斷.金="喜";
                        if(命盤.分析.陰陽五行.木.力量形態數 <6) 四時五行論斷.木="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量形態數 <3){
                        if(命盤.分析.陰陽五行.水.力量形態數 >=5) 四時五行論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量形態數 >=5) 四時五行論斷.金="忌";
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 四時五行論斷.木="忌";
                        四時五行論斷.土="";
                    }
                    break;    
            }
            break;

        case "金":
			四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

			// *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.金.力量形態數 <5) {
                if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    四時五行論斷.金="喜";
                    四時五行論斷.火="忌";
                }
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    四時五行論斷.金="喜";
                    四時五行論斷.木="忌";
                }
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    四時五行論斷.金="喜";
                    四時五行論斷.水="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.金.力量形態數 <5) 四時五行論斷.金="喜";
                if(命盤.分析.陰陽五行.土.力量形態數 <5) 四時五行論斷.土="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.金.力量形態數 >5) 四時五行論斷.金="忌";
                if(命盤.分析.陰陽五行.土.力量形態數 >5) 四時五行論斷.土="忌";
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.木="喜";

            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春金"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="春金喜藉火（官殺）除寒，但須兼具土（印）。火旺則喜水。忌水（食傷）增寒，忌木（財）旺。如果木、水旺，則用比劫，但須有火，中和為貴。";
					//四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

                    if(命盤.月令=="卯" || 命盤.月令=="辰") 四時五行論斷.註解+="二三月，宜濕土（丑辰）生金，略得火以溫之。";

					if(命盤.分析.陰陽五行.火.力量形態數 <5 && 命盤.分析.陰陽五行.土.力量形態數>0) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 >5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.水="喜";
                    if(命盤.分析.陰陽五行.金.力量形態數 <=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.水="忌";
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) {
                            四時五行論斷.木="忌";
                            if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                            四時五行論斷.金="喜";
                        }
                        if(命盤.分析.陰陽五行.水.力量形態數 >5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) {
                            四時五行論斷.水="忌";
                            if(命盤.分析.陰陽五行.火.力量形態數 <5) 四時五行論斷.火="喜";
                            四時五行論斷.金="喜";
                        }
                    }
                    break;

                case "夏":
                    四時五行論斷.四時五行="夏金"; 四時五行論斷.值令="死";
                    四時五行論斷.註解="夏金尚柔弱，燥土不能生金，更怕年日時支再臨死絕之位。最喜見水（食傷）制火潤土以生金。忌木（財）破土助火以剋金。喜薄土（印）生金，忌土厚金埋。亦喜比劫生水。";
					//四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土="喜"; 四時五行論斷.金="喜"; 四時五行論斷.水="喜";

                    if(命盤.分析.陰陽五行.水.力量形態數 <5 && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率)) 四時五行論斷.水="喜";
                    if(命盤.分析.陰陽五行.木.力量形態數 >5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.木="忌";
                    if(命盤.分析.陰陽五行.土.力量形態數<5 && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.土="喜";
                    if(命盤.分析.陰陽五行.土.力量形態數>=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) 四時五行論斷.土="忌";
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋金"; 四時五行論斷.值令="旺";
                    四時五行論斷.註解="秋金當權得令，不喜土（印），反增濁氣。喜木（財）火（官殺）相生，庚金不喜印比。辛金喜水（食傷）洩秀，為金水傷官格。秋天旺金剋木（財），摧枯拉朽，喜水培木，為食神生財格。比劫重則用火、水。";
					//四時五行論斷.木="喜"; 四時五行論斷.火="喜"; 四時五行論斷.土="忌"; 四時五行論斷.金=""; 四時五行論斷.水="喜";

                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.土="忌";
                    if(命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.木="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.火="喜";

                    if(命盤.日主=="庚"){
                        四時五行論斷.金="忌";
                        四時五行論斷.土="忌";
                    }
                    if(命盤.日主=="辛") {
                        if(命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.水="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量形態數>5) {
                        if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 四時五行論斷.火="喜";
                        if((命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.金.力量比率) && 命盤.分析.陰陽五行.木.力量形態數 >0) 四時五行論斷.水="喜";
                    }
                    break;

                case "冬":
                    四時五行論斷.四時五行="冬金"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="冬月之金無力剋木（財），忌旺水（食傷）而金沉，須火（官殺）土（印）相生。亦喜比劫，但用處不大。火為真用神，無火見土、木、水皆無益。";
                    //四時五行論斷.木=""; 四時五行論斷.火="喜"; 四時五行論斷.土="喜"; 四時五行論斷.金="喜"; 四時五行論斷.水="";

                    if(命盤.分析.陰陽五行.水.力量形態數 >=5) 四時五行論斷.水="忌";
                    if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
                    if(命盤.分析.陰陽五行.土.力量形態數 <=5) 四時五行論斷.土="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 ==0){
                        四時五行論斷.水="";
                        四時五行論斷.土="";
                        四時五行論斷.木="";
                    }
					break;
            }          
            break;

        case "水":
            四時五行論斷.木=""; 四時五行論斷.火=""; 四時五行論斷.土=""; 四時五行論斷.金=""; 四時五行論斷.水="";

            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.水.力量形態數 <5) {
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //印重身輕
                    四時五行論斷.水="喜";
                    四時五行論斷.金="忌";
                }
                if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //財重身輕
                    四時五行論斷.水="喜";
                    四時五行論斷.火="忌";
                }
                if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //官重身輕
                    四時五行論斷.水="喜";
                    四時五行論斷.土="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.水.力量形態數 <5) 四時五行論斷.水="喜";
                if(命盤.分析.陰陽五行.金.力量形態數 <5) 四時五行論斷.金="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.水.力量形態數 >5) 四時五行論斷.水="忌";
                if(命盤.分析.陰陽五行.金.力量形態數 >5) 四時五行論斷.金="忌";

                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 < 0.4) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率)) 四時五行論斷.木="喜";  //喜食傷
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 < 0.4) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率)) 四時五行論斷.火="喜"; //喜財
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 < 0.4)) 四時五行論斷.土="喜"; //喜官殺
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.火="喜";

            // *************** 通則-5：官殺強，印弱，喜印 ***************
            if((命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.金="喜";

            switch(四季){
                case "春":
                    四時五行論斷.四時五行="春水"; 四時五行論斷.值令="休";
                    四時五行論斷.註解="春天之水為病死墓地，散漫而無歸宿，多則泛濫，少則枯竭。忌再逢水（比劫）而氾濫。水旺必須戊土堤防制之，無劫刃不須用戊。戊多宜甲木制之，方不致塞水之流。春天木（食傷）旺火（財）相，喜得金（印）生扶，且可制木。春水不能缺金生扶，但金多則水濁，水火以既濟為義。無火則水性寒，故壬丙不相離。然火不宜旺，旺則水涸，必須比劫為救。春水見木為真傷官，然水少則氣洩，必以印劫為救。水盛則木浮，必以土培其根。水木傷官，所以喜財官。";
					
                    if(命盤.分析.陰陽五行.水.力量形態數 >5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4)) {
                        四時五行論斷.水="忌";
                        四時五行論斷.土="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) {
                        四時五行論斷.土="忌";
                        四時五行論斷.木="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量形態數 >5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 > 0.4)) {
                        四時五行論斷.火="忌";
                        if(命盤.分析.陰陽五行.水.力量形態數 <=5) 四時五行論斷.水="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 <=5) 四時五行論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量形態數 >5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4)) {
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.水.力量比率) 四時五行論斷.金="忌";
                    }

                    if(命盤.分析.陰陽五行.木.力量形態數 <5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.木="喜";
                    if(命盤.分析.陰陽五行.木.力量形態數 >6 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) {
                        四時五行論斷.木="忌";
                        四時五行論斷.金="喜";
                    }
                    if(命盤.分析.陰陽五行.木.力量形態數 >=5 && 命盤.分析.陰陽五行.木.力量形態數 <6 &&(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4)) {
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";
                        if(命盤.分析.陰陽五行.土.力量形態數 <=5) 四時五行論斷.土="喜";
                    }
                    break;

                case "夏":
                    四時五行論斷.四時五行="夏水"; 四時五行論斷.值令="囚";
                    四時五行論斷.註解="夏天水逢干涸之際，喜金（印，但夏月金氣微弱）與比劫同時生助，以水衛金，以金生水。木盛則洩水之氣，以助火旺，火土重，則速其干涸。只能生助，不能剋洩。";
					
					// 喜印比已建立在通則
					if(命盤.分析.陰陽五行.木.力量形態數 >=5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.木="忌";
					if(命盤.分析.陰陽五行.火.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.火="忌";
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.土="忌";
                    break;

                case "秋":
                    四時五行論斷.四時五行="秋水"; 四時五行論斷.值令="相";
                    四時五行論斷.註解="秋月之水，母（金，印）旺子相，以澄澈為貴，秀氣發越。己土（正官）重而混濁，且不能提防。逢戊土清平。喜火為財，火多而財盛，亦喜木為食傷。";

					// 喜印比已建立在通則
					if(命盤.分析.陰陽五行.金.力量形態數 <=5 && (命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率<0.5)) 四時五行論斷.木="忌";
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.土="忌";
					if(命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率<0.4) {
						if(命盤.分析.陰陽五行.火.力量形態數 <=5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.火="喜";
						if(命盤.分析.陰陽五行.木.力量形態數 <=5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.木="喜";
					}
					break;

                case "冬":
                    四時五行論斷.四時五行="冬水"; 四時五行論斷.值令="旺";
                    四時五行論斷.註解="冬月之水，見土形藏歸化，無用可言，故不宜以官殺為用。水冷金寒，反為無義。旺水見木洩其氣，是為有情，然水寒木凍，亦無生意。惟喜遇火，水得陽和之氣而活動，方能洩秀於木，滋潤於土，溫潤於金，大用全彰。火為冬水的真用神。嚴寒之際，水少土多，兩失其用；水多方喜用土為堤防，然亦不能缺火。";
					
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 四時五行論斷.土="忌";
					// 忌印比已建立在通則
					if(命盤.分析.陰陽五行.水.力量形態數 >=5){
						if(命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率) 四時五行論斷.木="喜";
						if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率) 四時五行論斷.火="喜";
						if(命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率) 四時五行論斷.土="喜";
					}
                    if(命盤.分析.陰陽五行.火.力量形態數 <=5) 四時五行論斷.火="喜";   
                    break;      
            }
            break;
    }
	
    var 總結註解="《調侯喜忌》：" + 四時五行論斷.註解;
    var 總結矩陣=["調侯喜忌", 四時五行論斷.木, 四時五行論斷.火, 四時五行論斷.土, 四時五行論斷.金, 四時五行論斷.水, 總結註解];

    命盤.分析.陰陽五行.五行喜忌總結.push(總結矩陣);
}


function 三命通會五行月令宜忌(日主五行, 月令, 命盤){
    var 五行宜忌論斷={"四時五行": "", "值令": "",  "註解": "",  "補注": "", "木": "", "火": "", "土": "", "金": "", "水": ""};
    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
    var 五行相對旺比率=1.5;
	var 少的比率=0.15; //overall less than 15%

    switch(日主五行){
        case "木":
            五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";

            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.木.力量形態數 <5) {
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率) { //印重身輕
                    五行宜忌論斷.木="喜";
                    五行宜忌論斷.水="忌";
                }
                if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率) { //財重身輕
                    五行宜忌論斷.木="喜";
                    五行宜忌論斷.土="忌";
                }
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //官重身輕
                    五行宜忌論斷.木="喜";
                    五行宜忌論斷.金="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.木.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.木.力量形態數 >5) 五行宜忌論斷.木="忌";
                if(命盤.分析.陰陽五行.水.力量形態數 >5) 五行宜忌論斷.水="忌";

                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 < 0.4) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率)) 五行宜忌論斷.火="喜";  //身強於食傷，食傷財不大，食傷不至於剋制官太過，喜食傷
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 < 0.4) && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率)) 五行宜忌論斷.土="喜"; //身強於財，食傷財不大，財不至於剋制印太過，喜財
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 < 0.4)) 五行宜忌論斷.土="金"; //身強於官，財官不大，喜官殺
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.木.力量比率)) 五行宜忌論斷.火="喜"; //食傷多於身，身大於財，喜食傷

            // *************** 通則-5：官殺強，印弱，喜印 ***************
            if((命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.木.力量比率)) 五行宜忌論斷.金="喜"; //官殺多於身，身大於印，喜印
            
            switch (月令) {
                case "寅":
                    五行宜忌論斷.註解="正春之木，得令之木也，晴則花葉敷榮，雨則寒其萌蘖。正月生者，雖三陽交泰，但寒氣猶存，見火則生意藹然，富貴無敵，火太多則洩其氣又不宜。火土同躔，富而且貴，有土無火，僅足衣資而已，逢金折傷之患，得火制之爲福，見水不爲子母相生，蓋初春之木，才有生意，見水則寒，反爲不吉。";
                    五行宜忌論斷.補注="補注：正月之木雖得月令，但餘寒未除，最需火星暖局，一點土最佳，但有土無火，非佳造，正月之木不喜金水，有火則見金無妨，水雖生木，在正月不宜，水多反成尅，根損枝枯。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土=""; 五行宜忌論斷.金="忌"; 五行宜忌論斷.水="忌";
                    if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.火.力量比率>0) 五行宜忌論斷.土="喜";
                    if((命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.火.力量比率>0) 五行宜忌論斷.金="";
                    break;

                case "卯":
                    五行宜忌論斷.註解="二月之木，生意暢茂，遇土培植爲佳，火土同行，富貴而壽，火盛亦洩其氣，蓋花木始含英，而眞陽發散故也。干支有壬癸亥子者咎也。見水生之太過，情性流蕩，離祖遷居，土金水會，夭折無疑，賤貧則壽。逢金伐之，旺處遭傷，戕其生意，豈天地生物之至仁也。先正有云：春木雖旺，不宜逢金此也。";
                    五行宜忌論斷.補注="補注：二月之木，火些許則喜，火多則宜見水，若無火則不喜水，春木尙嫩，不喜重金尅，逢金務要見火。";

                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.木.力量比率) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.木.力量比率) 五行宜忌論斷.水="喜"; else 五行宜忌論斷.火="忌"; 
                    if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.木.力量比率) {
                        五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.金="忌";
                    }
                    break;

                case "辰":
                    五行宜忌論斷.註解="三月之木，正條達長茂之時，春陽和煦，萬紫千紅，雨水浸淫，根株搖動，見土則根深蒂固，福壽綿延，見火則木通火明，文章秀發。喜火土，忌金水，運喜東南，西北不利，夏木病巳死午墓未者，蓋南方火盛，洩其眞氣故也，陰雨則吉，亢晴則忌。";
                    五行宜忌論斷.補注="補注：三月之木，必須有水，方能育木，不宜見火，火旺則須水亦旺方可。見薄土則佳，土重則損精神。木旺見金，則成棟樑，木少逢金，生涯勞苦多病。";
                    
					break;
                case "巳":
                    五行宜忌論斷.註解="四月之木未甚衰，火未甚旺，見微少，則枝葉茂繁，蔭庇發福，値盛水，則水神飄蕩，男女淫奔，見土利就名成，火土同躔，干支有壬癸亥子者當貴，逢金尅之，災訟不免。";
                    五行宜忌論斷.補注="補注：夏季之木，最需有水，水是眞正用神，縱使水非喜用，局內不可無水，金不可多，多則傷木，但不可無金，因欲金發水源之故，最忌火太多，火太多則有自焚之憂。只許微土，不可土多，土多則剋水矣。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="喜";
                    if((命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.金.力量比率 < 少的比率) 五行宜忌論斷.金="喜"; else 五行宜忌論斷.金="忌";
                    if((命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.木.力量比率) || 命盤.分析.陰陽五行.火.力量形態數 >=5) 五行宜忌論斷.火="忌";
                    if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 五行宜忌論斷.土="喜"; else 五行宜忌論斷.土="忌";        
                    break;                    

                case "午":
                    五行宜忌論斷.註解="五六月之木，喜雨水，夜生尤奇，値此者富貴而壽，火盛無水者，貧夭，夏令炎威火盛，爍石流金，木有枯槁之患，或水制，或夜生，或陰雨天，化凶而為己矣，得土以培其根，得水以達其枝，若水土同行，非惟富貴，且壽考康寧矣！見金不能剋木，火旺金柔，有子復仇故也。若小暑以後，土多亦忌，蓋衰木不能尅旺土也。大抵夏木喜水，與他時不類。";
                    五行宜忌論斷.補注="補注：夏季之木，最需有水，水是眞正用神，縱使水非喜用，局內不可無水，金不可多，多則傷木，但不可無金，因欲金發水源之故，最忌火太多，火太多則有自焚之憂。只許微土，不可土多，土多則剋水矣。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="喜";
                    if((命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.金.力量比率 < 少的比率) 五行宜忌論斷.金="喜"; else 五行宜忌論斷.金="忌";
                    if((命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.木.力量比率) || 命盤.分析.陰陽五行.火.力量形態數 >=5) 五行宜忌論斷.火="忌";
                    if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 五行宜忌論斷.土="喜"; else 五行宜忌論斷.土="忌";        
                    break;

                case "未":
                    五行宜忌論斷.註解="五六月之木，喜雨水，夜生尤奇，値此者富貴而壽，火盛無水者，貧夭，夏令炎威火盛，爍石流金，木有枯槁之患，或水制，或夜生，或陰雨天，化凶而為己矣，得土以培其根，得水以達其枝，若水土同行，非惟富貴，且壽考康寧矣！見金不能剋木，火旺金柔，有子復仇故也。若小暑以後，土多亦忌，蓋衰木不能尅旺土也。大抵夏木喜水，與他時不類。";
                    五行宜忌論斷.補注="補注：夏季之木，最需有水，水是眞正用神，縱使水非喜用，局內不可無水，金不可多，多則傷木，但不可無金，因欲金發水源之故，最忌火太多，火太多則有自焚之憂。只許微土，不可土多，土多則剋水矣。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="喜";
                    if((命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.金.力量比率 < 少的比率) 五行宜忌論斷.金="喜"; else 五行宜忌論斷.金="忌";
                    if((命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.木.力量比率) || 命盤.分析.陰陽五行.火.力量形態數 >=5) 五行宜忌論斷.火="忌";
					if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.水.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 五行宜忌論斷.土="喜"; else 五行宜忌論斷.土="忌";		
					break;
					
                case "申":
                    五行宜忌論斷.註解="秋三月之木，惟欲晴雨得宜，亢旱則物皆枯槁，淫雨則物不收成。初秋之時，炎威未退，不宜與火同行，陰雨生者最妙。見金雖有剝剋之嫌，然火氣尚炎，金氣未盛，不爲害也。處暑以後，金水同行，化凶爲吉，逢土培植，利就名成。";
                    五行宜忌論斷.補注="補注：初秋之木，尙有火氣，宜用水來消除暑氣，再用土來培木，則能穩固根基。秋月之木，喜木多比劫之助，而忌土厚，土多則難任大才，木多且壯所以能任財官，木少則宜運行東南。";
                    
                    五行宜忌論斷.木="喜"; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="喜";
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.木.力量比率) 五行宜忌論斷.土="忌";

                    break;
                case "酉":
                    五行宜忌論斷.註解="八九月之木，正調零之時，晝火同躔者貧夭，蓋秋陽燥烈，木皆枯落故也。或夜生，或陰雨，或水解方吉。見水旺有漂流之患，蓋秋水非滋木之時也。得土栽培，根基穩厚，見金反吉，蓋金司金則萬摧落，既無長養以遂其生，又未歸根以復其命，所可藉者在一金耳，苟無金制以成其器，則天地間一朽木耳，所以仗斧斤之力，𠜲削成器，而爲楝樑之用，正所謂斧斤以時入山林，材木不勝用也，氣運宜往東方南方。";
                    //五行宜忌論斷.補注="補注：初秋之木，尙有火氣，宜用水來消除暑氣，再用土來培木，則能穩固根基，仲秋之後，喜火星，但也喜月支之金來修剪，但只喜見月令之金，不喜金再透干，否則難勝其剋矣！如見金透干，務必見火出干制金以護木，否則非貧則夭。秋月之木，喜木多比劫之助，而忌土厚，土多則難任大才，木多且壯所以能任財官，木少則宜運行東南。";

                    if(節氣字轉值(命盤.生日.節氣)<節氣字轉值("秋分")) {
                        五行宜忌論斷.補注="補注：初秋之木，尙有火氣，宜用水來消除暑氣，再用土來培木，則能穩固根基。秋月之木，喜木多比劫之助，而忌土厚，土多則難任大才，木多且壯所以能任財官，木少則宜運行東南。";
                        五行宜忌論斷.木="喜"; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="喜";
                        if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 五行宜忌論斷.土="喜"; else 五行宜忌論斷.土="忌";
                    }
                    else {
                        五行宜忌論斷.補注="補注：仲秋後之木，喜火星，但也喜月支之金來修剪，但只喜見月令之金，不喜金再透干，否則難勝其剋矣！如見金透干，務必見火出干制金以護木，否則非貧則夭。秋月之木，喜木多比劫之助，而忌土厚，土多則難任大才，木多且壯所以能任財官，木少則宜運行東南。";
                        五行宜忌論斷.木="喜"; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="喜";
                        if((命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.金.力量形態數 >=5) 五行宜忌論斷.金="忌";
                        if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 五行宜忌論斷.土="喜"; else 五行宜忌論斷.土="忌";
                    }
                    break;

                case "戌":
                    五行宜忌論斷.註解="八九月之木，正調零之時，晝火同躔者貧夭，蓋秋陽燥烈，木皆枯落故也。或夜生，或陰雨，或水解方吉。見水旺有漂流之患，蓋秋水非滋木之時也。得土栽培，根基穩厚，見金反吉，蓋金司金則萬摧落，既無長養以遂其生，又未歸根以復其命，所可藉者在一金耳，苟無金制以成其器，則天地間一朽木耳，所以仗斧斤之力，𠜲削成器，而爲楝樑之用，正所謂斧斤以時入山林，材木不勝用也，氣運宜往東方南方。";
                    五行宜忌論斷.補注="補注：仲秋後之木，喜火星，但也喜月支之金來修剪，但只喜見月令之金，不喜金再透干，否則難勝其剋矣！如見金透干，務必見火出干制金以護木，否則非貧則夭。秋月之木，喜木多比劫之助，而忌土厚，土多則難任大才，木多且壯所以能任財官，木少則宜運行東南。";
                    
                    五行宜忌論斷.木="喜"; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="喜";
                    if((命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.金.力量形態數 >=5) 五行宜忌論斷.金="忌";
                    if((命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.木.力量比率) && 命盤.分析.陰陽五行.土.力量比率 < 少的比率) 五行宜忌論斷.土="喜"; else 五行宜忌論斷.土="忌";
                    break;

                case "亥":
                    五行宜忌論斷.註解="冬木正肅殺之時，復命歸根，微有小春生意，以見造化無窮之理。易曰碩果不食者此也。生於晴明者最佳，値陰雨，則凝冰積雪也。十月之木，遇火，貴而有壽。蓋冰寒土凍，仗火以溫暖其根故也。火土輔運，富貴雙全，見金，雖無害根本，未免骨肉參商，得水則有滋助之意。";
                    五行宜忌論斷.補注="補注：冬季，天寒地凍，最忌水來增寒，水多則根損枝萎，生機盡失矣！喜燥土（未、戌土）以培植制水。金因洩於水，無法尅木，雖然害處不大，卻也無益，最喜火旺，火旺則溫燠有功，根暖枝茂。水多者若非短命，也必貧困苦勞。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土="喜"; 五行宜忌論斷.金=""; 五行宜忌論斷.水="忌";
                    break;

                case "子":
                    五行宜忌論斷.註解="子丑月之木，喜火融之，與土同躔，位登台鼎，見水凶尅，蓋冬，水令也，木，冬木遇水而寒，無火溫之，則冰凝凍台，而生意摧折矣，貧賤者壽，富貴者夭。見金雖傷不害，蓋木任冬，歸根者，斧斤無所施，凋零者，𠜲削可成器，所以見金而無咎也。干支得丙了相制者，卻能富貴，豈獨免禍而已，氣運宜往南方，冬木喜南奔也，東方次之。";
                    五行宜忌論斷.補注="補注：冬季，天寒地凍，最忌水來增寒，水多則根損枝萎，生機盡失矣！喜燥土（未、戌土）以培植制水。金因洩於水，無法尅木，雖然害處不大，卻也無益，最喜火旺，火旺則溫燠有功，根暖枝茂。水多者若非短命，也必貧困苦勞。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土="喜"; 五行宜忌論斷.金=""; 五行宜忌論斷.水="忌";
                    break;

                case "丑":
                    五行宜忌論斷.註解="子丑月之木，喜火融之，與土同躔，位登台鼎，見水凶尅，蓋冬，水令也，木，冬木遇水而寒，無火溫之，則冰凝凍台，而生意摧折矣，貧賤者壽，富貴者夭。見金雖傷不害，蓋木任冬，歸根者，斧斤無所施，凋零者，𠜲削可成器，所以見金而無咎也。干支得丙了相制者，卻能富貴，豈獨免禍而已，氣運宜往南方，冬木喜南奔也，東方次之。";
                    五行宜忌論斷.補注="補注：冬季，天寒地凍，最忌水來增寒，水多則根損枝萎，生機盡失矣！喜燥土（未、戌土）以培植制水。金因洩於水，無法尅木，雖然害處不大，卻也無益，最喜火旺，火旺則溫燠有功，根暖枝茂。水多者若非短命，也必貧困苦勞。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土="喜"; 五行宜忌論斷.金=""; 五行宜忌論斷.水="忌";
                    break;
                default:
                    alert(月令+"：三命通會五行月令宜忌 function, 月令輸入錯誤！");
            }
            break;

        case "火":
            switch (月令) {
                case "寅":
                    五行宜忌論斷.註解="三春之火，其氣溫然而始著也，晴則藉木而明，雨則濕木而晦。正月微陽之火，隱於木中，雖有可親愛之意，但冰霜之氣未消，遇木生之，則陽氣發揮矣。逢金爲財。金木同行，官居鼎鼎。逢金値水，夭折無疑，見土盜洩微陽，浮薄卑賤。";
                    五行宜忌論斷.補注="補注：春月之火，所謂母旺子相，雖欲木以生扶，但忌過多，過多則炎熱過度，此時喜水相濟，但水多則木濕反不能生火。土不可多，土多則火晦，但火太旺則土焦，此時又喜水以潤局，春月之火，最喜見金，金健則必富。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) && 命盤.分析.陰陽五行.火.力量形態數 <=5 && 命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.6) && (命盤.分析.陰陽五行.火.力量形態數 >5 || 命盤.分析.陰陽五行.木.力量形態數 >5)) {
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.木.力量比率 || 命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率)) {
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }
                    if((命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4)) 五行宜忌論斷.水="忌";
                    if((命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.火.力量比率 > 0.6)) 五行宜忌論斷.土="忌";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率 && 命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率) {
                        五行宜忌論斷.火="忌";
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";

                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5){
                            五行宜忌論斷.金="忌";
                            五行宜忌論斷.水="忌";
                        }
                    }
                    break;

                case "卯":
                    五行宜忌論斷.註解="二月見木，敗處逢生，木秀火明，文章富貴之人也。但不宜有水，蓋濕木不生無焰火也。穀雨之後生者，微水無凶，蓋土司時，木主令，化凶而爲吉也。微陽之火，隱於木中，雖有可親愛之意，但冰霜之氣未消，遇木生之，則陽氣發揮矣。逢金爲財。金木同行，官居鼎鼎。逢金値水，夭折無疑，見土盜洩微陽，浮薄卑賤。";
                    五行宜忌論斷.補注="補注：春月之火，所謂母旺子相，雖欲木以生扶，但忌過多，過多則炎熱過度，此時喜水相濟，但水多則木濕反不能生火。土不可多，土多則火晦，但火太旺則土焦，此時又喜水以潤局，春月之火，最喜見金，金健則必富。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) && 命盤.分析.陰陽五行.火.力量形態數 <=5 && 命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.6) && (命盤.分析.陰陽五行.火.力量形態數 >5 || 命盤.分析.陰陽五行.木.力量形態數 >5)) {
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.木.力量比率 || 命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率)) {
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }
                    if((命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4)) 五行宜忌論斷.水="忌";
                    if((命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.火.力量比率 > 0.6)) 五行宜忌論斷.土="忌";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率 && 命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率) {
                        五行宜忌論斷.火="忌";
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";

                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5){
                            五行宜忌論斷.金="忌";
                            五行宜忌論斷.水="忌";
                        }
                    }
                    break;

                case "辰":
                    五行宜忌論斷.註解="三月見木，敗處逢生，木秀火明，文章富貴之人也。穀雨之後生者，微水無凶，蓋土司時，木主令，化凶而爲吉也。微陽之火，隱於木中，雖有可親愛之意，但冰霜之氣未消，遇木生之，則陽氣發揮矣。逢金爲財。金木同行，官居鼎鼎。逢金値水，夭折無疑，見土盜洩微陽，浮薄卑賤，唯辰月土差旺耳。";
                    五行宜忌論斷.補注="補注：春月之火，所謂母旺子相，雖欲木以生扶，但忌過多，過多則炎熱過度，此時喜水相濟，但水多則木濕反不能生火。土不可多，土多則火晦，但火太旺則土焦，此時又喜水以潤局，春月之火，最喜見金，金健則必富。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) && 命盤.分析.陰陽五行.火.力量形態數 <=5 && 命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.6) && (命盤.分析.陰陽五行.火.力量形態數 >5 || 命盤.分析.陰陽五行.木.力量形態數 >5)) {
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }
                    if((命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.木.力量比率 || 命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率)) {
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }
                    if((命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4)) 五行宜忌論斷.水="忌";
                    if((命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.火.力量比率 > 0.6)) 五行宜忌論斷.土="忌";
                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率 && 命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率) {
                        五行宜忌論斷.火="忌";
                        五行宜忌論斷.水="喜";
                        五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";

                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5){
                            五行宜忌論斷.金="忌";
                            五行宜忌論斷.水="忌";
                        }
                    }
                    break;

                case "巳":
                    五行宜忌論斷.註解="夏令之火，陽氣之極，草木爲之焦枯，江之乾涸，晴則流金爍石，真陽盡洩，雨則水濟其威，方得中和，反應蔭庇發福。四月火勢漸盛，逢日爭光，未能全其忠愛，雖富貴亦主夭亡，貧寒者壽而無子，孤獨艱辛。見金名成利就，逢土有權有謀。遇木而好禮。微水濟木，其貴不可言也。";
                    五行宜忌論斷.補注="補注：夏季是火當權之時，火勢炎炎，最需水來滋潤，才不致遭焚身之難，不可見木來增火勢，最喜金來制木生水，必有大發展。得金生水必富貴全。";

                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 五行宜忌論斷.木="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 >=5) 五行宜忌論斷.火="忌";
                        五行宜忌論斷.金="喜";
                        五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5) {
                        if(命盤.分析.陰陽五行.金.力量形態數 >=5 && (命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 五行宜忌論斷.金="忌";
                        if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 五行宜忌論斷.水="忌";
                    }
                   break;

                case "午":
                    五行宜忌論斷.註解="五六月生者，火炎之極，得水制之，則都將相。水不宜過盛，蓋旺火投於盛水，不能傷故也。得土制木解，則富貴過人矣。見土略洩其盛，而有權衡之貴，又好施惠及人，但施恩而反怨耳，蓋火能生土，亦能燥土故也。遇金爲財，火爍金流，反有破財蕩家之患。水土同行，名成利就，日戰月刑，忠孝有虧，凶禍孤尅。夜生減輕，氣運宜往西北，東南大忌。";
                    五行宜忌論斷.補注="補注：夏季是火當權之時，火勢炎炎，最需水來滋潤，才不致遭焚身之難，不可見木來增火勢，最喜金來制木生水，必有大發展。得金生水必富貴全。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 五行宜忌論斷.木="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 >=5) 五行宜忌論斷.火="忌";
                        五行宜忌論斷.金="喜";
                        五行宜忌論斷.水="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.金="喜";

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5) {
                        if(命盤.分析.陰陽五行.金.力量形態數 >=5 && (命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 五行宜忌論斷.金="忌";
                        if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 五行宜忌論斷.水="忌";
                    }
                    break;

                case "未":
                    五行宜忌論斷.註解="五六月生者，火炎之極，得水制之，則都將相。水不宜過盛，蓋旺火投於盛水，不能傷故也。得土制木解，則富貴過人矣。見土略洩其盛，而有權衡之貴，又好施惠及人，但施恩而反怨耳，蓋火能生土，亦能燥土故也。遇金爲財，火爍金流，反有破財蕩家之患。水土同行，名成利就，日戰月刑，忠孝有虧，凶禍孤尅。夜生減輕，氣運宜往西北，東南大忌。";
                    五行宜忌論斷.補注="補注：夏季是火當權之時，火勢炎炎，最需水來滋潤，才不致遭焚身之難，不可見木來增火勢，最喜金來制木生水，必有大發展。得金生水必富貴全。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 >0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 五行宜忌論斷.木="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 >=5) 五行宜忌論斷.火="忌";
                        五行宜忌論斷.金="喜";
                        五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    }

                    if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 >0.5) {
                        if(命盤.分析.陰陽五行.金.力量形態數 >=5 && (命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 五行宜忌論斷.金="忌";
                        if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 五行宜忌論斷.水="忌";
                    }
                    break;

                case "申":
                    五行宜忌論斷.註解="秋初之火，炎威未退，土傅生氣，水不能尅反主貴榮。見木助之，雖富貴而壽不永。（干支火也多者）。見金為財，富貴豪侈。逢土則息，顯達非常。";
                    五行宜忌論斷.補注="補注：秋季之火，盛期已過，必須有木生助，才有復甦之機，見水之尅，則有滅絕之難。有強木在柱才不怕水尅。金不可多，多則不僅損傷其力，恐有災禍之憂，此時最喜比劫助勢，以增其身。總之，秋月之火，宜見比劫，次用木佐之。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.金="忌";
                    }
                    break;

                case "酉":
                    五行宜忌論斷.註解="八九月失時之火，見木，生生之意無窮，富貴無敵。金木同躔，官居宰輔。有金無木，主弱敵強，不免有爭攘之事。與土同躔，洩其真元，孤刑冷退，得木助之，斯爲差矣。見水凶夭。運喜東南，西北忌之。";
                    五行宜忌論斷.補注="補注：秋季之火，盛期已過，必須有木生助，才有復甦之機，見水之尅，則有滅絕之難。有強木在柱才不怕水尅。金不可多，多則不僅損傷其力，恐有災禍之憂，此時最喜比劫助勢，以增其身。總之，秋月之火，宜見比劫，次用木佐之。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.金="忌";
                    }
                    break;

                case "戌":
                    五行宜忌論斷.註解="八九月失時之火，見木，生生之意無窮，富貴無敵。金木同躔，官居宰輔。有金無木，主弱敵強，不免有爭攘之事。與土同躔，洩其真元，孤刑冷退，得木助之，斯爲差矣。見水凶夭。運喜東南，西北忌之。";
                    五行宜忌論斷.補注="補注：秋季之火，盛期已過，必須有木生助，才有復甦之機，見水之尅，則有滅絕之難。有強木在柱才不怕水尅。金不可多，多則不僅損傷其力，恐有災禍之憂，此時最喜比劫助勢，以增其身。總之，秋月之火，宜見比劫，次用木佐之。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.金="忌";
                    }
                    break;

                case "亥":
                    五行宜忌論斷.註解="冬月之火，人多親之，晴霽則明，陰雨則滅，故見水爲凶，木生爲貴。有水無木，輕者疾，重者夭，雖生富貴之家，不免冷退，徐揚袞靑人得水制之，無咎，逢土洩之，弱中又弱，蹇滯終身。小寒之後，旺土晦其光明，定主昏愚瞽目。見金爲財，靑竞徐揚人主富，荆梁冀雍人助難爲凶，謂金之子水也。尅其母，子則乘勢報仇，無木解之，有刀兵獄訟之厄，腫痢沒溺之凶，干支木盛者減輕，大抵冬火喜木忌水，運宜東南，西北大忌。";
                    五行宜忌論斷.補注="補注：冬月水旺之鄕，火之體形絕亡之時，見木洩水生火，謂之絕處逢生。遇水剋則有滅身之禍。此時宜見土來制水，更欲火來相助。如此火土相資，而後可以溫木以護火。冬月之火甚弱，無力剋金，故見金爲患。";

                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.金="忌";
                    }
                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                        五行宜忌論斷.火="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) 五行宜忌論斷.金="忌";
                    break;

                case "子":
                    五行宜忌論斷.註解="冬月之火，人多親之，晴霽則明，陰雨則滅，故見水爲凶，木生爲貴。有水無木，輕者疾，重者夭，雖生富貴之家，不免冷退，徐揚袞靑人得水制之，無咎，逢土洩之，弱中又弱，蹇滯終身。小寒之後，旺土晦其光明，定主昏愚瞽目。見金爲財，靑竞徐揚人主富，荆梁冀雍人助難爲凶，謂金之子水也。尅其母，子則乘勢報仇，無木解之，有刀兵獄訟之厄，腫痢沒溺之凶，干支木盛者減輕，大抵冬火喜木忌水，運宜東南，西北大忌。";
                    五行宜忌論斷.補注="補注：冬月水旺之鄕，火之體形絕亡之時，見木洩水生火，謂之絕處逢生。遇水剋則有滅身之禍。此時宜見土來制水，更欲火來相助。如此火土相資，而後可以溫木以護火。冬月之火甚弱，無力剋金，故見金爲患。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.金="忌";
                    }
                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                        五行宜忌論斷.火="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) 五行宜忌論斷.金="忌";
                    break;

                case "丑":
                    五行宜忌論斷.註解="冬月之火，人多親之，晴霽則明，陰雨則滅，故見水爲凶，木生爲貴。有水無木，輕者疾，重者夭，雖生富貴之家，不免冷退，徐揚袞靑人得水制之，無咎，逢土洩之，弱中又弱，蹇滯終身。小寒之後，旺土晦其光明，定主昏愚瞽目。見金爲財，靑竞徐揚人主富，荆梁冀雍人助難爲凶，謂金之子水也。尅其母，子則乘勢報仇，無木解之，有刀兵獄訟之厄，腫痢沒溺之凶，干支木盛者減輕，大抵冬火喜木忌水，運宜東南，西北大忌。";
                    五行宜忌論斷.補注="補注：冬月水旺之鄕，火之體形絕亡之時，見木洩水生火，謂之絕處逢生。遇水剋則有滅身之禍。此時宜見土來制水，更欲火來相助。如此火土相資，而後可以溫木以護火。冬月之火甚弱，無力剋金，故見金爲患。";

                    五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.木.力量比率 <0.6) {
                        if(命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率) 五行宜忌論斷.金="忌";
                    }
                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                        五行宜忌論斷.火="喜";
                    }
                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) 五行宜忌論斷.金="忌";
                    
                    break;

                default:
                    alert(月令+"：三命通會五行月令宜忌 function, 月令輸入錯誤！");
            }
            break;

        case "土":
            五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";

            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.土.力量形態數 <5) {
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    五行宜忌論斷.土="喜";
                    五行宜忌論斷.水="忌";
                }
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    五行宜忌論斷.土="喜";
                    五行宜忌論斷.木="忌";
                }
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                    五行宜忌論斷.土="喜";
                    五行宜忌論斷.金="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                if(命盤.分析.陰陽五行.土.力量形態數 <5) 五行宜忌論斷.土="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.火.力量形態數 >5) 五行宜忌論斷.火="忌";
                if(命盤.分析.陰陽五行.土.力量形態數 >5) 五行宜忌論斷.土="忌";
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.土.力量比率)) 五行宜忌論斷.水="喜";

            switch (月令) {
                case "寅":
                    五行宜忌論斷.註解="正月之土，尚有霜寒，遇雨則凍，遇水則冰。值木則病，惟得火而溫之，則榮華莫比。逢金制木，亦名利兩成。";
                    五行宜忌論斷.補注="補注：春月之土，是土之死令季節，自然最忌旺木破土，必有傾陷之險，最要火來洩木生土。木旺則取金制木亦可，但金不宜多，多則反而盜洩土氣。命局若水多時，最欲土來相助以阻水，否則不僅助木尅土，亦且益增命局之寒濕。只有在淸明之後，土旺火多時，才喜水來調節氣候。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率){
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.土.力量比率) 五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                    }
                    break;

                case "卯":
                    五行宜忌論斷.註解="二月之土，正木盛土崩之時。遇木同躔，有脾胃腸風痔漏之災。輕者疾，重者夭。徐揚人干支有火，而值晝晴者無咎，見火同躔，位登台鼎，見水則凶。冀雍青兗人土渾水濁，終有水湧土潰之危，蓋水生旺木而傷土也，值此者貧寒疾夭。徐揚豫人，干支火者反吉，見金以洩土氣，難免災凶。";
                    五行宜忌論斷.補注="補注：春月之土，是土之死令季節，自然最忌旺木破土，必有傾陷之險，最要火來洩木生土。木旺則取金制木亦可，但金不宜多，多則反而盜洩土氣。命局若水多時，最欲土來相助以阻水，否則不僅助木尅土，亦且益增命局之寒濕。只有在淸明之後，土旺火多時，才喜水來調節氣候。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率){
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.土.力量比率) 五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                    }
                    break;

                case "辰":
                    五行宜忌論斷.註解="三月之土，漸有生意，蓋土旺季月故也。有火溫燠，則陽氣發舒，而生物茂矣。見木非疾則夭，徐揚豫人無害。水木同度，貧薄無聊。冀雍兗青人，尤甚。見金制木，反凶成吉。運喜南方，西方次之。";
                    五行宜忌論斷.補注="補注：春月之土，是土之死令季節，自然最忌旺木破土，必有傾陷之險，最要火來洩木生土。木旺則取金制木亦可，但金不宜多，多則反而盜洩土氣。命局若水多時，最欲土來相助以阻水，否則不僅助木尅土，亦且益增命局之寒濕。只有在淸明之後，土旺火多時，才喜水來調節氣候。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率){
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.火="喜";
                        if(命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.土.力量比率) 五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 > 0.5) {
                        if(節氣字轉值(命盤.生日.節氣)>=節氣字轉值("淸明")) 五行宜忌論斷.水="喜";
                    }
                    break;

                case "巳":
                    五行宜忌論斷.註解="土旺長夏，火盛土生之故也，陰雨則濕養萬物，故見水為吉。抗旱則田疇龜坼，故遇火為凶。孟夏之土，炎氣未盛，終喜火以助之，逢水則疾夭無疑。見水為財，徐揚人富足。見金遇木則貴，逢水則貧。";
                    五行宜忌論斷.補注="補注：夏月之土，母旺子相，炎炎燥烈，亟需得水以竞滋潤之功，切忌再見火來增局燥烈。土旺可用木疏，但必須柱中有水方可，因濕木方能疏土，則聰明達變。若無水，則木不僅不能疏土，反助火災。夏月之土，除需用水之外，尤須金發水源，使水不致枯渴，有金有水，其人必物財豐隆，總之夏土忌火用水，若用木，必須有水方可。";

                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 >0.3) {
                        五行宜忌論斷.火="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.5){
                            if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                            if(命盤.分析.陰陽五行.水.力量形態數 <=5) 五行宜忌論斷.水="喜";
                        }
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數 >5 && 命盤.分析.陰陽五行.水.力量比率>0.1) 五行宜忌論斷.木="喜"; 
                    break;

                case "午":
                    五行宜忌論斷.註解="五六月之土，見火則燥，而萬物焦枯。徐揚人干支火盛者，有火焚風血之災，輕者危，重者死。或陰雨，或夜生，雖災不甚。冀雍人干支有壬癸亥子者，富貴非凡。見水，滋養萬物，主富貴文章，見木疏通其性，多聰明特達。遇金無用，蓋火盛金衰，不能制木，所以金無用也。氣運宜行西北，最忌南方，蓋夏土逢火太燥故也。土逢秋令，金氣盛旺，洩土而氣薄矣，晴雨須要得宜。";
                    五行宜忌論斷.補注="補注：夏月之土，母旺子相，炎炎燥烈，亟需得水以竞滋潤之功，切忌再見火來增局燥烈。土旺可用木疏，但必須柱中有水方可，因濕木方能疏土，則聰明達變。若無水，則木不僅不能疏土，反助火災。夏月之土，除需用水之外，尤須金發水源，使水不致枯渴，有金有水，其人必物財豐隆，總之夏土忌火用水，若用木，必須有水方可。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 >0.3) {
                        五行宜忌論斷.火="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.5){
                            if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                            if(命盤.分析.陰陽五行.水.力量形態數 <=5) 五行宜忌論斷.水="喜";
                        }
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數 >5 && 命盤.分析.陰陽五行.水.力量比率>0.1) 五行宜忌論斷.木="喜"; 
                    break;

                case "未":
                    五行宜忌論斷.註解="五六月之土，見火則燥，而萬物焦枯。徐揚人干支火盛者，有火焚風血之災，輕者危，重者死。或陰雨，或夜生，雖災不甚。冀雍人干支有壬癸亥子者，富貴非凡。見水，滋養萬物，主富貴文章，見木疏通其性，多聰明特達。遇金無用，蓋火盛金衰，不能制木，所以金無用也。氣運宜行西北，最忌南方，蓋夏土逢火太燥故也。土逢秋令，金氣盛旺，洩土而氣薄矣，晴雨須要得宜。";
                    五行宜忌論斷.補注="補注：夏月之土，母旺子相，炎炎燥烈，亟需得水以竞滋潤之功，切忌再見火來增局燥烈。土旺可用木疏，但必須柱中有水方可，因濕木方能疏土，則聰明達變。若無水，則木不僅不能疏土，反助火災。夏月之土，除需用水之外，尤須金發水源，使水不致枯渴，有金有水，其人必物財豐隆，總之夏土忌火用水，若用木，必須有水方可。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 >0.3) {
                        五行宜忌論斷.火="忌";
                        if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.5){
                            if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                            if(命盤.分析.陰陽五行.水.力量形態數 <=5) 五行宜忌論斷.水="喜";
                        }
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數 >5 && 命盤.分析.陰陽五行.水.力量比率>0.1) 五行宜忌論斷.木="喜"; 
                    break;

                case "申":
                    五行宜忌論斷.註解="七月之土，火氣未除，土性尚燥，喜水滋之，則萬物實矣。若火太盛，亦有燥土之嫌，得水濟之為妙。逢木為災，徐揚荆梁人無忌。";
                    五行宜忌論斷.補注="補注：秋月之土，是土之休令，所謂子旺則母衰，因此，局內金若多，則盜土氣太甚矣！秋土見木，因木受金制，無害於土，但木旺則剋洩交加，此種情況，亟需火來制金洩木生土，一舉數得，忌水來損力。故七八月之土，用火而喜土。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    }
                    break;

                case "酉":
                    五行宜忌論斷.註解="八九月之土，見木則不能剋。此萬物凋零之時，金氣生旺，子復母仇。荆梁徐揚人富貴而壽，見金洩氣太甚，西北人不免有冷退怯弱之患。見火助之，文武名高，君子小人皆吉。見水為財，徐揚豫人，富而無敵。冀雍荆梁人，水過盛而反主貧薄。戌月僅可，運喜火土之方，水木金方有忌。";
                    五行宜忌論斷.補注="補注：秋月之土，是土之休令，所謂子旺則母衰，因此，局內金若多，則盜土氣太甚矣！秋土見木，因木受金制，無害於土，但木旺則剋洩交加，此種情況，亟需火來制金洩木生土，一舉數得，忌水來損力。故七八月之土，用火而喜土。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率) {
                        五行宜忌論斷.木="忌";
                        五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    }
                    break;

                case "戌":
                    五行宜忌論斷.註解="八九月之土，見木則不能剋。此萬物凋零之時，金氣生旺，子復母仇。荆梁徐揚人富貴而壽，見金洩氣太甚，西北人不免有冷退怯弱之患。見火助之，文武名高，君子小人皆吉。見水為財，徐揚豫人，富而無敵。冀雍荆梁人，水過盛而反主貧薄。戌月僅可，運喜火土之方，水木金方有忌。";
                    五行宜忌論斷.補注="補注：戌月之土，土得月令，自然生旺，此時不賴火土，不須土助，而喜木以疏土，水以滋濶，若用木則忌見金，命局無木，則取金生水，則必衣食豊隆，家財萬貫。";

                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 >0.3) { 
                        if(命盤.分析.陰陽五行.木.力量形態數 <5 && 命盤.分析.陰陽五行.木.力量形態數 >0) {
                            五行宜忌論斷.木="喜";
                            五行宜忌論斷.金="忌";
                        }
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                        if(命盤.分析.陰陽五行.木.力量形態數 == 0) {
                            五行宜忌論斷.金="喜";
                            五行宜忌論斷.水="喜";          
                        }
                    }
                    break;

                case "亥":
                    五行宜忌論斷.註解="十月之土，惟喜火以溫之，則土脈陽和，而萬物歸根矣。見木則凶，逢金則滯，遇水主孤寒。徐揚人干支火多者可富。";
                    五行宜忌論斷.補注="補注：土至三冬，冰寒地凍，最要火來溫燠，萬物方有生機，寒谷得以回舂，火旺則見水財豐，見金子秀。若無火者，下命，難以顯達。若局有火，則見木無妨，得土之相助亦吉 ，但若無火，土雖多亦無用，蓋無火溫暖，乃寒土之故。故見火旺盛，所以取富。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 >=5){
                        if(命盤.分析.陰陽五行.水.力量形態數 >0 && 命盤.分析.陰陽五行.水.力量形態數 <6) 五行宜忌論斷.水="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 >0 && 命盤.分析.陰陽五行.金.力量形態數 <6) 五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量形態數 ==0 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率)) 五行宜忌論斷.木="忌";
                    break;

                case "子":
                    五行宜忌論斷.註解="子丑之月，寒氣之極，火日融和，功名成就。見木最忌，見火解之，惟及。見水則陰氣愈甚，水寒地凍，輕者疾，重者夭，見金亦主貧薄，歲運南方最佳，北方大忌。";
                    五行宜忌論斷.補注="補注：土至三冬，冰寒地凍，最要火來溫燠，萬物方有生機，寒谷得以回舂，火旺則見水財豐，見金子秀。若無火者，下命，難以顯達。若局有火，則見木無妨，得土之相助亦吉 ，但若無火，土雖多亦無用，蓋無火溫暖，乃寒土之故。故見火旺盛，所以取富。";

                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 >=5){
                        if(命盤.分析.陰陽五行.水.力量形態數 >0 && 命盤.分析.陰陽五行.水.力量形態數 <6) 五行宜忌論斷.水="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 >0 && 命盤.分析.陰陽五行.金.力量形態數 <6) 五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量形態數 ==0 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率)) 五行宜忌論斷.木="忌";
                    break;

                case "丑":
                    五行宜忌論斷.註解="子丑之月，寒氣之極，火日融和，功名成就。見木最忌，見火解之，惟及。見水則陰氣愈甚，水寒地凍，輕者疾，重者夭，見金亦主貧薄，歲運南方最佳，北方大忌。";
                    五行宜忌論斷.補注="補注：土至三冬，冰寒地凍，最要火來溫燠，萬物方有生機，寒谷得以回舂，火旺則見水財豐，見金子秀。若無火者，下命，難以顯達。若局有火，則見木無妨，得土之相助亦吉 ，但若無火，土雖多亦無用，蓋無火溫暖，乃寒土之故。故見火旺盛，所以取富。";

                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 >=5){
                        if(命盤.分析.陰陽五行.水.力量形態數 >0 && 命盤.分析.陰陽五行.水.力量形態數 <6) 五行宜忌論斷.水="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 >0 && 命盤.分析.陰陽五行.金.力量形態數 <6) 五行宜忌論斷.金="喜";
                    }

                    if(命盤.分析.陰陽五行.火.力量形態數 == 0 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.土.力量比率)) 五行宜忌論斷.木="忌";
                    break;
                default:
                    alert(月令+"：三命通會五行月令宜忌 function, 月令輸入錯誤！");
            }
            break;

        case "金":
            五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";

            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.金.力量形態數 <5) {
                if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    五行宜忌論斷.金="喜";
                    五行宜忌論斷.火="忌";
                }
                if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    五行宜忌論斷.金="喜";
                    五行宜忌論斷.木="忌";
                }
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) {
                    五行宜忌論斷.金="喜";
                    五行宜忌論斷.水="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                if(命盤.分析.陰陽五行.土.力量形態數 <5) 五行宜忌論斷.土="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.金.力量形態數 >5) 五行宜忌論斷.金="忌";
                if(命盤.分析.陰陽五行.土.力量形態數 >5) 五行宜忌論斷.土="忌";
				
				if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.木.力量比率 < 0.4) && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率)) 五行宜忌論斷.水="喜";  //喜食傷
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.水.力量比率 + 命盤.分析.陰陽五行.木.力量比率 < 0.4) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率)) 五行宜忌論斷.木="喜"; //喜財
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 < 0.4)) 五行宜忌論斷.火="喜"; //喜官殺
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.木="喜";
			
			// *************** 通則-5：官殺強，印弱，喜印 ***************
            if((命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.土="喜";
			
            switch (月令) {
                case "寅":
                    五行宜忌論斷.註解="正月之金，見木為財，木神太旺，僅足衣食。土氣尚寒，未能生助，藝術顯明而已。火若同躔，男女重婚重嫁。見火遇土，富貴非常。逢水洩之，孤寒懦弱。";
                    五行宜忌論斷.補注="補注：一月之金，天氣尚寒，喜火溫暖，而忌水增寒，木多損力，春金無力剋木也。一月之金，雖喜火，但不宜多，因有木助之故，最需用土，火土相資，可富可貴。";
					
					// ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
					if(命盤.分析.陰陽五行.火.力量形態數 >5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) {
						五行宜忌論斷.火="忌";
						五行宜忌論斷.土="喜";
					}
                    break;
					
                case "卯":
                    五行宜忌論斷.註解="二三月之金，見土，則生生之意無窮，主人富貴而壽。逢水洩其元氣，亦主貧薄無情。見火則囚金遇鬼，貧夭無疑，土生水制為吉。見木而有困滯之災，蓋春木盛旺，以微弱之金，而欲制之，是猶以嬰兒而禦強敵，其格也不明也。犯此者必有求榮反辱之虞，官訟爭攘之事，謂其仁義相刑故也。荆梁人逢之，主富。徐揚人干支土多者，貴顯。氣運土鄉最吉，金運次之。";
                    五行宜忌論斷.補注="補注：二月之金，寒氣已除，陽和氣候，此時宜濕土之生，微火之溫，水火旣濟，必有前程，不可有火無水，若無水亦要濕土。卯月木之旺地，忌木成林，來損金力。喜土以生金，而忌土之太旺。喜金相助，金旺之時宜見火之煆煉。除非火重，否則忌水洩身生木。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 <5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.水.力量形態數 <5 && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.水="喜";
                    if(命盤.分析.陰陽五行.木.力量形態數 >5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.木="忌";
                    if(命盤.分析.陰陽五行.土.力量形態數 <5 && (命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.土="喜";
                    if(命盤.分析.陰陽五行.土.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率)) 五行宜忌論斷.土="忌";
                    if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                    if(命盤.分析.陰陽五行.金.力量形態數 >5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4)) {
                        五行宜忌論斷.火="忌";
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                    }
                    break;

                case "辰":
                    五行宜忌論斷.註解="二三月之金，見土，則生生之意無窮，主人富貴而壽。逢水洩其元氣，亦主貧薄無情。見火則囚金遇鬼，貧夭無疑，土生水制為吉。見木而有困滯之災，蓋春木盛旺，以微弱之金，而欲制之，是猶以嬰兒而禦強敵，其格也不明也。犯此者必有求榮反辱之虞，官訟爭攘之事，謂其仁義相刑故也。荆梁人逢之，主富。徐揚人干支土多者，貴顯。氣運土鄉最吉，金運次之。";
                    五行宜忌論斷.補注="補注：三月之金，母旺子相，土厚則喜木疏，金多之時則喜火之煆鍊，身強而木火健全，富貴天成也。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.土.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率) && 命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                    if(命盤.分析.陰陽五行.金.力量形態數 >5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.火="喜";
                    break;

                case "巳":
                    五行宜忌論斷.註解="夏月火盛，金至柔也，晴則日爍金流，雨則水滋金潤。故夏令之金，俱宜見土，主人有出將入相之權，金馬玉堂之貴。見火則火炎金爍，貧夭居多，雖富而夭寅賤。見木為財，荆梁豫人，多主富貴，遇水孤貧，蓋弱金不能生水故也。若與火土同行，則富貴康寧。運喜土金，木火則忌。";
                    五行宜忌論斷.補注="補注：夏月是金死之月，金質柔弱，那堪烈火之煉，故夏月之金，重見旺火，不夭也貧。亟需盛水來降火潤土以存金，忌見木來破土生火耗金。局內宜見土洩火生金，加之水來調候，如此有土（辰、丑等濕土方宜，不可戌、未等燥土）洩火生金，有金生水源，源源不絕，則能收制火潤土之功。命局除非土金旺盛，否則不取水星爲用。以用濕土最宜。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4)) {
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 五行宜忌論斷.木="忌";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.土.力量形態數 <5) 五行宜忌論斷.土="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 >0.5) {
                         if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                    }
                    break;

                case "午":
                    五行宜忌論斷.註解="夏月火盛，金至柔也，晴則日爍金流，雨則水滋金潤。故夏令之金，俱宜見土，主人有出將入相之權，金馬玉堂之貴。見火則火炎金爍，貧夭居多，雖富而夭寅賤。見木為財，荆梁豫人，多主富貴，遇水孤貧，蓋弱金不能生水故也。若與火土同行，則富貴康寧。運喜土金，木火則忌。";
                    五行宜忌論斷.補注="補注：夏月是金死之月，金質柔弱，那堪烈火之煉，故夏月之金，重見旺火，不夭也貧。亟需盛水來降火潤土以存金，忌見木來破土生火耗金。局內宜見土洩火生金，加之水來調候，如此有土（辰、丑等濕土方宜，不可戌、未等燥土）洩火生金，有金生水源，源源不絕，則能收制火潤土之功。命局除非土金旺盛，否則不取水星爲用。以用濕土最宜。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4)) {
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 五行宜忌論斷.木="忌";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.土.力量形態數 <5) 五行宜忌論斷.土="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 >0.5) {
                         if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                    }
                    break;

                case "未":
                    五行宜忌論斷.註解="夏月火盛，金至柔也，晴則日爍金流，雨則水滋金潤。故夏令之金，俱宜見土，主人有出將入相之權，金馬玉堂之貴。見火則火炎金爍，貧夭居多，雖富而夭寅賤。見木為財，荆梁豫人，多主富貴，遇水孤貧，蓋弱金不能生水故也。若與火土同行，則富貴康寧。運喜土金，木火則忌。";
                    五行宜忌論斷.補注="補注：夏月是金死之月，金質柔弱，那堪烈火之煉，故夏月之金，重見旺火，不夭也貧。亟需盛水來降火潤土以存金，忌見木來破土生火耗金。局內宜見土洩火生金，加之水來調候，如此有土（辰、丑等濕土方宜，不可戌、未等燥土）洩火生金，有金生水源，源源不絕，則能收制火潤土之功。未月之金，氣候尙炎，金水之潤滋不可缺，若有水星，日主不弱，則喜木破土爲用。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 >5 && (命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4)) {
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                        if(命盤.分析.陰陽五行.木.力量形態數 >=5) 五行宜忌論斷.木="忌";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 <0.4) {
                        if(命盤.分析.陰陽五行.土.力量形態數 <5) 五行宜忌論斷.土="喜";
                        if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                        if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 + 命盤.分析.陰陽五行.金.力量比率 >0.5) {
                         if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                    }
                    break;

                case "申":
                    五行宜忌論斷.註解="七八月之金得令，其性剛強，仗火以制其威，有玉帶金魚之貴。蓋頑金無火，不能成氣故也。見水洩其旺氣，金白水清，多主詞林清貴。水火俱無，則主夭折。見木為財，徐揚人富而且貴。遇土則隱彩埋光，雖有財而不發，孤者多。經云：秋金埋土而反旺也，逢木而貴，徐揚兗青人，見之尤佳。";
                    五行宜忌論斷.補注="補注：秋月之金，是得令之月，所謂剛猛超凡，威權萬丈。金星旣旺，自厭土多，尤其是仲秋之後，更忌土，否則土重埋金，無法出世顯揚矣！庚金最欲火煉，見火煆煉，必是社稷棟樑，鐘鼎大材。辛金最喜水磨，得水無土，金淸水白，才華滿腹，精神越秀。配木火乃鉅富之格。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.土="忌";
                    if(命盤.日主=="庚"){
                        if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.火="喜";
                    }
                    if(命盤.日主=="辛"){
                        if(命盤.分析.陰陽五行.土.力量形態數 ==0 && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    break;

                case "酉":
                    五行宜忌論斷.註解="七八月之金得令，其性剛強，仗火以制其威，有玉帶金魚之貴。蓋頑金無火，不能成氣故也。見水洩其旺氣，金白水清，多主詞林清貴。水火俱無，則主夭折。見木為財，徐揚人富而且貴。遇土則隱彩埋光，雖有財而不發，孤者多。經云：秋金埋土而反旺也，逢木而貴，徐揚兗青人，見之尤佳。";
                    五行宜忌論斷.補注="補注：秋月之金，是得令之月，所謂剛猛超凡，威權萬丈。金星旣旺，自厭土多，尤其是仲秋之後，更忌土，否則土重埋金，無法出世顯揚矣！庚金最欲火煉，見火煆煉，必是社稷棟樑，鐘鼎大材。辛金最喜水磨，得水無土，金淸水白，才華滿腹，精神越秀。配木火乃鉅富之格。";

                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.土="忌";
                    if(命盤.日主=="庚"){
                        if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.火="喜";
                    }
                    if(命盤.日主=="辛"){
                        if(命盤.分析.陰陽五行.土.力量形態數 ==0 && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    break;

                case "戌":
                    五行宜忌論斷.註解="九月生者，金氣稍退，遇火夜生為奇，書生少利。逢木則剋，反應骨肉參商。見水濟之，冀雍人不免冷退，徐揚人又何忌焉，逢土亦晦。兗青人富貴居多，豫人困滯。運喜東南。忌西北之。";
                    五行宜忌論斷.補注="補注：秋月之金，是得令之月，所謂剛猛超凡，威權萬丈。金星旣旺，自厭土多，尤其是仲秋之後，更忌土，否則土重埋金，無法出世顯揚矣！庚金最欲火煉，見火煆煉，必是社稷棟樑。戌月之金，最喜木制土有木有火，鐘鼎之材。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.土="忌";
                    if(命盤.日主=="庚"){
                        if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.火="喜";
                    }
                    if(命盤.日主=="辛"){
                        if(命盤.分析.陰陽五行.土.力量形態數 ==0 && (命盤.分析.陰陽五行.水.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.水="喜";
                    }
                    if(命盤.分析.陰陽五行.木.力量形態數 <5) 五行宜忌論斷.木="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    break;

                case "亥":
                    五行宜忌論斷.註解="冬月火氣嚴肅，金伏藏之時也，謂其畏寒而無生意。晴明則金清水秀，雨雪則水冷金寒。所以冬令之金，得火融之，然後可以奪其寒氣，則富貴非常矣。初冬之金，見火則為傷殘。徐揚人干支無土，日生者貧夭，夜生者孤寒。遇土則衣祿豐足。見水木俱不利矣。";
                    五行宜忌論斷.補注="補注：十月之金，洩氣之月，最忌水旺來增局寒，所謂水盛金沈，出頭無望。也忌木來損力，苦勞而已。喜土來止水生身，但需火星照暖，否則凍土無法生金溫金也。火土健全溫養有功，母子成功也。也喜比劫聚集相扶，但火不可少。故冬月之金，重點在官。（火）、印（土），有官有印，富貴可求。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.水="忌";
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.木="忌";
                    if(命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.土="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                    break;

                case "子":
                    五行宜忌論斷.註解="子丑月生者，亦喜火以溫之，徐揚人無火亦喜。遇土得火為貴，冀雍人無火者孤貧。蓋寒土非生金之資也。見水則寒，西北人賤貧疾夭。徐揚人干支有火者，福壽康寧也。遇木為財，主富，享閑中之福。兗青人則有妻孥犯分之事，蓋衰金不能制木故也，荆梁豫人則吉。運喜東南，西北最忌。";
                    五行宜忌論斷.補注="補注：十一月之金，洩氣之月，最忌水旺來增局寒，所謂水盛金沈，出頭無望。也忌木來損力，苦勞而已。喜土來止水生身，但需火星照暖，否則凍土無法生金溫金也。火土健全溫養有功，母子成功也。也喜比劫聚集相扶，但火不可少。故冬月之金，重點在官。（火）、印（土），有官有印，富貴可求。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.水="忌";
                    if(命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.木="忌";
                    if(命盤.分析.陰陽五行.土.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.土="喜";
                    if(命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
                    break;

                case "丑":
                    五行宜忌論斷.註解="子丑月生者，亦喜火以溫之，徐揚人無火亦喜。遇土得火為貴，冀雍人無火者孤貧。蓋寒土非生金之資也。見水則寒，西北人賤貧疾夭。徐揚人干支有火者，福壽康寧也。遇木為財，主富，享閑中之福。兗青人則有妻孥犯分之事，蓋衰金不能制木故也，荆梁豫人則吉。運喜東南，西北最忌。";
                    五行宜忌論斷.補注="補注：丑月之金，一片冷凍濕泥之土，非火不能解凍，無火不能展其生機，故火愈旺愈佳，亦愛木來疏土生火，見丙溫燠，所以取富，見丁煉金，所以取貴，丙丁甲三全而透，富貴無疑，最忌水星。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.木.力量形態數 <5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.金.力量比率)) 五行宜忌論斷.木="喜";
                    if(命盤.分析.陰陽五行.水.力量形態數 >=5) 五行宜忌論斷.水="忌";
                    break;

                default:
                    alert(月令+"：三命通會五行月令宜忌 function, 月令輸入錯誤！");
            }
            break;

        case "水":
            五行宜忌論斷.木=""; 五行宜忌論斷.火=""; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";

            // *************** 通則-1：日干弱，殺剋洩重，喜比劫 ***************
            if(命盤.分析.陰陽五行.水.力量形態數 <5) {
                if(命盤.分析.陰陽五行.金.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //印重身輕
                    五行宜忌論斷.水="喜";
                    五行宜忌論斷.金="忌";
                }
                if(命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //財重身輕
                    五行宜忌論斷.水="喜";
                    五行宜忌論斷.火="忌";
                }
                if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) { //官重身輕
                    五行宜忌論斷.水="喜";
                    五行宜忌論斷.土="忌";
                }
            }

            // *************** 通則-2：印比弱，喜印比 ***************
            if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 <0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.水.力量形態數 <5) 五行宜忌論斷.水="喜";
                if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
            }

            // *************** 通則-3：印比強，忌印比 ***************
            if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4) {  //比率隨季節調整
                if(命盤.分析.陰陽五行.水.力量形態數 >5) 五行宜忌論斷.水="忌";
                if(命盤.分析.陰陽五行.金.力量形態數 >5) 五行宜忌論斷.金="忌";

                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.木.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 < 0.4) && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率)) 五行宜忌論斷.木="喜";  //喜食傷
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.木.力量比率 + 命盤.分析.陰陽五行.火.力量比率 < 0.4) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.金.力量比率 * 五行相對旺比率)) 五行宜忌論斷.火="喜"; //喜財
                if(命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.土.力量比率 * 五行相對旺比率 && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 < 0.4)) 五行宜忌論斷.土="喜"; //喜官殺
            }

            // *************** 通則-4：食傷強，財弱，喜財 ***************
            if((命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.火="喜";

            // *************** 通則-5：官殺強，印弱，喜印 ***************
            if((命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率 * 五行相對旺比率) && (命盤.分析.陰陽五行.金.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.金="喜";

            switch (月令) {
                case "寅":
                    五行宜忌論斷.註解="正月生者，水有寒氣，見火則冰融凍釋，富貴雍容。得金相助，徐揚生者最佳。逢木無火，則水冷木寒，未有生意。遇土剋水，亦主貧寒。土制金生，衣食豐贍。";
                    五行宜忌論斷.補注="補注：正月之水，正値積雪融化之時，雖陽和漸暖，唯氣候加上融雪，易形冰冷，需要火來照暖，又正月融化之水，到處奔流，散漫而氾濫，務須土制，否則汪洋無度，如又柱上多水，則益形氾濫，必難逃色劫。但若土多水少，則水遭堵塞不能暢流，這時宜木破土，局內若水勢不旺，則不必用土阻水。唯正月之水務欲見火，方得雍容富貴。";
                    
                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4) {
                        if(命盤.分析.陰陽五行.水.力量形態數 >5) 五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.土.力量形態數 <5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.土="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)){
                        五行宜忌論斷.土="忌";
                        if(命盤.分析.陰陽五行.木.力量形態數 <5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.木="喜";
                    }
                    break;

                case "卯":
                    五行宜忌論斷.註解="二三月之水，浩無邊際。見土則有隄防，晝則富貴，夜則流移。生於穀雨後，或主淫邪痺憊之疾，蓋土渾水濁故也。見火則水火相刑，災訟不免。遇金生水，泛溢無情。徐揚人干支得土者無咎。見木洩之，能施惠及人。兗青人生於二月中旬者，木氣正旺，盜其元神，則生風怯之病，得金助之無患。";
                    五行宜忌論斷.補注="補注：二月是木之旺地，洩水甚烈，宜見金星制木生水，使水源不絕，但金水太旺，則多淫矣！微火照暖則水火旣濟。火多則欲比劫相濟。水多則木漂，則一生奔波，居無定所，欲土成堤防，引導水勢兼培木根，微火溫燠，則水木淸華，才華滿腹。木不宜多，多則取金制木生身。";
                    

                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.金.力量形態數 <=5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.金="喜";
                    if(命盤.分析.陰陽五行.火.力量形態數 <5 && (命盤.分析.陰陽五行.火.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.火="喜";
                    if(命盤.分析.陰陽五行.水.力量形態數 >5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4)) {
                        if(命盤.分析.陰陽五行.土.力量形態數 <=5) 五行宜忌論斷.土="喜";
                        五行宜忌論斷.水="忌";
                        if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
                    }
                    if(命盤.分析.陰陽五行.木.力量形態數 >5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) {
                        五行宜忌論斷.木="忌";
                        if(命盤.分析.陰陽五行.金.力量形態數 <=5) 五行宜忌論斷.金="喜";
                    }
                    break;

                case "辰":
                    五行宜忌論斷.註解="二三月之水，浩無邊際。見土則有隄防，晝則富貴，夜則流移。生於穀雨後，或主淫邪痺憊之疾，蓋土渾水濁故也。見火則水火相刑，災訟不免。遇金生水，泛溢無情。徐揚人干支得土者無咎。見木洩之，能施惠及人。兗青人生於二月中旬者，木氣正旺，盜其元神，則生風怯之病，得金助之無患。";
                    五行宜忌論斷.補注="補注：三月之水，若見土旺，則有堵塞流水之患，宜木疏土，疏通其流，水弱則宜金發水源。";

                    // ------------------- 個別 -------------------
                    if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) {
                        五行宜忌論斷.木="喜";
                        五行宜忌論斷.土="忌";
                    }
                    break;

                case "巳":
                    五行宜忌論斷.註解="夏水失令，逢火則乾涸矣，所以忌晴而喜雨也。初夏之時，水猶泛濫，得土止而不流，則福氣深厚。但不宜與火同行，蓋火盛則土燥而水涸。徐揚人干支無金水者，疾夭也。逢水利就名成。金若生之，反主孤剋。蓋夏令金衰，母弱不能生子，而反傷於母也。荆梁豫人值之則吉。";
                    五行宜忌論斷.補注="補注：夏月之火炎土燥，金水衰竭之時，面對此烈火燥土，亟需金發水源，使水源不絕，但局內若無水星相助，則金有被火銷熔之虞，故夏月之水，最欲金水同用，所謂以金生水，以水護金，金水相濟爲用，而後存形發源也。故夏月之水，最忌火來增局炎燥，亦忌木生火旺，以及土來尅水。若遇土旺時，則需取金洩土生水，一舉相得，而不取木來制土，蓋木會生火之故。";

                    // ------------------- 個別 -------------------
					// 喜印比已建立在通則
					if(命盤.分析.陰陽五行.木.力量形態數 >=5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.木="忌";
					if(命盤.分析.陰陽五行.火.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.火="忌";
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) {
						五行宜忌論斷.土="忌";
						if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
					}
                    break;

                case "午":
                    五行宜忌論斷.註解="五六月之水，正能滋助萬物。喜土同行，生時更值陰雨者，主富貴文章。見火則有涸水之嫌，輕者疾，重者夭。得水濟之，凶中反吉。見木亦主富貴豪雄。兗青人洩其真氣，非佳，逢金氣弱，無力生水，不可例以母曜論之，反主孤剋。干支有金水者吉。運喜金水，火鄉最忌。";
                    五行宜忌論斷.補注="補注：夏月之火炎土燥，金水衰竭之時，面對此烈火燥土，亟需金發水源，使水源不絕，但局內若無水星相助，則金有被火銷熔之虞，故夏月之水，最欲金水同用，所謂以金生水，以水護金，金水相濟爲用，而後存形發源也。故夏月之水，最忌火來增局炎燥，亦忌木生火旺，以及土來尅水。若遇土旺時，則需取金洩土生水，一舉相得，而不取木來制土，蓋木會生火之故。";
                    
                    // ------------------- 個別 -------------------
					// 喜印比已建立在通則
					if(命盤.分析.陰陽五行.木.力量形態數 >=5 && (命盤.分析.陰陽五行.木.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.木="忌";
					if(命盤.分析.陰陽五行.火.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.火="忌";
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.火.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) {
						五行宜忌論斷.土="忌";
						if(命盤.分析.陰陽五行.金.力量形態數 <5) 五行宜忌論斷.金="喜";
					}
                    break;

                case "未":
                    五行宜忌論斷.註解="五六月之水，正能滋助萬物。喜土同行，生時更值陰雨者，主富貴文章。見火則有涸水之嫌，輕者疾，重者夭。得水濟之，凶中反吉。見木亦主富貴豪雄。兗青人洩其真氣，非佳，逢金氣弱，無力生水，不可例以母曜論之，反主孤剋。干支有金水者吉。運喜金水，火鄉最忌。";
                    五行宜忌論斷.補注="補注：未月之水，因是火燥土旺之故，先用金發水源，此取水以消暑去熱，然後以木破土。除非金水甚旺，否則不取木爲用，而且木不可多，多則有洩水傷金之嫌。總之未月務須見旺水，水旺才能取貴，水多見一點火星，則財祿豐厚，金水勢旺時，可行木火，必見名利雙收。";
					
					// ------------------- 個別 -------------------
					if(命盤.分析.陰陽五行.金.力量形態數 <=5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 < 0.5)) 五行宜忌論斷.金="喜";
					if(命盤.分析.陰陽五行.水.力量形態數 <=5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 < 0.5)) 五行宜忌論斷.水="喜";
					if(命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.5){
						if(命盤.分析.陰陽五行.木.力量形態數 <=5) 五行宜忌論斷.木="喜";
						if(命盤.分析.陰陽五行.火.力量形態數 <=5) 五行宜忌論斷.火="喜";
					}
					if(命盤.分析.陰陽五行.木.力量形態數 >5) 五行宜忌論斷.木="忌";
                    break;

                case "申":
                    五行宜忌論斷.註解="水生秋令，正水清秀之時也。晴則清澈無瑕，雨則潦水混濁。七月之水，正能滋實萬物，不宜與火同行。徐揚人火多者，貧夭無依。金為母曜，是當其時，子母相生，文章清貴。土來同處，化禍為祥。木若聯行，亦當貴顯。";
                    五行宜忌論斷.補注="補注：秋月之水，母旺子相，表裏晶瑩，得金助則清純，逢土旺則混濁。初秋之時，不喜土旺。秋月之水，最喜用火，火多則財帛必豐，見木洩秀亦吉，必見榮達子孫。但微木即可不必多，總之秋月之水已成旺相，忌水多而成氾灘也。";
                    
					// ------------------- 個別 -------------------
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.土="忌";
					if(命盤.分析.陰陽五行.火.力量形態數 <=5 && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 < 0.5)) 五行宜忌論斷.火="喜";
					if(命盤.分析.陰陽五行.木.力量形態數 <5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.木="喜";
					if(命盤.分析.陰陽五行.水.力量形態數 >5) 五行宜忌論斷.水="忌";
                    break;
					
                case "酉":
                    五行宜忌論斷.註解="八九月之水，遇令星，則福壽難量。金火同躔，則功名烜赫。見木終被疏洩，不免先成後敗。火若同坦，恩金失力，雖有治民服眾之德，未免痰疾刑傷。見土雖凶不凶，蓋秋令金，最能化難為福。徐揚豫人，干支土多者，亦困滯終身。運利西北，東南失宜。";
                    五行宜忌論斷.補注="補注：秋月之水，母旺子相，表裏晶瑩，得金助則清純，逢土旺則混濁。是指初秋之時，不喜土旺，但仲秋之後之水，用土無妨，唯不喜土多爾。秋月之水，最喜用火，火多則財帛必豐，見木洩秀亦吉，必見榮達子孫。但微木即可不必多，總之秋月之水已成旺相，忌水多而成氾灘也。";
                    
					// ------------------- 個別 -------------------
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.土="忌";
					if(命盤.分析.陰陽五行.火.力量形態數 <=5 && (命盤.分析.陰陽五行.火.力量比率 + 命盤.分析.陰陽五行.土.力量比率 < 0.5)) 五行宜忌論斷.火="喜";
					if(命盤.分析.陰陽五行.木.力量形態數 <5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.木="喜";
					if(命盤.分析.陰陽五行.水.力量形態數 >5) 五行宜忌論斷.水="忌";
                    break;

                case "戌":
                    五行宜忌論斷.註解="八九月之水，遇令星，則福壽難量。金火同躔，則功名烜赫。見木終被疏洩，不免先成後敗。火若同坦，恩金失力，雖有治民服眾之德，未免痰疾刑傷。見土雖凶不凶，蓋秋令金，最能化難為福。徐揚豫人，干支土多者，亦困滯終身。運利西北，東南失宜。";
                    五行宜忌論斷.補注="補注：戌月之水，因受戊土剋制，水源受阻，喜甲木來疏土，亦需金發水源，忌土多阻水，除非身旺，否則不喜見火。";
					
					// ------------------- 個別 -------------------
					if(命盤.分析.陰陽五行.土.力量形態數 >=5 && (命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率)) {
						五行宜忌論斷.土="忌";
						if(命盤.分析.陰陽五行.木.力量形態數 <=5 && (命盤.分析.陰陽五行.木.力量比率 < 命盤.分析.陰陽五行.水.力量比率)) 五行宜忌論斷.木="喜";
					}
					if(命盤.分析.陰陽五行.水.力量形態數 >5 && (命盤.分析.陰陽五行.金.力量比率 + 命盤.分析.陰陽五行.水.力量比率 > 0.4)) {
						if(命盤.分析.陰陽五行.火.力量形態數 <5) 五行宜忌論斷.火="喜";
					}
					break;

                case "亥":
                    五行宜忌論斷.註解="冬月司令之水，寒氣嚴凝之時也。雨則冰凝，晴則凍釋，故冬三月俱喜火以溫之，則富貴無虞矣。見金子母相生，徐揚人金紫玉堂之貴，冀雍人水冷金寒，雖相生而反貧薄，得火同行為吉。逢土金骨肉參商，冀雍人頓以隄防，而無泛濫之患也。遇木水寒木凍，俱無生意，貧夭無疑。徐揚人干之火多者，富壽。木土同垣，制煞反吉。";
                    五行宜忌論斷.補注="補注：冬令之水，由於司令當權，水勢極強，一片寒水，最重要的是取火解凍除寒，方有生機，命上無火，非上格矣！無火取木洩秀，雖謂有情，其彰不顯，蓋因無火則爲寒木，難發其功矣！命局若是土多水少，則可取木破土以生火。若水甚旺則取土做爲隄防，但仍須有火，否則寒泥難發其功，故冬月之水用火（財）來生土（官），相輔爲用，方顯其彰，方至上格，火土兩健，財官雙美，用木生火，財帛豐厚也。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率)) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率) 五行宜忌論斷.木="喜";
                    break;

                case "子":
                    五行宜忌論斷.註解="冬月司令之水，寒氣嚴凝之時也。雨則冰凝，晴則凍釋，故冬三月俱喜火以溫之，則富貴無虞矣。見金子母相生，徐揚人金紫玉堂之貴，冀雍人水冷金寒，雖相生而反貧薄，得火同行為吉。逢土金骨肉參商，冀雍人頓以隄防，而無泛濫之患也。遇木水寒木凍，俱無生意，貧夭無疑。徐揚人干之火多者，富壽。木土同垣，制煞反吉。";
                    五行宜忌論斷.補注="補注：冬令之水，由於司令當權，水勢極強，一片寒水，最重要的是取火解凍除寒，方有生機，命上無火，非上格矣！無火取木洩秀，雖謂有情，其彰不顯，蓋因無火則爲寒木，難發其功矣！命局若是土多水少，則可取木破土以生火。若水甚旺則取土做爲隄防，但仍須有火，否則寒泥難發其功，故冬月之水用火（財）來生土（官），相輔爲用，方顯其彰，方至上格，火土兩健，財官雙美，用木生火，財帛豐厚也。";
                    
                    五行宜忌論斷.木=""; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    if(命盤.分析.陰陽五行.水.力量形態數 >=5 && (命盤.分析.陰陽五行.水.力量比率 > 命盤.分析.陰陽五行.火.力量比率)) {
                        五行宜忌論斷.水="忌";
                        五行宜忌論斷.土="喜";
                    }
                    if(命盤.分析.陰陽五行.土.力量比率 > 命盤.分析.陰陽五行.水.力量比率) 五行宜忌論斷.木="喜";   
                    break;

                case "丑":
                    五行宜忌論斷.註解="冬月司令之水，寒氣嚴凝之時也。雨則冰凝，晴則凍釋，故冬三月俱喜火以溫之，則富貴無虞矣。見金子母相生，徐揚人金紫玉堂之貴，冀雍人水冷金寒，雖相生而反貧薄，得火同行為吉。逢土金骨肉參商，冀雍人頓以隄防，而無泛濫之患也。遇木水寒木凍，俱無生意，貧夭無疑。徐揚人干之火多者，富壽。木土同垣，制煞反吉。丑月生者，貴顯。運喜南方，東南次之。";
                    五行宜忌論斷.補注="補注：十二月（丑月）之水，天寒地凍，冰泥之水，先用火照暖除寒解凍，次用甲木疏土，木火旺盛，富貴可期也。";

                    五行宜忌論斷.木="喜"; 五行宜忌論斷.火="喜"; 五行宜忌論斷.土=""; 五行宜忌論斷.金=""; 五行宜忌論斷.水="";
                    break;

                default:
                    alert(月令+"：三命通會五行月令宜忌 function, 月令輸入錯誤！");
            }
            break;
    }  // end switch 日主五行

    var 總結註解="《三命通會》：" + 五行宜忌論斷.註解+"<br>"+五行宜忌論斷.補注;
    //var 總結矩陣=["三命通會", "", "", "", "", "", 總結註解];
    var 總結矩陣=["三命通會", 五行宜忌論斷.木, 五行宜忌論斷.火, 五行宜忌論斷.土, 五行宜忌論斷.金, 五行宜忌論斷.水, 總結註解];

    命盤.分析.陰陽五行.五行喜忌總結.push(總結矩陣);
}


function 千里命稿五行分類(日主五行, 對比五行, 命盤){
    //千里命稿的五行分類與四季喜
    var 日主五行數=五行字轉數(日主五行);
    var 五行分類喜忌={"類別": "", "註解": "", "失衡五行": "", "木": "", "火": "", "土": "", "金": "", "水": ""};

    switch(日主五行){
        case "木":
            switch(對比五行){
                case "木":
                    // do nothing
                    break;
                case "火":
                    五行分類喜忌.類別="焚木"; 五行分類喜忌.失衡五行="火";
                    五行分類喜忌.註解="火多木焚，喜水剋火，土洩火，忌木生助，火熾烈。";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火="忌"; 五行分類喜忌.土="喜"; 五行分類喜忌.金=""; 五行分類喜忌.水="喜";
                    break;
                case "土":
                    五行分類喜忌.類別="折木"; 五行分類喜忌.失衡五行="土";
                    五行分類喜忌.註解="土多木折，喜水生木，忌土加重。";
                    五行分類喜忌.木=""; 五行分類喜忌.火=""; 五行分類喜忌.土="忌"; 五行分類喜忌.金=""; 五行分類喜忌.水="喜";
                    break;
                case "金":
                    五行分類喜忌.類別="斷木";  五行分類喜忌.失衡五行="金";
                    五行分類喜忌.註解="金多木斷，喜火制金存木，水洩金生木，忌土助金，金堅銳。";
                    五行分類喜忌.木=""; 五行分類喜忌.火="喜"; 五行分類喜忌.土="忌"; 五行分類喜忌.金="忌"; 五行分類喜忌.水="喜";
                    break;
                case "水":
                    五行分類喜忌.類別="浮木";  五行分類喜忌.失衡五行="水";
                    五行分類喜忌.註解="水多木浮，喜土制水，忌金助水。";
                    五行分類喜忌.木=""; 五行分類喜忌.火=""; 五行分類喜忌.土="喜"; 五行分類喜忌.金="忌"; 五行分類喜忌.水="忌";
                    break;
            }  // end switch 對比五行
            
            if(五行分類喜忌.類別==""){
                if(命盤.分析.陰陽五行.數據[日主五行數].力量形態數>=6){
                    五行分類喜忌.類別="強木";
                    五行分類喜忌.註解="強木喜土分力，金斫削，火吐秀，忌水生木，木加重。";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火="喜"; 五行分類喜忌.土="喜"; 五行分類喜忌.金="喜"; 五行分類喜忌.水="忌";               
                }
                if(命盤.分析.陰陽五行.數據[日主五行數].力量形態數<=4){
                    五行分類喜忌.類別="弱木";
                    五行分類喜忌.註解="弱木喜水生木，木比助，忌土分力，金剋害，火洩氣。";
                    五行分類喜忌.木="喜"; 五行分類喜忌.火="忌"; 五行分類喜忌.土="忌"; 五行分類喜忌.金="忌"; 五行分類喜忌.水="喜";               
                }               
            }
            break;
        case "火":
            switch(對比五行){
                case "木":
                    五行分類喜忌.類別="熾火"; 五行分類喜忌.失衡五行="木";
                    五行分類喜忌.註解="木多火熾，喜金剋木，忌水生木。";

                    五行分類喜忌.木="忌"; 五行分類喜忌.火=""; 五行分類喜忌.土=""; 五行分類喜忌.金="喜"; 五行分類喜忌.水="忌";
                    break;
                case "火":
                    //do nothing
                    break;
                case "土":
                    五行分類喜忌.類別="晦火"; 五行分類喜忌.失衡五行="土";
                    五行分類喜忌.註解="土多火晦，喜金洩土，木制土，忌火生土，土堅重。";
                    五行分類喜忌.木=""; 五行分類喜忌.火="忌"; 五行分類喜忌.土="忌"; 五行分類喜忌.金="喜"; 五行分類喜忌.水="";
                    break;
                case "金":
                    五行分類喜忌.類別="熄火"; 五行分類喜忌.失衡五行="金";
                    五行分類喜忌.註解="金多火熄，喜木生火，忌金加重。";
                    五行分類喜忌.木="喜"; 五行分類喜忌.火=""; 五行分類喜忌.土=""; 五行分類喜忌.金="忌"; 五行分類喜忌.水="";
                    break;
                case "水":
                    五行分類喜忌.類別="滅火"; 五行分類喜忌.失衡五行="水";
                    五行分類喜忌.註解="水多火滅，喜土制水存火，木洩水生火，忌金助水，水盛旺。";
                    五行分類喜忌.木="喜"; 五行分類喜忌.火=""; 五行分類喜忌.土="喜"; 五行分類喜忌.金="忌"; 五行分類喜忌.水="忌";
                    break;
            }  // end switch 對比五行
            break;
        case "土":
            switch(對比五行){
                case "木":
                    五行分類喜忌.類別="傾土"; 五行分類喜忌.失衡五行="木";
                    五行分類喜忌.註解="木多土傾，喜金制木存土，火洩木生土，忌水助木，木繁盛";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火="喜"; 五行分類喜忌.土=""; 五行分類喜忌.金="喜"; 五行分類喜忌.水="喜";
                    break;
                case "火":
                    五行分類喜忌.類別="焦土"; 五行分類喜忌.失衡五行="火";
                    五行分類喜忌.註解="火多土焦，喜水制火，忌木助火。";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火="忌"; 五行分類喜忌.土=""; 五行分類喜忌.金=""; 五行分類喜忌.水="喜";
                    break;
                case "土":
                    // do nothong
                    break;
                case "金":
                    五行分類喜忌.類別="焚土"; 五行分類喜忌.失衡五行="金";
                    五行分類喜忌.註解="金多易焚，喜火制金，水洩金，忌土助金，金堅實";
                    五行分類喜忌.木=""; 五行分類喜忌.火="喜"; 五行分類喜忌.土="忌"; 五行分類喜忌.金="忌"; 五行分類喜忌.水="喜";
                    break;
                case "水":
                    五行分類喜忌.類別="流土";
                    五行分類喜忌.註解="水多土流，喜火生土，忌水加重"; 五行分類喜忌.失衡五行="水";
                    五行分類喜忌.木=""; 五行分類喜忌.火="喜"; 五行分類喜忌.土=""; 五行分類喜忌.金=""; 五行分類喜忌.水="忌";
                    break;
            }
            break;
        case "金":
            switch(對比五行){
                case "木":
                    五行分類喜忌.類別="缺金"; 五行分類喜忌.失衡五行="木";
                    五行分類喜忌.註解="木多金缺，喜土生金，忌木加重。";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火=""; 五行分類喜忌.土="喜"; 五行分類喜忌.金=""; 五行分類喜忌.水="";
                    break;
                case "火":
                    五行分類喜忌.類別="熔金"; 五行分類喜忌.失衡五行="火";
                    五行分類喜忌.註解="火多金熔，喜水制火存金，土洩火生金，忌木助火熾。";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火="忌"; 五行分類喜忌.土="喜"; 五行分類喜忌.金=""; 五行分類喜忌.水="喜";
                    break;
                case "土":
                    五行分類喜忌.類別="埋金"; 五行分類喜忌.失衡五行="土";
                    五行分類喜忌.註解="土多金埋，喜木制土，忌火助土。";
                    五行分類喜忌.木="喜"; 五行分類喜忌.火="忌"; 五行分類喜忌.土="忌"; 五行分類喜忌.金=""; 五行分類喜忌.水="";
                    break;
                case "金":
                    // do nothing
                    break;
                case "水":
                    五行分類喜忌.類別="沉金"; 五行分類喜忌.失衡五行="水";
                    五行分類喜忌.註解="水多金沉，喜土剋水，木洩水，忌金助水泛。";
                    五行分類喜忌.木="喜"; 五行分類喜忌.火=""; 五行分類喜忌.土="喜"; 五行分類喜忌.金="忌"; 五行分類喜忌.水="忌";
                    break;
            }
            break;
        case "水":
            switch(對比五行){
                case "木":
                    五行分類喜忌.類別="縮水"; 五行分類喜忌.失衡五行="木";
                    五行分類喜忌.註解="木多水縮，喜火洩木，金制木，忌水生助，木繁盛。";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火="喜"; 五行分類喜忌.土="-"; 五行分類喜忌.金="喜"; 五行分類喜忌.水="忌";
                    break;
                case "火":
                    五行分類喜忌.類別="沸水"; 五行分類喜忌.失衡五行="火";
                    五行分類喜忌.註解="火多水沸，喜金生水，忌火加重。";
                    五行分類喜忌.木="忌"; 五行分類喜忌.火="忌"; 五行分類喜忌.土="-"; 五行分類喜忌.金="喜"; 五行分類喜忌.水="喜";
                    break;
                case "土":
                    五行分類喜忌.類別="淤水"; 五行分類喜忌.失衡五行="土";
                    五行分類喜忌.註解="土多水淤，喜木剋土存水，金洩土生水，忌火助土，土堅實。";
                    五行分類喜忌.木="喜"; 五行分類喜忌.火="忌"; 五行分類喜忌.土="忌"; 五行分類喜忌.金="喜"; 五行分類喜忌.水="-";
                    break;
                case "金":
                    五行分類喜忌.類別="滯水"; 五行分類喜忌.失衡五行="金";
                    五行分類喜忌.註解="金多水滯，喜火制金，忌土助金";
                    五行分類喜忌.木="喜"; 五行分類喜忌.火="喜"; 五行分類喜忌.土="忌"; 五行分類喜忌.金="忌"; 五行分類喜忌.水="忌";
                    break;
                case "水":
                    // do nothing
            }
            break;
    }
    var 分類喜忌="《千里命稿》："+五行分類喜忌.註解;

    var 總結矩陣=["五行平衡（"+五行分類喜忌.失衡五行+"）", 五行分類喜忌.木, 五行分類喜忌.火, 五行分類喜忌.土, 五行分類喜忌.金, 五行分類喜忌.水, 分類喜忌];

    命盤.分析.陰陽五行.五行喜忌總結.push(總結矩陣);

    return 五行分類喜忌;
}

function 五行具足(命盤){

	for(var i=0; i<5; i++){
		if(命盤.分析.陰陽五行.數據[i].數量==0) 命盤.分析.陰陽五行.五行具足.欠缺五行 +=命盤.分析.陰陽五行.數據[i].五行;
	}

	if(命盤.分析.陰陽五行.五行具足.欠缺五行=="") 命盤.分析.陰陽五行.五行具足.五行俱全=true;

	if(命盤.分析.陰陽五行.五行具足.欠缺五行!=""){
		if(命盤.分析.陰陽五行.五行具足.欠缺五行.indexOf("木") > -1) 命盤.分析.陰陽五行.五行具足.缺木=true;
		if(命盤.分析.陰陽五行.五行具足.欠缺五行.indexOf("火") > -1) 命盤.分析.陰陽五行.五行具足.缺火=true;
		if(命盤.分析.陰陽五行.五行具足.欠缺五行.indexOf("火") > -1) 命盤.分析.陰陽五行.五行具足.缺火=true;
		if(命盤.分析.陰陽五行.五行具足.欠缺五行.indexOf("金") > -1) 命盤.分析.陰陽五行.五行具足.缺金=true;
		if(命盤.分析.陰陽五行.五行具足.欠缺五行.indexOf("水") > -1) 命盤.分析.陰陽五行.五行具足.缺水=true;
	} 
}


function 五行旺與流通(命盤){
	var 旺的定義=30;
	var 最旺五行=命盤.分析.陰陽五行.五行力量順序[4].五行;
	var 最旺五行力度=(命盤.分析.陰陽五行.五行力量順序[4].力量 > 旺的定義)? "旺" : "不太旺";
	var 最旺五行流通=命盤.分析.陰陽五行.數據[五行字轉數(最旺五行)].流通;
	var 流通註解="";

	if(最旺五行力度=="旺"){
		switch(最旺五行){
			case "木":
				if(最旺五行流通) 流通註解="木旺且流通，善良、善緣、謀略、善於思考、進取。"; else 流通註解="木旺欠流通，易動怒、耿直、易受騙、情緒化、木納。陽剛者，好勝，不安於現狀。";
				break;
			case "火":
				if(最旺五行流通) 流通註解="火旺且流通，易有歡喜心、熱情、活力、外向、能壓抑自己、奉公守法、熱心公益。"; else 流通註解="火旺欠流通，好鬥、急躁。陰柔者，拘謹、保守。";
				break;
			case "土":
				if(最旺五行流通) 流通註解="土旺且流通，誠實忠厚，務實、親力親為。"; else 流通註解="土旺欠流通，易憂思，喜歡照顧別人、包容護短。陽剛者，頑固，遲鈍。";
				break;
			case "金":
				if(最旺五行流通) 流通註解="金旺且流通，嚴肅、好權、權威、精明能幹、貫徹始終。"; else 流通註解="金旺欠流通，易悲觀，陽剛者，衝動、殺氣、鬥爭。陰柔者，口是心非、弄權、注重外表。";
				break;
			case "水":
				if(最旺五行流通) 流通註解="水旺且流通，愛服務群眾、創作、應變、口才好、善交際。"; else 流通註解="水旺欠流通，易恐驚、執行力差、幻想、善變。陽剛者，愛說謊、貪心、賭博、走偏鋒、任性、色情、陰謀。";
				break;
		}  //end switch

	} // end if
	return 流通註解;
}

function 五行開運(命盤){
	var 所喜五行=命盤.分析.陰陽五行.五行喜忌.五行喜;
	var 喜五行矩陣=所喜五行.split("");
	var 開運總註解=[];

	for(var i=0; i<喜五行矩陣.length;i++){
		var 喜五行=喜五行矩陣[i];
		var 開運註解=[];

		switch(喜五行){
			case "木":
				開運註解.push("命喜木之人，平時多穿著綠色衣服、佩飾，或家裏之牆壁、沙發、窗簾、衣櫥，家具等儘量採用綠色或靑色系列，有助於開運。尤其是求職之面談，或交易之談判等事件。");
				開運註解.push("命喜木者，較宜居住於溫帶地區，喜多林木之區域，如公園、植物園、近山林之地方。就寢時頭部朝東較佳。");
				開運註解.push("開運物品：蜜蠟、石榴石、紅發晶、玫瑰輝石");
				開運註解.push("幸運數字：1、2");
				開運註解.push("職業：木材等、木製家具、裝潢業、木製藝品業、木匠、簿記員、秘書、速記打字員、出納員、護士、教師、文具店、文化事業(不含直接出版者)、校長、教育界及器具業、服裝師、作家、實驗室助理、書店、種植花卉藝術業、樹苗業、青果商、西藥房、藥劑師、圖書館員、園藝設計業、布匹買賣業、售賣植物性之素食業、蔬菜種作栽培研究業、物理研究員、生物學家、固定性公務人員、販賣青草店、特殊有機體成長研究員、技術性專業傳授、司機、竹製家具業、竹製裝飾品、藤製品、工業技術執行部門、操作員、人士培育輔導員及企劃設計部門等。");
				開運註解.push("食療：綠豆、韭菜、蒜苗、油菜、小白菜、芥蘭、菠菜、空心菜、西洋菜、萵苣、莧菜、芹菜、豌豆莢、四季豆、蘆筍、綠花椰菜、絲瓜、黃瓜、青椒、香菜、九層塔、青蔥、綠茶、香瓜、棗、葡萄、奇異果、芭樂、哈密瓜、青蘋果、動物肝臟。");
				break;
			case "火":
				開運註解.push("命喜火之人，平時多穿著紅色衣服、佩飾，或家裡之牆壁、沙發、窗簾、衣櫥、家具等儘量採用紅色系列，有助於開運。");
				開運註解.push("命喜火者，較宜居住於熱帶地區，大陸性區域較有利，或居住於乾燥、近火之區域。就寢時頭部宜朝南。");
				開運註解.push("開運物品：鑽石、黃水晶、琥珀、虎眼石");
				開運註解.push("幸運數字：3、4");
				開運註解.push("職業：電器業、照明設備業、舞台燈光業、鍋爐設備業、馬達動力業、加工製品合成業、高溫處理業、雷射反應處理、ｘ光處理部門、照相業、沖洗相片業、工業產品再製業、化學反應易燃品、硬化劑製售業、理電髮院、化妝品製造業、熱飲食業、油湯食品業、廚師、照相師、工商管理顧問、教官、人事管理事、電機工程師、警察、女管家、公務領導人、軍人、司法部、治安警備、政治參與者、人事培育訓練員、訓導人員、長官、董事長或總經理有實權領導者、執行政業者、鑄造業、評論家、演說家、鐘錶業、焚化燃燒員、機車汽車火車引擎業、核能反應處理業、電力電信業及塑膠成品業。");
				開運註解.push("食療：紫山藥、紅豆、紅甜椒、胡蘿蔔、紅辣椒、茄子、紅紫蘇、枸杞、紅棗、櫻桃、水蜜桃、蘋果、草莓、紅肉西瓜、火龍果、番茄、紅肉葡萄柚、桑葚、紅砂糖、動物心臟。");
				break;
			case "土":
				開運註解.push("命喜土之人，平時多穿著黃色衣服、佩飾，或家裡之牆壁、沙發、窗簾、衣櫥、家具等儘量採用黃色系列，有助於開運。");
				開運註解.push("命喜土者，較宜居住於不溫不寒且靠近山嶺或接近田園耕作之地區爲佳。就寢時頭部宜朝南。");
				開運註解.push("開運物品：玉、白幽靈、鈦晶");
				開運註解.push("幸運數字：5、6");
				開運註解.push("職業：建築業、石材業、石材製品業、礦石業、房地產買賣業、掮客、中盤批發商、介紹業、存貨清查員、倉儲業、泥木匠、拗磚工、磁磚製售業、磁器業、傳教士、牧師、建築管理師、統計師、和尚、尼姑、修道者、殯儀館、打石店、墓碑店、喪儀社、墓地管理經營業、收斂者、石油之原油在未提煉前、代書、山產業、農夫、礦冶工程師、地下工程業、挖鑽施工業、水泥製品業、混凝土業、食用農產品業、印章製造業、當鋪業、土木業、圖書館業、製糊或售糊業、保母業、防水處理業、雨衣雨具業、鞋業、綜合徵信業、資訊業、飼料製售業、五術研究機構、保險業、會統系部門、考古跡古董業、宗教寺廟宮壇管理經營業等。");
				開運註解.push("食療：薏仁、胚芽米、栗子、地瓜、糙米、蓮藕、玉米、芋頭、小米、燕麥、芋頭、南瓜、黃甜椒、黃豆芽、金針花、玉米筍、黃豆、豆干、素雞、麵腸、麵錢、油豆腐、味噌、蛋黃、豆腐乳、麵筋球、素肉、烤麩、豆腐衣、老薑、橘子、柳丁、楊桃、黃奇異果、檸檬、鳳梨、枇杷、柿子、黃肉西瓜、柑橘、榴槤、芒果、木瓜、金桔、白果、甘蔗汁、水蜜桃、花生、核桃、瓜子、腰果、奶油、乳酪、食用油、咖哩、蜂蜜、動物胃腸。");
				break;
			case "金":
				開運註解.push("命喜金之人，平時多穿著白色衣服、佩飾，或家裡之牆壁、沙發、窗簾、衣櫥、家具等儘量採用白色系列，有助於開運。");
				開運註解.push("命喜金者，較宜居住於涼性地區，及接近金屬或礦區爲佳。就寢時頭部宜朝西。");
				開運註解.push("開運物品：黃白金、白幽靈、翡翠、東菱石");
				開運註解.push("幸運數字：7、8");
				開運註解.push("職業：金屬工具材料業、機械製造業、鐵工廠、西工黑手界、金玉珠寶製售業、武器製造業、打鐵店、五金製品業、鋁窗工程業、採購員、雕刻業、鐵模工、外科醫生、牙醫、律師、法官、審判員、執行者、音樂家、裁縫師、金融界、爆破業、特殊冒險任務執行者、思想滲透部門、調查門部門、堅硬技術業、超鋼鑽石處理切割業、鑽具製售業、交通器具販售業、鑑定師、科技專業門(屬獨立超然系統)、能自我決斷發揮的事業，為主宰關鍵之部門而非領導者、記者、新聞傳播業、民意代表、消費者基金會、公務稽核人員、稅捐部門、公懲會、屠宰業、獸肉販賣業、拆船、拆屋、破壞業、度量衡、鏡業等。");
				開運註解.push("食療：白米、糯米、山藥、蓮子、荸薺、百合、馬鈴薯、麵粉、涼粉、高麗菜、白蘿蔔、洋蔥、大蒜、包心菜、小白菜、苦瓜、冬瓜、花椰菜、竹筍、白木耳、白蒟蒻、綠豆芽、薑、磨菇、金針菇、鮑魚菇、豆漿、豆腐、雞蛋、鴨蛋、荔枝、龍眼、紅毛丹、柚子、椰子、水梨、香蕉、山竹、杏仁、白芝麻、冰糖、動物肺臟。");
				break;
			case "水":
				開運註解.push("命喜水之人，平時多穿著黑色衣服、佩飾，或家裡之牆壁、沙發、窗簾、衣櫥、家具等儘量採用黑色系列，有助於開運。");
				開運註解.push("命喜水者，較宜居住於寒帶地區或靠近海邊、河川、湖泊等近水之地區爲佳。就寢是頭部宜朝北。");
				開運註解.push("開運物品：水晶、珍珠、黑曜石、黑碧璽、煙晶");
				開運註解.push("幸運數字：9、10");
				開運註解.push("職業：推銷員、導遊業、旅行社、牛仔褲販賣業、運動家、娛樂業、色情業、旅社賓館、公共浴室業、溫泉業、流動攤販、水管業、給排水處理業、水肥處理業、郵差、廣告業、出版者、油漆匠、超級商店、社會工作者、舞蹈演藝人員、投機事業、美容師、空中小姐、武術教練、大眾傳播業、漁業界、車掌、清潔清洗業、航海船業公司、船員、打撈業、消防隊、游泳業、衛浴業、股票市場、冷凍事業、冷水冰棒飲料業、蒸餾水業、抽水業、釣魚池業、滅火消防業、貿易業、期貨跑單幫、舶來品報關行、不定性事業、球類運動業、健身房、操體力勞工業、茶室、海產業、水產養殖場及事業、染衣洗衣店、運送店、交通運輸業、航空事業、水利事業、菜市場、藝術業、流動性事業。");
				開運註解.push("食療：黑木耳、髮菜、草菇、香菇、海菜、海帶、牛蒡、黑蒟蒻、海苔、黑棗、紫山藥、茄子、皮蛋、黑豆漿、黑豆、豆豉、蕎麥麵、龍眼乾、烏梅、葡萄乾、葡萄、藍莓、湖麻油、黑芝麻、醬油、黑醋、茶葉、甜麵醬、豆瓣醬、動物腎臟。");
				break;				
		}

		var 五行所喜標題='<span class = "經典標題">五行喜'+ 喜五行 +'</span><br><br>';
		開運總註解.push(五行所喜標題 + 開運註解.join("<br><br>"));
	}  // end for
	if(開運總註解.length>0) {
		var 開運標題='<span class = "論斷單元">五 行 開 運</span><br><br>';
		return 開運標題+開運總註解.join("<br><br>");
	}
	else return "";
}


function 尋最大最小五行(命盤){
	// Not use, use function 五行力量排列(命盤) to determine
    var 最大五行={"五行": "", "五行數": -1, "力量比率": ""};
    var 最小五行={"五行": "", "五行數": -1, "力量比率": ""};
    
    最大五行.五行數=0; 最大五行.五行=命盤.分析.陰陽五行.數據[0].五行; 最大五行.力量比率=命盤.分析.陰陽五行.數據[0].力量比率;
    最小五行.五行數=0; 最小五行.五行=命盤.分析.陰陽五行.數據[0].五行; 最小五行.力量比率=命盤.分析.陰陽五行.數據[0].力量比率;
    
    for(var i=1; i<5; i++){
        if(命盤.分析.陰陽五行.數據[i].力量比率>最大五行.力量比率){
            最大五行.五行數=i; 
            最大五行.五行=命盤.分析.陰陽五行.數據[i].五行; 
            最大五行.力量比率=命盤.分析.陰陽五行.數據[i].力量比率;
        }

        if(命盤.分析.陰陽五行.數據[i].力量比率<最小五行.力量比率){
            最小五行.五行數=i; 
            最小五行.五行=命盤.分析.陰陽五行.數據[i].五行; 
            最小五行.力量比率=命盤.分析.陰陽五行.數據[i].力量比率;
        }
    } // end for
    命盤.分析.陰陽五行.最強五行.五行=最大五行.五行; 命盤.分析.陰陽五行.最強五行.五行數=最大五行.五行數; 命盤.分析.陰陽五行.最強五行.力量比率=parseFloat((最大五行.力量比率*100).toFixed(1));
    命盤.分析.陰陽五行.最弱五行.五行=最小五行.五行; 命盤.分析.陰陽五行.最弱五行.五行數=最小五行.五行數; 命盤.分析.陰陽五行.最弱五行.力量比率=parseFloat((最小五行.力量比率*100).toFixed(1));
    
    //console.log(命盤.分析.陰陽五行.最強五行);
    //console.log(命盤.分析.陰陽五行.最弱五行);
}