
function 傳統論斷模塊(命盤){
    var 傳統論斷內容矩陣 = [];

    var 命盤神煞論斷 = 命盤神煞(命盤);
    var 四柱神煞論斷 = 論斷神煞(命盤); //命盤神煞(命盤);
    //var 四柱坐運星論斷 = 四柱坐運星(命盤.年柱.運星+"年柱", 命盤.月柱.運星+"月柱", 命盤.日柱.運星+"日柱", 命盤.時柱.運星+"時柱");

    var 命身宮論斷 = 命身宮論斷單元(命盤);
    var 分定經論斷 = 分定經(命盤.年干.天干, 命盤.時干.天干, 0);
    var 六十日主用法詩訣論斷 = 六十日主用法詩訣(命盤.日柱.干支);
    var 六十日主單元=六十日主論斷單元(命盤);
    
    //var 六十日主論斷1註解=六十日主論斷1(命盤.日柱.干支);
    //var 六十日主論斷2註解=六十日主論斷2(命盤.日柱.干支);

    傳統論斷內容矩陣.push(命盤神煞論斷);
    傳統論斷內容矩陣.push(四柱神煞論斷);
    
    //傳統論斷內容矩陣.push(四柱坐運星論斷);
    傳統論斷內容矩陣.push(命身宮論斷);
    傳統論斷內容矩陣.push(分定經論斷);
    傳統論斷內容矩陣.push(六十日主用法詩訣論斷);
    傳統論斷內容矩陣.push(六十日主單元);
    
    return 傳統論斷內容矩陣.join("<br><br>");

}

function 命身宮論斷單元(命盤){
    var 單元標題 = '<span class = "傳統論斷項目">命宮分析</span>';;
    var 命身宮論斷矩陣 = [];

    命身宮論斷矩陣.push(地支特性(命盤.命宮.substr(1,1), "命宮含義"));
    命身宮論斷矩陣.push(地支特性(命盤.命宮.substr(1,1), "一掌經含義"));

    命身宮論斷矩陣.unshift(單元標題);
    return 命身宮論斷矩陣.join("<br><br>");
}

function 六十日主論斷單元(命盤){
    var 單元標題 = '<span class = "論斷單元">六十日主論斷單元</span>';;
    var 六十日主單元矩陣 = [];

    var 六十日主1 = 六十日主論斷1(命盤.日柱.干支);
    var 六十日主2 = 六十日主論斷2(命盤.日柱.干支);
    var 六十日主3 = 六十日主論斷3(命盤.日柱.干支);

    六十日主單元矩陣.push(六十日主1);
    六十日主單元矩陣.push(六十日主2);
    六十日主單元矩陣.push(六十日主3);

    六十日主單元矩陣.unshift(單元標題);
    return 六十日主單元矩陣.join("<br><br>");
}


function 十二運星分析(命盤){
	var 十二運星資料 = [
        { "運星": "長生", "個性": "長生，為人溫和，忠厚、得人敬重，受人歡迎，易得長上之提拔而發跡，處事有原則，有理性，有志節，健康又長壽。", "註解": "日支自坐長生的人，大都資性溫厚，具有進取心，富發展性，有豐富的思考力，引人注目，所提出之構想大都可供於盡量發揮的獨特力量。這種人能夠守住祖先遺留下來的產業。並且能有自己創造的獨特的經營方式，使事業進入常軌。在外表上這種人平和而遵守紀律，靈敏而淸明，自己能開拓財運，爲發展性很大的好命之人。", "補注": ""},
        { "運星": "沐浴", "個性": "沐浴，個性倔強，不易接納忠言，虎頭蛇尾，有始無終，常常半途而廢，一生多起伏，多彩多姿卻不易獲大成就。", "註解": "日支自坐沐浴的人，性格奔放，輕舉妄動，常做冒失之事，因此也容易受到他人的責難。另一方面，雖然人緣極佳，但是在躊躇滿志之時，行動就會踰越限度，常常爲了一點小事就生氣地責備他人，性格忽冷忽熱。此外，還有易耽溺於性愛之缺點。", "補注": "內桃花，夫妻恩愛、互利、但遇沖破有分離；外桃花，又佔沐浴者，好酒色、有情人、夫妻不易合、不顧家、多有外遇、大運又遇外桃花更重；桃花煞，怕傷官、劫財、羊刃，女犯之為白虎星；男逢之主敗家；桃花帶合，浪蕩之人。"},
        { "運星": "冠帶", "個性": "冠帶，樂觀進取，堅忍不拔，不屈不撓，人格圓滿，深得敬重，善權術、謀略與交際手腕， 每有先知之見。", "註解": "日支自坐冠帶的人，博愛，仁慈，有先見之明，若掌握到機會，就能如順風揚帆般進行發展。此外，也會受社會的禮遇和衆人的尊敬。但另一方面，這種人自尊心極強，對待下人或後輩往往會態度傲慢，好耍權威。同時，這種人亦甚擅長於社交活動，是積極進取，深具實行力之人。", "補注": ""},
        { "運星": "臨官", "個性": "臨官，積極進取，壯志凌雲，高潔圓滿，自立自強，勇於突破困境，人格高尙，聰明機智，能擁富貴。", "註解": "日支自坐臨官的人，能發展，能集眾望於一身，有成大器之材，擅於運用權勢手腕，如果在人群中當領導人物，則地位、俸祿會自然地加於身上。品行端正，爲典型的社交家，能活躍於社交圈裏。同時這種人也頗有德望，故能普遍地獲得衆人之愛戴。但是，這種人在另一方面卻又過於自信，頑固執抛。這種命對於女性而言，稍嫌強烈。中年之後，靠自己之力量去發展，大都能招來福運，是屬於憑著一己之力能夠發祥叙福之人。", "補注": ""},
        { "運星": "帝旺", "個性": "帝旺，自信滿懷，獨斷獨行，剛強堅毅，魄力十足，可惜較難接納忠言，運勢雖強，充滿暗流。", "註解": "日支自坐帝旺的人，表示著權勢、威力、財貨兼備。此外，這種人自尊心甚強，頗有實行力，一旦決定之事，都能貫徹始終。同時，這種人能自然地享受福祿壽等惠澤。但對於女性而言，太過於強烈，有礙於人際關係之發展以及夫妻感情之和諧。", "補注": ""},
        { "運星": "衰", "個性": "衰，保守內向，溫文厚重，滿足現狀，不求大成，積極性不足，凡事多猜疑，多幻想，較難面對現實。", "註解": "日支自坐衰的人，秉性溫順，守舊內向，不會反對別人，有進取之氣槪，但比較內斂，即使自己之能力超越他人，也不會在表面顯現出來。此外，有點杞人憂天，對金錢財物不太關心，即使繼承祖業，也只是勉強維而已。女性的命中若有衰出現，則表示性格貞淑圓滿，陰干命表示好命，魁罡日女命則對內柔弱，外表則剛如獅吼。", "補注": ""},
        { "運星": "病", "個性": "病，消極苟安，富同情心，樂於助人，喜歡文靜藝術生活，不喜繁華熱鬧環境，內向保守而不喜出風頭，有嫉妒心。", "註解": "日支自坐病的人，遵守人道，不會排斥他人，安於自己之本分，因此與人交往也多半圓滿。性格稍內向，有時會杞人憂天，同時嫉妒心也強。但這種人才智過人，是非曲直分明，手腳靈活，但有招致波亂之傾向。", "補注": "容易生病，尤其是33-48歲之間。"},
        { "運星": "死", "個性": "死，焦慮不安，優柔寡斷，凡事舉棋不定，極端聰明，卻愛鑽牛角尖，因此自尋苦惱，宜於學術硏究與藝術生涯。", "註解": "日支自坐死的人，才華智慧，福德兼備，有俠義之心，富於進取，冒險之精神。富有創造發明之能力，爲努力之人，尤其能靠特殊技能獲致成功。另一方面，這種人性急，常常爲自己製造困擾和麻煩。而由於這種人智能過人，適合當學者，只要從事與智能硏究有關之工作，都能獲致滿意的成就。", "補注": "<br>日支入死、墓、絕者，①晚婚，②婚緣難續，③離異，④同床異夢，⑤死亡，⑥為情傷心，從而單身，⑦人慾橫流，⑧玩世不恭，無人倫觀念。再看地支的六沖或六合論，六沖婚不順，合化有外情。"},
        { "運星": "墓", "個性": "墓，生活樸素，不重外表，內向怪異，具有經濟頭腦，有收集嗜好。財運良好，若能打開胸襟，積極奮發，則可得不錯之成就。", "註解": "日支自坐墓的人，如果支均變成墓庫，則機會一旦來臨，就能獲得巨額的財富。但是，這種人有吝嗇的毛病，有明顯的財物慾，對於金錢十分精明，平常則爲樸素儉約之人。人格雖近圓滿，然缺乏社交性，這種命式爲停根復命，若要變回命中之根的財星，則日干必須強力，這種人不會浪費金錢。", "補注": "妻宮入墓，妻無助，體弱多病，殘疾可解。<br>日支入死、墓、絕者，①晚婚，②婚緣難續，③離異，④同床異夢，⑤死亡，⑥為情傷心，從而單身，⑦人慾橫流，⑧玩世不恭，無人倫觀念。再看地支的六沖或六合論，六沖婚不順，合化有外情。"},
        { "運星": "絕", "個性": "絕，心性焦躁，缺乏耐性，輕舉妄動，有頭無尾，運勢多起伏，凡事三思，謹慎行事，則不致絕處逢生。", "註解": "日支自坐絕的人，隱藏著好轉的運氣，但是性格略爲陰鬱，表面上看來柔和寬容，事實上心性容易變動，缺乏一貫性，常和人起衝突。與人相處，缺乏協調性，往往容易陷於自我本位爲中心。此外，情緖不穩定，喜怒哀樂的起伏變動激烈。", "補注": "<br>日支入死、墓、絕者，①晚婚，②婚緣難續，③離異，④同床異夢，⑤死亡，⑥為情傷心，從而單身，⑦人慾橫流，⑧玩世不恭，無人倫觀念。再看地支的六沖或六合論，六沖婚不順，合化有外情。"},
        { "運星": "胎", "個性": "胎，凡事好奇，充滿旺盛之探究心，很適於科學家、硏究發明。講人情、重義氣，有幽默感，但會見異思遷。", "註解": "日支自坐胎的人，寬大能容，仁義爲懷，福德溫厚，爲溫情濃厚之人。人格也圓滿，父母、兄弟之間相處融洽，家庭生活美滿。雖然有很好的構想，但缺乏一貫的魄力，經常在半途即輟止。個性冷靜，不激動，但心情容易變。", "補注": ""},
        { "運星": "養", "個性": "養，獨立心旺盛，做事認真負責，積極進取，自我鞭策，重視實力，不走旁門左道，不依賴他人，事業運順遂。", "註解": "日支自坐養的人，做事四平八穩，八面玲瓏，外表柔和質樸，不喜歡製造波動，沈默，性稍陰鬱。因此，也就缺乏剛毅活潑的一面，一切均主張息事寧人，無論是對長輩或晚輩，都能應付自如。另外，會有色情方面的困擾，而且越老越盛。對於和異性的交往，多半採取博愛主義，因此桃花運越老越旺盛。", "補注": ""}
    ];

    var 月柱運星= 命盤.月柱.運星;
    var 日柱運星 = 命盤.日柱.運星;
    var 運星論斷矩陣 = [];

    var 論斷項目='<span class = "傳統論斷項目">十二運星論斷</span><br>';
    var 月柱索引=_.findIndex(十二運星資料, {運星: 月柱運星});
    var 日柱索引=_.findIndex(十二運星資料, {運星: 日柱運星});

    if (月柱索引 != -1) {
        運星論斷矩陣.push("月柱坐"+十二運星資料[月柱索引].個性);
	}
	else alert("月柱運星 沒有搜尋到資料！");

    if (日柱索引 != -1) {
        運星論斷矩陣.push("日柱坐"+十二運星資料[日柱索引].個性);
        運星論斷矩陣.push("<br>"+十二運星資料[日柱索引].註解+十二運星資料[日柱索引].補注);
	}
	else alert("日柱運星 沒有搜尋到資料！！");

    return 論斷項目 + 運星論斷矩陣.join("<br>");
}

function 分定經(年干, 時干, 選項){
	var 分定經資料 = [
		{ "年時干": "甲甲", "卦象": "震卦", "格局": "雷霆遠震格", "詩訣": "長天忽震雷霆響，凜凜帷中獨有威，驚散雁鴻飛塞遠，狂風飄散落花枝。山南山北鄉關闊，家住瀟湘東複西，借問百年堪結子，一條球棒引孩兒。 ", "星名": "天鸞 金 雀 天貴", "註解": "此星照命，風霜早曆，賓士度量，高胸次遠。手段大，機謀深，心慕高人，見事敢做。親君子，遠小人，退神重重，多奸疑，多思慮，不驕傲。恬淡只因立志不一，性亂難拘所作於人。不足頭女末男，便是這個五行所注。初年未稱意，末限方成。述云：過水自有人相接，提我登雲別有梯。"},
		{ "年時干": "甲乙", "卦象": "恒卦", "格局": "泊水鴛鴦格", "詩訣": "群群雁過遠離塞，雨打鴛鴦各自飛，縱有海風吹不斷，也須相守自相宜。滿樹花殘留一葉，好逢前發馬頭時，若見子宮鬚髮祿，牛首牽弓必射之，壽命齊松柏，天齡不待時，鼇魚游水遠，平步上雲梯。 ", "星名": "", "註解": "此命造化，性格恬淡，氣宇風騷，胸襟磊落，言語剛強。放蕩所為，不會深思遠慮。從前吃誤兩三番，方才省覺：滋潤處，不滋潤；安閒處，不安閒。廣孝不記，心力不足。初年件件愛好，中年事事懶惰，凡事要一番做兩番。頭子難招，妻宜兩硬，交友水炭，多成多敗。述云：一番風雨足，方始見生涯。"},
		{ "年時干": "甲丙", "卦象": "豐卦", "格局": "馬瘦長川格", "詩訣": "遙遙千里見波濤，獨有心機志氣高，故國豈無根葉在，爭名圖利自蕭條。青山雁侶雙雙遠，歲寒松柏枝枝青，君今莫問榮枯事，晚景終為富貴豪。生涯未遇平生志，總使身閒心未閑，酉進辰年龍在水，無憂人在水歸山。 ", "星名": "天滯 天囂 天說", "註解": "此星照命，技藝工巧之星，學術多能之士。清閒秀麗，險處無慮，凶中反吉，臨危有救。見善不欺，君子成持，小人欺罔。為人性快，使人欺，能有綱紀自在中。尋出不自在，要好處，樂得一場愁。雁行有侶有妻，妾各難老。凡事慮心，且宜戒酒。述云：孤中孤不盡，一世見凶危。"},
		{ "年時干": "甲丁", "卦象": "豫卦", "格局": "春暖鵑啼格", "詩訣": "祖計紛紛東又西，綠楊深處子規啼，山空霧潤猿聲切，澗遠林深鳥倦飛。雁宿野花岩歲月，鴛鴦雨打不分離，終知意在逍遙外，爭奈塵心染是非。積歲多迍蹇，如今漸漸通；年老春色好，花枝一叢叢。 ", "星名": "天拗 天慵 天執", "註解": "此星照命，眉宇清秀，性格高標。凡事見快，珍瓏見識。知高下、識尊卑。只緣志大心高，立志不定。緊慢不均，大寬小急，多學少成，忘前失後，有始無終。會施為，能妝飾，無下口不吃飯，無衣冠不出門。財帛聚散，假小心，多魯莽。雖然遍曆風霜，卻喜危中有救。惡星出限，末主無疑。述云：若要心身定，末主始榮昌。"},
		{ "年時干": "甲戊", "卦象": "小過卦", "格局": "漁父收綸格", "詩訣": "漁父歸莊利祿名，旗橫隨後詔宣城，年來塞外思鄉國，游水中心逐浪平。生計必從前定立，運時應待百年榮，天邊孤雁高飛處，花落岩前月滿庭。帶祿牽牛歸路時，馬猴消息應天時，庭前早有文書至，何必自心盡皺眉。 ", "星名": "天晦 天淹 天貴", "註解": "此星照命，乃慵懶暗昧之宿。作事退晦，行坐躊躇，不會俯仰人，不會拘束人。衣祿自然豐厚，大利改更不靜。在祖宅難為六親、兄弟冰炭，只宜離祖過房、行贅遠方。求財不利家，為人無私曲，情性寬緊不調，從來兇險多經歷，只得凶中有救。述云：子午才來時應泰，龍蛇地上必深財。"},
		{ "年時干": "甲己", "卦象": "豐卦", "格局": "鳳宿春林格", "詩訣": "鳳凰池上釣連鼇，風卷長沙逐浪濤，雁過碧天群失隊，違親背祖奮身高。花開雨打枝頭損，果結風吹實不牢，北畔是家南畔立，晚年須遇貴人豪。遇犬邊添翼，逢牛角畔刀，限隨羊馬發，身上碧雲霄。 ", "星名": "天曜 天章 紫微 ", "註解": "此星照命，吉利之星，祥瑞之宿，靜辦處反成啾唧，尷尬處卻有救神。一生巧中成拙，是處成非。此命是非多惹，才得自然，朋輩如同親眷，骨肉恰似路人。妻是瓜皮搭李樹，李樹搭皮兒。兄弟不和合，子息不能全，目下啾唧有貴人舉目。述云：貴人來舉目，何愁不稱心。"},
		{ "年時干": "甲庚", "卦象": "歸妹卦", "格局": "花遇殘愁格", "詩訣": "女嫁男婚寡與鰥，心靈機巧性居閑，江邊雁伴飛南北，百歲榮華醉夢間。遠樹落花存果少，可憐香徑蝶蜂還，路遙千里知音絕，限遇猴狼必稱顏。逆水行舟體不安，好於舟內把魚竿，庚辛自應身危險，壬癸相逢始好看。 ", "星名": "雲雨 天囂 天機 ", "註解": "此星照命，作事剛柔，所為平品。凡事勞心未達，要高未高，要顯未顯，立志不一，外觀有餘。內看不足，弄巧成拙；近處無緣，遠處欽慕；骨肉無分，子息見遲；螟蛉庶出，贅婿之類。眼前一件事，心下萬般量，只是虛名薄利未到。風光寅申運氣裹，好事立成。述云：目下心不足，後有貴人成。"},
		{ "年時干": "甲辛", "卦象": "大壯卦", "格局": "月遠雲霄格", "詩訣": "金烏明處蟾蜍黑，高山險處不須行，雁過長江波浪急，平生活計破中成。好似電光風裹燭，花開花落不堪論，晚景到來須享福，百年喜氣一身盈。思慮不曾閑，身閒心不閑，饒君多計較，雖有也憂煎。 ", "星名": "金鳳 玉壺 鳳關 ", "註解": "此星照命，如鵲巢生鳳，似蚌長明珠。作事先難後易，只宜別祖離宗，過房異姓，入贅遷居。剋陷六親，兄弟不睦，機深志遠，作事剛柔，口直心慈，不受觸，不藏事，口傷人招人相怪。大寬小急，作事倡狂。妻命兩敵免剋，可保到頭。述云：七九年來收運算元，縱橫好用自家風。"},
		{ "年時干": "甲壬", "卦象": "解卦", "格局": "芳草逢春格", "詩訣": "春來芳草依依綠，雪散紛紛見枯竹，空中群雁各東西，傷情獨向灘邊宿。雨裏桃花風裏燭，平生到此心未足，樹頭花發兩三枝，一朵枝頭紅似玉。陸地行舟水未來，空將心事委塵埃，逢牛漸漸登雲閣，跨馬騎牛大路開。 ", "星名": "金鸞 天印 科名 ", "註解": "此星照命，乃福祿之星。科名之宿，如珠之命。 "},
		{ "年時干": "甲癸", "卦象": "小畜卦", "格局": "白玉離塵格", "詩訣": "年光迅速催人老，風過瀟湘春又秋，雁過碧天沙塞遠，雨殘花敗果難收。知君頗得高人用，喜慰安然祿自攸，欲問平生何處好，南遷京國度揚州。苦處還逢樂，身高又欲危，犬頭人發箭，戍遇虎生威。 ", "星名": "天福 天星 文貴 ", "註解": "此星照命，稟五行之氣福，居百順之祥聲，聞震屋之雷氣，達剛柔之象情。性機謀深，作事忘前失後，多學少成，件件向前，般般費力。划船人少，距立人多，相成者少，相敗者多。性直口毒，招人相怪。男女生多收少，妻宮兩硬無傷。目下未得安寧，除是子寅路通。述云：牛羊若得雞聲唱，便是安閒享福人。"},
		{ "年時干": "乙甲", "卦象": "益卦", "格局": "行穩梅林格", "詩訣": "日月分明照太陽，一身孤節最高強，空中雁陣東西遠，南北鴛鴦逐水長。有祿遇羊頭上發，樹頭枝葉暮秋殘，知君心有塵勞外，不被塵勞不奮揚。生計從來未委泥，早年兄弟見分離，龍蛇若遇還通泰，虎上高山意便奇。 ", "星名": "祿存 天感 天聆 ", "註解": "此星照命，事業艱辛。幼年見成之規模空費，萬般之心力三思進退、百種盈虧。破祖業，財帛難聚，有險難之處喜得救神，行皆好事翻成怨恨。近處無緣，遠方人喜。危難立個家計，無心中遇個因緣。子息見多難存，頭子須是喚爺作伯、呼母為姑方可，若到猴雞，必能自成自立。述云：從來磨難多勞力，今日淘沙始見金。"},
		{ "年時干": "乙乙", "卦象": "巽卦", "格局": "鴻雁瀟湘格", "詩訣": "遇貴還須得意時，平生剛志與松齊，登山履險雲山遠，綠樹逢春發舊枝。鴻雁過溪雙遠影，百歲榮華見一兒，更問雙蛇平地起，牛羊兩路必登梯。雪落紛紛三十九，天晴日暖雙蛇走，長安路遠遇危橋，勸君莫飲春前酒。 ", "星名": "天蠱 天毒 紫宸 ", "註解": "此星照命，退晦淹留之宿，安閒自在之星。凡有凶危，龍頭蛇尾，好事多磨，凶中有救。貴人遇如不遇，財祿秀而不實。學堂雖有，多學少成。也不會惡人，也不會救人。退神重重，使錢如風，撰錢如雨；有錢會使，無錢會耐，成財不一。中年合帶暗疾，雕青破肉可以延年，要安穩直待辰寅。述云：直待一聲雷奮發，管教一躍入青雲。"},
		{ "年時干": "乙丙", "卦象": "家人卦", "格局": "日月重明格", "詩訣": "日月交光色漸明，重樓天大兩重明，天邊雁叫蘆花遠，池沼鴛鴦憶出群。生來未發應無馬，名利成時待虎年，借問桃花成幾果，雨中風送一殘燈。借問何為業，龍蛇水畔僧，馬牛逢薦舉，更上樓一層。 ", "星名": "天佑 天禮 天揮 ", "註解": "此命星如鳳生鵲巢、龍長蛇腹，性緊多謀，常懷不足。作事躊躇，所為進退自在中出，苦辛安閒處惹是非，盡心竭力似春花逢夜雨、秋月被浮雲。會趁錢不如省用度，一似門樓前獅子、草屋下珠廉，強施設、硬追陪。述云：貴人輕借力，又立一翻新。"},
		{ "年時干": "乙丁", "卦象": "觀卦", "格局": "魚遊清波格", "詩訣": "你親非我我非親，家外榮身隔故人，興廢想應前分定，利名還要待終人。高峰頂上群離雁，渭水河邊釣錦鱗，借問花殘鶯舌老，禁煙春色柳青青。頭枕山前鹿，心思水上財，騎牛須遇虎，方有貴人來。 ", "星名": "天囂 天祿 孤虛 ", "註解": "此星照命，困干之宿，虛名之星。人命值之，無見成之。福獨拳，自立理。要分明。作事自是氣高、性直、口毒、心慈、親眷無緣，朋友少義，知心者少，妒害者多，只喜凶中有救。用心多，歷事早。要靜辦，未靜辦；要安閒，不安閒，卻有晚景好且待之。述云：長安道上花閑盡，誰信山邊有彩雲。"},
		{ "年時干": "乙戊", "卦象": "漸卦", "格局": "鶴立松林格", "詩訣": "生同出處鶴離巢，飛上青松立樹梢，學問不成終是去，蓋根遮葉未能拋。空中二雁爭群隊，池內鴛鴦頸不交，姑舅六親雖共處，成敗艱辛命裏招，種菜須宜時，花開發舊枝，一朝身立奮，成鳳附瑤池。 ", "星名": "天休 天霞 天權 ", "註解": "此星照命，如仙女種田，天橋車水，安閒中尋出辛苦，享福處不得安閒。為人慷慨，見識高明，平生性格，如泉擊石。區區心力，成三四處之規模；滾滾平生，做兩三場之活計。件件自向前，般般自費力，有福不會享，有事不能藏。性直無私，恩愛中反招不足。述云：莫恨春遲花落早，秋來猶有一枝芳。"},
		{ "年時干": "乙己", "卦象": "謙卦", "格局": "籬外海棠格", "詩訣": "重台遙望仰天高，風卷長沙起浪濤，莫問平生榮與辱，身成上馬指龍毛。瀟湘雁過離蹤跡，吳越相持奮氣豪，由恨此生根葉好，不堅牢處也堅牢。意欲謀前路，心懷未肯行，馬羊逢舉力，方始得通亨。 ", "星名": "天柱 天極 天颯 ", "註解": "此星照命，乃是鑿山取路之星，掘石沒泉之宿。有心膽，有機謀，有措置，會施為。知輕重，識高低，別貴賤，有威儀。如不系之舟，若初生之月。為人慷慨，稟性持達，只因運未至。且戒且忍，晚年發跡，無心中遇個貴人，無意中遇項財物，榮身潤已，稱平生之志矣。述云：正好求謀安樂計，忽然日暖動蛇鄉。"},
		{ "年時干": "乙庚", "卦象": "中孚卦", "格局": "幸遇金門格", "詩訣": "玉殿金門到不難，一心重度兩重山，空中雁叫飛二隻，一歲兒童一日閑。鹿在遠鄉歸故里，箭隨風月過雲間，誰知性戀逍遙外，爭奈身閒心未閑。秉志剛柔足，機謀出眾群，資財盈白首，無意遂功名。 ", "星名": "天福 天機 括舌 ", "註解": "此星照命，金銀斗秤之星，福祿簿書之宿。件件勞心，般般費力，機謀深密，性劣心高。會驅駕，能擔當，假小心，喝大采。勤燒香念佛，有救人心，無傷人意。要使大錢，會吃大飯。結識人，尷尬處能分理，險難處會脫身。猴鼠相逢，必能發奮。目下時運不襯，淹留未能顯達。述云：花正開時遭雨打，月當圓處被雲遮。"},
		{ "年時干": "乙辛", "卦象": "渙卦", "格局": "海底明珠格", "詩訣": "明珠海底隱寒光，用意成時卻有傷，孤雁叫天離塞遠，雙龍吟雨更蒼忙。田中祖業更新主，境外榮身立舊莊，借問百年成甚事，枝頭花果一雙雙。臥虎相將起，人眼醉漸忙，猴蛇終見喜，卓立自相當。 ", "星名": "天貴 天梁 天浼 ", "註解": "此星照命，為人有調度，有機謀，胸襟磊落，志氣剛強，生來只緣磨難多，卻得凶中有救星。貴人遇如不遇，親眷親之不親，懶中忽然豁達，用事卻有迂迴。妻宜親上成親，卻宜在外經營，不利在家作活，命中合帶暗疾，雕青斬指，延壽和平，睹事發出話來，招人相怪，兄弟如無父母，過容百事。會裨補，能主張。若遇龍豬，方始通泰。述云：莫嗟時未至，暗過又還明。"},
		{ "年時干": "乙壬", "卦象": "小畜卦", "格局": "雁過長江格", "詩訣": "密雲不雨空雷響，閃電流光震不威，雁叫空中飛去急，歲寒松柏綠依依。能將心膽分南北，解用剛刀斷是非，滿樹花開存一果，更隨掣電耀光輝。膽氣合天心，狂風擺舊林，年來新事到，花樹再鮮榮。 ", "星名": "天暗 天奔 ", "註解": "此星照命，乃綱紀之星，權沖之宿。人命值之，有創業之謀，無享祖之福。剛柔相濟，為人見識。作事自是氣高性急，口直心慈。生經風浪早，獨權獨立，省力處翻成費力，安閒處不得安閒。見不平事要斷，理直才去沾惹，反成不足。述云：春去秋來多少恨，才逢羊馬得平安。"},
		{ "年時干": "乙癸", "卦象": "漸卦", "格局": "松竹同榮格", "詩訣": "平生艱阻多翻覆，費力勞心半松竹，雁行中路見分離，夫妻傷刑多反目。月移花影當心觸，月到天中雲霧簇，樹上花枝兩朵榮，百年未稱今朝福。俊俏有規模，聲名播道途，欲求天外事，須下死功夫。 ", "星名": "天吉 天祚 天晚 ", "註解": "此星照命，多遭誹謗。口直心慈，不受人欺。凡百之事，所為進退，錢財失散，好事難成。妻遲子晚，只宜頭女頭子難招，所為有頭無尾。雞鳴犬吠相逢，這須遠大前程。晚年財祿自成，前程遠大。述云：曆過幾多危險處，如今舟穩始無風。 "},
		{ "年時干": "丙甲", "卦象": "大有卦", "格局": "池內雙蓮格", "詩訣": "赤腳堂前履玉墀，蓮花出水不沾泥，天然定注安閒福，富貴賓士事業遲。遠雁分飛煙水闊，鴛鴦戲水各分離，君家若問平生事，向道登雲自有梯。積善延君壽，行慈護子孫，喜逢豬合處，騎鹿上天門。 ", "星名": "天恩 天赦 天櫃 ", "註解": "此星照命，出現眾星朗然，君臣和合，風雪濟會，奸佞不生。胸襟瑩徹，賞罰必信。事業似燕營巢，獨居自處，生來好靜，主性不一。易盈虧，多反復，傷妻害子，好事難全。大門樓，好妝點，外觀須好，裏面槎牙，成中有破，喜處多憂。晚年財祿自成，前程遠大。述云：從前難處多¾- 曆，牛馬相逢事便奇。"},
		{ "年時干": "丙乙", "卦象": "鼎卦", "格局": "鶴宿春林格", "詩訣": "塵埃漸脫步雲梯，花發庭前正及時，若得東君眥子力，太陽何處不光輝。有限自然成祿位，雁橫秋水遠相離，若問生涯何處足，明蟾一點照希夷。欲謀千里事，登明陟險難，伏心勞費力，善地覓安閒。 ", "星名": "科名 詞館 鳳閣 ", "註解": "此星照命，如玉如珠。貴人皆仰，民族皆歡，能為鐘鼎之器，可作棟樑之材。只緣退神重重，好事迂迴，利名反復，勞而無功，秀而不實，機深慮遠，事無十全。性剛強，不俯仰，不謙讓，妻宜親上成親，長子難招，卻要喚爺作伯。雖是口毒心平，與人不足赦人，無恩中兩主駁雜，卻稱晚年。述云：桑榆晚景鎡基別，目下生涯事未圓。"},
		{ "年時干": "丙丙", "卦象": "離卦", "格局": "虎困松林格", "詩訣": "生身本在垂楊下，恰正成陰志不閑，雁過碧波照影見，林中哮吼待歸山。若問生涯隨分過，命中險難隔函關，六親險難應難守，飄蓬因得貴人看。冗冗心無用，區區未肯閑，假若心事好，命不與時爭。 ", "星名": "紫氣 天瑞 天官 ", "註解": "此星照命，乃爵祿之星，利祿之宿。自合名利兩全，爭奈運氣未至。屈曲處，會忍耐；不儉約，會安排；懶俯仰，只是與人不足，兄弟不和，親不是親，非親卻親。五遲五早之命：當家早、歷事早、吃力早、辛苦早、破祖早；妻招遲、兒女遲、成身遲、享福遲、財祿遲。述云：若要風雲相濟會，除非添了水邊人。"},
		{ "年時干": "丙丁", "卦象": "晉卦", "格局": "燕奪鶯巢格", "詩訣": "平生註定馬頭榮，事業區區總未成，西畔有家東畔立，南邊有辱北邊榮。孤飛雁叫湘江水，燕奪鶯巢兩處鳴，借問此身何處是，雲收月皎正當庭。運氣合迍蹇，生涯日日新，問君前程事，要是虎頭人。 ", "星名": "天魁 天駟 天英 ", "註解": "此星照命，生來近貴，須沾雨露之恩。命合遇天財，爭奈五行駁雜，還了許多俗債。有事不會藏，有事不會耐。弄巧成拙，恩中生怨，撰錢來如風雨，去似飛沙。雖是名播四方，聲揚閣裏，比如干纈桃花，好看不結實。兄弟虎羊，件件自當心，自理會。命中若帶暗疾，雕青破肉，可免傷妻害子。述云：一生心多事翻覆，猴鼠相逢事業成。"},
		{ "年時干": "丙戊", "卦象": "旅卦", "格局": "雁逐鸞飛格", "詩訣": "重山高聳拂雲端，孤燕高飛逐鳳鸞，久後資財應滿屋，白頭方得貴人看。生因志氣如松竹，立志清高耐歲寒，借問西園花結果，一枝春色椅闌干。初榮中亦破，祿在晚年成，見豬登劍閣，遇鼠即身榮。 ", "星名": "天休 天祿 天煥 ", "註解": "此星照命，胸襟磊落，滿面春風。見識察秋毫之末，謀事有沖天之志。慮遠機深，胸襟澄澈，明明如燭。量長較短，知輕識重，善斟酌，會周折，意慈悲，不怒恨。監危涉險，自能主張。五行孤不盡，猶如草屋下掛珠簾、匣中藏寶劍。凶事如冰見日，好事未免迂迴。松柏長青風霜久曆，若帶暗疾，可免刑傷。述云：功名未遇天家祿，試向雞窗苦用功。"},
		{ "年時干": "丙己", "卦象": "晉卦", "格局": "失侶孤鴻格", "詩訣": "羽翼初生且待時，開籠展翅自高飛，誰期失侶分南北，嘹唳衡陽日易西。遠雁過山群失隊，白雲深處杜鵑啼，爭知意在塵埃外，因在塵埃涉是非。滿院桃花帶雨開，東風吹綻一枝梅，逢牛兔上枝枝發，一箭成功事事諧。 ", "星名": "天妒 三合 天憂 ", "註解": "此星照命，不喜俗事，有冠世之材。心地好，行忠孝，作事閑中不靜，只好鬧中取靜。僧不僧，道不道，俗不俗，孤不孤。拿東籬補西障度日，身心不定。早年喜得屁蔭下，中年不好，末主始成。若不破祖，定是異居。合帶暗疾，可免傷剋根基；應在水邊成立，目下未達。述云：幾多辛苦皆經歷，自有桑榆壽晚年。"},
		{ "年時干": "丙庚", "卦象": "睽卦", "格局": "天際孤鴻格", "詩訣": "百尺竿頭進步難，紛紛祖業有迴圈，雲中雁陣飛程遠，檻內奇花一點斑。若問前程榮顯事，白雲猶自戀孤山，平生志氣應無失，只恐當年事不閑。生涯心未定，遇虎方榮盛，進退有兩般，弟兄應不順。 ", "星名": "右史 天營 天柄 ", "註解": "此星照命，性格不常，易喜易嗔。早年福祿，志略操持，心機遲要。省力早，越見心下不安。雖然一個好根基，過了許多磨難。雖北辰有拱星之拱常明，台輔之前，高而不危，滿而不溢。會主張，歷事早，成敗知多少，憂煎過幾番。若逢申已歲，必遇貴人欽。述云：運氣未來君且守，晚年一個稱心人。"},
		{ "年時干": "丙辛", "卦象": "大有卦", "格局": "鶴立青松格", "詩訣": "青松百尺嶺頭寒，白鶴飛來立晚灘，氣直雪霜欺不得，石崖岩下立根盤。紛紛葉落春光語，百歲兒童一夢間，借問生涯何處發，才逢犬馬始安然。長安路坦然，不用苦相煎，前程名與利，直過馬牛邊。 ", "星名": "天臺 天退 天懶 ", "註解": "此星照命，有規模，有豐度，能驅駕，會撐拼。只因多破少成，秀而不實，豪氣沖天，膽志拖地。不能俯仰人，會支吾，能處分，會妝點，善擺佈。卻因福薄恩深，多翻多覆，獨權自立之命，只得根基固實，凶中有救，災害難侵，晚年方有貴人舉用。述云：遇盡許多危與險，直須且待晚年成。"},
		{ "年時干": "丙壬", "卦象": "未濟卦", "格局": "山頂鸞棲格", "詩訣": "祖業紛紛晚可成，山深隱雪見猴星，孤飛雁南南來伴，渭水河邊釣錦鱗。若問生涯多進退，勞心費力晚年榮，牛馬運來應見祿，從前事業未堪憑。白玉黃金貴，清門早赴期，瓊林花要發，牛角長新枝。 ", "星名": "大常 天府 炎炎 ", "註解": "此星照命，有火星，難獨犯。多頭多緒多疑惑，多孱愁，多是非。口直性緊，自是自直。勤燒香，懶念佛，多憂慮。志遠機深，安閒中見生受，省力易，費力難。雖是能措置，會施為，卻緣命中凡百蹭蹬，好事迂迴。早年宜異姓隔胞，改更離祖，如乳燕營巢自立計方可，若守祖業誠恐難招。晚年自有貴人提攜，無心中遇一項財祿。述云：頭上安頭心不足，巳亥才逢有貴人。"},
		{ "年時干": "丙癸", "卦象": "旅卦", "格局": "雁唳雲霄格", "詩訣": "撼動高山力不加，根深連海接天涯，雁飛江外無消息，折散鴛鴦便不來。春風是處園林好，秋月揚明逐歲華，借問平生何處是，到頭三結半枝花。遇馬多應險，逢牛迤邐安，此時方得意，喜得貴人看。 ", "星名": "天輔 天破 天鸞 ", "註解": "此星照命，是穿山透石之星，經風涉浪之宿。人命犯之，施行雨露，掌握山河。容貌清壽，骨格胸襟磊落。所為進作操持，即緣性剛弄巧成拙，多招是非。撰錢來如風雨。述云：過了危難處，龍蛇始稱心。 "},
		{ "年時干": "丁甲", "卦象": "複卦", "格局": "枯木逢春格", "詩訣": "春來萬物長新枝，枯木寒風灰火隨，因向暗中逢巨燭，月殘素色漸光輝。蘆花雁過溪邊白，柳絮鶯聲是處啼，桃花滿園人不摘，霜林花放柳塘堤。魚入大江中，山林虎嘯風，命逢寅午位，箭發馬蹄中。 ", "星名": "天權 天沖 天秤 ", "註解": "此星照命，美中不美，好事多磨，始榮終辱。先難後易之兆，好事迂迴、錢財蹭蹬，恩中成怨、好事乖張。離祖辭親，移南就北。多翻多覆之命，瀟灑中不安閒，端正處要喎斜，心閒心未定，運至心安然。述云：堪恨年來無限事，馬頭逢著有恩人。"},
		{ "年時干": "丁乙", "卦象": "升卦", "格局": "月透浮雲格", "詩訣": "平地升騰上碧霄，烏雲散處有仙橋，每將心事重更變，祿食千鍾福自招。天邊雁叫空留影，南北家鄉萬里遙，墳前借問誰為主，風送孤帆出海潮。久缺看看滿，經年鏡再明，江南與江北，花落虎頭人。 ", "星名": "天庫 天倉 天樓 ", "註解": "此星照命，監官提攜之宿。氣宇朗然，機謀智略。作事好勝，財帛要多，心常不足。人雖欽仰，作事迂迴。重擔有肩，無人可替。高人見喜，小輩無緣。口直傷人，多招不足。憐貧敬老，難觸心慈。中主漸強，末主最好，命中合遇金貴水貴等人。述云：從來事業成烏有，晚景生涯始可誇。"},
		{ "年時干": "丁丙", "卦象": "明夷卦", "格局": "張弓待箭格", "詩訣": "雁過前山影漸孤，家鄉天際立江湖，張弓待箭逢牛虎，雞兔相逢是事圖。月下瓊花三結子，日高紅照隔天衢，借問安身何處好，不妨迅步到皇都。梨在田中未過牛，小童湖上泛輕舟，青錢再得逢朱紫，須信中年事不虛。 ", "星名": "天階 天貴 天策 ", "註解": "此星照命，有見識，有操持，機謀膽量出眾超群。心性剛直，志識遠大，易嗔易喜，退神重臨。危不危，遇險不險，成中有破，莫信小人。初年有福，中限便強，末限尤佳。述云：擬待張弓施一箭，百步穿楊也不難。"},
		{ "年時干": "丁丁", "卦象": "坤卦", "格局": "耕鋤獲寶格", "詩訣": "耕鋤偶爾得金珠，牽牛遇虎雁相速，花殘一果榮君壽，欲學相如卻未如。夾道相牽仍隔水，鴛鴦孤只戲雙魚，終知事業青松下，留取生涯伴老軀。受祿須乘馬，逢雞路漸通，虎頭尋兔尾，當遇主人翁。 ", "星名": "天非 天妒 天舌 ", "註解": "此星照命，平生氣宇，草屋上獸頭，羊質，虎皮，要妝點，要好看，要施為。能近上卻緣運氣未利，虛名虛利苗而不秀，秀而不實。知道理尊卑，思遠大見識高明。凶中有吉，不犯官刑。要閑管，招是非，於人不足。末主錢財興旺，不求自至。無心中遇個貴人，忽然中得段財祿，傷妻剋子，破祖離宗之命。述云：此身成立處，須仗貴人扶。"},
		{ "年時干": "丁戊", "卦象": "謙卦", "格局": "桃李同榮格", "詩訣": "黃河天水相連濟，自古從今不斷流，月在碧霄雲漢闊，雁飛天外兩驚秋。每聽猿聲山澗遠，利名福祿自然周，借問花殘留幾果，桃源雨打落花憂。 ", "星名": "天車 天轟 天輦 ", "註解": "此星照命，自成自立。心地坦然，不免勞心費力；未能成家，不得六親兄弟之力。骨肉相悚憂愁多，巧中成拙失了還。束心平口直，發出話來招人相怪。顛撲處有救神，危難中立家計，兇險處做個門庭，比似一塊生鐵煉成一塊真鋼，還是成器費力尤多，須待晚景。述云：煉鐵成鋼為美器，財到榮身也不難。"},
		{ "年時干": "丁己", "卦象": "坎卦", "格局": "乘槎渡海格", "詩訣": "黃河湘水水相同，水港微渠路也通，松茂節高侵碧漢，爭知蓬島有仙翁。雁飛雲外無蹤跡，必是年深事業隆，夭桃花發枝枝秀，羊虎才逢喜氣濃。羊馬即亨通，貴客更相逢，箭隨弦上發，錢財喜氣中。 ", "星名": "天輪 天戈 天鋒 ", "註解": "此星照命，陷害六親。遷居改正，孤獨自成。心閑身未閑，身閒心似火，意懶氣如虹。當權早，歷事早，百丈竿頭，進步千重，浪底翻身多磨難，只得凶中有救，破盡還來，卻在晚年，發祿如井泉水之造化，用之不竭，貯之不滿，成中有破，破了還成，卻在晚年。述云：要知向去生涯事，羊馬群中事鼎新。"},
		{ "年時干": "丁庚", "卦象": "頤卦", "格局": "畫樓獨倚格", "詩訣": "高樓畫閣終非久，獨倚闌干望遠天，一上小舟音信隔，蘆花深處有風顛，鄰家戶口三千萬，咫尺長安一水間，借問白頭墳畔立，四隅相送海隅間。四海名聲遠，風帆駕遠舟，逢寅親馬尾，明月照中秋。 ", "星名": "天刑 天耗 天虛 ", "註解": "此星照命，做事迂迴，巧中成拙，是處還非。傾心吐膽于人，翻成不足。兄弟無分，獨立自成。財似嶺頭雲，聚散不一；福如秋夜月，明暗不常。家不欠缺，眉頭不曾開；親戚難靠，朋友少知心；子未得力擔未息，肩鬢白如霜，猶負重擔。目下雖安心未徹，枯木若逢春，蟠桃終是結。述云：寅馬才逢泰，枯枝也遇春，是非還自戒，切莫聽小人。"},
		{ "年時干": "丁辛", "卦象": "泰卦", "格局": "月影浮雲格", "詩訣": "自古興隆泰漸通，因逢除夜月朦朧，如今暗地逢明燭，隨照流光卻向空。寒塞霧煙鶯燕少，雁飛沙塞也西東，知君意在青松下，堪笑桃花滿樹紅。如禽添羽翼，侶虎奔深山，便風舟到岸，何用苦搖撐。 ", "星名": "天井 天臺 右班 ", "註解": "此星照命，作事迂迴，所為進退，歷盡崎嶇，舟行未穩。嘲風詠月，瀟灑胸襟。吃不得虧，受不得思，出外高人見喜，在家小輩無緣，命中退神重重，奈緣事運皆未能成器，才到午酉件件稱心，述云：目下小人相忌妒，自有高人舉用時。"},
		{ "年時干": "丁壬", "卦象": "師卦", "格局": "鼠守陳倉格", "詩訣": "倉積陳糧食有餘，半歸食鼠半歸廚，空中雁字飛相遠，天賜聰明豈在書。有限足招雲外慶，危中卻有貴人扶，百年大限中庸好，心巧機靈壓眾愚。立志能剛勇，心聰見識明，六親雖倚靠，舉意合天真，子箭思牛鬥，騎龍上碧雲，逢蛇多稱意，遇馬得榮身。 ", "星名": "天鑰 天缺 天蜈 ", "註解": "此星照命，機深膽略，志巧心靈，生來執道，不會懸容。有操持，會施為，能支撐，會伏眾，卻緣磨難早，六親不得力，當心自掙扎。退神重重，相識無義，骨肉相悚，好處翻成不足，妻遲子晚，好事多磨。述云：好笑幾翻天大事，危中卻有貴人扶。"},
		{ "年時干": "丁癸", "卦象": "謙卦", "格局": "雲開見月格", "詩訣": "君子垂鉤坐釣台，烏雲吹散碧天開，從今漸有升騰志，好把身心自忖裁。此時得運瀟湘客，月影梅花明照雪，蛇猴相會濟風雲，荒圃凋枝杏花發。得意成家業，時至福崢嶸，蛇猴相會處，福祿自然通。 ", "星名": "天廚 天馳 天料 ", "註解": "此星照命，如孤鴻離塞，只鶴秉風，志在四方，宦遊他處，不守祖居立業，只宜出外救神有。求財如泉，井滿而不溢。三兩次改換基址，四五翻成立家緣。在俗還孤，出家不淨，磨難多，成敗多，心在間地，身落火坑，儘是天馳星所注。述云：君今若問真消息，只好桑榆度晚年。 "},
		{ "年時干": "戊甲", "卦象": "頤卦", "格局": "仙鶴騰雲格", "詩訣": "大化無非小化成，身齊松柏複堅青，安居待命須時發，養性消遙自稱情。天遠雁飛三四隻，水邊雲際望俱平，君還若問前程事，百歲花如半日榮。遇犬逢辛祿，逢牛箭自來，兔龍應奮發，羊馬上高臺。 ", "星名": "天船 天昌 天南 ", "註解": "此星照命，心性剛直，所作詳明，其性坦然，並無私曲，三寸剛舌，一片佛心，卻只於人不足，恩中生怨。交遊無終始，件件自當心，般般自費力。移桃結李，幾度家成又敗。末主方興五行之所注。述云：從前磨難皆勞力，今日方知舉步高。"},
		{ "年時干": "戊乙", "卦象": "蠱卦", "格局": "鶴立青松格", "詩訣": "鶴立青松棲不成，無言終日謾勞神，剛柔自定成身計，金滿斯箱酒滿瓶。雁叫碧天空接水，桃花雨後始鮮明，堪受利名頻得失，爭似山居靜掩門。得遇陰人發，乘豬喜漸通，龍蛇當有慶，羊馬開顏紅。 ", "星名": "天綺 天並 天轂 ", "註解": "此星照命，凶處成吉，憂處有喜。件件自勞心，般般重費力，朋友淡薄，親戚相疏，伶俐自然，風流天賦。于人不足，翻成是非。只得救神在命，三五處失腳吃顛處，人扶妻宮有破、祖業消磨。命帶暗疾，可免刑傷亦能延壽。宜戒五葷三厭。述云：平生曆遍難危處，如上青山得片雲。"},
		{ "年時干": "戊丙", "卦象": "賁卦", "格局": "鴻雁失群格", "詩訣": "如今家富未為富，他日身貧未是貧，根腳淺來心地廣，榮身好事未能成。雁飛天外空尋侶，裏外三千煙水雲，借問芳菲成幾朵，滿園留得一枝春。身計未能安，區區雁陣寒，利名須見馬，方得貴人看。 ", "星名": "天牛 天雍 天空 ", "註解": "此星照命，如芝蘭秀于山谷，松柏茂於岩崖，出處幽微，根苗固實。雖然祖父根基，獨自能與保守，六親無分，弟兄相疏，好個創業規模，卻欠安閒之福。如甜瓜，命香從辛苦裏來。述云：己午年中成事業，桑榆晚景樂餘年。"},
		{ "年時干": "戊丁", "卦象": "剝卦", "格局": "雨翻桃花格", "詩訣": "桃花夜雨春殘落，柳綠鶯聲繞樹枝，寄我一身須遠祖，蘆花深處雁南飛。真文必遂金門椽，晚赴舟墀莫歎遲，家住五湖明月夜，兒童相送步雲梯。寒雁江天晚，昏銅再琢磨，箭從寅午發，牛鼠亦顏和。 ", "星名": "右輔 天蓬 積寶 ", "註解": "此星照命，氣宇精神，胸襟灑落，成幾處事，立幾處家風。滾滾平生，區區名利，披星戴月，惹事招非。高人見喜，小輩相欺，近處無緣，遠傳令德，只喜不犯官刑，仍主晚年秀氣。述云：從前曆遍崎嶇道，若要心閑待晚年。"},
		{ "年時干": "戊戊", "卦象": "艮卦", "格局": "獨婦倚門格", "詩訣": "岩前風雨正依依，獨倚柴門半掩扉，貞潔沉吟凝淚眼，兒夫別後未回歸。天邊雁陣空違侶，檻內無花借一枝，莫恨晚年成敗事，休論昔日是和非。休誇得意深，莫怨彼無情，欲進獨難進，別有好知音。 ", "星名": "天央 天說 天文 ", "註解": "此星照命，外好看，內槎槎牙牙。葉茂花繁，秀而不實。密雲不雨，憂中有喜，險處有救神。有於人意，無酷毒心，頭緒多少記著，成而又破破了又成，妻宮有剋，子宜見遲。述云：君知欲問前程事，只好空心待丑蛇。"},
		{ "年時干": "戊己", "卦象": "剝卦", "格局": "擊破連環格", "詩訣": "連環擊破愁縈腹，松檜盤槎鶴必棲，雁過遠山飛斷目，鴛鴦雨打各分離。平生志氣應難敵，爭奈從來未遇時，借問晚年何處是，桃花林下好圍棋。 ", "星名": "天愁 天皮 鎖眉 ", "註解": "此星照命，口能舌辨，出語不常。作事多疑，為人奸狡。生來有四遲四早：辛勤早、曆仕早、卓立早、事業早；妻妾遲、子息遲、享福遲、安閒遲。若是離祖隔胞，庶出異姓，最得地。不然則女遲子晚，遍曆風霜，撰錢來如風雨，去若飛沙。正是，花巧得花巧破財是，更殘漏盡燈。述云：從前是處卻未是，只得桑榆可贍身。"},
		{ "年時干": "戊庚", "卦象": "損卦", "格局": "岩前古檜格", "詩訣": "立志先須用琢磨，荒涼陸地起風波，孤飛雁度雲霄遠，乳燕飛來壘舊窠，花發園林存一果，從來事業也蹉跎，君還問我平生事，喜得連綿壽數多。獨坐圍棋為樂情，水東軒宇水西亭，如今箭在行人手，牛角乘龍上玉京。 ", "星名": "天郝 天憂 天商 ", "註解": "此星照命，枯木未春，旱苗未雨，為人熱心腸。賭事理直口直，發出話招人相怪。是親不親，非親卻親；外人如手足，兄弟不和睦。身在江東，心有江北。凶中有救，不犯官刑。生來只被天憂星所惱，歡喜未來愁先到，錢財聚處又成空。初中限駁雜，末主方佳。述云：梅花還謝了，結實在枝頭。"},
		{ "年時干": "戊辛", "卦象": "大畜卦", "格局": "負薪登險格", "詩訣": "負薪涉險過長林，半路行來卻遇金，休道資財前分定，也須回首謝知音。空中雁叫雙雙遠，喜得年高卻稱心，為向桃花留幾果，樹頭獨有一枝春。莫怨榮身晚，枯木再逢春，見豬方得地，月到五更明。 ", "星名": "天懶 天晦 天暗 ", "註解": "此星照命，心明志巧，智廣機深，從容出眾，作事退悔，多學少成。早年不能奮迅，中年始可立成，天懶慵惰，天暗不明，移南就北。革故鼎新。是瓜皮搭柳樹，兄弟恩猶如羊虎，商量一件事，管取鬧一場。述云：生來磨難處，晚得貴人成。"},
		{ "年時干": "戊壬", "卦象": "央卦", "格局": "芳草芝蘭格", "詩訣": "黃金非我終身寶，畢竟芝蘭異芳草，家住瀟湘東又西，身向山南山北老。枝頭春色枝枝早，傍人稱意知音少，百歲榮華不必憂，福祿雙全還自好。暑往更寒來，終是有資財，馬龍施一箭，莫與外人猜。 ", "星名": "天祿 天轟 天福 ", "註解": "此星照命，為人正直，謹言語，有救人之心，無傷之意。高人見喜，小輩無情。同居闔家做活，凡事弄巧成拙。退神重重不剋，有兩座祿星在命，衣祿自然。述云：從來事業皆未定，必竟收因在晚年。"},
		{ "年時干": "戊癸", "卦象": "艮卦", "格局": "沙裏藏金格", "詩訣": "生涯不可謾咨嗟，石在玄精金在沙，去石真窪方顯得，淘沙金塊各無瑕。雁離衡陽無伴侶，鴛鴦戲沼隱蓮花，須知祿向龍頭得，財寶逢牛自有涯。未遂平生志，豬尋子上雄，春殘花未落，一朵伴春風。 ", "星名": "天機 天柱 天敗 ", "註解": "此星照命，為人機巧，有操持，審法度，知高下，別賢愚。小人無緣，高人見喜。依本分，利名頭，風霜早，磨難早，幾度吃顛仆，皆是天敗星在命。只得天柱星在命，且得凶中不凶，妻宮不得力，兒女主遲。述云：牛龍須遇貴，枯木再逢春。 "},
		{ "年時干": "己甲", "卦象": "複卦", "格局": "池長碧蓮格", "詩訣": "平生未遇衣和祿，藕在青泥長碧蓮，魚戲池中還自樂，雁飛遠漢度長川。盡道功名難入手，卻緣事業晚因緣，借問桃源消息好，牛羊歸去好耕田。鑿井通泉水，枯木長新枝，君應施一箭，且待馬牛時。 ", "星名": "天隆 天晚 天祿 ", "註解": "此星照命，乃廣行之星，為人梗直，作事忠良，心靈志巧，見識遠謀，妻宮有破，子息難招。只宜出外求財，在家不利。六親冰炭，骨肉無情，有貴人遇如不遇，有衣祿秀而不實。外觀有餘，內看不足。結識相知，臨難不救。攀陪親眷，冷淡相看。這五行獨權自立，秋花晚秀之命。述云：時運到時成大器，休怨蒼天且待時。"},
		{ "年時干": "己乙", "卦象": "升卦", "格局": "雲散月明格", "詩訣": "百計千方作養生，風吹雲散月重明，空中雁影飛三隻，祖代耕盤在一耕。遠樹落花三四朵，秋風結子一枝榮，心懷志氣無人敵，莫把聰明與命爭。遇乙親同位，逢寅運漸通，箭先隨鼠發，虎跳出朦朧。 ", "星名": "天進 天蠱 天祿 ", "註解": "此星照命，為人性剛，有膽略，有操持，親枝不得力，有事自當心，做事十步九計，恩愛處落得辛勤。恩中成怨，好事多磨，不欺貧，不妒富。退神重重，不發達者，盡被天蠱星所惱，將來還遇一貴人舉用。述云：施恩成怨處，卻有貴人扶。"},
		{ "年時干": "己丙", "卦象": "明夷卦", "格局": "秋晚芙蓉格", "詩訣": "富貴豪奢意未專，年來年去幾多般，須知雁過關山遠，花發清秋色亦鮮。立業成功還已定，成身無咎亦天然，終知得遇同鄉友，乘馬淩雲上碧天。平生未遇亨，舉步上青雲，兔頭兼虎尾，有路坦然平。 ", "星名": "天破 天災 天榮 ", "註解": "此星照命，磨難風霜。親不可托，友人可交，勞心只力獨支撐，會施為，能措置，好事多磨，巧中成拙，險處卻不險，安閒又不閑，正是一個不靜辦五行，卻不忘恩亦不狂圖也。會守己，好事蹭蹬，成了又破，破了又成。中初兩限不聚財，末限方得地。述云：新月休言缺，團圓也有時。"},
		{ "年時干": "己丁", "卦象": "坤卦", "格局": "接木逢春格", "詩訣": "日透高峰雪未消，難將桂木接新條，榮身本是天然定，成敗皆因命裏招。水際鴛鴦和暖夜，天邊鴻雁不丹霄，花開正遇陽和節，又恐狂風一旦飄。命逢豬漸發，遇丙卻堅牢，平生多蹇滯，方始出塵勞。 ", "星名": "天轟 天明 天說 ", "註解": "此星照命，有機謀，有膽略，有權柄，有操持。自權自立之命，有造化能全，只因刑殺重，立性重，為人性懶心焦、多奸多疑。會妝點，會施為，能驅駕，會撐持，口直傷人，恩中生怨，傷妻損子，事不十全。初中財不聚，末主方成。述云：釣鼇不得休空歎，自有生涯在晚年。"},
		{ "年時干": "己戊", "卦象": "謙卦", "格局": "雁戲長溪格", "詩訣": "百歲生涯漸得成，險中重換一翻新，西園春色濃如錦，好向朱門問主人。鴻雁過溪妨羽翼，桃花值雨亦傷情，平生事業休惆悵，羊馬相逢卻是榮，雞報更殘晚，牛逢鼠漸奇，龍蛇消息好，羊馬始成時。 ", "星名": "天騫 天將 天福 ", "註解": "此星照命，初年顛磕，多憂多慮，勞心費力，不能遂心。蹇滯奔波，骨肉冰炭，千方百計，有始無終。兄弟難靠，相識無情，獨立自成之命。遠處人見喜，近處並無緣，作事勞而無功，名利秀而不實。若要稱心，直過五九。述云：名利還自得，羊馬遇時榮。"},
		{ "年時干": "己己", "卦象": "坤卦", "格局": "鑿石見玉格", "詩訣": "鑿石盡時逢寶玉，庭樹檻外夾修竹，雁飛天外唳聲高，鷗鷺沙汀蹺一足。園林處處接桃花，惟我庭前長秋菊，百年枝上果何如，半子半孫相半宿。 ", "星名": "天退 天晦 天喪 ", "註解": "此星照命，機辦多疑，多思遠慮，性直心高。見識有心機，口毒心慈，聰明中做出魯莽事，機巧處弄出是非來，胸襟磊落，性格巍巍。財利盡被天晦星所退，猶如蓮葉上水珠，空中得來空裏去，散時容易聚時難。只得退神重重，逢凶不凶，遇險不險。鎡基有氣，目下未成，直待末限。述云：幾番得失教經歷，晚景將來必稱心。"},
		{ "年時干": "己庚", "卦象": "臨卦", "格局": "雨打鴛鴦格", "詩訣": "日出陰雲光自燦，安然千載喜相期，歲寒但愛存蹤跡，莫怨生來未遇時。天外有鴻聲叫遠，鴛鴦經雨各分飛。桃花閬苑春殘處，零落園中一兩枝。聚散多今古，榮枯幾代前，追思來往事，且樂太平年。 ", "星名": "天囂 天爵 天章 ", "註解": "此星照命，孤高品格，秋月精神。六親不得力，兄弟不比和。口直心慈，閑管處惹是非，於人不足，巧中成拙，好事多磨，無心中做就家，趁哄處立成計。先難後易，始辱終榮，中主漸好，末主尤佳。述云：還知世事多顛倒，才到凶年卻不危。"},
		{ "年時干": "己辛", "卦象": "既濟卦", "格局": "石上栽松格", "詩訣": "苦節淩霜志恁堅，賢人未決待天然，有志終須成大器，休嗟虛度舜堯年。鴻雁沙汀三四隻，鴛鴦獨立在江邊，誰知樹上殘秋果，李白桃紅寄在前。鹿過重山喜，逢牛始遂心，虎頭春色美，龍尾立家榮。 ", "星名": "天庫 天傷 蠱毒 ", "註解": "此星照命，竿頭上立身，進退未得；海灘上起屋，立柱不牢。磨難風霜，利名未就，空存學識，未免憂心。親情難靠，兄弟無緣，自成自立，造化難憑。真心待人，未免不足，無心栽柳，卻又成蔭。端止處要喎斜，成就處有破綻，君子相欽，小人懷恨。述云：從來險難牛羊見，待得雞猴立大功。"},
		{ "年時干": "己壬", "卦象": "師卦", "格局": "鴛戲蓮池格", "詩訣": "戲水鴛鴦滿沼蓮，朱衣放箭遇階前，黃金未與君收掌，白玉堂前看古賢。遠雁孤飛天外影，鴛鴦兩兩傍沙眠，君今肯問平生事，松柏同榮壽萬年。遇鼠明消息，逢牛喜漸榮，樹頭空問祿，花向水中尋。 ", "星名": "天樞 天川 農蠱 ", "註解": "此星照命，多思遠慮，易信易瞞。家業見成，田疇不缺。知進退，識高低，作事沉吟，所為進退大寬小急，喜怒不常，於人不足，惹是招非。恩愛生煩惱，好事思參差。凶中有救，退神重重。述云：從前多駁雜，中末始平和。"},
		{ "年時干": "己癸", "卦象": "謙卦", "格局": "花秀秋深格", "詩訣": "祿重須防印與權，財成人恐事連綿，三春鴻雁飛南北，花落秋深葉亦鮮。晚景利名終得遂，平生無恨亦安然，家鄉本在瀟湘外，重遇關山好向前。守道終成福，須知省禍危，雲離天上過，迤邐見光輝。 ", "星名": "天丙 猥疾 龍虎 ", "註解": "此命造化，見識高明，機謀智慧。是處成非，非中又是，多思多慮，未能遂心。貴人見喜，小輩無緣。口直心慈，運人牛羊，自然通泰。述云：傍人盡道成身早，必竟生涯在晚年。 "},
		{ "年時干": "庚甲", "卦象": "隨卦", "格局": "渭水垂釣格", "詩訣": "疏屋荒涼燕久居，過橋相遇一封書，持竿上釣魚相失，反致休來卻有魚。玉樹有花難可折，金櫻花落果應疏，須知雁過斜陽遠，雲散庭前樹幾株。攜弓親射鹿，逐鹿自歸林，得遇黃牛首，羊馬遂人心。 ", "星名": "貫索 天絞 天刑 ", "註解": "此星照命，志氣高，心機大，立性質樸，所為聰明。親眷無情，朋友無義，作事不湊逗，舉用未能成。退神太重，多學少成，若交牛馬之鄉，別是一家風景。述云：牛馬運中方得地，須信榮身在晚年。"},
		{ "年時干": "庚乙", "卦象": "大過卦", "格局": "鶯語東風格", "詩訣": "疏卻親情親卻疏，離南往北自安隅，知君本是吾鄉友，權寄飄飄½- 上居。雙雁過溪忘羽翼，鴛鴦獨戲繞青蒲，黃鶯枝上雙雙語，為報窠中一個雛。橋邊逢水客，屋內未親知，南北東西去，窠中只一兒。 ", "星名": "天藻 天煩 天懈 ", "註解": "此星照命，為人氣高，不能俯仰。好一介造物如錦袋，貯糠草屋安穩。外觀有餘，內觀不足，勞而無功，秀而不實，密雲不雨，空裏雷聲，錢財聚散，好事迂迴，六親冰炭，朋友相疏，妻遲子晚，未得安居。述云：晚年必是成身處，濟會風雲事未虛。"},
		{ "年時干": "庚丙", "卦象": "革卦", "格局": "革故鼎新格", "詩訣": "棄故從新待命通，利名還見兩三重，雁飛隊隊迷蹤跡，花落溪邊間綠紅。祿立應隨天信志，始覺心閒事事通，借問君子何年順，龍頭一見自身榮。犬上花開色，龍頭奮舊身，一心隨命舉，破屋再重榮。 ", "星名": "天饒 天車 太乙 ", "註解": "此星照命，親高近貴，性直心慈。亦無剋剝，亦不苟求。五行堅實，四柱平和。性如碧潭秋月，情如野鶴棲松，六親如畫餅，骨肉似虛花。凶中有救，喜處還嗔，命帶暗疾，有破相方可以延年。述云：多成多破多翻覆，龍犬才交顯後身。"},
		{ "年時干": "庚丁", "卦象": "萃卦", "格局": "月照幽軒格", "詩訣": "月華清潔瑩如銀，世外安身欲染塵，愁慮未消終有待，逍遙偏稱等閒人。空中飛雁江邊立，日透紅霞漸出雲，身在五湖歸不得，花殘果結一枝春。心在繁難外，身居眾緒邊，馬頭春色好，雲靜月當天。 ", "星名": "飛輪 天蓬 天倉 ", "註解": "此星照命，性巧心靈。將無作有，弄假成真。親如雪中月，財如水上萍，好事多磨，利名進退。凶中有救，不犯官刑。先來破祖，自立自成。此命是也。述云：掃雪觀山山色異，春來還有百花紅。"},
		{ "年時干": "庚戊", "卦象": "鹹卦", "格局": "鳳宿梧桐格", "詩訣": "身心進退多翻覆，且度年華守舊心，若問瑤池東畔立，等閒棲向綠楊蔭。遠雁堅飛三四隻，寒風一點透波深，終身若問歸何處，千里黃沙半撚金。得路逢牛首，騎虎渡危橋，平生心膽廣，福祿命中招。 ", "星名": "天參 天孤 天鸞 ", "註解": "此星照命，如孤鸞出塞，似野鶴乘風，志在他鄉，心思他處，成身異地，立業他鄉，東畔栽花西畔發，北國種樹南國蔭。父母堂前過客，弟兄空裏雁行。鎡基雖不中，末注漸漸佳。述云：從前事業多成敗，直待虎牛身漸成。"},
		{ "年時干": "庚已", "卦象": "萃卦", "格局": "孤雁傳書格", "詩訣": "銀花滿地襯金車，踏雪歸來向五湖，借問長安消息好，唯知孤雁一封書。鴛鴦懶向池中宿，零落花枝獨一株，猶恨根基還恁薄，貴人引入好山居。井內霞光射鬥牛，平生衣祿未能周，施弓箭向豬頭髮，必在功成在此秋。 ", "星名": "天鑒 天秤 天度 ", "註解": "此星照命，秉性玲瓏，胸襟磊落。磨難早，翻覆多，親情有似溪邊雪，兒女還如鏡裏花。疑思重，成敗多，經歷早，作事蹉跎。述云：名利未成君且待，犬豬才到事皆和。"},
		{ "年時干": "庚庚", "卦象": "兌卦", "格局": "春花秋葉格", "詩訣": "大澤乘舟泛五湖，區區逐浪不通吳，春花苑圃終難久，才到秋來葉漸疏。水涸山遙飛雁遠，天高雲杳事難圖，知君志在清閒地，好向林泉讀佛書。 ", "星名": "天秋 天都 毛頭 ", "註解": "此星照命，如芝蘭出深谷，似松柏茂幽岩，父母鎡基難守，兄弟事業如無。獨身自立，難靠難憑。親義秋風葉，人情鑒裏花，成敗多端，利名進退。命中八字，卻得時辰得也終；祿在晚年，此命好為僧道。述云：雖然通草做屏風，異日崢嶸骨不同。"},
		{ "年時干": "庚辛", "卦象": "央卦", "格局": "鼇隱滄浪格", "詩訣": "日到天心影漸高，庚辛金印自風騷，巨舟泛浪多翻覆，淺水回波隱巨鼇，遠雁過溪三四隻，柳枝一朵伴紅桃，平生志氣無人識，晚景金門過貴豪。身心辛勤事未成，碧天雲暗幾翻明，逢雞漸有人抬舉，跨馬騎牛祿漸平。 ", "星名": "天英 天馳 天破 ", "註解": "此星照命，心行正直，賦性平和。能睹是非，無私曲，不藏機，出語毒，易嗔易喜，能榮能辱，如虎之口，佛之心。於人不足親，如千葉桃花；交友如風裏秉燭。述云：妻遲子晚君休歎，五九安閒福始來。"},
		{ "年時干": "庚壬", "卦象": "困卦", "格局": "雨打荷花格", "詩訣": "荷花雨打鴛鴦散，蘆葦風翻雁陣斜，家住五湖思信至，白頭塵境自生涯。園林花發存三果，百歲墳前半是他，借問始生須苦節，到頭三紀入煙霞。遇犬多驚險，逢牛路漸通，前程還有路，龍馬必亨榮。 ", "星名": "天騎 天馬 文昌 ", "註解": "此星照命，凶中變吉，好事多磨。見識別，智略多，自能自會不俯仰，性快口直多魯莽。會擔當，能支撐，會裨補。夫妻和睦，兄弟鏡中花。有貴如不遇，衣祿聚散多。述云：龍馬才逢遇，衣祿自亨通。"},
		{ "年時干": "庚癸", "卦象": "鹹卦", "格局": "鶯宿野林格", "詩訣": "斛裏黃金不用量，誰知升斗自相妨，孤飛雁過蘆花白，百歲優遊玩水旁。鶯宿喬林飛散畢，春花枝上有金芳，君家若出中年外，好逐笙歌入畫堂。筆硯隨身學不成，不思名譽與公卿，江邊幸有鱸魚美，錯認長江作帝京。 ", "星名": "天將 天氣 孤惱 ", "註解": "此星照命，孤重、性重，退神重重。心高性直，不靠祖財。拳頭上做成個基業，竿頭上撰出家緣，千層浪裏安身，不妨百尺竿頭立命。不怕虎穴中敢去取子，巨浪裏也去釣鼇，只得四柱堅牢，所以不能消爍。述云：根基先駁雜，晚景福優遊。 "},
		{ "年時干": "辛甲", "卦象": "無妄卦", "格局": "雲罩長椿格", "詩訣": "重雲密霧遍天涯，祈雨祈風隔歲華，秋水雁橫三四隻，歲寒孤立伴寒沙。春晴去處園林綠，冬寒凝霜自不加，借問生涯何處是，騎牛歸去老農家。 ", "星名": "天班 天瓊 天囚 ", "註解": "此星照命，隱士之星，有道之宿。人命臨之，清若秋霄夜月，春沼虛花。不實之兆，名利賓士，生涯蹭蹬。性直出口傷人多招不足，親情有如江上雪，兄弟恰似鏡中花。若要身榮，除非牛虎相逢之年。述云：長江波浪急，也有坦平時。"},
		{ "年時干": "辛乙", "卦象": "逅卦", "格局": "戲水鴛鴦格", "詩訣": "志氣孤高且待時，煙鴻霧雁各分飛，園林花發依依綠，春色須還長嫩枝。山遠路遙知馬力，鴛鴦戲水不相依，前程幸有知音者，獨聽殘鶯晚樹啼。遇鼠身逢厄，逢寅遇貴推，龍蛇波浪急，牛馬定光輝。 ", "星名": "天佑  天非 天破 ", "註解": "此星照命，無祖業之分，無親友股肱之力，一雙手做成家計，獨自立個生涯。人情淡薄，骨肉相疏。十分恩愛，好處成非，雖是疑奸，奈何費力。大事不怕，小事不欺，過思遠慮，千方百計。過了多少艱難，經了幾翻閃撞，皆是天破星所注。述云：幾番浪裏風波急，還知也有坦平時。"},
		{ "年時干": "辛丙", "卦象": "同人卦", "格局": "日被雲翳格", "詩訣": "日盡難分影漸斜，成身消息未待時，春歸雁叫無蹤跡，秋月空梁燕亦歸。祖道只因身反破。恩深爭奈見分離，春色樹浸緣何事，實結枝頭一果奇。知道身榮貴，成身卻異同，龍牛外虎穴，相會便亨通。 ", "星名": "天權 天聰 天害 ", "註解": "此星照命，經風涉浪之星，穿山透石之宿。人命照之，有三早，有三遲：當家早、憂愁早，勞心早；子息遲、心閑遲、享福遲。直待末主成家計。述云：五九才交還得地，桑榆晚景得安閒。"},
		{ "年時干": "辛丁", "卦象": "觀卦", "格局": "雁過高峰格", "詩訣": "雁過高峰不及飛，歲寒江上理毛衣，犬頭消息應測別，鹿在豬牛奮猛威。中路陰人來舉用，綠波深處定虛虧，平生蹇難得後晚，才過蛇羊透玉墀。大樹盤根實，年深枝葉殘，歲歲江上日，獨自照青山。 ", "星名": "", "註解": "此星照命，如風之象，有名無形。作事七顛八倒，弄巧成拙。親如不親，恩中生怨。撰錢來如風雨，去若飛沙，雖是鎡基鞏固，預尋不定之憂。妻遲子晚，凡事勞心。妻宜命硬年高，方合婚緣；命弱年小，定有相妨，休言發達應遲，末主自有福利來也。述云：猴兔才相會，事業便光輝。"},
		{ "年時干": "辛戊", "卦象": "遁卦", "格局": "雲霧過山格", "詩訣": "平生立志重重險，獨拽彎弓力漸施，雲路過山多險阻，時來平地上天梯。雁飛天外聲聲遠，雨後桃花片片飛，借問百年成應事，長城春色綠依依。 ", "星名": "天印 龍馬 北辰 ", "註解": "此星照命，有操持，有智慧，見喜不喜，財帛不缺，先破後成，會撐絆，會分理，有剛斷。卻緣退神重重，多學少成，有頭無尾，名揚內外，譽藹鄉閭，目下未成，四九之後方可榮身。述云：根深不怕風搖動，五九年來見倍明。"},
		{ "年時干": "辛己", "卦象": "否卦", "格局": "琢玉園珠格", "詩訣": "箭飛星斗起寒光，月照長天感上蒼，宮羽己開天賜福，目前雲幕自高強。黃牛滿屋非干職，琢玉須圓取出方，雁過碧天沙塞遠，兒童歸去一雙雙。雨潤龍生角，山深虎奮威，但交猴鼠上，漸漸見光輝。 ", "星名": "天貴 天轟 血妒 ", "註解": "此星照命，將相扶君之兆，文武待衛之星。爵祿自然，兇惡不侵。明窗淨几，受業琢磨，有記性心，有操持志。只因心不足，未免多學少成。退神在命，凶中有救，險處人扶。五九才交成立，命享安閒之福。述云：利名未遂心多慕，際會風雲自有期。"},
		{ "年時干": "辛庚", "卦象": "履卦", "格局": "龍蛇波浪格", "詩訣": "水畔張弓射鹿魚，龍藏深窟自安居，鴻飛天上聲聲遠，蛟在池中戲月珠。祖業漫將心不足，鴛鴦相背意情陳，知君自有逍遙路，摘取蟾宮第一枝。鹿在高原望，張射鬥牛弓，平生何事足，晚景自從容。 ", "星名": "天刑 天孤 鸞鶴 ", "註解": "此星照命，一生勞心費力，般般自向前，件件自理會。別人做過事，須是自要做，不信別人，自是自直。作事持重，言不妄發。安須少，煩惱多，閑中尋靜，靜處不安閒。命招性拗，妻須命硬。凶中有救，遇險無危。述云：一生勞心非燦爛，遙空輝晃照天宮。"},
		{ "年時干": "辛辛", "卦象": "乾卦", "格局": "石上芝蘭格", "詩訣": "頑金鍛冶方成器，石上芝蘭根腳異，遠塞孤鴻飛不歸，群群飛上丹霄際。春來花發滿園林，未秀多應時未至，百年枝上半青紅，白頭應作蓬萊裔。遇鼠天應祿，逢丁必惹災，鼠牛羊內發，一舉上高臺。 ", "星名": "天蔭 天囚 科秘 ", "註解": "此星照命，不受祖業之物，全憑天地之滋生。如日升東，漸麗北海；筍迸新芽，不久成竹；魚遊深水，變化非難。好個根基，只緣退神重重，胸襟磊落，作事迂迴。述云：桃李花飄處，枝頭綴果多。"},
		{ "年時干": "辛壬", "卦象": "訟卦", "格局": "雲霄月朗格", "詩訣": "骨格輕盈如婀枝，清風滿徑任教吹，良霄月朗天光碧，在路行人未得歸。借問嶺頭花發未，囂囂鶯語喜還悲，平生進退多危險，晚景匆匆福自宜。門戶慶來時，麻衣換綠衣，馬頭人著力，應事見光輝。 ", "星名": "天愕 天銳 天駐 ", "註解": "此星照命，乃惡劣之星，人命值之，君子多福，常人帶疾，添財減土，成敗不常。先憂後喜，破了還成，心性不常。大寬小急，性忒直，心忒焦，妻硬相宜，子遲到老。九五之後方得立成人家。述云：甜苦重重暗曆過，方知晚景祿優遊。"},
		{ "年時干": "辛癸", "卦象": "遁卦", "格局": "寶劍重磨格", "詩訣": "吹毛寶劍金剛樣，塵土經年暗未明，合遇貴人重拂拭，雪霜潔利自然新。江邊三雁飛沙遠，樹上花枝果亦成，幸有陰人相接引，春雷才動馬嘶聲。無根濃葉滿地堆，蓮花出水望秋來，逢牛必定成權貴，跨馬騎牛大路開。 ", "星名": "天福 天將 天卻 ", "註解": "此星照命，乃榮華之宿，富貴之星。生來無苦，衣祿自然，有操權，有智慧，有鎡基，有變豹，有靜性，有剛斷。作事先難後易，所為十是九非，才逢雞兔之年，定主妻榮子美。述云：一生災難處，鎡基進益多。 "},
		{ "年時干": "壬甲", "卦象": "屯卦", "格局": "松透蓬蒿格", "詩訣": "逢蒿直透茂松青，霜雪雖深且固根，雁飛天外聲聲遠，鴛鴦戲水失其群。桃花滿苑從君摘，未逢一個好知音，若逢運到蛇羊地，衣祿安然必稱情。限隨羊馬發，喜慶自然迎，壽如逢九五，不用問前程。 ", "星名": "天祿 天將 天容 ", "註解": "此星照命，主人有機謀，有持略，有進濟，有財帛。親如不親，交友難托，獨自向前。難為長子螟蛉，庶出方可存留。更遇馬牛，錢財興盛。述云：逢牛遇馬方還樂，休道年來不稱心。"},
		{ "年時干": "壬乙", "卦象": "井卦", "格局": "玉碗盤托格", "詩訣": "白玉藏珍寶，靈沙隱碎金，異香安水際，方始見浮沉。遠飛雁千里，鴛鴦戲綠蔭，信如花謝後，實子火中尋。滿屋乘天雨，陰人隱舊情，豬中逢兔子，方始遂安寧。 ", "星名": "天暗 天成 天賜 ", "註解": "此星照命，為清風明月之星，為昏迷朦朧之宿。人命犯之，藏機隱志，思遠慮深，反復鎡基，顛倒造化。只宜過房離祖，異姓就贅。妻遲子晚。妻是年高命硬，保守到頭，子若螟蛉庶出，相陪到老。述云：豬羊逢兔子，方始得身榮。"},
		{ "年時干": "壬丙", "卦象": "既濟卦", "格局": "猿戲叢林格", "詩訣": "柱倒人扶起，輪推仗匠園，雁飛沙塞遠，有意合天心。命有重榮晚，花開兩果鮮，馬頭逢見犬，牛首換弓弦。地遠三千里，扁舟泊小溪，貴人來舉用，逢丑上天梯。 ", "星名": "天廚 天柱 天霞 ", "註解": "此星照命，乃遊懸之星，犯之志性乃見。遠機深，難觸犯，不吃虧，易嫌消，不妄相。不利東南，得來西北，貴人提攜一段財物卻有壽。作事可然，面前背後，多招不足。述云：名利成就何時晚，只恨初中運不通。"},
		{ "年時干": "壬丁", "卦象": "比卦", "格局": "雁宿蘆叢格", "詩訣": "雲收月出天中淨，雪壓松筠翠轉堅，雞叫牛邊聲未歇，雁樓蘆葦竟艱眠。平生志氣無人識，馬去羊來意向便，報導龍蛇消息好，弓開箭發盡天年。 ", "星名": "天遊 天靜 天鎮 ", "註解": "此星照命，不耐靜，猶加被雲遮，鏡在塵土；如甜瓜香從辛苦裏來，甜向苦中生。六親如冰炭，兄弟若流波。在家煩惱大，出外笑顏多。只宜出外求財，不利在家作活。分憂人少，吞食人多之命。述云：自有根基在，何勞事不成。"},
		{ "年時干": "壬戊", "卦象": "蹇卦", "格局": "金玉滿堂格", "詩訣": "江邊雁陣聲聲遠，孤只飛來野岸中，金玉滿堂誰得意，一枝花放暗香通。春來滿苑花芬晚，百歲枝頭一點紅，借問馬頭消息好，箭來蛇上必成功。遇午登雲路，逢牛渡險堤，命逢雞犬上，平步上雲梯。 ", "星名": "天寶 天圭 天財 ", "註解": "此星照命，氣大心慈，剛性志廣。閑管翻成不足，不平處須要閑言，好處成悲，恩中生怨，六親冰炭，兄弟無緣。好事多磨，弄巧成拙。述云：從前多少關心事，五九才交事業新。"},
		{ "年時干": "壬己", "卦象": "中孚卦", "格局": "雁度衡陽格", "詩訣": "海潤無涯萬里深，蓬萊仙島在其中，雁聲暗度衡陽遠，鴛侶雙雙逐曉風。月到更闌天練淨，秋風颯颯樹頭空，君家若問歸身計，蛇到龍宮事業隆。箭發從空下，龍蛇必換宮，貴人相接引，方始見亨通。 ", "星名": "天波 天卿 天忤 ", "註解": "此星照命，能妝點，會施為，立志孤高，見識遠大。作事無私，斷曲理直，有能三思行之，卻不魯莽。口直招人怪，喜得命中有救神。述云：生來作事臨危處，卻得官刑不犯凶。"},
		{ "年時干": "壬庚", "卦象": "節卦", "格局": "骨成仙客格", "詩訣": "四海為家未是家，西山盡可作生涯，天邊雁叫思南北，池沼鴛鴦獨戲沙，繞樹花芳三五朵，秋殘將落一枝花，終知志在逍遙外，欲到蓬萊度歲華。說著文君信，君常省是非，要知財祿盛，遇鼠自相宜。 ", "星名": "天怨 天年 天越 ", "註解": "此星照命，立業早，勞心早。刑殺重，退神多，雕青破肉，斬指截發，可免刑獄，只得退神在命，若向松軒竹檻，作一個清閒瀟灑之人，量為得地。若在塵勞中末，區區碌碌不能遂心。述云：平生多志氣，晚景自逍遙。"},
		{ "年時干": "壬辛", "卦象": "央卦", "格局": "雁陣橫空格", "詩訣": "天高地遠難憑尺，有志堪宜生羽翼，雁陣橫空各自飛，賓鴻江上應孤只。要知花果深蹤跡，花落枝頭俱教逸，向雲深處好安身，謾自經營勞苦力。 ", "星名": "貪狼 王簡 天喜 ", "註解": "此星照命，孤高獨立，稟性聰明。分憂人少，趁問人多。廣招是非，於人不足。好事多磨，閑中不靜，惡處成活。貴人在命，空得奔波。衣祿有分，人事未知。一生凡事勞心費力，便是這個命中所注。述云：孤舟無櫓棹，大海遇風波。"},
		{ "年時干": "壬壬", "卦象": "坎卦", "格局": "池沼遊魚格", "詩訣": "生計如魚戲水池，臨危涉險亦無危，鴻飛天上無消息，必竟傷心意緒悲。青草池塘鴛鴦失，洞庭湖上客船稀，知君箭發龍蛇地，莫怨如今未得時。春來又複秋，如水向東流，若問安閒日，重山好牧牛。 ", "星名": "天暗 天器 天庚 ", "註解": "此星照命，難為父母，祖業可留，兄弟宜遠，妻室難求。清閒瀟灑，自在優遊，一番事作兩番做，一重煩惱一重憂。高人舉用，小輩啾唧。述云：自有貴人相舉薦，何須回首夕陽樓。"},
		{ "年時干": "壬癸", "卦象": "蹇卦", "格局": "花柳同榮格", "詩訣": "萬里關山東複西，後前事業是成非，蘆叢雁別雙雙遠，雨打鴛鴦兩處飛。綠樹春花開數朵，秋深葉脫獨存枝，知君貴在君臣下，只恐天年又不齊。遇丙雨兩相宜，庚年恐是非，遠山逢虎日，龍到更為奇。 ", "星名": "天笑 天印 天焱 ", "註解": "此星照命，五行安德，四柱堅牢，基業見成，一呼百諾，名傳閭裏，德譽鄉關。此命憂中有喜，喜處成悲，退神重重，財物來如驟雨，去如流沙，正是花巧得來花巧去，散時容易去時難。述云：滾滾生涯閑未得，區區享福晚年間。 "},
		{ "年時干": "癸甲", "卦象": "頤卦", "格局": "月年秋夜格", "詩訣": "雙雙鴻雁飛霄漢，獨對秋光月更明，煙靄霧橫千里遠，行人猶聽馬嘶聲。名成利就還中末，早歲賓士事未成，更問年來誰是伴，兒男東畔向西傾。橋水卻難逢，關山兩樹紅，騎牛逢遠路，必遇主人公。", "星名": "天晦 天龍 天哭", "註解": "此星照命，為人豁達，稟性聰明。不耐靜，要尋頭，會撐持，能就省。兒女有，不得力，錢米不能周急，樂處未能樂憂，中卻有歡。作事躊躇多思慮，凶事不凶，凶中卻有救神。"},
		{ "年時干": "癸乙", "卦象": "蠱卦", "格局": "雕鶚棄梧格", "詩訣": "雕鶚離梧別幽谷，飛過岩前立奇木，雁飛天外怨聲悲，鴛鴦戲水多翻覆，處處花開我未開，我花開時風雨觸，勸君不用苦經求，晚年自有千鐘祿。運至馬牛時，凡事悉皆宜。", "星名": "天疊 天雨 天逸", "註解": "此星照命，聰明曉了，睹事執直，鎡基自好。心裏不足，五行穩潤，四柱得局。外觀好看，裏面不足，靜中尋出不靜，思中成怨，憂處不足。述雲：休道從前虛度日，始知牛馬是豐年。"},
		{ "年時干": "癸丙", "卦象": "賁卦", "格局": "金榜題名格", "詩訣": "龍樓鳳閣帝王城，草屋柴扉貴祿名，金榜唱名應自別，寰中君子駭然驚，江邊雁過空移影，對對遙飛只聽聲，試問前程何所是，妻兒子女晚年成。命中逢犬喜，乘牛必見凶，馬頭相遇日，喜氣必重重。", "星名": "司諫 石闕 天昌", "註解": "此星照命，聰明之宿，人皆仰之。性直心慈，招非惹是，喜努不常，理直睹是。親戚和而不同，朋友和而不美，便是這個命中所注。"},
		{ "年時干": "癸丁", "卦象": "剝卦", "格局": "鸞鏡重明格", "詩訣": "平生似玉無瑕玷，百年磨難未能成，良工巧匠鑿成器，早年應須遇貴人。霜雁過溪三四隻，松筠帶葉各枝青，知君意在行雲外，半把金銀伴月明，遇馬行千里，逢雞始過橋，鼠牛心未足，龍虎自逍遙。", "星名": "貫索 天飄 天戲", "註解": "此星照命，資財多，費力多，恩愛煩惱多。親恩如冰炭，兄弟不比和，贊力受奔波。孤不盡，妻不和美。只喜得退神重，凶中不凶。述雲：從前騎虎多不利，今日乘龍便不同。"},
		{ "年時干": "癸戊", "卦象": "艮卦", "格局": "雁過重嵐格", "詩訣": "重山過雁楚天高，百歲兒童晚景豪，早歲不成安樂地，榮處家如磨劍刀。園林是處花開早，直至春深雪未消，遇兔馬龍身奮發，利民晚歲遇英豪。百里秋光起，千秋木葉凋，才逢兔馬地，衣祿自然調。", "星名": "天暗 天奔 天貴", "註解": "此星照命，獨立自成自費力，營家早，風浪早，磨難早。虎狼口，善心腸，好多磨。凡百進退，君子知重，小人無緣。惹是招非多，招不足。述雲：巧成名利日，馬足兔頭中。"},
		{ "年時干": "癸己", "卦象": "剝卦", "格局": "雲散青松格", "詩訣": "雷發空中應聲遠，松篁雪化樹頭青，雁陣聲聲歸遠岫，空對蘆花月朗明。煙裏樓臺鶯語巧，芳堤雨霽馬蹄輕，借問桃源花幾朵，枝頭留下一枝榮。", "星名": "天艱 天興 天晶", "註解": "此星照命，心高志氣廣，性直會剛斷，能施為，會理直，能睹是。虎口佛心，為人慷慨，多成少聚，多學少成，好南北，多恩多怨，多因婦人面上不足省順，可免是非，無心中可要惹煩惱，身安處心不安。述雲：雞兔相逢身必貴，引取前來步玉京。"},
		{ "年時干": "癸庚", "卦象": "損卦", "格局": "岩前古柏格", "詩訣": "古柏岩前歲月深，直堅霜雪耐欺侵，剛柔未決身猶舉，白首榮心量滿襟。祿位得時君自險，資財失處又還成，要知立業安身計，三四人中一老心，樹花逢一果，蛇猴合稱心。", "星名": "天福 天臺 天極", "註解": "此星照命，執直睹是，仁義禮樂，所為平品。作事忠良，能親君子，會禦小人。凶中有救，有犯官刑。六親冰炭，朋友無情。述雲：利民還自得，五九好身榮。"},
		{ "年時干": "癸辛", "卦象": "大畜卦", "格局": "池映芙蓉格", "詩訣": "池畔芙蓉照水開，松筠力辦雪霜材，孤飛雁過瀟湘遠，百歲兒童去複來。興廢只因辛到癸，成名好趁卯寅來，誰將杖擊雲中鼓，震動成聲滿九垓。跨馬身榮早，騎牛帶祿榮，莫言今未顯，羊角虎頭成。", "星名": "天福 天倉 天晦", "註解": "此星照命，為人聰明俊秀，性直口快，有執持，能耐事，如松筠之在歲寒，經霜雪而不改其性操。與朋友交，久而敬之。骨肉情疏，子息晚立。遇辛癸且興且廢，逢寅卯志遂名成。身榮家富，作事振作，聲譽四方，經險而不危，遇凶而自消，末主福祿稱心。述雲：過了千重險，虎羊身始成。"},
		{ "年時干": "癸壬", "卦象": "蒙卦", "格局": "虎隱深山格", "詩訣": "遇浪輕舟不復高，平生興廢若波濤，逢豬才息風波險，遇鼠方知松節高。雁叫碧空悲夜月，鴛鴦並隊戲新潮，要知箭發從何處，遇虎方知福自高。遇虎身舒暢，逢兔福優遊。", "星名": "鍛煉 孤虛 天福", "註解": "此星照命，如枯木逢春，旱苗得雨。五行中勞心早，歷事早，煩惱早，艱辛早。妻不得力，子不替憂。心性緊慢不均，大寬小急。作事龍頭蛇尾，有始無終。皆因退神重。述雲：初年吃盡艱辛苦，末主安閒福始來。"},
		{ "年時干": "癸癸", "卦象": "艮卦", "格局": "牆畔黃葵格", "詩訣": "今日心同百歲時，爭知名利未相齊，有根不斷階前草，總有孤鴻江上飛。春樹有花終結子，冬深松柏壽同齊，若問生涯成利祿，才逢羊馬便相宜。", "星名": "牽牛 天應 天空", "註解": "此星照命，如芝生榭砌，竹茂南軒，根深葉實，情異直堅，心慈志廣，玲瓏天然。只因退神在命，父母堂前，過客兄弟，天邊雁陣，妻妾同林，宿鳳兒女。謾惹榮牽，初年管見，駁雜榮華在晚年。休言晚發，五行所注之然。述雲：晚景成身處，羊馬始亨通。"}
	];
	
	var 年干時干=年干+時干;	
    var 論斷項目='<span class = "傳統論斷項目">鬼谷子 分定經</span><br>';
    var 資料索引=_.findIndex(分定經資料, {年時干: 年干時干});
    
    //var 資料註解2 = 分定經資料[資料索引].註解;
    if (資料索引 != -1) {
        var 資料註解 = 分定經資料[資料索引].年時干 + "&nbsp&nbsp&nbsp&nbsp&nbsp卦象：" + 分定經資料[資料索引].卦象 + "&nbsp&nbsp&nbsp&nbsp&nbsp格局：" + 分定經資料[資料索引].格局 + "<br><br>詩訣：" + 分定經資料[資料索引].詩訣 + "<br><br>星名：" + 分定經資料[資料索引].星名 + "<br><br>註解：" + 分定經資料[資料索引].註解;
	    return 論斷項目 + 資料註解;
	}
	else alert("分定經 沒有搜尋到資料！");
}

function 六十日主用法詩訣(日柱){
	var 用法詩訣資料 = [
        { "干支": "癸亥", "註解": "天門懸彩日，臨帝旺。支坐傷官。劫財，驛馬。九華山上天門開，日行東方花似海。若去西方崑崙地，邊塞將士戀故國。未月，合木，貴。在外終。子月，妻離異，財分張。亥月，劫財，一生無正業，散業。四季土月，有作為，決戰沙場。寅卯月，財團經營，或藝名天涯。巳午月，大富。癸亥，命薄，多貧賤。"},
        { "干支": "甲子", "註解": "天德貴人日。坐子、沐浴，逢官臨桃花。白玉仙子捧印來，一舉成名天門開。貴人不向西方去，烽火空負曠世才。辛為正官，庚為偏官，戊己為財，見甲乙為破財，丙丁傷名利艱難，生在子月，無丑合，離祖自立，亥卯辰月主貴，巳月平常之命，午月甲死子神沖，他鄉立業。申月，子嗣難有。辰月，移根換葉。亥月，文章顯達。"},
        { "干支": "乙丑", "註解": "玉女佩珠日（丁為玉女，丑為珠）。臨衰，坐梟與偏財，將星。身坐金庫財福秀，衣祿榮華樣樣有。金水相涵好文章，東方西方對面談。生於子月，丑合，貴，丑月，帶疾；寅月，寅中丙火克庚金官星，不祿。申酉月，無火，壽長。寅卯月敗財。辰戌月，富貴。亥子月，詩文揚。巳午月，福壽。戌月，清秀厚道，財富豐盈。"},
        { "干支": "丙寅", "註解": "紅日東昇日，坐長生，梟印，食神。山川秀麗柳絲青，人生最喜煙霞景。莫向離情虎山行，西南一去幽幽命。酉月，正財，透財貴顯。寅月，貴而不長久。卯，見財星福，官星顯貴。申月，財官雙顯。未月，主福。戌月，衣祿平常。亥子月，六品之貴，巳午月，腸胃或肺疾。"},
        { "干支": "丁卯", "註解": "月照蟾宮日。臨偏印，坐病（虛名虛利）。日坐偏印身自強，西風不吹日惆悵。驛馬交馳到財鄉，山斗文章蓋一方。寅卯月，印綬，喜行官運，寒門將相。辰戌丑未月、孤星，妻不順，財不聚。巳午月，夫妻緣份薄，艱苦。午月多婚，貧，夭，申酉月，名利雙貴。子月，武職。亥月，文職顯耀。"},
        { "干支": "戊辰", "註解": "蒼龍出海日。臨冠帶，正才，比肩，正官。月灑高山江山秀，平生最喜東南遊。一生辛勤貴不顯，為人熱心福氣厚。子月，財旺，目盲，無火，虛而不實。丑月，財少，人聰明。寅卯月，官星，身榮。辰月，財不聚，孤克。巳午月，學業二次成名。申酉月，藝名四方。戌月，沖，少年出眾。亥月，多疾，子月，無根，漂蕩，技藝超群。"},
        { "干支": "己巳", "註解": "馬躍平川日，臨帝旺，坐偏印，比劫。南朝天子綬玉印，千里長江醉遊人。雪山草地馬難行，春風得意座上賓。巳為印，旺，巳月，金神，忌財，喜食傷。午月，顯貴。土月，候伯命。申酉月，喜印運，傷盡為武職。亥月，一品貴，有兵權。子月，食傷運大富，辰月，先貧後發。己巳日，人貴。"},
        { "干支": "庚午", "註解": "火鑄金印日，臨沐浴，支坐正官印。鐵筆一隻水為墨，淡彩濃雲筆下繪。學苑將士兩般命，山野朱雀銜玉翠。丑月有名聲，辰月，自刑，富而有刑。寅月，火旺，帶殘疾，肺有疾患。卯月，財旺，大富之人。子月沖，天涯藝海。申酉月，日貴，垂手青雲。"},
        { "干支": "辛未", "註解": "冰河解凍日，臨衰，支坐梟印，偏官，多情忘義。身入西國佛香地，漫歌輕舞管弦醉。玉女傳輸風流人，高山日出彩畫新。申月，在貴人門下得富。酉月，又貴又富。辰月，庫印，沖，清雅儒士。巳月，文月，武操重權，子月，富門貴顯。丑月，經濟商，雲遊。亥月，雙貴。"},
        { "干支": "壬申", "註解": "白虎渡江日。臨長生。支坐偏印，偏官，劫財，驛馬。命似白虎渡長江，最怕風雨江水漲。麗日跨入平川地，金枝玉葉陪身旁。子月，劫財，合水，一生奔波，貧。酉月，偏旺，帶疾，弧身。亥月，刑，破財，見官星，大富。丑月，官星，行財運，清秀，祿貴。寅、卯月，食旺，富貴雙全。巳、午月，身坐學堂，名利馳驅。申、酉月財帛進退。土月，貴。"},
        { "干支": "癸酉", "註解": "天福日，臨病，支坐偏印。瀟灑功名起一方，一衝一合異尋常。江湖花灑安享福。南去高山勢莫檔。亥月，生涯遂心，風流。戌月，平常，善智謀。酉月，得祖業，破財。申月，印旺，文上出仕。寅月，藝技生涯。卯月，沖，印破，大富。巳月，富商。午月，生意人。申酉月，金水相涵，文秀。子月，印破，不祿，平常命。"},
        { "干支": "甲戌", "註解": "青龍獻藝日。坐養，臨偏財，傷官。一世榮華走他鄉，千般藝技樣樣強。官星印星來捧上，風流多情歌舞場。子月，書海成名。丑未月，沖刑災，多病。寅月貴，工作好，對妻不利，丑月，大富，巳月名利兩全。午月，富而貴。辰月，僧道清高。亥月，藝人，功名不遂。戌月，背祿逐馬，雞鴨同鳴。甲臨戌，財庫，富貴雙全日。"},
        { "干支": "乙亥", "註解": "名利雙成日。坐死，臨正印，劫財，文星貴人。玉兔月桂喜官星，親姻朋輩重友情。青竹流水郁蔥蔥，太陽投江重複行。子月，主有富，喜官殺顯貴。亥月，自刑。午月，貴命，千荷夏日鮮。寅卯月，財星透，富壽。申月，得官。巳月，天涯風塵。戌月，藝道成名，干戈陣前之命。酉月，傷官，貴，死於非命。"},
        { "干支": "丙子", "註解": "漓江照彩日。臨胎，正官，喻文曲星，天官貴人。彩照山川鳳呈祥，年少成名坐華堂。日落江河人堪傷，東彩西虹任君想。子月，逢印，貴。土月，企業財團。寅卯月，學業有成。午月，貧，自立家業，兄弟難依。申酉月，經濟有方。亥月，有疾，夭。子月，不祿，心臟疾患。丑月，透財貴。巳月，刑災，大腸患疾。辰月，官星暗藏，超群出眾。"},
        { "干支": "丁丑", "註解": "玉女守庫日，坐墓，臨財。一輪滿月彩畫鮮，金銀滿庫祿高遷。麗人不行東南地，潔膚玉身受熬煎。丑月，財透干，富。寅卯月，印，學士命。巳午月，妻遲，二婚，破財，一生辛勞。申酉月，金銀滿貫，戌月刑災，財去財散兩空空。亥月，喜行南方火運，名利有望。子月見火，戎馬空忽。"},
        { "干支": "戊寅", "註解": "虎嘯山谷日，臨長生，坐殺，偏印。將星入命立武功，猛虎縱風顯英雄。印綬財官懸天門，南征北戰旅馬行。卯月，寅月，鬼旺，多疾或夭。巳、午月，印，詩文會海，兵權萬里。申酉月，不祿，傷功名，土月，富。亥月，子月，商賈大富。"},
        { "干支": "己卯", "註解": "武跨將壇日，臨衰，坐七殺將星。將士佩弓跨戰馬，暮雨風月渡年華。文星福祿若有情，北國回首似到家。酉月：卯酉沖，一生多遷移，妻離。申月，早發跡。亥月，貴。未月，合，五穀豐登。午月：詩滿乾坤。巳月，文秀。辰月，能建功立業。子月，無禮，凶暴。"},
        { "干支": "庚辰", "註解": "福德貴人日，臨養，坐支偏印，食神。命帶魁罡性剛強，不信鬼神在身旁。玉珮嬌陽入命來，執戈跨馬佐高皇。丑月，富而有名。子丑，文才出眾。寅卯月，財福壽促，午月，發跡有疾患。巳月，一生艱辛，未申月，財運發跡。酉月合，透官星，榮顯。亥子月，食神旺發跡難壽。庚辰，貴而風流，名重利輕。"},
        { "干支": "辛巳", "註解": "金馬登殿日，臨死，坐支正官，正印，劫財，驛馬。金馬臨官號嘶風，玉堂拜相翰苑名。最喜高山水環繞，嬌陽日出漫消魂。子月，食旺，名顯。丑月，合，妻少緣，財淡。寅月，因財有刑。卯月，橫財。巳月，金長生，化水名顯。午月，暗鬼有疾。申酉月，貴中有失。亥月，沖，雙貴。"},
        { "干支": "壬午", "註解": "花紅柳綠日，臨胎，支坐財，正官，驛馬。祿馬相邀入帝鄉，花紅柳綠掩高堂。出闋最喜函玉關，千里迢迢雁北上。子月，月日沖，外鄉立家，難團園。丑月，祿旺，貴。寅月，貴而多疾。卯月，富貴雙顯，巳月，財旺，喜印地，午月自刑，夭疾，比劫扶，吉。未月，大富。申、酉月，狀元及第。土旺四季，主權。亥月，身旺，財旺。"},
        { "干支": "癸未", "註解": "貴人佩玉日。臨墓，支坐偏官，偏財。日臨官庫將相命，男子英勇女貴榮。西方一去福祿地，花園翠亭馬不行。子月，青雲得路，貴。丑月，暗鬼沖傷。婚有變。寅月，秀貴，一生順利。卯月，武職平常。辰月，富而秀貴，巳月，富而且有肺疾。未月，男女無子女，陽痿。申酉月，文字生發。亥月，財發。"},
        { "干支": "甲申", "註解": "龍虎奪魁日。坐絕，臨殺化印。躍馬橫戈馳天涯，秦山楚國帥府家。兒女手足喜相逢，斬將奪關壯士誇。生於子月，印化煞，貴。亥卯未月，都貴，申月申時，死，夭命。丑月，帶疾，辰月，孤獨或僧道。巳月，清貧，敦厚聰明，且有刑。午月，藝業成名，酉月，先貴有疾，一成一敗，亥月，文章顯達。"},
        { "干支": "乙酉", "註解": "龍鳳呈祥日。（生於酉月為貴為蒙難日）坐絕，將星。春花江水落鳳霞，南北揚名匡天下。南方一去坐金殿，玉石翡翠淚花花。子月，生身，逢財星，吉。寅卯月，顯貴。午月，藝名生涯。申月，貧命，勞碌。酉月，自刑，傷祿破命目疾，主災，行印運時吉。亥月，喜財星，田園豐盛，巳月敗散祖業，乙酉，多傷殘。"},
        { "干支": "丙戌", "註解": "天廚貴人日，坐墓，福神財地。玉堂厚祿寒門出，金銀珠寶西方路。日落深潭闖鬼門，金榜題名顯雙親。生於子月，福壽延，有名有利，地支巳午戌月，富貴雙全。申酉月，大富，財團。辰月沖，少年名顯。亥月，武職，六品。丑月，一般經濟人。辰月，身旺得職，身弱貧賤。"},
        { "干支": "丁亥", "註解": "月照天門日。坐胎，臨正印，正官。詞館文章早榮身，驛馬七殺風塵人。最喜荷花並蒂開，金水文章佐朝君。亥月，貴且富。子月，行木運，金戈鐵馬。戌月，沖，技藝精湛。寅卯月，貴而顯耀。巳午月，自刑，小商。申酉月，利路綿綿。子月，帶疾。辰月，專業技術成名。"},
        { "干支": "戊子", "註解": "山環水抱日，臨胎，坐正財。水繞山環明月光，煙花影中福高享。勿貪關城槐山夢，江海浮雲一空束。子月，喜行火運，福。丑月，聰明，主富貴。寅卯月，弱，病或夭亡，喜火土。巳午月，巳祿，印，午刃，喜行食傷富貴。申月，食旺，貴。酉月，傷名望。土月得才，富貴。亥月，虛秀，財帛不聚。"},
        { "干支": "己丑", "註解": "金牛拜金殿。臨墓，坐比肩，食神，偏財。一柱佛香拜金殿，艮山流水芳名顯。金匙開得丑戈庫，富貴榮華醉管弦。亥月，傷官盡，貴，有權威。寅月，貴顯。卯月，兵權顯赫。申月，庚為背祿。甲絕未月，沖，發跡，腎病。午月，沖，妻有厄。巳月合金，商賈巨富。辰月，孤身。子月，倉庫充盈。"},
        { "干支": "庚寅", "註解": "白虎鎮山日，臨絕，坐支偏財，七殺，偏印。平川猛虎歸山林，秋風落葉時不寧。最喜大雪封山時，三夏濃蔭臥孔明。子月，食旺，身衰，比劫扶吉。寅月，清秀，命高。卯月，富不長久。辰月，富而貴。巳月，鬼暗藏，有印，職榮。申酉月，錢財聚散浮沉，戌亥月，董事財團。"},
        { "干支": "辛卯", "註解": "鳳闕早步日，臨絕，支坐財，傷官，驛馬，沖祿。高山起程水流長，邊塞迢迢雪滿霜。佛山玉女豈有情，雪山日照花海棠。辰月，傷官傷盡，自立自成，技藝，卜相，醫生。寅卯月，合，財豐。巳月，沖，文星出眾。午月，自刑，先榮後刑。未月，富。申月，貧，人生不定。酉月，多爭論。子月，食旺，福旺。亥月，傷官。技業成名。辛卯，偏財，為福貴雙全日。"},
        { "干支": "壬辰", "註解": "山流水長日，臨墓，支坐偏官，劫財，庫地，虛名虛利。江水流芳美如畫，杜鵑啼血巫山峽。月下騎馬走平川，一日嘗盡牡丹花。子月，成中有敗，多凶。丑月辰戌未月，俱貴。寅月，食旺，人騎龍背，名流，財旺。卯月，清雅人。巳、午月，廣置莊園。申月，奔勞，走鄉串野。酉月，合，文上有名，才子。亥月，主掌權。"},
        { "干支": "癸巳", "註解": "彩霞佩玉日。臨胎，支坐正財正官，驛馬，文星。貴人玉堂來拜相，墨池泉湧好文章。武士跨馬走天下，王公皇候似平常。巳月，財官雙美，詩書琴畫。午月，中年大富。申酉月，終生勞累，透官。丑月，秀氣。辰月，山明水秀，紅粉生涯。"},
        { "干支": "甲午", "註解": "龍馬奔馳日。坐死、傷官、財地、進貴日。龍馬交弛好福氣，嬌妻美女喜北地。八月桂花香千里，春風麗日相依依。子月，沖午，鴛鴦難合。亥卯未月，貴顯。午月，自刑，見亥子，主富。丑月，身弱，見火貧。寅月，得申酉吉，火月勞碌貧夭；卯月，財不聚；申酉月，武職得權。"},
        { "干支": "乙未", "註解": "財福日。臨財，坐養。也叫福貴目。天元坐福人聰穎，得官逢比賽富翁。絲綢路上愁石榴，春色秋花雨濛濛。子月，平常命。未月，孤刑，申酉月，腎病，陽痿，女姓有婦科病，亥月，大貴。辰戌丑月，福商巨賈。午月，聲名天下，夏月生，平常，冬生，壽長。巳月，功名難遂，藝業生涯。"},
        { "干支": "丙申", "註解": "火照金城日。病地，偏財，臨殺。身臨財官顯聲名，且防比刃殺傷臨。馬逢帝旺臨官處，堆金積玉立大功。子丑月，血疾，申月，文章有名。酉月，妻妾有情。子辰月，帶疾，亥月，喜財。午月，一生吉慶無病，長壽。寅卯月，官榮身。未月，雖富腸胃有病。丙申日，遇歲運刑沖，必生災禍。"},
        { "干支": "丁酉", "註解": "玉女乘鳳日。坐長生，臨偏財。朱雀乘鳳顯英豪，金車玉鳳福壽高。貴人龍馬東方起，太陽升時漫徒勞。亥月，貴人捧印，酉戌月，犯刑，骨肉無情，因財分張。子月，殺旺，喜行土運，午月，干強，財旺，未月，衣祿平常，申月，財多身弱，富室貧人，戌月，技術生涯。"},
        { "干支": "戊戌", "註解": "溪繞畫亭日，坐墓，臨正印，比劫。熱情憨厚心似海，白帝玉女捧印來。溪繞畫亭芳香名，田園平川雲天外。子月，顯貴聚財。丑未戌月，刑災，有破。寅卯月合印，詩文成章。申酉月，堆金積玉。亥月，沖，心神不定，異地創業。"},
        { "干支": "己亥", "註解": "平川流水日。臨胎，坐支正財，正官。祿馬同鄉拜玉堂，天塹通途文星揚。沉影不隨流水去，殺星衝動馬無疆。亥月，財顯，官旺，貴。酉月，食神，財旺，申月，乾透印，大貴。未月合武職。已月，沖，外跡發憤。子月，多病，血疾。寅卯月，支中鬼旺，一生難成大事。印透大貴。"},
        { "干支": "庚子", "註解": "金玉出海日，臨死，坐支，傷官。能歌善舞筆和墨，猶如白虎戲江水。沖在祿馬登科甲，斑竹細雨傷情淚。子月，衰，傷官，無土運，鬼旺，風燭夭賤。丑月，虛名，輕財。寅月，偏財，不祿。卯月，合財，金玉滿目。辰月，利路經商。巳月，武職顯躍。午月，文官近衛。四季月，印旺富而有名，亥月，漂蓬，僧侶。"},
        { "干支": "辛丑", "註解": "白玉生輝日，臨養，支坐偏印，食神，比肩。白玉生輝金門客，高山得貴子為墨。身入平川多愁歎，干戈影裡勳業垂。子月，食神，榮華。丑月，伏吟，鴛鴦難合。寅卯月，財聚官旺。巳月，早遂名香，辰月顯達，有名利。午月，凶。申酉月，逢官星，貴，少年坎坷。土月，平常。亥月傷官，一文鳴天下。"},
        { "干支": "壬寅", "註解": "福祿日，臨病，支坐食神，偏財偏官。虎躍天河威名揚，猶如箕豹出山崗。祿到長生官得地，九重雨露沐朱衣。卯月，破財，有成有敗。土月，吉。午月，正官，榮華顯貴。申月，沖身弧，奔波人。酉月，風流才子。戌月，財旺。亥月，財有根富命。子月，因財有破。壬見寅為食神，號富貴雙全日。"},
        { "干支": "癸卯", "註解": "天姿文秀日，臨長生，支坐食神。學堂詞館貴人命，天姿文秀人多情。最喜三星相拱照，詩琴歌樂官弦聲。子月，刑，無禮德，對妻不利，但平步青雲。丑月，貴，奇顯。寅月，艱難人生。卯月，人生富庶。辰月，財帛富月，父母難靠。巳月富而有殘，午月，一生財豐。申月，書香早遂，酉月刀筆成名，沖，鴛鴦離合。土月主貴，亥月，名利雙全。"},
        { "干支": "甲辰", "註解": "龍守財庫日。坐偏財庫，臨衰。身坐財庫一世榮，慷慨風流人多情。財團公司善交際，官星透顯管萬民。子月，水多木飄，主移根換葉。申月、貴，酉月，富貴雙顯。午戌月，主富，卯月，羊刃主敗財。丑月富厚有財，亥月透官，最貴。寅月，龍虎拱月，叫龍吟虎嘯。"},
        { "干支": "乙巳", "註解": "木火生輝日。交貴，驛馬，正財，成名。剛愎自用又聰明，財官同見公候命。文才武略怕青龍，興旺成敗一刻中。子月，文才出眾，一生勞碌。申月，官得生，近臣。丑月，武職建奇。亥卯月，通根見官殺貴。未月，有福，營商發財。巳午月，妻病或離別。申酉月，帶疾，肝膽病。亥月，文章出奇。戌月，入墓，富而壽短。"},
        { "干支": "丙午", "註解": "天河落彩日。坐劫地，傷官，羊刃。人逢帝座爵士身，功名仕途顯達人。蒼龍水火多有厄，細雨濛濛入燕門。巳午月，平常命。亥子月，武官，功名挫蹬。午月，貧，倒沖子貴。寅月，三合局，文上顯赫。卯月，喜行財星，貴而富。戌月合夥，商人。辰月，實業主。申酉月，財富商賈。"},
        { "干支": "丁未", "註解": "人立畫橋日，坐冠帶，食神，比肩，偏印。食神生旺勝財官，天河畫橋拜金殿。巽風相伴雲雨水，太陽奪輝苦貧寒。子月，沙場立功。丑月，外出經商，妻多離別。寅卯月，金堂玉馬。巳午月，破祖業，自立家門。申月，財官雙美，酉月，大富。辰月，雜氣官旺。亥月，將相。丁未，性強，人貴，凶險多。"},
        { "干支": "戊申", "註解": "霞落花簇日。臨病，食神，偏財。日坐福星聲名顯，萬卷詩書朝天關。騎驢走馬爐中火，風雲雷雨步金殿。寅月，沖祿，財旺。子月，財旺，印旺，貴，丑月福，愛酒色，固執。卯月，合食，名利雙顯。辰戌未月，土氣專旺，不聚財，腎病。巳午月，事業沉浮不定多變動。申酉月，專業致富。亥子月，大富。"},
        { "干支": "己酉", "註解": "鳳飛綠洲日。臨長生，坐支食神。一輪滿月出蒼海，金鳳展翅飛天外，秦山崑崙雪皚皚，龍鳳呈祥玉珠來。亥月，身弱，貧，寅卯月，有火，武職，酉月，高貴之命，酉多遊方術士。申月，無官顯貴。未月，大富。巳月，富貴陶朱。子月，食破，貧寒。"},
        { "干支": "庚戌", "註解": "祿馬貴人日，臨衰，坐支正官，偏印。將軍百戰不論功，高山流水又出征。西去陽關知音少，前祿後福兩三重。辰月，沖，平常之命。卯月，合，因妻發福。寅月，候王之命。丑月，財旺官升。巳月，火官，武職操權，有驚險。午月文職。難善終。申酉月，財來財散，散聚兩依依。亥子月，文筆超群。"},
        { "干支": "辛亥", "註解": "虎行天門日。臨沐浴，支坐傷官，正財，驛馬。一去天門遙遙遠，長亭驛路關山寒。倒騎毛驢東行去，高山麗日花團團。申月，發福。帶疾。酉月。破祿，多磨。寅月，富商。卯月財團。巳月，沖，天涯遊客。午月，武功建奇。土月，有官職。亥月，誤入商海。"},
        { "干支": "壬子", "註解": "馬奔天河日，臨帝旺。支坐劫財。壬水浩浩漫天下，行入東方福到家。江南平川魚米鄉，雲雨湖海鏡中花。子月，平常人。丑月，官星，人清秀。寅月，大富貴。卯月，刑，妻離。辰月，官庫，無沖不發。巳月，午月，利路經商。申酉月，文章璀璨。戌月，權重。亥月，貧。"},
        { "干支": "癸丑", "註解": "桑柳成蔭日，臨冠帶，支坐偏官，印，比肩。池塘桑柳滿園色，二月春風柳絮飛。莫怨高山運來遲，干戈影裡是翡翠。午月，沖，財旺，福。未月，主貴。子月，合，功名顯達。丑月異常出仕。寅卯月，傷食旺，藝海生涯。巳午月利路經商。四季土月，平平，殘疾。申酉月，科場功名，亥子月，決戰千里。"},
        { "干支": "甲寅", "註解": "天祿貴人日。坐比肩，食神，臨官祿。祿到人間最為奇，千秋功業酬白帝。田園風光好福氣，春江月夜柳絲垂。雙木並排，見寅月，孤克，二三妻，見申酉月大貴，卯月，身太旺破財，巳月，犯刑，亥月，早步帝闕，子月拱丑，貴。午月，會東方火局，才華超群，辰月，廣置阡陌。"},
        { "干支": "乙卯", "註解": "風雲相會日。坐祿，臨比肩，爵位，天乙貴人。身坐爵位人稱羨，功名顯達列朝班。蒼海珠玉會雨露，青山白雲流水遠。子月，偏印，文筆命，喜食傷生財，土月富，亥月，辛官，武職勳業。寅卯月，財絕，僧道有緣。巳午月，破財，申酉月顯赫。戌月福而壽。未月財富豐盈。"},
        { "干支": "丙辰", "註解": "火照龍潭日。臨官，食神旺，正印。日坐福神受皇恩，高官厚祿子孫興。平生享盡人間福，女命穿金又戴銀。戌月，沖，財門開，富命。辰月，僧道或孤。寅卯月，貴。丑未月，富厚。亥子月，貴格。申酉月，行火運，官至二三品。午月，兩三妻，福祿兩全。"},
        { "干支": "丁巳", "註解": "朱雀躍輝日。坐帝旺，劫財，傷官，正財。謝女才高滿詞館，等閒平步出少年。旌旗蔽日入鳳闋，火焰馬疲怨高山。午月，長生，文章顯奇。巳月，祿貴。寅卯月，透官星，一品大貴。辰月，商海有名。未月，貴格，申酉月富命。戌月，無福，見癸水，傷目近視。亥月，常常外出。"},
        { "干支": "戊午", "註解": "馬奔午門日。臨羊刃，正印。日月分秀福氣隆，殺官相見主武功。平川一去前程遠，戎馬西洲比陶公。子月，名利雙收，丑月，財旺。寅卯月透干，朝野重臣。午未月印，錦繡文字，透官顯貴。申酉月，企業財團董事。戌月財少，平常，孤克。子月，外鄉立實。祖業無靠，六親冷落，亥月，大富，刃旺，性強，人雖貴，凶險多。"},
        { "干支": "己未", "註解": "丹桂漂香日，臨冠帶，坐比肩，梟印。月中桂子秋飄香，江河日月交相映，莫道高山芳氣散，二月春風論短長。亥月，文章誇躍，清高，酉月，大貴。辰月，小職，近衛。申月，財福充盈，未月，財金散失，午月，合，清貧儒雅。巳月，喜官顯貴。辰月，寒門將士。"},
        { "干支": "庚申", "註解": "雙虎奔馳日。臨官祿，坐支比肩，食神，偏印，又叫虎戀玉女日。白虎交馳向南行，雀躍江河早成名。祿到長生官得地，九重露雨沐朱衣。庚月，透火，大貴之命。亥子月，詩詞清暢流韻。申酉月，無官星，貧而賤。寅卯月，財滿三峽。已午月，官至侍郎，七殺，金戈鐵馬。"},
        { "干支": "辛酉", "註解": "鳳臥金山日，臨祿，支坐比肩，天乙貴人。祿馬貴人世少有，鳳臥金山將帥候。日出朝陽橫天行，月圓金門尋石榴。申月，劫財，一生財不聚。酉月，比肩，財逢劫。子月，福壽名高，巳月，損妻。寅卯月，財氣通門戶。巳月，合，名揚四海。午月干戈劍影，未戌月，清貧，亥月，富而有刑。"},
        { "干支": "壬戌", "註解": "龍出蒼海日，臨冠帶，支坐正財，偏官，正印，火庫。身坐火庫水得福，西行東邀人間苦。壯士難酬青雲志，醉看少女漫歌舞。子月，有疾。丑月，人貴顯。申月，梟印，劫財，親姻難全。酉月，印綬，文印齊來。寅月，合，滋生榮茂；卯月，傷名，異路乘鳳。巳月，英豪透發，午月，貴顯雙親。辰月，青龍飛躍。亥月，蘭蕙不祿。"}
    ];

    //var a = 六十干支字轉值(日柱);

    var 論斷項目='<span class = "傳統論斷項目">60日主 用法詩訣</span><br>';
    var 資料索引=_.findIndex(用法詩訣資料, {干支: 日柱});
    
    if (資料索引 != -1) {
        var 資料註解 = 用法詩訣資料[資料索引].註解;
	    return 論斷項目 + 資料註解;
	}
	else alert("用法詩訣 沒有搜尋到資料！");
}


function 六十日主論斷2(日柱){
	var 六十日主論斷2資料 = [
        { "干支": "癸亥", "註解": "癸亥日柱，內性剛，有主見。見丙、丁、午、戌、未，生慈善之心，富裕興事業。水雜旺無火，不利婚姻，學習厚德，理財。金雜，心神不定，常生邪念。見純木生火，展示才華，興事業。日柱癸亥，應注重道德修養，信仰宗教大吉。"},
        { "干支": "甲子", "註解": "甲子日柱，四柱平衡無衝克，人漂亮，身條優美，有學識、能力、性溫和。金純，有德、有才。土厚則富有。火純見土，成名家。水雜多，則心神不穩定，女較為不利婚姻。木雜旺，智商較為不高宜多充實自己。見火金相戰，女較為不利婚姻。見子午相衝，一生較災禍多。日柱甲子，要得勢而不驕、不張揚，要不斷提高技能，昇華文化道德水平。不清高，低調生活於人群中。"},
        { "干支": "乙丑", "註解": "乙坐丑，乙木長在濕土上，個性較偏執，固執己見，行事宜謹慎小心。四柱中見陽金，有官位才學，個性穩靜。木雜多，較不利妻、父親。水過多寒，易患病，疑心重較重。見火來生土，有慈善之心，有才能。日柱乙丑，應放開思想，瀟灑人生。廣泛的吸收多方面知識，學會分析問題的法則。"},
        { "干支": "丙寅", "註解": "丙寅日柱，木助火勢，火更炎旺，個性較強，自主意識強。水旺抑火，內剛外柔，自控能力強，心胸寬。見金水相生，有才能。木多雜，無土，宜學習正確觀念。土雜無金，心易生邪念。日柱丙寅，應靜心修德，不爭強好勝。順勢待機，興事業,不可操之過急。"},
        { "干支": "丁卯", "註解": "丁卯日柱，內心依賴性強，外有能量，有心計，內心有計畫，外形氣平和。金重，興事業，有才能，見土生金，成名家。水有根，有官位。木雜，無土金，做事果斷。見土水相戰，易犯官災。火雜多，無土金，學習道德觀，易多爭鬥。日柱丁卯，要注重道德修養，堅定自己信仰原則，不可隨邪助紂。得讓人處則讓人。不可記人過太甚，報復心太強。"},
        { "干支": "戊辰", "註解": "陽土坐在潤土上，土厚潤，有主見，意志堅強，有韌性，處事沉穩，主觀意識強。火旺土焦宜多充實知識。水旺則富，有能力。木濕則貴，有德有財。見陽金生水，有才德，興事業。逢戌衝，易患脾胃病。日柱戊辰，要開放思想，勇於創業，不可固步自封，不思進取。決策要廣泛徵求別人意見，不可自以為是。"},
        { "干支": "己巳", "註解": "己巳日柱，性剛強，自以為是，心性較易激動、發洩。見刑、衝、克、害，都易招惹是非。見水旺生木，外有節制，內性剛，成就事業。見金水相生，也能施展才能，興事業。火炎、土焦，最忌惹事生非。金雜無水，易多行不義。日柱己巳，應常靜心思己過，不可非議干預他人之事。"},
        { "干支": "庚午", "註解": "火煉真金，性偏急躁，內性易生煩躁情緒。見濕、潤土生金，有才、有德，有涵養。金有助，有德。見濕木，有才能，興事業。火雜透，易招刑傷，女感情易多變，較不利婚姻。見子衝午，多災情，不利婚姻。金弱，木火成局，煩躁不安，狂傲不羈，易招傷病。日柱庚午，濕土能養身性，濕木能聚財。火炎成傷病，水沖也非祥。"},
        { "干支": "辛未", "註解": "辛未日柱，陰金坐在乾土上，內性較為急躁，有傲氣，不服約束，思路較窄狹。丑、戌多見，空想少做，較不利婚姻。水純旺，有才學，興事業。見水木相生，易成名成家。金多，較常爭鬥學習謙讓。水雜，主奔波操勞宜多規劃，女較為不利婚姻。日柱辛未，要務實創業，不驕不躁，不張揚。要活躍思想情緒，勇於開拓創新。"},
        { "干支": "壬申", "註解": "壬申日柱，機警敏感，虛榮心較強，善於交際，語言善巧，有能力。見木純生火，有德、有才，興事業。水雜多，需多思考，充實知識，較不利婚姻，不利財。金雜多，內心生鬼謀，勿自私招災，女不利婚姻。見火土相生，有德、有才、有貴氣。木雜無火，易心生邪念，難擋誘惑。女不利婚，見寅衝災重。日柱壬申，要踏踏實實做人，認認真真做事。要注重務實性，不講面子、不要虛榮，不搞排場。"},
        { "干支": "癸酉", "註解": "癸酉日柱，機警敏感，善於規劃，敢想敢做，敢作為。火旺則富，能創業，有德有財。見火土相生，有貴氣、才能。見木火相生，有創業才能。木多無火，易生邪念，不務正業，不利婚姻。金雜多，多想少做，宜樍極，較不利婚姻。水雜旺，易窮困勿懶惰須積極求財，不利婚姻。日柱癸酉，做事要留後路，不可太狠絕。要增加包容性，增強忍耐性。"},
        { "干支": "甲戌", "註解": "甲木貪生戌中丁火，辛金被烤，戊土更燥。心性易激動、較急躁，愛發洩。四柱中火旺，則易口無遮攔，惹禍招災，早年病，多災情，女不利婚姻。水旺減災，有才學。見潤濕土、寒金，有財富、官位，女注意自律，可保長婚姻。日柱甲戌，柱中再見火，無論強弱，都不宜求官，以防年、運火旺招官災。火熱年運，女要注意寬容保護丈夫、婚姻。時刻注意自我節制，太露鋒芒、強詞奪理必惹災禍。"},
        { "干支": "乙亥", "註解": "乙亥日柱，乙木栽在水上，有心計，性情變化多。見厚土，木有根基，有才能，興事業。見土金相生，有德有才，性慈善。水雜旺，易心術不正，窮困飄零，不利婚姻。見火金相戰，犯官災，較不利婚姻。見純火生土，有德有才。金純旺，有德、有才，有貴氣。日柱乙亥，須心性穩定，要以德誠處事為人，不可太施心計。給人以德，終有回報。"},
        { "干支": "丙子", "註解": "丙子日柱，水火共柱，心性複雜，偏於保守，多疑慮。火炎水孤，性急躁。水旺火弱，性內向，常有壓抑感。見午衝子，個性驕傲，容易激動。土雜多，心常生邪念宜多培養道德觀。見純金，有德有財。火有氣，水有根，有才有德。水純旺，德厚穩重，女有良好婚緣。日柱丙子，熱燥者須戒驕戒躁，尋濕氣以求貴氣。寒濕者須奮起精神，勤吸收知識，以壯膽志。"},
        { "干支": "丁丑", "註解": "陰火坐濕土，膽小心細，多疑慮。四柱中火旺見金，有才學、富裕，有慈愛之心。水旺無火，優柔寡斷，多疑慮。土多透幹，多思慮，易生邪念。火旺見水，有官位，有德有才。日柱丁丑，應善於解放思想，欲求與時俱進，不可保守狹隘，暗生疑慮。"},
        { "干支": "戊寅", "註解": "戊寅日柱，性格複雜，多變化，時有傲氣，也能自我節制。生冬季、初春，見火有德、有才學；見土助，也厚道人。土孤，木雜成局，易招刑傷。金旺雜，常生邪念，一生災難重重。生夏季，水旺，有能力，興事業。水孤則易貧困宜積極求財、較不利婚姻。土木平衡，婚姻關係良好。日柱戊寅，得勢不驕，失勢不卑。處事須謹慎小心，避免盲目追隨。"},
        { "干支": "己卯", "註解": "己卯日柱，心細膽小，心胸較狹隘，知識面窄，固執己見，進取心弱，自我封閉性強宜多方求知識。生冬季、初春，見火有德、有才學；見土助，也厚道人。土孤，木雜成局，易招刑傷。金旺雜，常生邪念，一生災難重重。生夏季，水旺，有能力，興事業。水孤則貧困宜學習理財、不利婚姻。土木平衡，婚姻關係良好。日柱己卯，應開闊眼界，廣泛全面地學習知識，走出小圈子，廣交朋友。要活潑瀟灑，不要暮氣沉沉。"},
        { "干支": "庚辰", "註解": "庚辰日柱，辰為潤土，庚金親和辰土，不怕火旺，不愁水濕。有韌性，個性穩重，計算性強。木旺，興事業。火純，有德有才。水純，有才華。金多有害，易傷他人而不自知。土多，心易生邪念，多空想。日柱庚辰，創業時，可計劃周全。與人交往，不可過於算計。不要急功近利，更不要強求別人報答。"},
        { "干支": "辛巳", "註解": "辛巳日柱，心性較為複雜，內性多動變，容易急躁，有時也生狠心，得勢易驕橫，失勢易暗藏禍心。金有根氣，德厚慈善。金有助，見濕潤土，有德有才。金弱火多，常生狠毒之心，常失控發火應學習理智。水雜無木，常生邪念宜學道德觀。金有根見水木相生，有能力，興事業。日柱辛巳，應進德修業，力求具備良好的道德修養。若給人以狠毒，必然自招殘悲之果。應慎之！戒之！"},
        { "干支": "壬午", "註解": "壬午日柱，做事認真，求業心切，依賴性強，務實性強，任性執著。水、火既濟，有德有財，成富裕人。金根旺，有才能、有德。木雜，心性多動，操勞成疾。水孤弱，招傷病。木火共旺，招傷刑。日柱壬午，要開闊眼界，廣泛吸收知識。處事不可過於執著，要有靈活性，勿想多做少。"},
        { "干支": "癸未", "註解": "癸未日柱，性格脆弱，喜怒哀樂常發，內性有急躁情緒。水旺，有涵養，有才。見陽木，易生不良之心，不利婚姻。金純旺，有才學、貴氣。水孤土燥，易惹禍招災，較不利婚姻。日柱癸未，須注意平靜心態，應開闊眼界，廣泛全面地學習知識，走出小圈子，廣交朋友，冷靜心寬為貴。"},
        { "干支": "甲申", "註解": "甲申日柱，木受金制，常自律，內心性多思動，外性常拘謹。木有助，金無衝，人厚道有才學。水純有才學。金雜木孤，招刑傷，夫妻不和。木金平衡有情，配偶有貴氣，才學。火雜無潤濕土，易生邪念，夫妻同床異夢。日柱甲申，宜尋水木之地以求學創業，以助成功。金重之地，受約束，易受傷。火炎之處，犯官災，不易久待。"},
        { "干支": "乙酉", "註解": "乙酉日柱，心胸較狹隘，知識面窄，思慮欠準確開闊，固執己見，進取心弱。木有助，見水，有德、有才、貴氣。火雜無濕潤土，常生邪念，夫妻同床異夢。木孤，金雜成局，易生邪念，招刑傷。日柱乙酉，要廣泛全面地學習知識，力求開闊眼界。為人處事，要放寬肚量，常以德對人。"},
        { "干支": "丙戌", "註解": "丙火貪生助戌中戊土，丁火助丙火旺，辛金受熱烤。性急、做事執著。四柱火旺，個性較暴躁，易惹禍招災，打架鬥歐，不利婚姻，早年易患病。見濕潤土，減災有才學、技能。見氣旺之金，創業富足。見水易招磨難。日柱丙戌，柱中見水，不可求官，也不要去惹事、交官，以免官災。四柱火旺，要注意自我節制，以免受傷刑之苦。宜找濕潤之土，變燥旺為有用，以泄火災。"},
        { "干支": "丁亥", "註解": "陰火近水，心細多思慮，常有憂慮感，不善張揚。火有氣，水有助，德厚有財人。水旺不雜，見陽木，有大才、官位。見巳衝，多災難。火孤，金水氾濫成局，招傷刑。火多水孤，心高命不隨。土雜多，多愁善感。日柱丁亥，應注意養心修性，須奮起精神，勤吸收知識，以壯膽志。要瀟灑活潑，不可過於拘謹。"},
        { "干支": "戊子", "註解": "戊子日柱，事業心強，認真負責，善於操勞，任性、偏固執、守財緊。一生少缺錢財。生冬季，火純有德才。木實，有貴夫。土旺，水孤，較克父、配偶，婚姻多變。土有助，水有泉，執掌財政權。日柱戊子，處事待人要寬容，不可太記人過。得讓人處且讓人，要仗義疏財，積極參與慈善事業。"},
        { "干支": "己丑", "註解": "土坐濕土，個性強，主觀固執，自以為是，守財。水旺透幹，有財富。火生濕土，有才能，人誠實。四柱中見金木相戰，易招刑傷。土過多燥，較不利婚姻。日柱己丑，要增加包容之心，要嚴於律己、寬以待人，要學會散財求義。"},
        { "干支": "庚寅", "註解": "庚寅日柱，任性，斤斤計較個人得失，有決斷力，守財緊，求財善用心計。金有助，木有氣，富裕，興事業。金孤，木雜旺，求財招傷災。金雜木孤，較不利婚姻。金有助，見火，有德有財。日柱庚寅，注意進德修業，信仰宗教大吉。要多生慈善之心，為人處事且忌施狠毒心計。"},
        { "干支": "辛卯", "註解": "辛卯日柱，任性固執，心胸較狹窄，為人處事認真、固執、堅貞。金有助，木有氣，有德有財。金雜木孤，較不利父、妻。金孤，木雜旺，求財招傷災。日柱辛卯，要解放思想，開闊眼界，廣泛吸收知識。要活潑瀟灑，不可計人小過。處事待人不可斤斤計較、太過要求他人。"},
        { "干支": "壬辰", "註解": "壬辰日柱，心性變化大，善動心計，平衡者有德，失衡者狡詐。金純生水，有才學。水有助，有德、有能力。見陰木旺，易生邪念，不務正業。女不利婚姻。水孤、土雜旺，招傷刑。生冬季，見火也有能力、富裕。日柱壬辰，須注意平靜心態，平生謹慎、進德、忠誠。勿以善小而不為，勿以惡小而為之。"},
        { "干支": "癸巳", "註解": "癸巳日柱，心性偏急躁，求財心強，處事執著，得理不讓人。水有根，火有助，有德有財人。水孤，火雜旺，求財招傷災。木雜，心術易不正為己。金有根，有才能。金脆弱，易招傷災。日柱癸巳，要開闊眼界，廣泛吸收知識。處事不可過於執著，要有靈活性。要仗義疏財，積極參與慈善事業。不可太記人過，得讓人處且讓人。"},
        { "干支": "甲午", "註解": "木坐在火土上，木燥要燃火，心性易浮動，個性偏急燥。水旺，有才華，事業輝煌。土濕，有德財，興事業。火炎旺，一生多磨難，早易患重病，較不利婚姻。木有根氣，才華橫溢。火旺克金，易犯刑傷，不利子女、婚姻。日柱甲午，遇事要三思而後行，處事要堅持原則，不可過於感情用事。得勢不驕不躁，失勢不急不惱怒。要重視婚姻關係，感情要專一。"},
        { "干支": "乙未", "註解": "乙木栽在躁土上，性固執，偏急躁，遇事少冷靜，守財緊。水純，利學習。火雜旺，性急躁常幻想，不利婚姻。見脆金，犯官災，不利婚姻。見濕金，有德才、貴夫。日柱乙未，遇事要冷靜，不急不躁。要開闊眼界，解放思想。活潑瀟灑，不可凡事都認真、激進。"},
        { "干支": "丙申", "註解": "丙申日柱，任性、有傲氣，自以為是，固執己見，求財心切。火有助，有才能，興事業、有德才，富裕。火弱金多，易招病傷。火雜，金孤，不利妻、父。木純，有才華。見寅受折磨。日柱丙申，要和氣待人，努力創造和諧的生存環境。不記人過，增強包容性。處事創業，要廣泛地徵求意見。"},
        { "干支": "丁酉", "註解": "丁酉日柱，任性、有傲氣，自以為是，固執己見，求財心切，處事決斷，易感情用事。火有助，有才能，興事業。木濕純，有才華，善用計謀。火雜金孤，較不利妻、父。見卯衝，不利婚姻。日柱丁酉，要和氣、心誠待人。為人要仗義，不可玩權術。要讓利於人，不可斤斤計較，過於在乎個人得失。"},
        { "干支": "戊戌", "註解": "土厚燥成堆，性燥、剛，主觀性強。見濕旺木，外柔內剛，有才能、技藝、官氣。火旺、土多焦，剛暴無節，早年多病，易患皮膚病、血液病、糖尿病，不利婚姻。見庚申生水，有才華，躁剛性減去。陰陽金重見，心神不定，招病傷，女不利婚。日柱戊戌，要注意養生，年、運火炎土焦，病傷禍易發。見乙亥、甲子、庚申年運大吉，當努力創業。水旺年運，也利創業。"},
        { "干支": "己亥", "註解": "己亥日柱，性柔弱，自製能力強，常有壓抑感、守財緊。火純，有德有才。巳衝亥，易多災情，性情不穩定。土有助，有創業精神，富裕人。土孤無火，木雜旺，招傷刑。金純，善操勞。金雜，主奔波勞累。日柱己亥，要開闊眼界，廣泛吸收知識。要仗義疏財，積極參與慈善事業。不可固步不前，要瀟灑的生活，不可太沉悶。"},
        { "干支": "庚子", "註解": "水要洩金，心性多動，奔波勞心。金根深氣旺，有才華，見木成一代名家。金弱，水雜寒，感情多變，身飄零求依，婚姻多變。見火，招磨難。見乾燥土，有才學。日柱庚子，要穩定心性感情，不可感情用事。要感情專一，重視維護婚姻關係。"},
        { "干支": "辛丑", "註解": "辛金陷在濕土中，心性靈活，能屈能伸，善尋疑問，多思考。金有助，有才能。土多見水，有才華。金有根，見水木相生，憑才華致富。金有助，見木火相生，興事業，有官位。金寒水多，憂傷成病較為悲觀，女不利婚姻。日柱辛丑，寒金欲求乾土生，突見水、火，都易生災。需為人坦誠，不可過於施用心計。"},
        { "干支": "壬寅", "註解": "壬寅日柱，有心計，心高性傲，感情易動盪，性急多動。水有助，有才能，見巳、午火，興事業，見丙火性急躁，做事有始無終。水雜旺，易生邪念，易受人騙。金純，有才能。金雜，善於用計謀，學習誠實。木雜，易招災禍，女不利婚姻。日柱壬寅，女性注意維護好婚姻，要穩定感情。處事要重視原則性，少感情用事，既要講誠信，又不可輕易相信別人。力求既不騙人，也不被人騙。"},
        { "干支": "癸卯", "註解": "癸卯日柱，有心計，善於策劃，語言表達能力強，精力旺盛，得理不讓人。水有助，木純，有才能，見火有才華，興事業。木雜無火，生邪念，善鑽營徳薄，易不務正業，不利婚姻，感情不穩定。水孤弱，易操勞成疾，多遇災禍，抱怨天不公。日柱癸卯，要穩中求成，靜思求準。增加寬容性，增強忍耐性，要寬以待人，嚴以律己。對人對事，不可求全責備。"},
        { "干支": "甲辰", "註解": "甲辰日柱，創業心切，重視收入，守財緊，任性，有韌性，善於理財。木有根，土有助，有德財，求財有道。土有根，見純金，有德才，官位。木雜土薄，無火，易克妻父。木有根，火純，有才華，興事業。日柱甲辰，要仗義疏財，積極參與慈善事業。經常吸收知識，不可固步不前，要廣泛聽取其他人建議。"},
        { "干支": "乙巳", "註解": "陰木坐在火上，心性偏急躁，感情波動大，心高多幻想。見潤濕土，生慈愛之心。火多，一生多磨難，易患肝病，不利婚姻。見金火相戰，易招刑傷，較不利婚姻。水旺，有生機，見亥水則招挫折磨難。日柱乙巳，要注意靜心養性，穩定情緒，不可忽冷忽熱。處事要面對現實，不可期望值過高。"},
        { "干支": "丙午", "註解": "丙午日柱，個性剛強，火多災病多，剛暴有加。水大制火，外柔內剛。金水弱，一生多難，較不利婚姻。水旺，有德成大財。金重，有能興大業。金生水氾，成就大事業。土雜無金，易惹禍招災。日柱丙午，應注意靜心思過，遇事三思而後行，不可急性作事、盲目行事。更不要自以為是。學會靜心思定最為有利。"},
        { "干支": "丁未", "註解": "丁火有助，火勢不弱，火土有燥氣。個性稍急，心細，常思考，處事有熱情。金純有財富、有才能，興事業。金生旺水，有官位。土雜無金，易多生邪念，一生空忙碌，較不利子女，女不利婚姻。燥土過多，易患糖尿病、血液病、呼吸系統疾病。日柱丁未，要注意每臨大事有靜氣，冷靜處事，不感情用事。要有靈活性"},
        { "干支": "戊申", "註解": "戊申日柱，有心計，善於操勞，為人處事熱心，善於交際。土有助，金純，有才華，見水，才華橫溢，興事業。金雜，善計謀，為人學習誠實。見木，有災難，女不利婚姻，木雜災重。寅年、運易生災。日柱戊申，女性注意維護好婚姻，不可期望值過高，也不可因事業而忽略夫妻感情。為人時刻注意誠信，誠實為根基。"},
        { "干支": "己酉", "註解": "己酉日柱，有心計，多思慮，心高性傲，稍偏躁。土有助，金純，有才能，見水，才華橫溢，興事業。金雜，想入非非，不安本份，易招傷災，女不利婚姻。木雜，多災情，招刑傷，女不利婚姻。卯年、運易生災情。日柱己酉，女性注意維護好婚姻，不可期望值過高。要面對現實處事，不可過於幻想、空想。要腳踏實地的做事，不可輕挑浮躁。"},
        { "干支": "庚戌", "註解": "庚金坐在燥土上，性剛暴燥，難與人和諧相處學習和諧。四柱中火炎土焦，暴烈無節制，無端發怒耍脾氣，惹事招病傷學習冷靜。見濕木，減燥氣、災情，有財富。水旺，有才華，自己經常注意自我節制。日主庚戌，易受人孤立，特別是在家庭中，家人多畏而避之。要注意自我修養，多吸收知識，少自以為是、無端耍脾氣。"},
        { "干支": "辛亥", "註解": "辛亥日柱，善用計謀，求財心切，心高。水雜，感情多變，女不利婚姻。金有根，見木，有才能，興事業。見乾土有才學。火雜，招災禍，女不利婚姻。日柱辛亥，當注意為人處事誠實、誠信，要踏踏實實的做人，認認真真地做事。"},
        { "干支": "壬子", "註解": "壬子日柱，內性剛，水旺性決斷。見巳火、戌土、未土、丁火，生慈善之心，外弱內剛，見純木生火，有德才，興事業。金雜，易生邪念。木雜無火，太過自我主觀，招刑傷，不利婚姻、子女。水雜旺，不利婚姻，也易犯罪。日柱壬子，信仰宗教大吉，克制自己不招惹他人，增強忍耐性，增加寬容性。"},
        { "干支": "癸丑", "註解": "癸水下面是濕泥，心眼較多，善動心計。水火既濟真貴命。水有根氣，火有根基，興事業，有官位。木雜無火，性刁鑽應學修養寬容，不務正業。火土共旺困弱水，須防牢獄之災。日柱癸丑，須把聰明才智用於積德創業，不可日想夜思近路。積善必有厚福，私心過重則成惡，集惡必成禍殃。"},
        { "干支": "甲寅", "註解": "甲寅日柱，個性強，主觀意識強。比、劫林立必成災，不利婚姻、易窮困學理財，個性固執。見火旺克金，易招刑傷。見厚潤土，有才能，成大富。見濕土生金，有克制能力。重金圍木，外柔內剛。火旺雜無土，早傷克親屬。日柱甲寅，應注意創造和諧活潑的生存、生活環境，遇事多徵求別人的意見。創業時，力求民主決策，善於否定自己，應多充實知識增加自信心。"},
        { "干支": "乙卯", "註解": "乙卯日柱，個性強，有威嚴，自主意識強。金多增貴氣，有節制，生慈愛之心。比、劫林立，固執己見，易窮困學理財，較不利婚姻。見潤土生金，有官位，有德有才能，興事業。火雜旺無土，不務正業，不利婚姻。日柱乙卯，要注意增加寬容之心，要每臨大事有靜氣，要增強韌性。"},
        { "干支": "丙辰", "註解": "丙火生潤土，多思慮，一生奔波，善於操勞，心性多動，創新意識強，愛發洩，期望值高。土雜多無金，一生空忙祿學習規劃，較多磨難，不利子女，女不婚姻。火有根，土純見金，有才能，興事業。火孤弱，多想少做，做事有始無終。見水木相生，有官位。日柱丙辰，應多吸收知識，少表現，做事要準確、穩妥。份內事要做好，不可介入份外事。"},
        { "干支": "丁巳", "註解": "陰陽火助燃，性剛易生雜念，佔有欲強。見濕潤土生金，有德才，成就大業。見衝、刑、合，都易生邪念，不利婚姻。見金水相生，無衝克，也能成就事業。木多雜幹生火，易做惡事。日柱丁巳，應時刻注意修德養性，靜心思過，遇事三思而後行。逐漸認識到貪欲占私，都是惹禍災之源。宜學習付出關愛。"},
        { "干支": "戊午", "註解": "乾土騎黃馬，乾土逢火烤，成燥厚欲烈之土。性剛急躁，主觀意識強。見水旺木濕，外柔內剛，有克制性，成就大事業。見陽金生水，有德才，興事業。金雜無水，自以為是，多行不義。火炎土焦，惹禍招災，早生重病。日柱戊午，要尋金水旺、木濕環境住宿、生活、工作。要增強忍耐寬容之心性，多取他人之長，常避自己之短。"},
        { "干支": "己未", "註解": "陰土坐在乾土上，心性偏剛急，主觀意識強，有傲氣，愛議論他人是非。水旺，有能力，興事業。木濕，有貴氣，利求官。金雜，多磨難，不利婚姻。火炎土焦，多充實學識知識。日柱己未，要避開乾燥之地住宿、活動，要靜心養性，以平和心態對人對事。對高者不媚，對低者不貶。得勢不驕，失勢不卑。"},
        { "干支": "庚申", "註解": "庚申日柱，個性剛強，意志堅定，自主意識強。火旺煅之，生慈心，外柔內剛。比、劫林立，克親屬，不利婚姻。水雜無木，易心事重重學習溝通，女不利婚姻。日柱庚申，要注意多參與慈善事業，要修德養性，不可生傷克生靈之心。學習慈悲體諒。"},
        { "干支": "辛酉", "註解": "辛酉日柱，個性強，決斷意志堅強，自主意識強，任性固執。火多旺煅金，有官位，生慈心，外柔內剛。比、劫林立，克親屬，不利婚姻。水雜無木，心事重重學習溝通，女不利婚姻。水純，有才能，見木興事業、富裕。日柱辛酉，要廣泛吸收知識，專心學習一門專業。要增加寬容之性，增強慈愛之心。"},
        { "干支": "壬戌", "註解": "水被燥土困激，性情不穩定，波動變化快，時急燥、時怒、時喜。四柱中木多幹，常生邪念，招災禍。火炎、土焦，經常焦躁不安，早患重病。見亥、子水旺，有才學，涵養性提高。見申金有才學。見金水相生，有才學、興事業。日柱壬戌，要注意情緒的穩定性，水有根氣，一生富而有才華。要尋金水以避燥氣。"}
    ];
    
    var 論斷項目='<span class = "傳統論斷項目">六十日主論斷 ②</span><br>';
    var 資料索引=_.findIndex(六十日主論斷2資料, {干支: 日柱});
    
    if (資料索引 != -1) {
	    return 六十日主論斷2資料[資料索引].註解;
	}
	else alert("六十日主論斷② 沒有搜尋到資料！");
}

function 六十日主論斷1(日柱){
	var 六十日主論斷1資料 = [
        { "干支": "癸亥", "註解": "癸亥日生，為人剛直，言語坦然，不順人情；六親疏遠，交往淡淡；自立家業，女人緣旺，家庭坎坷，誠信待人，保養健康。"},
        { "干支": "甲子", "註解": "甲子日生，多學少成，防止有始無終；心性暴躁，幼年多災。重拜父母，飲食保養；兄弟骨肉少靠，有子多刑。男人妻大，女人夫長；伶俐聰明賢能；受人尊重，社交風波多。"},
        { "干支": "乙丑", "註解": "乙丑日生，慷慨大方，喜愛春風，多學少成，幼年現災，父母重拜；九流中人，夫妻無刑，兒女不孤，六親少靠；女人賢良純和，但求財心切，需體恤家庭。"},
        { "干支": "丙寅", "註解": "丙寅日生，多學少成，心性不定；口快舌硬，身閑心直，手足不停，利官近貴，女人賢良，聰明伶俐，辛勤收獲。"},
        { "干支": "丁卯", "註解": "丁卯日生，手足不停，身心不閑，內外有勞，衣祿不少，性巧聰明，做事有頭少尾，男人福份之命，女人企圖寧靜，操勞中有幸而獲，防不知足。"},
        { "干支": "戊辰", "註解": "戊辰日生，喜氣春風，利官近貴，骨肉刑傷，兒女不孤，女人溫良賢達，有口無心，烏鴉嘴豆腐心，主招好夫，防止誤會。"},
        { "干支": "己巳", "註解": "己巳日生，聰明才智，手足伶俐，小有功名，做事如意；夫妻和睦相處，諸事可為；女人衣食住行不缺，善良待人；男人多出風頭，小有計謀，資性英敏，福厚之命。"},
        { "干支": "庚午", "註解": "庚午日生，口快心直，利官近貴，小有殊榮，衣祿豐盈。男人權柄，辛勤持家，外面固執，有人欽佩；女人秀氣，約顯美感，榮夫益子，鄰裡欽佩。"},
        { "干支": "辛未", "註解": "辛未日生，生有志氣，心性寬容仁義，少年災病；中年約好，頭胎見女更吉，生男有刑克；夫妻和睦相處事業順利；女人持家方興旺，男人顧家，多利業。"},
        { "干支": "壬申", "註解": "壬申日生，性巧聰明，才智少顯，計謀多變，誠信待人接物，功名有份；有賢妻子，為人英敏，受人喜歡；女人美麗，博得人助。"},
        { "干支": "癸酉", "註解": "癸酉日生，心直公平，伶牙俐齒，防言多失；衣祿自儉，有備無患，平穩足用；六親冷淡，自謀求生；社會交往，多有人愛，雖事不成，少取勿貪，百業可為；女人助夫，勤儉持家，晚年幸福。"},
        { "干支": "甲戌", "註解": "甲戌日生，口快舌伶，身閑心不空，少年貧民，中年奔波，約有權職，心機謀略，多學少成，小有名聲；晚景福祿延年，自珍自愛益壽；助人惹怨，妒忌常伴而來。女人旺夫，勤儉興家。"},
        { "干支": "乙亥", "註解": "乙亥日生，為人和順，幼年多災，父母有刑，誠實待人接物，出來稍好；女人夫好、和睦相處、偕老，存心中正，中年財旺，防勞致病；婚遲子晚，子女防克，重拜義母，嚴教成才。"},
        { "干支": "丙子", "註解": "丙子日生，膽大言廣，有權謀，心機詭詐，早年平平，中年成就，晚景大好，女人饒舌，言多有失，安分守己，避免麻煩，幸福自來。"},
        { "干支": "丁丑", "註解": "丁丑日生，為人和睦，衣祿不愁，初年有旺祿常在，晚景大好，更有結余，婚遲子晚，夫妻和睦相處，則百事順利。女人旺夫愛子，孝敬，持家賢良。"},
        { "干支": "戊寅", "註解": "戊寅日生，性格猛烈，剛強招禍，交往閑雜，小人無情；早年勤儉，離祖發達，聰明才智，手足伶俐；晚年大有良機，不可莽撞，得安寧，有幸福。"},
        { "干支": "己卯", "註解": "己卯日生，為人交往廣泛，風流倜倘，衣祿豐足，閑情逸致，嬉戲娛樂，有人尊從；六親冷淡，自立為上，骨肉難為，妻招年長，配偶和睦；女人注意鄰居關系，自我解脫，曠達胸懷，長壽，親族賢達。"},
        { "干支": "庚辰", "註解": "庚辰日生，春風和氣，勞祿雪霜一生，利官近貴，名利雙全，衣食足用；中年平順，晚年大興，女人勤儉，持家有方，受人敬仰，坎坷風波。個別命運身體衰弱，注意健康，平安為福。"},
        { "干支": "辛巳", "註解": "辛巳日生，友善機謀，能應變，志氣過人，衣食足用；有貴人扶助，中年和順，老有福運，心安理得，知足常樂，可以長壽。"},
        { "干支": "壬午", "註解": "壬午日生，為人勤儉，父母刑傷，早年財物不順利，存儲不多，中年勞心，稍有所得，晚景旺子，事應積蓄，防備缺乏。女人興家，賢能自達，恆心有獲。"},
        { "干支": "癸未", "註解": "癸未日生，心急口快，為人伶俐；救人無恩，反招是非，曲直難辯，多有誤會。有財無庫，過眼煙雲，財來財去，精打細算，可免禍災；女人賢惠，勤儉持家；晚景平安。"},
        { "干支": "甲申", "註解": "甲申日生，衣祿不少，心性溫柔，出入有為，技壓群芳，初年不順，中年勞神，晚景利達；夫妻和順，兒女遲到，女人操勞，忍耐莫逆，家事平安。"},
        { "干支": "乙酉", "註解": "乙酉日生，口快心直，軒昂大方，樂觀；衣祿足用，兄弟雖有，難為助力；與人善良，事業成功；女人興旺，小有蓄財，平穩，求安。"},
        { "干支": "丙戌", "註解": "丙戌日生，性情溫和，技藝護身，衣祿不愁，豪杰和順，自能有財；獨立家業，前運不周，利益不順，中年操勞，錢財有進，晚年榮華。"},
        { "干支": "丁亥", "註解": "丁亥日生，性巧聰明，小有才智；獨立自營，奔波操勞，兒女有利，見遲方好；好為善事，稍微旺財；女人貞節自愛，貴人幫助，幸有財運，衣祿平穩。"},
        { "干支": "戊子", "註解": "戊子日生，聰明伶俐，才智有余，文武兩通，兒女早產防克；財運不錯，男人須防色難；女人自珍，賢慧發福。"},
        { "干支": "己丑", "註解": "己丑日生，口快心直，通技藝人，能掌實權，誠意待人，博得眾望，衣祿不少；男人防再娶，家庭當和睦相處。女人晚年發福。"},
        { "干支": "庚寅", "註解": "庚寅日生，心性急快，有口無心，大事有藏；易好易怒，性情反復無常，傷人還不知道，易結人緣，也易失人緣；衣祿足用，早年不蓄財物，中年奔波，晚景豐隆。女人內助，好事發達，勤儉有得。"},
        { "干支": "辛卯", "註解": "辛卯日生，口快心直，有志氣，有權柄，利官近貴，身閑心不空；六親少靠，自立家業，少年勞祿，晚年大利；女人持家，操勞，勤儉節約可興隆。"},
        { "干支": "壬辰", "註解": "壬辰日生，勞祿之人，手足無停；早年難守，財來財去，晚景發達。女人操家，勤奮興旺。"},
        { "干支": "癸巳", "註解": "癸巳日生，聰明伶俐，近貴人，中年風霜，慎重守護已成之事業，晚景好。"},
        { "干支": "甲午", "註解": "甲午日生，為人和氣，好娛樂；青春好風流，交往朋友，利官近貴，逢凶化吉，骨肉少靠。女人口快，心直能言；防止禍不單行。"},
        { "干支": "乙未", "註解": "乙未日生，少年勤儉，初年平順；兄弟少靠；子息不孤；晚年聚財，可以興旺；女人持家，相夫旺子，精打細算。"},
        { "干支": "丙申", "註解": "丙申日生，衣食豐足，利路亨通，技能生財；早年勞祿，女人持家，勤儉節約，旺相發達。"},
        { "干支": "丁酉", "註解": "丁酉日生，喜好面子，多情重恩，緣份奇特；利官近貴，初年勞累，身閑心苦，晚年興隆，子女有為。女人清秀吉昌。"},
        { "干支": "戊戌", "註解": "戊戌日生，為人和氣，獨立自營；早年顛倒運程，是非耗財；中年貪求，欲望很高，遭人妒忌，宜自重，苦學技藝，靠技能發達之命。"},
        { "干支": "己亥", "註解": "己亥日生，聰明伶俐，衣食安穩，骨肉少力，六親冷淡，兒女早見刑克，遲到稍好，夫妻和順。女人清閑，晚年好。"},
        { "干支": "庚子", "註解": "庚子日生，穩重平順，衣祿無虧，妻子賢惠，持家有方，建交貴人，提拔機遇，逢凶化吉。女人興旺，福蔭家庭。"},
        { "干支": "辛丑", "註解": "辛丑日生，心性溫和，初防驚恐，意外之厄；雖有衣祿，骨肉少力，晚年好，女人旺家，事多發達。"},
        { "干支": "壬寅", "註解": "壬寅日生，為人口快心直，男女都不能早結婚，夫妻防克，兒女宜遲，初年顛倒，中年興旺。女人如意，發福之命。"},
        { "干支": "癸卯", "註解": "癸卯日生，衣食不少，凶中化吉，早年不順，財來財去，晚年好。女人操持之命，遭遇妒忌，好事難全，少年弱，中年勞祿，老有歡樂。"},
        { "干支": "甲辰", "註解": "甲辰日生，衣食豐足，清閑心情，早年較弱，中年勤奮，情感波折，事業發達，晚結婚，子女宜遲，幫助多。"},
        { "干支": "乙巳", "註解": "乙巳日生，為人好面子，救人無功；好事莫望；早年子女刑克，晚年安寧。女人助夫愛子。"},
        { "干支": "丙午", "註解": "丙午日生，身閑心不空，初年耗財，宜做基礎，技能工夫，求名不利，事多爭端，兄弟各方。女人青秀，思維奇妙。"},
        { "干支": "丁未", "註解": "丁未日生，喜怒無常，口舌能言，名利不缺，骨肉疏遠，子息遲到；衣祿豐足。女人有旺運，勤儉能興家。"},
        { "干支": "戊申", "註解": "戊申日生，為人性急，易反復無常；一生勞祿，利官見貴，兒女刑傷，財庫富足。女人有旺運，勤儉能興家。"},
        { "干支": "己酉", "註解": "己酉日生，為人聰明，衣祿豐足，六親少靠，兒女早見；凡事寬量，百事通達。女人技巧多變，少災之命。"},
        { "干支": "庚戌", "註解": "庚戌日生，為人快活，丑未防災；利官近貴，敏捷聰明，福氣晚年，救人無義。女人心賢，勤奮才興家。"},
        { "干支": "辛亥", "註解": "辛亥日生，不惹閑事，清靜守中；早年不聚財，晚景榮華富貴。女人勤儉，福豐，助立家業。"},
        { "干支": "壬子", "註解": "壬子日生，幼年顯災，中年衣食豐足，男有好妻，身閑心勞，多喜多憂，奔波事業；兄弟少力，六親冷淡，勤奮自立。女人賢能，防止嫉妒。"},
        { "干支": "癸丑", "註解": "癸丑日生，衣祿不少，一生尊重；莫惹是非，父母難為。骨肉少靠，夫婦和睦相處，順利，兒女見遲；財物早年難聚，波折。"},
        { "干支": "甲寅", "註解": "甲寅日生，為人誠實，利官見貴。家道興寧，父母有利，重拜雙親。男人怕妻，命硬三分。女人管夫，子息長。"},
        { "干支": "乙卯", "註解": "乙卯日生，志氣軒昂，衣祿豐足，計巧精妙，言行有詐，有成有敗；文武兩筆，坎坷難免，金石為開，一事可成。女人福氣，勤儉添壽。"},
        { "干支": "丙辰", "註解": "丙辰日生，聰明才智，手足伶俐，衣祿無虧；身閑心勞，愛交朋友，中年興隆。女人賢能，勤儉建家。"},
        { "干支": "丁巳", "註解": "丁巳日生，為人剛強，利官近貴，個性乖巧，不易順從；兄弟居長，事業顯榮。女人賢惠，勤奮發達，熱誠事業，防有頭無尾，宜精益求精，專心致志，精打細算。"},
        { "干支": "戊午", "註解": "戊午日生，為人溫良，志氣寬宏，衣祿豐足；少年多災，骨肉有刑，夫妻顯克，女人親屬少幫；中年勤奮，有收獲；夫妻性格欠協調，影響健康，老可無憂，子女孝順。"},
        { "干支": "己未", "註解": "己未日生，口快舌硬，衣祿小有，得貴人幫，勤奮敬業，精打細算，財源不絕。交往朋友，避免閑雜。"},
        { "干支": "庚申", "註解": "庚申日生，手足不停，為人清高，利官近貴。夫妻口角，煩多愛少。做好事難得好報，救人無功，遭遇妒忌。女人興家，六親冷淡。"},
        { "干支": "辛酉", "註解": "辛酉日生，為人伶俐，面氣清爽，艱苦事業，自謀高見，口舌能言，高人敬重，財力廣大，六親冷淡，骨肉情疏，女人賢達。"},
        { "干支": "壬戌", "註解": "壬戌日生，好行善事，四處不停，心勞憂多，衣食不缺，結交貴人，提拔事業，早年平，中年勞，晚年好。女人賢惠，操勞興家。"}
    ];

    var 論斷項目='<span class = "傳統論斷項目">六十日主論斷 ①</span><br>';
    var 資料索引=_.findIndex(六十日主論斷1資料, {干支: 日柱});
    
    if (資料索引 != -1) {
	    return 六十日主論斷1資料[資料索引].註解;
	}
	else alert("六十日主論斷① 沒有搜尋到資料！");
}


function 六十日主論斷3(日柱){
	var 六十日主論斷3資料 = [
        { "干支": "癸亥", "註解1": "日干坐刃，氣性剛，無節制則暴孽，節制平衡則成棟樑材。", "註解2": "癸水坐亥水之上，干支同氣癸水有持無恐，喜友多識慷慨愛面子。配偶多智慧不善理財。", "註解3": "玄武日，坐刃，喜歡獨斷專行，武將不善終。", "註解4": " ①鼓盆煞多剋妻。 ②喜愛文學。 ③女性，有離婚之可能。 ④女人，四十歲左右剋夫。"},
        { "干支": "甲子", "註解1": "日干坐正印，日干坐正印，內依賴性強，外有抗災耐力。", "註解2": "甲木坐子水，水能生木，甲木一生享用。甲木好學見識廣，小氣多疑心。配偶內向善家務真情奉獻。", "註解3": "甲木為棟梁之木，木主仁，坐下正印，為身高體健，慈愛愷悌，相貌俊秀。印為文書，身坐文書，主才學超群，有權柄。印又有生身助學之功，故主人記憶力強，學習成績優秀。", "註解4": " ①精明，善於做人，處世練達。 ②甲子日、甲子時之女命，長子多夭折。 ③乙亥時生，目疾。 ④女人、夫人命。 ⑤容貌出眾。 ⑥女人性烈。"},
        { "干支": "乙丑", "註解1": "日干坐丑的人，多生疑惑之心，內性多疑，外性穩定。丑土內含辛金、癸水、己土，自成濕寒體系，旺火親和濕土。可泄火旺氣，怕水勢浩蕩。", "註解2": "乙木坐丑土，丑土是濕土可以滋養乙木，乙木善良勤奮善理財。配偶任勞任怨默默貢獻。", "註解3": "六秀日，主人秀氣漂亮，身坐金庫，無根，坐下七殺無制，自信心太過，往往一意孤行。", "註解4": " ①女命，有再婚之可能。 ②男命得賢妻之助，在事業上有大發展。 ③性固執。 ④靠實力、不靠運氣。"},
        { "干支": "丙寅", "註解1": "日干坐偏印，底氣旺盛，耐力強。", "註解2": "丙火坐寅木，木能生火，丙火得能源支助，精力充沛好學講義氣，喜功。配偶能幹海派。", "註解3": "丙為太陽，身坐長生，有光彩之象，主人聰明，但坐下梟神奪食，不吉。生于冬至后夏至前，戊土長生于寅，食神旺，主人聰明，吉；生于夏至后冬至前，戊土長生在申，食神弱，稍差。", "註解4": " ①鼓盆殺剋妻。 ②專心執著，老於世故，深藏不露、人秀氣，多長壽。 ③身份富貴、光輝照人，易受嫉妒。"},
        { "干支": "丁卯", "註解1": "日干坐偏印，底氣旺盛，耐力強。", "註解2": "丁火坐卯木，木能生火，丁火能源充足，精力好，好學不倦，膽大細心。配偶能幹多智。", "註解3": "坐印通根，主人聰明有學問。若四柱出現亥卯未三合局或寅卯辰三會局，為大貴人，但身坐偏印，只能為副職，輔佐他人。", "註解4": " ①見己土，好美食。 ②女人、不受婚姻之拘束。 ③無心傷害他人（利害得失之判斷較差）。 ④精神易遭挫折、身體多病。"},
        { "干支": "戊辰", "註解1": "日干坐祿，個性強，主觀意識強，克洩平衡則能成就事業。", "註解2": "戊土坐辰土，干支都是土，戊土力量大，身強體壯，敦厚好交友，有財。配偶如友能蓄財。", "註解3": "通根身旺，坐財官比肩，但支中比肩財星化火為印，變成官印相生，故主高貴。支內戊癸化火生土，而辰本為濕土，內中有火，溫暖中和，能生萬物，必然根深葉茂，秀氣有成。", "註解4": " ①多富貴。 ②善良，能憐貧恤老。 ③相當自信。 ④有時因風頭太大而引起衝突。"},
        { "干支": "己巳", "註解1": "日干坐刃，氣性剛，無節制則暴孽，節制平衡則成棟樑材。", "註解2": "己土坐巳火，火能生土，己土能源充足，精力充沛，心善巧思足智多謀。配偶多智名氣響。", "註解3": "金神，主人剛毅、聰明，有火則貴，卻火則不吉。坐下正印、劫財、傷官，傷官佩印，貴不可言，但傷官遇劫，易遭小人陷害。", "註解4": " ①鼓盆殺剋妻。 ②為某方面之頭人，運勢強旺。 ③容易引起衝突。 ④女命夫緣易變。"},
        { "干支": "庚午", "註解1": "日干坐官，日干與官都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "庚金坐午火，金怕火，庚金如坐針氈，心善性急，急功近利，還算好學。配偶有威嚴性急。", "註解3": "身坐正官正印，氣質清純，必主官貴，但金坐火地，須經火煉，千錘百煉，所以仕途坎坷，有大起，也有大落。", "註解4": " ①多痔瘡、風濕之疾病。 ②容易親近，也容易分開。"},
        { "干支": "辛未", "註解1": "日干坐偏印，底氣旺盛，耐力強。", "註解2": "辛金坐未土，未土能護金不能生金，辛金還算好學，怕生喜財。配偶如母如師有小財。", "註解3": "得庫通根，身旺，坐下偏財、偏印、七殺，一片順生，主小貴，吉。", "註解4": " ①卯月生人富，冬月生人貴。 ②性格與外觀相反。 ③女性與公婆不和，婚姻不理想。"},
        { "干支": "壬申", "註解1": "日干坐偏印，底氣旺盛，耐力強。", "註解2": "壬水坐申金，申乃水源地，壬水精神充沛好學不倦，心寬格局大喜功。配偶智慧高能幹。", "註解3": "身坐長生，太旺，主人好動不拘。納音劍鋒金，男命敢于拼打爭斗，易受傷。女命具男性風格。", "註解4": " ①宜晚婚。 ②女人老年安樂，能生貴子。 ③身份高貴。 ④行事積極，若率爾操之，容易受人誤解。"},
        { "干支": "癸酉", "註解1": "日干坐偏印，底氣旺盛，耐力強。", "註解2": "癸水坐酉金，酉屬西方水鄉，癸水體力佳，好學，孝順，就是小氣多疑心。配偶能幹多勞。", "註解3": "坐偏印，金神，外表柔和，內心深沉。富于心計，會掙錢，但也會花錢。", "註解4": " ①忌生於巳、午月，身弱。 ②女性，有自力謀生的能力。 ③家庭生活單調。 ④女人，夫運不佳。耐性不大，常為瑣事煩心。"},
        { "干支": "甲戌", "註解1": "日干坐戌的人，心情易急躁、激動，也愛發洩。戌屬燥土，其中含丁火、戊土、辛金，自成燥熱體系。四柱中戌土熱燥、多見，極易患血液病、皮膚病、呼吸系統疾病、糖尿病。", "註解2": "甲木坐戌土，木剋土，甲木緊抓戌土，代表熱心勤勞多祿，書本少近。配偶大而化之有財。", "註解3": "得庫通根身旺，坐下偏財正官傷官。", "註解4": " ①本性善良。 ②夫妻緣份好，忌偏財多。 ③與生父母的緣較薄。 ④女命，子嗣賢良。性溫和、運氣平穩。"},
        { "干支": "乙亥", "註解1": "日干坐正印，日干坐正印，內依賴性強，外有抗災耐力。", "註解2": "乙木坐亥水，水能生木，乙木多智能幹心慈，還帶有財氣。配偶多智多才幹有財。", "註解3": "雖正法地，卻坐下為正印劫財幫身，故有枯木逢春之象。", "註解4": " ①容易得消渴勞疾。 ②女性夫子之緣不佳。 ③沉靜、理性，由於較杞人憂天，以致常錯失良機。"},
        { "干支": "丙子", "註解1": "日干坐官，日干與官都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "丙火坐在子水上，使丙火裹足不前，羞怯內向做事謹慎，仍有果斷一面，配偶內向多慮。", "註解3": "為六秀，主人聰明秀氣。丙火坐子無根，主人身矮。丙為太陽主光明，而子鼠桀黠，子中癸水陰濕，故主人性格雙重。身坐正官，一權在握，往往自以為是，獨裁固執。", "註解4": " ①配偶很好，女人婚後能享福。 ②一生無衣食之憂。女人與婆婆不和。 ③精明，但死心眼。 ④富獨創研究性格向新事業挑戰。"},
        { "干支": "丁丑", "註解1": "日干坐丑的人，多生疑惑之心，內性多疑，外性穩定。丑土內含辛金、癸水、己土，自成濕寒體系，旺火親和濕土。可泄火旺氣，怕水勢浩蕩。", "註解2": "丁火坐在丑土上，丁火雖懦弱毅力不減，勤勞謹慎守財，講情意。配偶安靜多藝。", "註解3": "丁火坐丑無根，但丁為星光，無妨。坐下偏財、七殺、食神，食神生偏財，偏財生殺，也一片順生，吉祥。", "註解4": " ①女人中年夫妻變緣。 ②夫妻難得和好相處。 ③運勢平穩，很有表現力。 ④對金錢的開支與否相當執著。"},
        { "干支": "戊寅", "註解1": "日干坐殺，日干與殺都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "戊土坐寅木之上，寅乃戊土長生之地，戊土為人謹慎朋友廣，好學有遠見。配偶能幹大方。", "註解3": "坐長生，身旺。生于春，則坐下七殺太重，一生辛勞，多為人造福。", "註解4": " ①美中有缺。 ②一生無衣食之慮。 ③見乙卯富貴。 ④身份高貴，有意外之福。 ⑤樂觀，但忌鋒芒太露。 ⑥古之親王、貴公子，多生於此日。"},
        { "干支": "己卯", "註解1": "日干坐殺，日干與殺都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "己土坐卯木上，木能剋土，己土膽小律己，溫和手藝好。懼配偶型。", "註解3": "坐殺截腳，為最差之日，人命己卯，易殘疾、受傷，一生較為辛勞。", "註解4": " ①夫妻為兒女常發生爭論。 ②不活潑。 ③女命為貴夫人。 ④容貌出眾、統領格，但成功須倍於他人努力。 ⑤常遭橫禍怪異之事。"},
        { "干支": "庚辰", "註解1": "日干坐偏印，底氣旺盛，耐力強。", "註解2": "庚金坐在辰土之上，土生金，庚金自信心強，思慮遠，處世有情。配偶多智善家務稍嘮叨。", "註解3": "身坐正財、傷官、偏印，主人有財祿，聰明有學識，支中傷官帶偏印有貴氣，而戊癸化火為官殺，變成日坐財官，可做官，但隱含傷官，較有氣勢權威。", "註解4": " ①日德，心地善良；忌庚戌。 ②女人夫緣不佳、紅顏命薄，才情勝男人。 ③精力旺盛、運氣亦強。"},
        { "干支": "辛巳", "註解1": "日干坐官，日干與官都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "辛金坐巳火之上，辛金溫暖有情，自信心強好動，處事圓滿。配偶急公好義，律我嚴。", "註解3": "身坐正印正官劫財，辛金瀛弱，有正印生身，劫財匡助，由弱轉旺，而正官丙火制衡，使干支中和，必主官貴，富于成功。", "註解4": " ①幼年患大病。 ②男命妻多病；女命夫善變。 ③性多猜忌疑惑，不易屈服。"},
        { "干支": "壬午", "註解1": "日干坐正財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "壬水坐午火之上，地支火使壬水熱滾滾，壬水聰明熱情有幹勁。配偶性急達觀有幹勁。", "註解3": "坐下財官，無雜氣，多主官貴，丁壬合財，主得妻財或因妻致富。", "註解4": " ①帶佛骨，信仰神佛。 ②一生無衣食之憂。 ③配偶賢良，一生有福氣。 ④容易接近，亦容易分開。 ⑤頭腦靈敏，但思慮欠周詳。"},
        { "干支": "癸未", "註解1": "日干坐殺，日干與殺都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "癸水坐未土上，受未土欺侮之苦，癸水內向無主見，行事中規中矩。配偶能幹有智稍悍。", "註解3": "坐下有食神生財、財生殺，因坐偏財、七殺，故男女命逢癸未，婚姻宜多溝通，包容，協調。", "註解4": " ①胞胎日，縱不富貴，亦無衣食之憂。 ②男性權實、真誠，為妻多勞。 ③多才多藝，聰明、性巧。 ④外似迷糊，其實思慮縝密，很有信心。"},
        { "干支": "甲申", "註解1": "日干坐殺，日干與殺都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "甲木坐申金上，申中有金有水，甲木外表膽怯內心澎湃。配偶能幹識大體心寬廣。", "註解3": "坐絕地，一輩子辛勞，奔波，但死木逢殺克削，也不失可用之材。", "註解4": " ①天干見庚、為俊男美女。 ②胞胎日生，縱不富貴，亦無衣食之憂。 ③為人較沉不住氣。 ④妻賢。 ⑤紅豔，多男女緋聞。"},
        { "干支": "乙酉", "註解1": "日干坐殺，日干與殺都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "乙木坐酉金之上，如坐針氈，乙木內向多疑心，心善怕事。配偶佔有慾強，固執多心。", "註解3": "坐殺截腳，生在春天有救，生在土月助殺攻身，較為不妙。較多傷病血光之慮。女命乙酉漂亮，浪漫，易早戀早婚。", "註解4": " ①一生無衣食之憂。 ②容易傷殘。 ③女性能力優於丈夫，多離婚。 ④做事非常謹慎，忍受困境的能力比常人強。"},
        { "干支": "丙戌", "註解1": "日干坐戌的人，心情易急躁、激動，也愛發洩。戌屬燥土，其中含丁火、戊土、辛金，自成燥熱體系。四柱中戌土熱燥、多見，極易患血液病、皮膚病、呼吸系統疾病、糖尿病。", "註解2": "丙火坐戌土之上，戌中有土有火，丙火躁氣重行事誇張膽識大，講義氣。配偶豪邁好友。", "註解3": "坐火庫，身旺，火光熠熠，聰明漂亮。", "註解4": " ①夫妻不易相處。 ②性情溫和、勤勉。 ③喜歡管閒事。生於貧家者，中年後運氣上揚；生於富家者、中年後衰微。 ④古代的親王、貴公子多生於此日。"},
        { "干支": "丁亥", "註解1": "日干坐官，日干與官都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "丁火坐亥水之上，丁火行事果敢但忽熱忽冷，文采好神經質重。配偶知識好野心大。", "註解3": "坐下正印官星，官印相生，主聰明超群，丁壬合化印星，坐貴，主官貴，與大貴人有緣。女命丁亥，易嫁貴夫。", "註解4": " ①一生無衣食之慮。 ②少年時代逢凶危，中年起漸健。 ③多富貴。 ④外表溫厚，內富野心。 ⑤內心肝一番計畫，隨時可以展開。"},
        { "干支": "戊子", "註解1": "日干坐正財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "戊土坐子水上，戊土外表豪邁，內地私心重喜財，小氣但有情。配偶刻苦耐勞不求回報型。", "註解3": "六秀日，主人聰明秀氣，坐正財，得賢妻，因妻致富，干支戊癸化火生身，主高貴。", "註解4": " ①聰明。 ②能得到異性的好感。 ③女性與夫不融合。 ④誠實做事，大器晚成。 ⑤冥冥中得人助。"},
        { "干支": "己丑", "註解1": "日干坐丑的人，多生疑惑之心，內性多疑，外性穩定。丑土內含辛金、癸水、己土，自成濕寒體系，旺火親和濕土。可泄火旺氣，怕水勢浩蕩。", "註解2": "己土坐丑土上，干支同氣，己土有持無恐，喜結善緣，多才多藝。配偶溫穩勤奮善友。", "註解3": "通根，比丁丑好，生于得令時為強，比肩奪財爭鬥，生于失令時則有兄弟幫忙。", "註解4": " ①福德，宜居於平洋鬧市。 ②有時木訥陰沈，有時多話。 ③一生之盛衰無常。 ④婚姻物件易變。"},
        { "干支": "庚寅", "註解1": "日干坐偏財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "庚金坐寅木之上，庚金氣勢如虹，氣魄佳有才氣又有財。配偶多智多識心胸寬，知進退。", "註解3": "坐絕地，無根，蓋頭（干剋支），女命易克夫再嫁，做偏房可以，男命庚寅亦有刑傷，但坐殺印有開拓精神，為官多清廉，支藏偏印宜做副手。", "註解4": " ①一生無衣食之慮。 ②男性在家是權威者，女性夫緣薄。 ③絕處逢生之命，中年有奇遇。 ④成功來自倍于常人之努力。"},
        { "干支": "辛卯", "註解1": "日干坐偏財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "辛金坐卯木之上，辛金小氣守財，膽識不大，細心行事。配偶單純心慈願多方配合。", "註解3": "坐偏財，桃花，男命喜歡女色，女命稍好，但漂亮億多風情（因既漂亮，又浪漫，對異性富吸引力）。", "註解4": " ①女人與夫同床異夢。 ②沉不住氣。 ③女人四十歲左右剋夫。 ④一生無衣食之慮。 ⑤若刻意追求完善則難有大成就，遭挫折。"},
        { "干支": "壬辰", "註解1": "日干坐殺，日干與殺都有根氣且相互平衡，方為貴格。一方過弱或過強，都是災禍之格。", "註解2": "壬水坐辰土之上，壬水足智多謀重心計，有遠見。配偶心思細多慮，心慈稍嘮叨。", "註解3": "坐水庫通根身旺，坐下有劫財生食，食神制殺，身旺用殺，主貴。壬辰日為壬騎龍背，亥時生，為龍歸大海，主大貴，午時龍死為生計奔波。", "註解4": " ①個性剛毅、明敏。 ②女人為美人胚子，中年與夫感情不好。 ③才智勝男人。 ④不利於理財。"},
        { "干支": "癸巳", "註解1": "日干坐正財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "癸水坐巳火上，癸水坐立不安，好動多事，外弱內剛。配偶膽識好能幹常鼓舞。", "註解3": "身坐正官正印正財，財官印連生，循環清正，主高貴富貴或清貴，且身康體健有錢，生活富裕，女癸巳，可嫁貴夫。", "註解4": " ①富貴之時防酒色帶病。 ②外冷內熱。 ③女人賢明，但不能得公婆的歡心。 ④女人，四十歲左右剋夫。 ⑤潛力豐富。"},
        { "干支": "甲午", "註解1": "日干坐傷官，心性多動，感情易動盪，生洩平衡，洩有用，有成就。多洩無用，邪念多。", "註解2": "甲木坐午火之上，甲木膽量氣勢皆旺，行事執行力強。配偶性急多勞，願相隨。", "註解3": "身坐死地，一生勞苦奔波，干生支，對妻子好，傷官生財，對上輩孝敬。日主泄出丁火，主利他人，故對別人照顧有加，為人付出。", "註解4": " ①小亨、寅午戌月生人財豐。 ②甲午年女命婚姻不利。 ③體格健全、肯上進、但乏積極果斷。 ④男出眾、女夫人。"},
        { "干支": "乙未", "註解1": "日干坐偏財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "乙木坐未土之上，乙木安穩得意，心胸寬勤奮工作，善良無憂。配偶勤奮無怨尤。", "註解3": "坐庫通根，財星入庫，主富，但愛財小氣，再逢命局或大運流年沖庫主發財。", "註解4": " ①子嗣少。 ②妻性保守、小心眼、善妒。 ③女性，得良子。 ④與生父母緣薄。 ⑤男性有野心。性憨厚，得人和。"},
        { "干支": "丙申", "註解1": "日干坐偏財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "丙火坐申金之上，丙火做事謹慎，善理財。配偶格局比丙火大，能幹寬胸體貼識大體。", "註解3": "身弱無根，妙在丙火太陽，坐下食神生財，財生殺，壬水殺旺，映照太陽光輝，主人聰明靈氣。但殺旺攻身，較易孤獨，一輩子較為辛勞，較難坐享其成。", "註解4": " ①文昌，喜歡研究學問。 ②男性可娶名門淑媛。 ③女人夫緣薄。 ④暗祿，有意外之福。 ⑤多學而不精。"},
        { "干支": "丁酉", "註解1": "日干坐偏財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "丁火坐酉金之上，丁火性果斷卻猶豫，謹慎理財。配偶較內向細心，勤奮。", "註解3": "坐長生偏財、夜貴、文昌，主人高貴聰明，見識超群，受人欽敬，另有叛逆創新性格。", "註解4": " ①日貴、氣質高貴。 ②生活講究品味。 ③少年早發。 ④一生的起伏很大。 ⑤最宜當參謀、幕僚、顧問。"},
        { "干支": "戊戌", "註解1": "日干坐戌的人，心情易急躁、激動，也愛發洩。戌屬燥土，其中含丁火、戊土、辛金，自成燥熱體系。四柱中戌土熱燥、多見，極易患血液病、皮膚病、呼吸系統疾病、糖尿病。", "註解2": "戊土坐戌土之上，戊土固執強行，眼觀四方，配偶性情相同，稍燥有膽識。", "註解3": "坐庫通根，土太燥，吉帶兇。魁罡主人心直口快，臨事果斷，也主聰明，文章振發，但不會用陰謀，常得罪人。", "註解4": " ①魁罡，性剛毅明敏。 ②女人容貌姣美，才情勝男人。 ③對金錢的使用極端，有時一擲千金，有時一毛不拔。"},
        { "干支": "己亥", "註解1": "日干坐正財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "己土坐亥水之上，己土內向富格，勤勞於事，配偶格局大，文質重學識恐寡斷。", "註解3": "坐正財正官，為財官雙美，主貴。女命己亥，也可嫁貴夫。", "註解4": " ①從不富貴，亦有盈餘。 ②女人與公婆不和，對丈夫亦無助。 ③有獨特的思想。"},
        { "干支": "庚子", "註解1": "日干坐傷官，心性多動，感情易動盪，生洩平衡，洩有用，有成就。多洩無用，邪念多。", "註解2": "庚金坐子水之上，庚金聰穎內性，被動性強，配偶稍內向智商高，體質虛。", "註解3": "坐傷官，女命克夫。干支金水相生，人秀麗聰明，但耿直，講義氣。做官宜公檢法部分。", "註解4": " ①女人婚姻不佳，欠圓滿，子不良。 ②男人，是硬漢型，惜運氣不強，懷才不遇者居多。"},
        { "干支": "辛丑", "註解1": "日干坐丑的人，多生疑惑之心，內性多疑，外性穩定。丑土內含辛金、癸水、己土，自成濕寒體系，旺火親和濕土。可泄火旺氣，怕水勢浩蕩。", "註解2": "辛金坐丑土之上，辛金依賴性強，好學上進，配偶體貼多情，溫穩苦幹型。", "註解3": "通根，坐下有印比食神，主人靈秀，女命辛丑身材好，秀氣，守家。", "註解4": " ①女人得賢良子嗣。 ②平常大多服從他人，必要時也會自己採取行動。 ③與親生父母緣份薄。"},
        { "干支": "壬寅", "註解1": "日干坐十神，心性易動，求欲心強。生洩平衡，洩有用，成大才。洩多無用，成惡禍。", "註解2": "壬水坐寅木之上，壬水博學好事，聰明智慧高，配偶格局大，行事多謀，善外務。", "註解3": "坐下食神生偏財再生殺，又為壬騎虎背，主富貴雙全，干支相生，家庭圓滿。", "註解4": " ①透戊，無已混，福祿崇顯。 ②文昌好學。男命妻賢、多病；女命幫夫。 ③暗祿，有意外之福。"},
        { "干支": "癸卯", "註解1": "日干坐十神，心性易動，求欲心強。生洩平衡，洩有用，成大才。洩多無用，成惡禍。", "註解2": "癸水坐卯木之上，癸水柔情智慧高，人緣好，配偶性柔，手巧人和事圓型。", "註解3": "坐長生、日貴，食神吐秀，主人聰明有文才。女命癸卯，生子讀書有成。", "註解4": " ①文昌，好學。 ②夫妻圓滿。 ③身份高貴，文雅。 ④妻賢子秀。很有才能、行事不落俗套，求完美。"},
        { "干支": "甲辰", "註解1": "日干坐偏財，日干與日支平衡，一生少缺錢財。易固執己見，任性。很少受他人影響，求財心切，守財緊。", "註解2": "甲土坐辰土之上，甲木多才藝，尚理想，配偶聰慧善取財，外緣極佳。", "註解3": "得氣通根，坐下有偏財破印，缺少貴氣，前半生不太好，后半生平安，財祿豐足。", "註解4": " ①十惡大敗，無祖產，或退敗祖產，天德日生可解，見財官富貴。 ②心地好、性柔、厚道。 ③男性得妻助，女性多再婚。"},
        { "干支": "乙巳", "註解1": "日干坐傷官，心性多動，感情易動盪，生洩平衡，洩有用，有成就。多洩無用，邪念多。", "註解2": "乙土坐巳火之上，乙木能幹多才能稍性急，配偶動作大，善言辭。", "註解3": "乙木朝陽，英華外發，主人聰明，但泄氣，只利他人，不利己。坐下傷官正財，正官順生，有錢，富裕，男命乙巳，多晚婚，可得賢妻，但支中傷官見官，過于剛強，不守紀律，武將者，喜開殺戒。", "註解4": " ①敗家產。鼓盆煞剋妻。 ②八字中無壬癸者，行金運則死。 ③離鄉。能言善道，博得聲譽，但福薄。有福有德者，病弱。"},
        { "干支": "丙午", "註解1": "日干坐刃，氣性剛，無節制則暴孽，節制平衡則成棟樑材。", "註解2": "丙土坐午火之上，丙火多才行義，名氣響亮，配偶一如手足，性情好動慷慨。", "註解3": "坐羊刃，過剛，人聰明有文才。男命克妻，女命克夫，不論男女生于丙午，容易受傷或致殘。", "註解4": " ①外爽朗、內陰沉；外奢侈、內儉嗇。 ②運勢強大，富同情。 ③男剋妻女剋夫。"},
        { "干支": "丁未", "註解1": "日干坐刃，氣性剛，無節制則暴孽，節制平衡則成棟樑材。", "註解2": "丁火坐未土之上，丁火外柔內剛，果斷有人緣，配偶性稍急，外表木訥智慧內藏。", "註解3": "得庫通根，坐下食神旺，主人漂亮，但好吃，女命賢惠。", "註解4": " ①女人四十歲左右剋夫。 ②六秀、聰明。 ③婚姻美滿，子嗣優秀。 ④暗祿，有意外之福。 ⑤明朗、敢言，受強運所保護，是天之驕子。"},
        { "干支": "戊申", "註解1": "日干坐十神，心性易動，求欲心強。生洩平衡，洩有用，成大才。洩多無用，成惡禍。", "註解2": "戊土坐申金之上，戊土粗中有細，規劃力佳，配偶格局大，有主見善謀略。", "註解3": "土猴孤獨，女命早婚者易離婚，或孤身，男命稍好。不論年月均漂亮，但愛情不專，作風不正。", "註解4": " ①有文才、好學。 ②妻賢，但妻多病。 ③女性有幫助丈夫的才能，卻難得丈夫之歡心。 ④聰明，有意外之福。好奇，但乏耐心。"},
        { "干支": "己酉", "註解1": "日干坐十神，心性易動，求欲心強。生洩平衡，洩有用，成大才。洩多無用，成惡禍。", "註解2": "己土坐酉金之上，己土外若內強，手藝極佳，配偶細心稍內向，思慮過多。", "註解3": "坐長生、文昌，主人好文學，聰明有文才，且土金相生，主人身體好，但干生支，究竟泄氣，故得失都有。", "註解4": " ①文昌，好學。 ②很有度量，體胖，賢能持家。 ③女人得賢良之子嗣。 ④身份高貴、統領格。 ⑤個人魅力強。"},
        { "干支": "庚戌", "註解1": "日干坐戌的人，心情易急躁、激動，也愛發洩。戌屬燥土，其中含丁火、戊土、辛金，自成燥熱體系。四柱中戌土熱燥、多見，極易患血液病、皮膚病、呼吸系統疾病、糖尿病。", "註解2": "庚金坐戌土上，庚金固執單純勤奮，行事有智慧少謀略。配偶心寬體壯，有膽識多鼓舞。", "註解3": "坐庫通根身強，魁罡，聰明剛毅，有文才，忠義雙全。", "註解4": " ①個性剛毅明敏。 ②女人面貌姣好，才情勝男人，但婚姻不得良緣。 ③男命得賢妻之助。 ④外表溫和，內在嚴格。"},
        { "干支": "辛亥", "註解1": "日干坐傷官，心性多動，感情易動盪，生洩平衡，洩有用，有成就。多洩無用，邪念多。", "註解2": "辛金坐亥水，辛金聰明詰慧行事溫穩儒雅，帥哥美女型，愛面子。配偶大方多智喜相隨。", "註解3": "干支相生，金水相連，文才好（女命稍差），坐沐浴，女命坐下傷官旺較不利夫。男命可得妻財，或漂亮之妻。", "註解4": " ①聰明。 ②女人性剛烈。 ③守寒房而清潔。 ④外表浮華，其實踏實、有理性。"},
        { "干支": "壬子", "註解1": "日干坐刃，氣性剛，無節制則暴孽，節制平衡則成棟樑材。", "註解2": "壬水坐子水，干支同氣，壬水豪邁好言，人緣佳多智。配偶內向溫穩稍嘮叨。", "註解3": "坐刃坐劫財，水太旺，漂亮。易有桃花問題，若經商發財，發多少失多少，不易守財。", "註解4": " ①己酉時生，有為私生子者。 ②女命多帶下之疾。 ③婚姻不美滿。 ④妻平凡。 ⑤人際關係不好。"},
        { "干支": "癸丑", "註解1": "日干坐丑的人，多生疑惑之心，內性多疑，外性穩定。丑土內含辛金、癸水、己土，自成濕寒體系，旺火親和濕土。可泄火旺氣，怕水勢浩蕩。", "註解2": "癸水坐丑土上，癸水優柔寡斷，心善少謀喜友。配偶多才善管理。", "註解3": "坐庫通根，人秀氣，坐下殺印生比肩，利兄弟，吃力不討好，較為勞累奔波。", "註解4": " ①女命，婚姻不美滿。 ②暗祿，有意外之福。 ③配偶之個性強。 ④在社會上受人尊敬。 ⑤外表沉靜，內心活潑。"},
        { "干支": "甲寅", "註解1": "日干坐祿，個性強，主觀意識強，克洩平衡則能成就事業。", "註解2": "甲木坐寅木之上，干支同氣，甲木自信自私皆有，海派喜友，多才藝。配偶多才藝願追隨。", "註解3": "坐祿通根身旺，坐下有傷官生財，主富貴，但比肩奪財，文采差一些。女命甲寅，身強剋夫。", "註解4": " ①日德，心地善良，能憐老恤貧。 ②孤鸞，女命守寒房而清潔。 ③處事理智，白立。 ④聰明。 ⑤忌庚辰。"},
        { "干支": "乙卯", "註解1": "日干坐祿，個性強，主觀意識強，克洩平衡則能成就事業。", "註解2": "乙木坐卯木之上，干支同氣，乙木多才藝喜友樂善，處世圓滑有秩。配偶單純喜友善良。", "註解3": "坐祿通根身旺，坐比肩，無財，清貴不富貴，上下乙木，秀氣透出，文才好，人秀氣，手腳纖細。", "註解4": " ①對配偶不滿。 ②男命，富則剋妻，不富則妻長壽。 ③見戊寅富貴。 ④獨來獨往，有自己的信念和目標。"},
        { "干支": "丙辰", "註解1": "日干坐十神，心性易動，求欲心強。生洩平衡，洩有用，成大才。洩多無用，成惡禍。", "註解2": "丙火坐辰土之上，丙火聰慧善良，行事多慮。配偶少勞愛享受，多識卻嘮叨。", "註解3": "身坐魁地，支藏正印、食神、七殺，主人聰明、伶俐，辰為濕土，丙為太陽，陽光普照，萬物有成，人命丙辰聰明好動。", "註解4": " ①人善良，有憐貧恤老之心。 ②忌壬辰。人較溫和，但行事常未表明即實行，因此招致不利的評語。"},
        { "干支": "丁巳", "註解1": "日干坐刃，氣性剛，無節制則暴孽，節制平衡則成棟樑材。", "註解2": "丁火坐巳火之上，干支同氣，丁火仗配偶氣勢行事乖違，果敢。配偶識大體有膽善調解。", "註解3": "丁火坐丙火，陽盛陰衰，白日無光。生時丁巳，老年易災病。", "註解4": " ①女人喜愛詩畫。 ②人聰明。 ③平常外表溫和，但內心多疑。 ④太太的容貌大多不漂亮（不是秀氣溫雅的類型）。"},
        { "干支": "戊午", "註解1": "日干坐刃，氣性剛，無節制則暴孽，節制平衡則成棟樑材。", "註解2": "戊土坐午火之上，戊土粗況豪邁氣勢旺，行事好功好面子。配偶粗中有細，相輔相成。", "註解3": "與丙類似，坐刃太旺，女命克夫，男命克妻，易受傷災。戊土太燥，主人性格浮躁。", "註解4": " ①六秀，相貌清秀或性伶俐。 ②男性多得女人相愛。 ③個性強，但富同情心。 ④為某一方面之能人。 ⑤帶佛骨，篤信神佛。"},
        { "干支": "己未", "註解1": "日干坐祿，個性強，主觀意識強，克洩平衡則能成就事業。", "註解2": "己土坐未土之上，干支同氣，己土沈穩多才能喜友。配偶多功能型性直喜友，意見強。", "註解3": "坐庫通根，身旺，坐下有殺印，主人自我意識強。女命己未身材好。", "註解4": " ①六秀，聰明、性強。 ②與父無緣。 ③福德，宜居於平洋鬧市。 ④有意外之福。 ⑤欠理性、常杞人憂天，自我迷惑。"},
        { "干支": "庚申", "註解1": "日干坐祿，個性強，主觀意識強，克洩平衡則能成就事業。", "註解2": "庚金坐申金之上，干支同氣，庚金氣魄大重情意智慧高。配偶思想寬廣清晰，善鬥智。", "註解3": "坐祿通根，身體好，主富貴。丑月庚申，為天月兩德，主人一生身健少疾病。女命庚申帶天月兩德，必生貴子，聰明大器。", "註解4": " ①鼓盆煞剋妻。 ②喜新厭舊，欲望強、運氣亦強。 ③須防無妄之災。 ④初次的婚姻愛情大多無結果。"},
        { "干支": "辛酉", "註解1": "日干坐祿，個性強，主觀意識強，克洩平衡則能成就事業。", "註解2": "辛金坐酉金之上，干支同氣，辛金清新羞怯，領悟力高喜友群。配偶氣勢大固執強勢。", "註解3": "坐祿通根，得助，立于不敗之地，聰明有文才，有能力。", "註解4": " ①女人四十歲左右剋夫。 ②自我本位採取行動。 ③有革新、創造之精神。 ④容易遭到感情的困擾。"},
        { "干支": "壬戌", "註解1": "日干坐戌的人，心情易急躁、激動，也愛發洩。戌屬燥土，其中含丁火、戊土、辛金，自成燥熱體系。四柱中戌土熱燥、多見，極易患血液病、皮膚病、呼吸系統疾病、糖尿病。", "註解2": "壬水坐戌土之上，壬水被架空行事虛浮，但宏觀好有遠見。配偶能幹務實好鬥力。", "註解3": "坐下財生殺，殺生印，殺印相生，主大貴。", "註解4": " ①日德，心善、信神。 ②八字見戊（無己來混），福崇祿顯。 ③忌戊戌。一帆風順，要求自己，也要求別人好。"}
    ];

    var 論斷項目='<span class = "傳統論斷項目">六十日主論斷 ③</span><br>';
    var 資料索引=_.findIndex(六十日主論斷3資料, {干支: 日柱});
    
    if (資料索引 != -1) {
	    return 六十日主論斷3資料[資料索引].註解1+"<br>"+六十日主論斷3資料[資料索引].註解2+"<br>"+六十日主論斷3資料[資料索引].註解3+"<br>"+六十日主論斷3資料[資料索引].註解4;
	}
	else alert("六十日主論斷③ 沒有搜尋到資料！");
}

function 四柱坐運星(命盤){
	var 四柱坐運星資料 = [
        { "運星四柱": "長生年柱", "運星": "長生", "四柱": "年柱", "註解": "年柱坐長生，小時候能受父母庇蔭，少年時就能展露才華。", "補註": ""},
        { "運星四柱": "長生月柱", "運星": "長生", "四柱": "月柱", "註解": "月柱坐長生，青年時期易得長官提攜扶持，事業有所發展，能享幸褔。", "補註": ""},
        { "運星四柱": "長生日柱", "運星": "長生", "四柱": "日柱", "註解": "日柱坐長生，為人有品德，有名望，有才華。夫妻也蠻恩愛，可得幸褔美滿。", "補註": ""},
        { "運星四柱": "長生時柱", "運星": "長生", "四柱": "時柱", "註解": "時柱坐長生，晚運不錯，子女才華出眾能出名，子女聰穎健康。", "補註": ""},
        { "運星四柱": "沐浴年柱", "運星": "沐浴", "四柱": "年柱", "註解": "年柱坐沐浴，幼年或少年運變化較多，父母感情也有較多的變化，可能會離鄉奮鬥。", "補註": "年月逢丙子、辛卯，主父母離異機率高。若此日月又遇亥子時柱，此為淫浪蕩、易得性病、愛滋病、腎病，如果歲運並臨可致死。"},
        { "運星四柱": "沐浴月柱", "運星": "沐浴", "四柱": "月柱", "註解": "月柱坐沐浴，青春期工作、事業、家庭較不安定，會有較多的變動。手足間意見多。", "補註": "月上桃花，夫妻恩愛。年月逢丙子、辛卯，主父母離異機率高。若此日月又遇亥子時柱，此為淫浪蕩、易得性病、愛滋病、腎病，如果歲運並臨可致死。"},
        { "運星四柱": "沐浴日柱", "運星": "沐浴", "四柱": "日柱", "註解": "日柱坐沐浴，夫妻感情多變化，配偶異性緣濃，較有桃花的機會。", "補註": "日上桃花、本人花心、好美、好酒色、耗財。"},
        { "運星四柱": "沐浴時柱", "運星": "沐浴", "四柱": "時柱", "註解": "時柱坐沐浴，晚年生活較不安定，有可能常搬家遷移，子女大多不住身邊。", "補註": "時上桃花，多情多義、不顧自家。"},
        { "運星四柱": "冠帶年柱", "運星": "冠帶", "四柱": "年柱", "註解": "年柱坐冠帶，少年得志，聰穎活潑，能得父母疼愛，會有出名的機會。", "補註": ""},
        { "運星四柱": "冠帶月柱", "運星": "冠帶", "四柱": "月柱", "註解": "月柱坐冠帶，青年期，事業可獲發展，工作一學就會。", "補註": ""},
        { "運星四柱": "冠帶日柱", "運星": "冠帶", "四柱": "日柱", "註解": "日柱坐冠帶，好勝心強，有耐性，做事有始有終，中年後事業大獲進展，有名望與聲譽。", "補註": ""},
        { "運星四柱": "冠帶時柱", "運星": "冠帶", "四柱": "時柱", "註解": "時柱坐冠帶，晚運會有不錯的機運，子女有成，老來不用煩惱。", "補註": ""},
        { "運星四柱": "臨官年柱", "運星": "臨官", "四柱": "年柱", "註解": "年柱坐臨官，可能是出身富裕家庭，一生適於自營事業。", "補註": ""},
        { "運星四柱": "臨官月柱", "運星": "臨官", "四柱": "月柱", "註解": "月柱坐臨官，離鄉發展較佳，凡事能獨立自主，時屆壯年左右就能步入坦途。", "補註": ""},
        { "運星四柱": "臨官日柱", "運星": "臨官", "四柱": "日柱", "註解": "日柱坐臨官，可承家業或繼承他人事業。能廣結人緣，處處受人歡迎，可獲名望。", "補註": ""},
        { "運星四柱": "臨官時柱", "運星": "臨官", "四柱": "時柱", "註解": "時柱坐臨官，晚年可享豐碩生活。", "補註": ""},
        { "運星四柱": "帝旺年柱", "運星": "帝旺", "四柱": "年柱", "註解": "年柱坐帝旺，一般家境良好，有積極進取獨立自主之精神，充滿雄心壯志。", "補註": ""},
        { "運星四柱": "帝旺月柱", "運星": "帝旺", "四柱": "月柱", "註解": "月柱坐帝旺，自尊心很強，不喜受人差遣，支使，看似很有骨氣，很有個性。", "補註": ""},
        { "運星四柱": "帝旺日柱", "運星": "帝旺", "四柱": "日柱", "註解": "日柱坐帝旺，個性勇敢堅忍，如果身處逆境也會絕處逢生，是一個不懦弱悲觀的人。", "補註": ""},
        { "運星四柱": "帝旺時柱", "運星": "帝旺", "四柱": "時柱", "註解": "時柱坐帝旺，意志很堅強，行事積極奮進，終會有所成就，子女們充滿堅強鬥志。", "補註": ""},
        { "運星四柱": "衰年柱", "運星": "衰", "四柱": "年柱", "註解": "年柱坐衰，出生時環境不佳，幼年時備受艱辛，困頓生活，身體衰弱也較虛。", "補註": ""},
        { "運星四柱": "衰月柱", "運星": "衰", "四柱": "月柱", "註解": "月柱坐衰，青年期運勢不佳，凡事易受打擊或挫折。", "補註": ""},
        { "運星四柱": "衰日柱", "運星": "衰", "四柱": "日柱", "註解": "日柱坐衰，婚姻運弱，異性緣較差，成家後比較難得有美滿狀況。", "補註": ""},
        { "運星四柱": "衰時柱", "運星": "衰", "四柱": "時柱", "註解": "時柱坐衰，年老身體衰弱，晚運較差，子女身體較衰弱。", "補註": ""},
        { "運星四柱": "病年柱", "運星": "病", "四柱": "年柱", "註解": "年柱坐病，父母健康不佳，在運勢低落之時出生，先天可能體弱多病。", "補註": ""},
        { "運星四柱": "病月柱", "運星": "病", "四柱": "月柱", "註解": "月柱坐病，內心比較悲觀消極，自尋苦惱，不思奮鬥進取。", "補註": ""},
        { "運星四柱": "病日柱", "運星": "病", "四柱": "日柱", "註解": "日柱坐病，配偶身體健康不佳，婚姻難得美滿。", "補註": ""},
        { "運星四柱": "病時柱", "運星": "病", "四柱": "時柱", "註解": "時柱坐病，晚年工作或事業多波折，難有清閒。子女健康欠佳、多病。", "補註": ""},
        { "運星四柱": "死年柱", "運星": "死", "四柱": "年柱", "註解": "年柱坐死，少年時性格消極，缺乏積極進取。", "補註": ""},
        { "運星四柱": "死月柱", "運星": "死", "四柱": "月柱", "註解": "月柱坐死，青年期運勢低落，手足朋友情份較淡薄，無情。", "補註": ""},
        { "運星四柱": "死日柱", "運星": "死", "四柱": "日柱", "註解": "日柱坐死，婚姻關係漸趨冷淡，彼此缺乏共識沒有改變的心態，易亮紅燈。", "補註": ""},
        { "運星四柱": "死時柱", "運星": "死", "四柱": "時柱", "註解": "時柱坐死，晚年多阻滯不順，子女緣薄，獲子息機會較慢。", "補註": ""},
        { "運星四柱": "墓年柱", "運星": "墓", "四柱": "年柱", "註解": "年柱坐墓，出生於經濟較沒落家庭，幼年時較貧困。", "補註": ""},
        { "運星四柱": "墓月柱", "運星": "墓", "四柱": "月柱", "註解": "月柱坐墓，為人節儉吝嗇，會儲存錢財，但收入不豐。中年後方有轉機。", "補註": ""},
        { "運星四柱": "墓日柱", "運星": "墓", "四柱": "日柱", "註解": "日柱坐墓，總是辛苦度日，一生變動較大，生活吝嗇節儉。", "補註": ""},
        { "運星四柱": "墓時柱", "運星": "墓", "四柱": "時柱", "註解": "時柱坐墓，子嗣可能較少，或操心困擾，晚年時開花結果，可享辛勞成果。", "補註": ""},
        { "運星四柱": "絕年柱", "運星": "絕", "四柱": "年柱", "註解": "年柱坐絕，沒有祖業可得，能自立創業，唯個性急躁激進。", "補註": ""},
        { "運星四柱": "絕月柱", "運星": "絕", "四柱": "月柱", "註解": "月柱坐絕，不善交際，會避開群眾而孤立，心情浮沉，一生多變動。", "補註": ""},
        { "運星四柱": "絕日柱", "運星": "絕", "四柱": "日柱", "註解": "日柱坐絕，夫妻易分離，總是喜新厭舊，花俏風流，衝動急躁。", "補註": ""},
        { "運星四柱": "絕時柱", "運星": "絕", "四柱": "時柱", "註解": "時柱坐絕，對子女完全放任漠視，最後不得子女奉養。", "補註": ""},
        { "運星四柱": "胎年柱", "運星": "胎", "四柱": "年柱", "註解": "年柱坐胎，出生時值父母變動期，性格開朗，意志較不堅，易受他人左右。", "補註": ""},
        { "運星四柱": "胎月柱", "運星": "胎", "四柱": "月柱", "註解": "月柱坐胎，青年期工作，事業起伏不定，可能時常變換。", "補註": ""},
        { "運星四柱": "胎日柱", "運星": "胎", "四柱": "日柱", "註解": "日柱坐胎，是一個能言善道之人，易搬弄是非，禍從口出。", "補註": ""},
        { "運星四柱": "胎時柱", "運星": "胎", "四柱": "時柱", "註解": "時柱坐胎，如果是女命懷孕比率高，易生子女。", "補註": ""},
        { "運星四柱": "養年柱", "運星": "養", "四柱": "年柱", "註解": "年柱坐養，一生中易受父母薰陶培養，與雙親緣厚。", "補註": ""},
        { "運星四柱": "養月柱", "運星": "養", "四柱": "月柱", "註解": "月柱坐養，可能會因異性問題而有所糾葛，會追求婚外情。", "補註": ""},
        { "運星四柱": "養日柱", "運星": "養", "四柱": "日柱", "註解": "日柱坐養，婚姻路途看似美滿、融合。", "補註": ""},
        { "運星四柱": "養時柱", "運星": "養", "四柱": "時柱", "註解": "時柱坐養，晚年時子女孝順，也會奉養晚年。", "補註": ""}
    ];


    var 論斷項目='<span class = "傳統論斷項目">四柱坐十二運星</span>';
    var 運星坐各柱 = [命盤.年柱.運星+"年柱", 命盤.月柱.運星+"月柱", 命盤.日柱.運星+"日柱", 命盤.時柱.運星+"時柱"];

    var 論斷矩陣 = [];
    for (var i = 0; i < 4;i++){
        var 資料索引 = _.findIndex(四柱坐運星資料, { 運星四柱: 運星坐各柱[i] });
        
        if (資料索引 != -1) {
            var 資料註解 = 四柱坐運星資料[資料索引].註解+四柱坐運星資料[資料索引].補註;
	        論斷矩陣.push(資料註解);
	    }
	    else alert("四柱坐十二長生論斷 沒有搜尋到資料！");
    }
    論斷矩陣.unshift(論斷項目);
    return 論斷矩陣.join("<br>");
}

function 日干坐運星(日柱){
	var 日柱坐運星資料 = [
        { "干支": "癸亥", "坐十二長生註解": "癸水帝旺在亥。天干再見壬水，乃不受約束之人，女性則中年喪夫。"},
        { "干支": "甲子", "坐十二長生註解": "甲木沐浴在子。子在冬天，結凍的水是不生木的，所以甲坐沐浴之人，做事全靠自力更生，必須經過好多努力才能成功。女命則有感情之苦，即一生為情所困。"},
        { "干支": "乙丑", "坐十二長生註解": "乙木衰在丑。若四柱中不見火，一生膽小怕事，畏首畏尾，胸無大志。"},
        { "干支": "丙寅", "坐十二長生註解": "丙火長生在寅。寅木是生丙火的，故丙火長生之人做事樂觀，積極性高。"},
        { "干支": "丁卯", "坐十二長生註解": "丁火病在卯。不合群，性格孤僻，但很有風度。"},
        { "干支": "戊辰", "坐十二長生註解": "戊土冠帶在辰。能量力行事，最終能達成願望和理想。四柱中有戌沖者，易被朋友出賣，有兩辰者，則做事紛亂，理不出頭緒。"},
        { "干支": "己巳", "坐十二長生註解": "己土帝旺在巳。女命不佳，此為『金神』日，婚姻不佳。"},
        { "干支": "庚午", "坐十二長生註解": "庚金沐浴在午。有超越他人的才藝，真才實學全憑苦學而成。四柱中若不見水，不論男女都會有感情上的壓力。"},
        { "干支": "辛未", "坐十二長生註解": "辛金衰在未。未中有夏的餘火，最喜壬水傷官。"},
        { "干支": "壬申", "坐十二長生註解": "壬水長生在申。申是生壬水的，所以壬水坐長生之人是屬於做事十分理智的人。"},
        { "干支": "癸酉", "坐十二長生註解": "癸水病在酉。文人之命，喜歡宗教藝術。"},
        { "干支": "甲戌", "坐十二長生註解": "甲木養在戌。若是甲戌日生人，婚姻不佳，有六合者先凶後吉。"},
        { "干支": "乙亥", "坐十二長生註解": "乙木死在亥。男命一般，女命不吉。若是亥月生人，四柱無火的話，一生畏首畏尾。"},
        { "干支": "丙子", "坐十二長生註解": "丙火胎在子。若是月支所見，不論男女，都是靚哥靚妹，儀容俊美，但子是沐浴桃花，所以此類男女大多是不安分的，風流但不下流。"},
        { "干支": "丁丑", "坐十二長生註解": "丁火墓在丑。丑為財庫，一生遇坐折時反而會有大的成就。男命得事業有成之女子幫助。"},
        { "干支": "戊寅", "坐十二長生註解": "戊土長生在寅。木是克土的，所以戊土坐長生之人，能在困境中克服困難，尊敬他人，心安理得地接受惡劣環境的考驗。"},
        { "干支": "己卯", "坐十二長生註解": "己土病在卯。若是乙卯日生，為防害煞，不論男女婚姻都十分不順。"},
        { "干支": "庚辰", "坐十二長生註解": "庚金養在辰。庚辰日生人為『魁罡』，一生受父母影響較深。"},
        { "干支": "辛巳", "坐十二長生註解": "辛金死在巳。最喜四柱有壬水，乃各方面極佳人士。"},
        { "干支": "壬午", "坐十二長生註解": "壬水胎在午。雖有財官，但往往因與異性交往引來災禍。"},
        { "干支": "癸未", "坐十二長生註解": "癸水墓在未。若四柱見癸水的根，則命主一生都不發達。女命則是老夫少妻之命。"},
        { "干支": "甲申", "坐十二長生註解": "甲木絕在申。若地支三合水局，則為漂泊之命。甲申日生人為人聰明伶俐，性急多疑，氣量狹隘，嫉妒心強。"},
        { "干支": "乙酉", "坐十二長生註解": "乙木絕在酉。酉是乙的”天元殺”，乙木坐『天元殺』，八字從殺為貴命。"},
        { "干支": "丙戌", "坐十二長生註解": "丙火墓在戌。四柱中不能再見土，最忌土多，土多則火炎土燥，中年時會生一場大病。"},
        { "干支": "丁亥", "坐十二長生註解": "丁火胎在亥。冬天生人喜甲木透出天干。"},
        { "干支": "戊子", "坐十二長生註解": "戊土胎在子。戊子日生人能得佳妻，若生於冬天，則四柱中見甲丙為佳。"},
        { "干支": "己丑", "坐十二長生註解": "己土墓在丑。冬月所生有火為佳，無火下賤。"},
        { "干支": "庚寅", "坐十二長生註解": "庚金絕在寅。有機會獲得財運，但易得易失。"},
        { "干支": "辛卯", "坐十二長生註解": "辛金絕在卯。若辛卯日生人，和父親關係不佳，緣份較薄。辛卯為淫欲殺。女命多淫，婚姻不順，多為『小姐}之命。"},
        { "干支": "壬辰", "坐十二長生註解": "壬水墓在辰。壬辰日為『魁罡』，常會遇不順心之事，喜歡攻擊他人，言詞尖刻。女命則常在家中爭吵不休，引起事端。此日所生之人大多愛製造事端。"},
        { "干支": "癸巳", "坐十二長生註解": "癸水胎在巳。多有被家人或朋友拖累之煩惱。"},
        { "干支": "甲午", "坐十二長生註解": "甲木死在午。男命較為吉利（食傷生財），能得妻財，女命一般。"},
        { "干支": "乙未", "坐十二長生註解": "乙木養在未。能得朋友的幫助，和兄弟姊妹、朋友的關係融洽。"},
        { "干支": "丙申", "坐十二長生註解": "丙火病在申。為人有正義感，若在晚上出生，和宗教有緣。"},
        { "干支": "丁酉", "坐十二長生註解": "丁火長生在酉。酉是沐浴桃花，男性易得到女性之合作，有著聰明、善於利用環境、能巧妙地抓住機遇的特性。"},
        { "干支": "戊戌", "坐十二長生註解": "戊土墓在戌。戊戌日即是『魁罡』，男命遇之剛毅果斷，作事敏捷，女命逢之有貴妃風韻，但不論男女，家庭都有不和睦的現象。"},
        { "干支": "己亥", "坐十二長生註解": "己土胎在亥。亥是正官，無刑沖者，一生安穩，配偶大多是同鄉同學。"},
        { "干支": "庚子", "坐十二長生註解": "庚金死在子。生於子月者，四柱中見火方佳；女命有壬水透出者不吉。"},
        { "干支": "辛丑", "坐十二長生註解": "辛土養在丑。家庭觀念強，喜歡為家人或朋友奉獻。女命若嫁此男人，不用為家務操心。"},
        { "干支": "壬寅", "坐十二長生註解": "壬水病在寅。四柱中見三壬者大富。"},
        { "干支": "癸卯", "坐十二長生註解": "癸水長生在卯。卯是貴人，癸坐長生之人，做事喜歡付出了要有回報，為人聰明，做事有條不紊，學有專長。"},
        { "干支": "甲辰", "坐十二長生註解": "甲木衰在辰。甲木是漂在水上的巨大木材，但處衰地卻是可造就之材。"},
        { "干支": "乙巳", "坐十二長生註解": "乙木沐浴在巳。巳是泄身的，又是財，乙木坐沐浴之人，喜歡錢財，為人務實，不愛空談，做事積極，但健康欠佳，體弱多病。"},
        { "干支": "丙午", "坐十二長生註解": "丙火帝旺在午。作事大膽，不畏艱辛，不怕困難；女命最好配『魁罡』之人。"},
        { "干支": "丁未", "坐十二長生註解": "丁火冠帶在未。中年有壯志，但過了中年以後，即想急流勇退，最適合做公務員工作。"},
        { "干支": "戊申", "坐十二長生註解": "戊土病在申。女命有獨立管理財務的能力，男命一般。"},
        { "干支": "己酉", "坐十二長生註解": "己土長生在酉。酉在六親上為食神，喜歡四柱中有丙火生之，若不見丙火，則生長乏力，做事緩慢，易知足，少上進，默默耕耘。"},
        { "干支": "庚戌", "坐十二長生註解": "庚金衰在戌。庚戌是魁罡，性格剛烈，見丁火為吉，女命則儀錶甚佳，但個性剛烈。"},
        { "干支": "辛亥", "坐十二長生註解": "辛金沐浴在亥。亥是辛金的傷官，不論男女，只要他支中見到寅，即是佳命。"},
        { "干支": "壬子", "坐十二長生註解": "壬水帝旺在子。最忌生於卯月，卯是壬的『背祿逐馬』，男女見之婚姻不順。"},
        { "干支": "癸丑", "坐十二長生註解": "癸水冠帶在丑。丑是寒冬臘月，最喜丙火。"},
        { "干支": "甲寅", "坐十二長生註解": "甲木臨官在寅。自坐寅之人，為犯淫欲煞，主夫妻不和，易有色情之災。"},
        { "干支": "乙卯", "坐十二長生註解": "乙木臨官在卯。若四柱中透財官者，能有富裕的歲月。"},
        { "干支": "丙辰", "坐十二長生註解": "丙火冠帶在辰。女命婚姻不佳，男命事業辛苦，但能在辛苦中有成就。"},
        { "干支": "丁巳", "坐十二長生註解": "丁火帝旺在巳。和異性交往中易有是非糾葛；女命最為不吉。"},
        { "干支": "戊午", "坐十二長生註解": "戊土帝旺在午。喜見丑之濕土，女命則喜歡漂亮男孩。"},
        { "干支": "己未", "坐十二長生註解": "己土冠帶在未。柔中帶剛，順水推舟而有成。"},
        { "干支": "庚申", "坐十二長生註解": "庚金臨官在申。與人不易相處，特別是異性朋友。"},
        { "干支": "辛酉", "坐十二長生註解": "辛金臨官在酉。酉是桃花紅豔，易有色情之劫而壞夫妻感情。"},
        { "干支": "壬戌", "坐十二長生註解": "壬水冠帶在戌。最忌四柱中五行不全。"}
    ];

    var 論斷項目='<span class = "本命論斷項目">日柱坐運星</span><br>';
    var 資料索引=_.findIndex(日柱坐運星資料, {干支: 日柱});
    
    if (資料索引 != -1) {
        var 資料註解 = 日柱坐運星資料[資料索引].坐十二長生註解;
	    return 資料註解;
	}
	else alert("日柱坐運星論斷 沒有搜尋到資料！");
}
