function 十神論斷單元(命盤){
    var 單元標題 = '<span class = "論斷單元">十神論斷單元</span>';;
    var 十神單元矩陣 = [];

    var 四柱十神論斷 = 四柱十神(命盤);
    var 十神坐十神論斷=十神坐十神(命盤);
    var 十神配偶喜忌論斷=十神斷配偶喜忌(命盤.日支.十神1);
    var 夫妻關係十神論斷=夫妻關係十神定位斷訣(命盤);
    var 父子關係十神論斷=父子關係十神斷訣(命盤);

    十神單元矩陣.push(四柱十神論斷);
    十神單元矩陣.push(十神坐十神論斷);
    十神單元矩陣.push(十神配偶喜忌論斷);
    十神單元矩陣.push(夫妻關係十神論斷);
    if(父子關係十神論斷!="") 十神單元矩陣.push(父子關係十神論斷);

    十神單元矩陣.unshift(單元標題);
    return 十神單元矩陣.join("<br><br>");
}

function 十神力度分析(命盤){
    
    命盤.分析.十神.數據[十神字轉數(命盤.年干.十神)].力量+=命盤.年干.力量;
    命盤.分析.十神.數據[十神字轉數(命盤.月干.十神)].力量+=命盤.月干.力量;
    命盤.分析.十神.數據[十神字轉數(命盤.時干.十神)].力量+=命盤.時干.力量;
    
    命盤.年支.十神1力量=藏干力量比率(命盤.年支.地支, 1)*命盤.年支.力量;
    命盤.年支.十神2力量=藏干力量比率(命盤.年支.地支, 2)*命盤.年支.力量;
    命盤.年支.十神3力量=藏干力量比率(命盤.年支.地支, 3)*命盤.年支.力量;

    命盤.月支.十神1力量=藏干力量比率(命盤.月支.地支, 1)*命盤.月支.力量;
    命盤.月支.十神2力量=藏干力量比率(命盤.月支.地支, 2)*命盤.月支.力量;
    命盤.月支.十神3力量=藏干力量比率(命盤.月支.地支, 3)*命盤.月支.力量;

    命盤.日支.十神1力量=藏干力量比率(命盤.日支.地支, 1)*命盤.日支.力量;
    命盤.日支.十神2力量=藏干力量比率(命盤.日支.地支, 2)*命盤.日支.力量;
    命盤.日支.十神3力量=藏干力量比率(命盤.日支.地支, 3)*命盤.日支.力量;

    命盤.時支.十神1力量=藏干力量比率(命盤.時支.地支, 1)*命盤.時支.力量;
    命盤.時支.十神2力量=藏干力量比率(命盤.時支.地支, 2)*命盤.時支.力量;
    命盤.時支.十神3力量=藏干力量比率(命盤.時支.地支, 3)*命盤.時支.力量;

    命盤.分析.十神.數據[十神字轉數(命盤.年支.十神1)].力量+=命盤.年支.十神1力量;
    if(命盤.年支.十神2!="") 命盤.分析.十神.數據[十神字轉數(命盤.年支.十神2)].力量+=命盤.年支.十神2力量;
    if(命盤.年支.十神3!="") 命盤.分析.十神.數據[十神字轉數(命盤.年支.十神3)].力量+=命盤.年支.十神3力量;

    命盤.分析.十神.數據[十神字轉數(命盤.月支.十神1)].力量+=命盤.月支.十神1力量;
    if(命盤.月支.十神2!="") 命盤.分析.十神.數據[十神字轉數(命盤.月支.十神2)].力量+=命盤.月支.十神2力量;
    if(命盤.月支.十神3!="") 命盤.分析.十神.數據[十神字轉數(命盤.月支.十神3)].力量+=命盤.月支.十神3力量;

    命盤.分析.十神.數據[十神字轉數(命盤.日支.十神1)].力量+=命盤.日支.十神1力量;
    if(命盤.日支.十神2!="") 命盤.分析.十神.數據[十神字轉數(命盤.日支.十神2)].力量+=命盤.日支.十神2力量;
    if(命盤.日支.十神3!="") 命盤.分析.十神.數據[十神字轉數(命盤.日支.十神3)].力量+=命盤.日支.十神3力量;

    命盤.分析.十神.數據[十神字轉數(命盤.時支.十神1)].力量+=命盤.時支.十神1力量;
    if(命盤.時支.十神2!="") 命盤.分析.十神.數據[十神字轉數(命盤.時支.十神2)].力量+=命盤.時支.十神2力量;
    if(命盤.時支.十神3!="") 命盤.分析.十神.數據[十神字轉數(命盤.時支.十神3)].力量+=命盤.時支.十神3力量;
    
    命盤.分析.十神.數據[0].力量 += 命盤.日干.力量; //將日主的力量加入比肩中
    
    // ************************** 加合化出的十神 *****************************
    for (var i = 0; i < 命盤.分析.刑冲合會害表.length; i++){
        if(命盤.分析.刑冲合會害表[i][5]!="" && 命盤.分析.刑冲合會害表[i][13]==1){  //合化十神 && 納入計算
            命盤.分析.十神.數據[十神字轉數(命盤.分析.刑冲合會害表[i][5])].力量 +=命盤.分析.刑冲合會害表[i][6];
        }
    }
    
    for(var i=0; i<10; i++){
        命盤.分析.十神.力量總和 +=命盤.分析.十神.數據[i].力量;
    }
    
    var checksum=0;
    for(var i=0; i<10; i++){
        命盤.分析.十神.數據[i].力量比率 =命盤.分析.十神.數據[i].力量 / 命盤.分析.十神.力量總和;
        checksum +=命盤.分析.十神.數據[i].力量比率;
    }
    
    // ************************** 分析五神力量 *****************************
    命盤.分析.五神.比劫.力量=命盤.分析.十神.數據[0].力量+命盤.分析.十神.數據[1].力量;
    命盤.分析.五神.比劫.力量比率=命盤.分析.十神.數據[0].力量比率+命盤.分析.十神.數據[1].力量比率;
    
    命盤.分析.五神.食傷.力量=命盤.分析.十神.數據[2].力量+命盤.分析.十神.數據[3].力量;
    命盤.分析.五神.食傷.力量比率=命盤.分析.十神.數據[2].力量比率+命盤.分析.十神.數據[3].力量比率;

    命盤.分析.五神.財才.力量=命盤.分析.十神.數據[4].力量+命盤.分析.十神.數據[5].力量;
    命盤.分析.五神.財才.力量比率=命盤.分析.十神.數據[4].力量比率+命盤.分析.十神.數據[5].力量比率;

    命盤.分析.五神.官殺.力量=命盤.分析.十神.數據[6].力量+命盤.分析.十神.數據[7].力量;
    命盤.分析.五神.官殺.力量比率=命盤.分析.十神.數據[6].力量比率+命盤.分析.十神.數據[7].力量比率;
    
    命盤.分析.五神.印梟.力量=命盤.分析.十神.數據[8].力量+命盤.分析.十神.數據[9].力量;
    命盤.分析.五神.印梟.力量比率=命盤.分析.十神.數據[8].力量比率+命盤.分析.十神.數據[9].力量比率;
    
    命盤.分析.五神.力量總和=命盤.分析.五神.比劫.力量+命盤.分析.五神.食傷.力量+命盤.分析.五神.財才.力量+命盤.分析.五神.官殺.力量+命盤.分析.五神.印梟.力量;
    
    
    //console.log(命盤.分析.陰陽五行.五行力量總和 + " / " + 命盤.分析.十神.力量總和 + " / " + 命盤.分析.五神.力量總和);
    //console.log(命盤.分析);
}


function 四柱十神(命盤) {
    var 四柱十神資料 = [
        { "四柱十神": "年干正官", "十神": "正官", "各柱": "年干", "註解1": "正官現年干，祖上清高，有任公職之輩。易繼承家財。為長子或長女。幼年時家教嚴厲，小時愛哭。自身學業成績優異，易獲高學歷，行事多受長輩提拔。", "註解2": "雙親的管教方式嚴格。自尊心強、重視體面。多屬長子，或實際上要負擔家庭責任者。詩云：年上正官福德添，祖上有德功名全；更喜獨官居一位，後人必定早握權；年上正官怕傷官，唯遇此運添麻煩；中年交了正官運，再逢祿旺職高遷。", "註解3": "①年干正官旺相，祖上或父母顯貴。②年干正官為喜用有力，少年得志，可獲祖蔭，多得長輩扶助。③年干正官，月干正財或正印，多為長子。④年干正官，其他柱官殺太重，身弱，夭折之命。⑤年干正官為忌，難得祖業。"},
        { "四柱十神": "年支正官", "十神": "正官", "各柱": "年支", "註解1": "", "註解2": "年支坐正官，兄弟姐妹有潔癖，重視體面。 多生長在傳統的大家庭環境中。大都是長子，即使不是長子，也要弟代兄職，負起家庭責任。 能得父、祖之蔭。", "註解3": ""},
        { "四柱十神": "月干正官", "十神": "正官", "各柱": "月干", "註解1": "正官現月干，性情敦厚莊嚴，沈默寡言，不善交際，威武不能屈，具有獨立自主之性格，重名望而不執着金錢，與朋友交往不涉及利害關係。青年時期不論從事何職皆易獲升遷，平步青雲。女命易早婚。", "註解2": "兒女個性嚴謹，有潔癖。多身為長子或事業繼承人。若頭胎生男，則此子是你的優秀繼承。女命，可嫁一個如意郎君。（正官與日干相合是貴夫人，只可見一個正官，多了就不好。正官之干不可被爭合。）", "註解3": "①月干正官獨透有根為喜用，四柱別無官殺，身官兩停，大貴之命。②月干正官，非為長子，正官過旺克身，易受兄長欺凌，若正官失令，柱有印星，則深得父母寵愛。③月干正官月支亦是正官，無刑沖克破，別柱無官殺，身強有印綬，心地善良，果敢有為，有大富大貴之機會。若被合化為他神，當破貴氣。④月干正官得令，身弱官星為忌，無印綬化官生身，多主體弱多病，怯懦無為。女命婚姻不如意，易受丈夫欺凌，若他柱再有官殺，為多夫之兆。⑤女命月柱干支正官被鄰柱行克，第一次婚姻容易失敗。"},
        { "四柱十神": "月支正官", "十神": "正官", "各柱": "月支", "註解1": "", "註解2": "月支坐正官，個性謹慎，有潔癖，善於保護自己。氣質高貴，相貌堂堂。很能替別人的立場著想，奉行上級指示的任務。男女的婚姻運大都很好，女兒秀外慧中（不可逢沖破）。大都經由相親結婚。", "註解3": ""},
        { "四柱十神": "日支正官", "十神": "正官", "各柱": "日支", "註解1": "正官現日支，自身相貌秀氣、端正、注重禮儀。性格率直，不善掩飾，行事平穩踏實，生活方式較嚴謹刻薄。家庭責任感深厚。配偶易為公教人員或主管級，夫妻彼此較重視精神感受及生活之協調。", "註解2": "配偶品貌端正，心性平和，氣質高尚。日主為女性，則是名門淑女。配偶心思細密，重視體面。詩云：日坐正官逢旺地，學而不倦有才能。日弱官旺膽子小，一生讀書難成功。 日帶正官正當時，功名遠揚有權勢；男女皆得配偶助，日坐官星名利馳；有福有財財入墓，無沖無破享清福；生日更喜官印煞，獨自一位富貴殊。", "註解3": "①日支官星為喜用，婚姻美滿；為忌神，婚姻易受挫折。②身強日支本氣正官，好學上進，工於心計，應變力強；身弱則相反。"},
        { "四柱十神": "時干正官", "十神": "正官", "各柱": "時干", "註解1": "正官現時干，工作態度易得賞識，辦事效率雖高但不愛出鋒頭，名利於穩定中成長，與部屬較能達成共識。行事安於現狀，不易變更，欠缺積極。不貪非分之財。與子女可享 天倫之樂，且子息易成文達賢能之輩。一生名望於晚年漸提高。女命晚年可受夫之庇蔭而享福。", "註解2": "子女孝順，安享晚年。女命，丈夫長壽。兒女不多。若官星無氣，有子而無能。", "註解3": "①時干正官為喜用而有力，晚年發達。②時干正官有根為喜用，子女賢孝。若正官無根，雖然忠孝但無才能。③正官坐偏官，勞心苦身，易犯小人。女性易有桃色新聞。"},
        { "四柱十神": "時支正官", "十神": "正官", "各柱": "時支", "註解1": "", "註解2": "時支坐正官，干支皆正官，可成人上之人。女命，常晚婚，或終身不嫁。性生活呆板。", "註解3": ""},
        { "四柱十神": "年干七殺", "十神": "七殺", "各柱": "年干", "註解1": "七殺現年干，必為長子或長女，或常代兄長之位。出生背景清寒，小時多災難，家教嚴，管教方式是用打，上半身常有疤痕。易為他人養子或養女，與親手足緣分淡薄，或有早別離之徵兆。朋友少，易受排斥，不重財，有多少花多少。男命易因家計之故早出社會。女命早熟、失身、夫不賢，首次婚姻易敗，有再嫁喪偶之兆。", "註解2": "多生於寒微之家，雙親勤奮勞動。多為長子或長女，幼少年時代（約十五歲前）貧病。有正直、勤勞的遺傳。命格佳者，是大人物。", "註解3": "①年干偏官，身強見刃，行財運生殺，富貴雙全，為貴命。②年透偏官，身弱為忌，受人欺負，體弱多病。③年干偏官為忌，祖業難承，七殺攻身太過，出身貧寒，一生多病。女命婚姻不順。"},
        { "四柱十神": "年支七殺", "十神": "七殺", "各柱": "年支", "註解1": "", "註解2": "年支坐七殺，兄弟姐妹個性單純、率直，本人一生忙碌。肩挑一家之重擔，成功時會照顧兄弟姐妹，但是兄弟姐妹成功時，本身不會得到他們的好處。", "註解3": ""},
        { "四柱十神": "月干七殺", "十神": "七殺", "各柱": "月干", "註解1": "七殺現月干，為人重信講義，行事不畏強權。青年時易受上司重用或升遷，工作轉型期屬革命性。具有堅忍不拔之毅力，富風險意識。與自身手足關係疏遠或手足易有損傷。女命易有不好之婚緣。", "註解2": "次子以後的子女比較孝順，若是只有獨生子則孫兒很孝順。子女比較頑皮，但很正直。能得到親族的助力。女命第一次婚姻多失敗。", "註解3": "①月干偏官，月支本氣為印，四柱組合好，多屬貴命。②月干偏官，食神制而得用，富貴。"},
        { "四柱十神": "月支七殺", "十神": "七殺", "各柱": "月支", "註解1": "", "註解2": "月支坐七殺，夫妻容易起爭執。不服輸，有領袖欲；四柱七殺不多見，且有食神一位制殺，福壽富貴之命。", "註解3": ""},
        { "四柱十神": "日支七殺", "十神": "七殺", "各柱": "日支", "註解1": "七殺現日支，自身性格豪放爽直，行事具魄力、俠義心，公私分明，但欠缺圓通性。易體弱多病且責任壓力皆重。配偶精明能幹豪放，善外交、個性急躁、剛烈、倔強。", "註解2": "容易傷殘，性急，有印化殺，無財破印，文章奮發。聰明。家庭缺少和諧氣氛。大運忌七殺，主貧病。", "註解3": "①日支偏官，別無官殺，若日主喜偏官，必然聰明機巧，做事果斷，應變力強，但有些祭灶。②身弱忌殺，若日支為七殺，柱中再有官殺財星，日主一生多災多病。③日支偏官為忌，配偶性格暴躁。④身強，日支偏官為用，若偏官處月令墓絕之地，日主有志難伸，功名難就。"},
        { "四柱十神": "時干七殺", "十神": "七殺", "各柱": "時干", "註解1": "七殺現時干，工作責任感強，凡事必躬親，具督導力，決策能力強，對自身要求過高，與晚輩部屬欠溝通。對事物獎罰分明。男命易得子，子女難教養或敗家。晚年較易陷孤獨，老年愛漂亮，且生活難得清閒。對工作易有不滿常發牢騷。身強的人有權勢；身弱的人，則會有壓力災難。女命有異性追求，婚姻不得圓滿，易成職業婦女，晚婚較佳。女命生產易開刀，會打小孩，子女易有災難。", "註解2": "時干佔七殺，大貴之兆，稱時上一位貴。但忌見正官相雜，反而命苦貧困。時柱又為兒女宮，七殺有制，男命陽日主得兒，陰日主得女；女命陽日主得女，陰日主得兒，而且晚年生貴子。個性剛直、穩重，不屈不撓。兒女遲或少，兒子很有作為。四柱中若有正印或食神，是大器晚成型，「大隻雞慢啼」，中晚年可創大業、掌權勢。", "註解3": "①時干偏官為喜用，他柱另無官殺，或有而被合化，為貴命，晚年尤其好。②時干偏官獨透，柱透財印，日主有力，作為非同凡響，有望名揚四海。③時干偏官為喜用，男命得賢孝之子；若為忌，生不肖之子。"},
        { "四柱十神": "時支七殺", "十神": "七殺", "各柱": "時支", "註解1": "", "註解2": "時支坐七殺，子女少，或有損失。干正官，支七殺，晚年貧困不遇。", "註解3": ""},
        { "四柱十神": "年干正印", "十神": "正印", "各柱": "年干", "註解1": "正印現年干，家道純正，祖上清高具名望，但貴而不富。能得祖上庇蔭，與長輩關係良好且情深義重，幼小時得妥善之照顧，且容易參與宗教活動。讀書求學順利進展，易得師長疼惜引導。較安逸 少異動。工作易因長親之故而獲升遷或提拔。", "註解2": "正印在年上，表示祖宗一代有文化修養，坐官生印，富貴榮華。又代表自己得祖上恩德，出身官宦世家，早年學業成名。雙親及長輩個性溫和，富有人情味。幼年家境大都很好。但要月、日、時有正印的臨官才有用。", "註解3": "①年干正印旺相，生富貴或書香之家。②年干正印，月干正官，祖上或父輩掌權。③正印為喜用，利文途。④年正印衰弱遭克，祖上貧寒，命主幼時家貧。⑤年干正印衰弱，月干劫財，祖上遺產多被手足繼承而與己無緣。"},
        { "四柱十神": "年支正印", "十神": "正印", "各柱": "年支", "註解1": "", "註解2": "年支坐正印，兄弟姐妹相貌都長得不錯，理智、口才好，寫作能力亦佳。記憶力好。", "註解3": ""},
        { "四柱十神": "月干正印", "十神": "正印", "各柱": "月干", "註解1": "正印現月干，手足情深但緣薄。自身具有慈善及關照他人之心，好學不倦，聰明有謀，以己為中心，容易接觸宗教。工作上易得上司器重，不論從事公職或就業，皆易得提升。行事誠懇待人謙虛，唯缺乏衝鋒陷陣之精神。輕利重名之人，加諸自身責任壓力皆重，不善言詞，較沉默。女命婚後易有婆媳問題；男命受母親約束甚多，且家中由母親掌權。", "註解2": "受母親的教養比父親多。聰明、慈悲、性強、博學，容易成名。兒女孝順，尤其是次子、次女、四子、四女；兒女善變、乏耐性，但不失穩重。", "註解3": "①月干正印為喜用，不遭克破，學業有成，文才出眾，聞名四方。②月干印為喜用，聰明仁慈，體健貌端；若有官星來生，身官印均衡，必主功名顯達，名揚天下，為貴命。③月干正印，年干官星，出身顯貴。④月干正印失令，又遭財星克伐，出身貧寒。⑤日干強旺，月支印之本氣，與兄弟姐妹緣薄，或兄弟姐妹少甚至沒有。"},
        { "四柱十神": "月支正印", "十神": "正印", "各柱": "月支", "註解1": "", "註解2": "月支坐正印，大都是智慧型人物。因容易受父母的寵溺而養成耽於安樂、華而不實、依賴心重的個性。富有人情味，愛面子，喜歡人家恭維，有優越感，念舊，用錢保守。男性，多不是長子，排行二、三、五。女性、多為長女（代母職）。", "註解3": ""},
        { "四柱十神": "日支正印", "十神": "正印", "各柱": "日支", "註解1": "正印現日支，自我保護意識強，生活圈子較小。具敏捷之思考力。家庭責任感重，與配偶相處重視內涵。配偶性格穩重踏實，年紀較己為大，多任文職，自己盼望在婚姻生活上得到配偶之呵護照顧。", "註解2": "配偶賢良有助力，日主弱者尤佳。（甲子日、乙亥日、戊午日、己巳日。）配偶的氣質高尚優雅，男性的太太有「母性」的味道。容易逃避現實問題。男性容易娶「某大姐」，女性剛好相反，愛嫁年齡比自己小的男生。有謙讓的君子風度。", "註解3": "①正印坐日支，並且為喜用，可得配偶之助，有貴人相幫。②正印坐日支，為忌神，則夫妻不睦，不利子息。"},
        { "四柱十神": "時干正印", "十神": "正印", "各柱": "時干", "註解1": "正印現時干，工作盡忠職守、勤勉樸實、緩慢但細心，規劃重於實踐，易得上司有力支持及重用。對子女部屬獎罰分明。與子息關係雖密切，但不溺愛。晚年可得安逸平穩之生活，易接近宗教，如吃素、皈依等。", "註解2": "兒女聰明孝順。晚年享受盛譽，衣食無慮。職業居處常變動。", "註解3": "①時干正印為喜用，子嗣賢孝，多生貴子，並享子孫之福。②時干正印為喜用，晚運好，有大器晚成之說；若月上有正官，歲運逢正印必主發達。③時干正印為喜用，財星得令，官星衰弱或不見，一生事業難以成功，屬貧苦之命。"},
        { "四柱十神": "時支正印", "十神": "正印", "各柱": "時支", "註解1": "", "註解2": "時支坐正印，巧於謀事，食祿豐厚。一生與名聲、榮譽結緣。掌大權、任要職，是受重視的人物；生月支是正官者，晚年尊榮。性生活比較呆板、清淡。", "註解3": ""},
        { "四柱十神": "年干偏印", "十神": "偏印", "各柱": "年干", "註解1": "偏印現年干，祖父疼惜，但血親較疏遠，易過繼他人或有雙重父母，故長親之助力弱，且因家族糾紛是非多，幼小時亦缺乏愉快之童年。住所常變遷，與父母思想觀念差距甚大。長親健康久安。", "註解2": "雙親是有理想、有耐性的人，由於忙碌而冷落了你。出生時家境多貧困，且與出生地無緣，會拋棄祖業，在他鄉創立家業。年支又是偏印，長親不利，祖上寒微。", "註解3": "①年干偏印，月干非正印，與生母緣薄。為喜用得繼母或養母之愛；為忌神，繼母或養母刻薄。②年干偏印為喜用且有力，繼母或日主精明能干，宜從事副業或技術性工作。③年干偏印為忌，祖業無靠，幼年多失雙親教養，出身貧寒。"},
        { "四柱十神": "年支偏印", "十神": "偏印", "各柱": "年支", "註解1": "", "註解2": "年支坐偏印，兄弟姐妹不喜歡受束縛，善辯，不輕易吐露心事，容易與親族疏遠，被視「怪人」。與出生地緣份薄，大多在他鄉立足。", "註解3": ""},
        { "四柱十神": "月干偏印", "十神": "偏印", "各柱": "月干", "註解1": "偏印現月干，模仿、學習力皆強。思想易成反傳統，凡事有獨特見解，反應快，好唱反調，出怪招。內心易多愁善感，心思細腻且敏感，適合扮演各種角色，唯獨缺乏魄力、決斷力。工作易得貴人輔助，一生亦易得異性長輩之助，但兄弟姐妹會扯後腿。對宗教、文藝、哲理興趣濃厚，對事物具洞悉力，喜好探索人生。女命會要控制老公。", "註解2": "生活方式異於凡人，常被當作「怪人」。頭腦靈活，第六感強，求知欲強，不喜陳舊，能創新。宜當醫師、藝術家。", "註解3": "①日主身旺，月干偏印為忌，主霸道、頑固、惹是生非，易招凶災橫禍。②財旺身弱，月干偏印失令，出身貧困。③月柱偏印克制食神，行為常被長輩限制。④月干支偏印重疊為忌，與手足緣薄。"},
        { "四柱十神": "月支偏印", "十神": "偏印", "各柱": "月支", "註解1": "", "註解2": "月支坐偏印，性情，愛之欲其生，惡之欲其死。精明幹練。孤獨，不輕易吐露心事，遇事常以消極的態度抵制。與打針、吃藥結下難解之緣（胃腸病居多）。有的人久病成良醫。與宗教也很有緣，有宗教信仰的行為，如：吃長齋，或清修。以五術為業。若值衰病死絕之位，其貌不揚，人氣不好。", "註解3": ""},
        { "四柱十神": "日支偏印", "十神": "偏印", "各柱": "日支", "註解1": "偏印現日支，性格灑脫，博學不精，孤獨不合群，喜好探索神秘性之事物，對宗教有獨特感觀力，具有隱士之特質。感情婚姻多波折，因對配偶之要求及期望過高，如結婚則配偶掌管一切權力，對配偶較依賴。女命婚後易有婆媳問題，且家中事物由婆婆掌理，作為職業婦女較佳。", "註解2": "看日元當令與否：日強者，配偶賢良，日弱者，配偶帶給你困惱。丙寅、壬申日的女性，幸福、得優秀的子女；男性妻子賢淑。丁卯、癸酉日生人，幼年時代易患大病，早離雙親，婚姻不美滿。癸酉日生的女性，夫緣尤劣。庚辰、辛丑日生者，與生父母緣薄；男性，妻緣不好，女性，可得賢良子女，一生幸福，但庚辰日生者，夫緣不佳。辛未、庚戌日生人，雙親緣薄，婚姻不美滿；女性，表面柔順，內心冷酷，不孝翁姑。結婚後，操心勞形。幼年時體弱多病，而且大都屬嚴重危險的急症。能以發明、創作而成功。", "註解3": "①坐偏印，他柱又透，婚姻多不稱意。"},
        { "四柱十神": "時干偏印", "十神": "偏印", "各柱": "時干", "註解1": "偏印現時干，對任何性質工作適應力皆強。行事精明能幹，善企劃，適合擔當幕僚之職，但賺錢困難。不論男女命，易犯小人，與部屬之關係疏遠或被扯後腿。晚年之體質較弱。與子息關係疏遠，且子女易體弱多病。女命生產時較不順，易有產厄之災。對宗教、玄學易有迷戀執着之心態。", "註解2": "兼職多，晚年亦不得清閒。子女性情不良（或有特異的資質），若為喜用神，子女有特殊成就、孝順；若為忌神，子女夭折，甚者絕嗣。子女不多。", "註解3": "①時干偏印，嗜酒好賭好勝。②日刃時梟，妻難產。"},
        { "四柱十神": "時支偏印", "十神": "偏印", "各柱": "時支", "註解1": "", "註解2": "時支坐偏印，不喜歡熱鬧、喧嘩，喜歡獨自研究學術、技藝。對醫藥、命卜、風水、宗教有深入的研究或特殊成就。時干正印，同時擁有兩種以上的工作。", "註解3": ""},
        { "四柱十神": "年干正財", "十神": "正財", "各柱": "年干", "註解1": "正財現年干，祖上必有產業，生於名望之家，家業穩固，幼小時物質豐足，但不愛唸書。性格清純保守，異性緣佳，易受師長疼惜。賺錢容易，機會多，也愛賺錢，愛玩，好動，喜歡快樂。身強者不愁吃穿，有合者可得祖輩的錢財。", "註解2": "雙親個性溫和保守，母親節儉，能未雨綢繆。多生於富家、資本家，祖父多是富貴之人。", "註解3": "①年透正財，上輩富足，為喜用可得福蔭，為忌難得祖產。②年干正財為忌，出身貧寒，幼時經濟困難。③年干正財，又得他柱傷食財星生助而過強，必克母親，且文途有阻。④年干正財，父親慷慨，樂於助人。"},
        { "四柱十神": "年支正財", "十神": "正財", "各柱": "年支", "註解1": "", "註解2": "年支坐正財，兄弟姐妹多。兄弟姐妹個性溫和，會幫忙做家事，常識豐富，對事物的價值判斷正確。", "註解3": ""},
        { "四柱十神": "月干正財", "十神": "正財", "各柱": "月干", "註解1": "正財現月干，有繼承家產之機會，或白手起家，自行創業，或受薪階級之主管。青年時工作職務穩固，財源茂盛，個人亦懂得量入為出，用錢知節制。男女命皆較多戀愛機會，易早婚，男命較疼老婆。若遇劫才，主貧困。", "註解2": "女兒，或排行二、四、六等偶數的兒子比較孝順。兒女的個性溫和篤實。月支坐天乙貴人者，妻非賢即美。本人的個性勤儉，善於理財，父母不富即貴。", "註解3": "①月干正財得令，雙親富貴，但勤儉持家。②月干正財，年上劫財，父輩先貧后富；時上劫財，則先富后貧。③身強月干逢正財，可得父母資財或得兄弟資助。④月柱透正財，為喜用，男命婚姻早，娶近處之女。正財透出為忌，第一次婚姻容易失敗。⑤月干正財，日主勤勞節儉，善積蓄，但小氣。"},
        { "四柱十神": "月支正財", "十神": "正財", "各柱": "月支", "註解1": "", "註解2": "月支坐正財，從小就有理財的觀念，作事務實，重人望，諸事圓滿，可從事財務金融、工商實業。男命，妻賢。（不可見沖、刑或被合去。）正財在墓庫，無刑沖來開庫者，吝嗇，守財奴，少年不發墓中人。", "註解3": ""},
        { "四柱十神": "日支正財", "十神": "正財", "各柱": "日支", "註解1": "正財現日支，自身性格爽朗樂觀，追求安逸悠閒之生活，對任何事物有探索之心。婚姻由自由戀愛而成，夫妻對家務有相互扶持之功。配偶工作穩定，為公務員或企業上班居多，自己易得配偶之助力，或工作上易得有力之支援。", "註解2": "妻宮妻守（指男命正財坐日支夫妻宮本位），配偶賢慧，善理家，但是一個醋罐子。月將（太陽）同位，妻家富貴。", "註解3": "①身強喜財，財星有氣，得美妻，因妻致富。②日支正財臨將星，當娶名門之女。③身強勝財，日支正財，事業心強，有責任感，通過自身努力致富。④命局財星不與日柱相合，而與他柱相合，妻易有外情。⑤日支正財被合，逢歲運引發，婚姻恐有變故。⑥日支正財遭刑沖合害，婚姻有不如意之處。"},
        { "四柱十神": "時干正財", "十神": "正財", "各柱": "時干", "註解1": "正財現時干，對任何事物執着迷戀，愛旅行，略帶賭性。工作勤勉踏實，與子息或晚輩較親近。晚年生活安逸，功名利祿以晚年為佳。若身弱不得任財官，要很拼命才能賺錢。", "註解2": "用錢保守，寒酸小氣，是鐵公雞。中、晚年財運亨通。妻子長壽。若無劫財及刑沖者，妻美子賢。性急。時上正財，子女榮華富貴，晚年財產豐厚。時干正財，頭胎為兒子。", "註解3": "①時干正財為喜用，晚年發富，為忌則奔波辛苦而少得。②時透正財為喜用，子女成家后富貴發達，晚年可享子女之福。③時干正財臨桃花為喜用，中年后得美妻，並因此發財。"},
        { "四柱十神": "時支正財", "十神": "正財", "各柱": "時支", "註解1": "", "註解2": "時柱見正財若是喜神，同柱即日支、月干不現比劫星時，則財不受破壞，表示晚年財運甚佳，雖然性情急躁，但經過青中年的努力之後，晚年開花結果，能得美妻及 賢孝富貴之子女，晚運富足之命。日主身弱以印星為用而財星佔據時柱者，不僅晚運外華內虛，為財奔波勞累，或晚年因財而損失名譽與地位。同時難得子女之孝養。", "註解3": ""},
        { "四柱十神": "年干偏財", "十神": "偏財", "各柱": "年干", "註解1": "偏財現年干，祖上經濟豐富，且祖上有風流之輩，婚姻不美滿。父輩家道中衰，外華內虛。自身幼年時體弱多病，易因好玩而影響學業。早出社會工作，與父母緣分淡薄。家居變遷較大。喜歡吃好用好的，錢財滾動很大，", "註解2": "雙親個性溫和，重視人情義理。能繼承祖。年干支皆偏財，與父緣薄、養子過房之命。年支比肩，父亡於他鄉。", "註解3": "①年干偏財旺相，父親長壽。②年干偏財旺相為喜用，祖業豐富，且能得祖蔭。③年干偏財為忌，幼年家貧。④年干偏財，早戀，若為忌，不易成婚。⑤年干偏財重疊，多父之象。⑥年干偏財坐驛馬，父親遠方創業，若遭克過重，恐怕客死他鄉。"},
        { "四柱十神": "年支偏財", "十神": "偏財", "各柱": "年支", "註解1": "", "註解2": "年支坐偏財，兄弟姐妹樂於助人，心地善良心腸軟，不會拒絕他人請託。父、祖時代發達。", "註解3": ""},
        { "四柱十神": "月干偏財", "十神": "偏財", "各柱": "月干", "註解1": "偏財現月干，仗義疏財，豪邁大方，廣結善緣，對任何事物不執着沉迷。異性緣佳，淡泊名利。出生家境早年辛苦，過青年期家境漸佳，喜歡做大生意，錢滾錢，易成暴發戶，敢承擔風險。對事物具有理解力、分析力，口才伶俐圓滑、社交力強。", "註解2": "早發達。年干見比、劫，父壽不永；時干見劫財，先發後敗，先富後貧。女兒孝順，兒女早熟，小時就很世故，懂得人情義理。月支又為偏財，創業發跡於他鄉，酒色亡家者有之。", "註解3": "①月干偏財，年干劫財，先貧后富。②月干偏財，時干劫財，先富后貧。③月干偏財為忌，揮霍浪費，家資不豐。④身弱逢月干支偏財，容易因異性破財，並引起桃色風波。⑤月干偏財強旺克印太過，日主身弱，主頑固不化，文運不暢，不重禮節，為人粗俗。"},
        { "四柱十神": "月支偏財", "十神": "偏財", "各柱": "月支", "註解1": "", "註解2": "月支坐偏財，名利雙收，很會賺錢，財源不斷。反應好、多為他人盡心力、出手海派，善於掩飾感情。大多排行老三。", "註解3": ""},
        { "四柱十神": "日支偏財", "十神": "偏財", "各柱": "日支", "註解1": "偏財現日支，配偶精明能幹銳利，行事爽快，不拘小節，男命有寵妾傷妻之傾向，女命之能力較夫賢能。不論男女命，宜晚婚，可免家庭風波。", "註解2": "生活較浪漫、重氣氛；男性容易有外遇或招惹桃色事件。配偶性急，無刑、沖者，家有內助之賢，或得妻家財。與月將（太陽）同支，取名門淑媛或富家之女。", "註解3": "①日支偏財，若年月柱再有財星，則婚前有多戀之象。②日支偏財，他柱再無財星，妻聰明賢惠。③日支偏財衰弱，妻子多病，而且財運平平。④日支偏財臨將星，妻子出生於名門，有氣質。⑤日支偏財，月干正財，妾奪妻權，多愛妾少愛妻子。"},
        { "四柱十神": "時干偏財", "十神": "偏財", "各柱": "時干", "註解1": "偏財現時干，晚年較春風得意，多情慷慨，唯身體虛弱。工作上易得異性之助力，因工作應酬多而與子女聚少離多。子女社交能力較強，技能表現佳，適宜商務推廣。老年風流又大方，若雙財重疊（一個正財，一個偏財）有納妾的傾向。時干偏財如受剋， 家境易斷送於子孫，且子孫之性格奢侈浪費，虛榮心強。", "註解2": "只有時干一位偏財，他柱不見者，「時上偏財格」，性擇善固執，中、晚年榮華致富；忌比劫歲運，主破財、病痛。中年後，財運亨通，很有作為。", "註解3": "①身強時干逢偏財，晚年富裕。②時干偏財旺，子女成家而富。③時干偏財為喜用，老來可享受子女之福，為忌則老來難靠子女。"},
        { "四柱十神": "時支偏財", "十神": "偏財", "各柱": "時支", "註解1": "", "註解2": "時支坐偏財，無刑、沖者，晚年榮華。", "註解3": ""},
        { "四柱十神": "年干食神", "十神": "食神", "各柱": "年干", "註解1": "食神現年干，易為長子或長女，幼小時家境中等，小時候很喜歡讀書，記憶力強。注重飲食、旅遊，若有印或財搭配，則有出國深造之機會。自身體質較弱。袓上有再婚之兆。易得祖上庇蔭，可享雙親之福德。", "註解2": "多生於鄉村、郊區，或都市中的靜謐區。父母或祖父是「看天吃飯的人」（農民或公務員），個性樂天知命、隨和。幼年時的家境大抵小康。幼年平安，能得到祖父母的疼愛。", "註解3": "①年干食神旺相，父親肥胖；年支本氣食神旺，母親身體好。②食神為喜用，能得祖業。③食神坐衰絕之地，祖業無靠，幼時家貧。④祖旺父衰。"},
        { "四柱十神": "年支食神", "十神": "食神", "各柱": "年支", "註解1": "", "註解2": "年支坐食神，同胞和睦，同心協力。人大方，不拘小節，安逸。", "註解3": ""},
        { "四柱十神": "月干食神", "十神": "食神", "各柱": "月干", "註解1": "食神現月干，性格外柔內剛，較有食祿，行事機變，求知欲強，但偏向靜態，適合科技、企管、翻譯人員，不宜文教行政。青年期經濟平穩，不喜交際應酬。心態從容，度量寬宏。", "註解2": "好飲食、謳歌，心寬體胖。若月支有偏印，疾病纏綿，常遭遇厄事，潦倒窮困。", "註解3": "①善良、樂觀、喜自由自在、自食其力、節儉。②月干支食神，為忌。早年多家貧。③月干食神，日主有根，喜音樂。④食神為用，心寬體胖。"},
        { "四柱十神": "月支食神", "十神": "食神", "各柱": "月支", "註解1": "", "註解2": "月支坐食神，有度量、和氣，大都是幸福的人。藏食透傷者，性格轉為猛烈。食神格，人多清高，宜當公務員、學者、書畫家。", "註解3": ""},
        { "四柱十神": "日支食神", "十神": "食神", "各柱": "日支", "註解1": "食神現日支，溫柔多情，善解人意，聰明伶俐，為人寬容，包容力強。待人處事，親切平和，真誠客氣，給人一種樂於親近、值得信賴之好感。加上口才平實了得，故是一流之交際高手，較容易中年發福。自身行事緩慢，企劃力強，但實踐力弱，有惰性。夫妻間追求互不拘束，配偶性格敦厚寬宏，身材較豐厚。重感情生活的質素，男命較易風流，女命較易挑剔配偶。女命如逢偏印剋制，易剋損子息或生產時較不順。", "註解2": "只有日支是食神，他柱不見者，名「食神暗見，人物豐肥。」自己、配偶心寬胖。", "註解3": "①配偶心地善良。②有藝術天賦，好自由。③女子食神太旺無制貪淫好色。④女人外心重。"},
        { "四柱十神": "時干食神", "十神": "食神", "各柱": "時干", "註解1": "食神現時干，工作上較易得清閒，易安於現狀，缺乏衝勁，與部屬關係密切。男命得子率高，女命得女機率高，雖與子息意見失和但能和睦而居。晚年多外出旅遊之機會，且較會吃素。", "註解2": "女命子女旺。晚年豐衣足食，而且長壽。戊日庚申時最吉，「專食合祿格」。（要四柱無官印，喜秋、冬。忌年、月有甲、丙、寅、卯。戊午、戊寅兩日除外，不作此格論。）女性時干食神坐長生、臨官、帝旺者，子嗣必發達。（甲日丙寅時、丁日己酉時、癸日乙卯時。）", "註解3": "①食神旺相，子女肥胖。②食神為喜用，子女賢孝。③女性時干坐梟神，不利子女，恐有產厄。"},
        { "四柱十神": "時支食神", "十神": "食神", "各柱": "時支", "註解1": "", "註解2": "時支坐食神，乙日壬午時、辛日戊子時，食神兼正印，煩累。甲日己巳時、丁日辛丑時、己日癸酉時，食神兼財星，吉順。乙日、庚日丁亥時，食神兼正官，尊貴不凡。丙日壬辰時，食神兼七殺，治事精細，富謀略，立志堅決：女命，「丙逢壬制顔如玉」，貌美。丁日丁未時、己日辛未時，食神兼比肩，不武斷專權，遇事肯與人商量，有謙下之風。", "註解3": ""},
        { "四柱十神": "年干傷官", "十神": "傷官", "各柱": "年干", "註解1": "傷官現年干，祖上虛耗，家境多見清寒，早出社會謀職，以半工半讀完成學業。早離祖居，與祖父母緣分淡薄或父母不全。家居常遷動。性格具有叛逆傾向。小時候愛出風頭。少年時容易受傷。", "註解2": "雙親孤僻、神經質、情緒化，雖然有人情味，但不易被了解。父母不全（一個早逝，或離異），或父母是家世、性格極端相異的結合；總之，上代的關係不單純。大都不是長男或長女。父母晚年運衰微。", "註解3": "①年柱傷官，難承祖業，與父母緣薄，為生計奔波。②年干傷官旺而無制，父親脾氣暴躁。③年干傷官喜用，幼年家境好；為忌，則幼年家境貧困。④身弱忌傷官，因痼疾不治而折壽，有印綬可解。⑤年時傷官出干，難有子。⑥祖旺父衰。"},
        { "四柱十神": "年支傷官", "十神": "傷官", "各柱": "年支", "註解1": "", "註解2": "年支坐傷官，兄弟姐妹性格各異，情緒多變，孤獨、冷漠，數量不多。年干支皆傷官，富而不久，或生於家道中落之時。", "註解3": ""},
        { "四柱十神": "月干傷官", "十神": "傷官", "各柱": "月干", "註解1": "傷官現月干，青年期好動、活躍，自尊心過強，具有創造設計發明之才能，行事不喜受指使拘束，喜好動態藝術文物。交友廣，對環境適應力強。具商業頭腦，適合自創事業、業務推廣、變化較大之工作，也宜作專門技術之人員。與上司老板易有口舌爭端。青年期不易積財，易因家計操勞而致病。兄弟易不和或夫妻有別離之兆。", "註解2": "不適合從事平凡的行業。頭腦靈活，感受性強，愛好藝術。細心，有一點兒神經質。生活方式異於凡人，不易被人了解。兄弟姐妹不全（數量少，或有流年不利夭折者），大都不是第一胎。", "註解3": "①月干傷官，手足失和，不利婚姻。②女命月干支皆傷官，夫緣極差。③傷官強旺透月干，容易得罪人，幫人而不得好報。④傷官得令，溫柔不足，若透印綬，則口惡心善。⑤高傲，標新立異，喜歡否定別人，逞強好勝，心服口不服。⑥傷官泄身太過，貧困，自作聰明。⑦月干傷官坐日刃，年輕時不能獨立創業。"},
        { "四柱十神": "月支傷官", "十神": "傷官", "各柱": "月支", "註解1": "", "註解2": "月支坐傷官，女命，若四柱沒有正印或財星者，婚姻多屬悲劇。原創力、叛逆性強，宜從事藝術、科技。鬼頭鬼腦，聰明絕頂。", "註解3": ""},
        { "四柱十神": "日支傷官", "十神": "傷官", "各柱": "日支", "註解1": "傷官現日支，性格好勝、倔強、任性、反傳統、喜歡投機取巧、較善變、樂觀活躍、有才華、善應變，賺錢的心態強，口才極佳，是交際好手。易給人自驕自大，叛逆，有冒險越規之行為，無形中極易傷害到別人，故不易獲得別人之信賴，交友雖廣但難得知心好友。男命事業心重，喜歡追求浪漫，較易風流，不易納妻言。女命有挑剔配偶的傾向，有凌駕丈夫之心態。故配偶間彼此不太易馴服於對方，夫妻易貌合神離，有互相猜忌之嫌。", "註解2": "女命，婚緣不佳，多離異或夫早死；未婚者則有精神異常者。男愛美女，女愛帥哥。男命，妻多屬現代美感的類型，嬌柔、眼睛大。眼高手低，能言善道。", "註解3": "①清高、自負、性急、機敏、官場失利，無遠慮。②女性，不能屈服於丈夫，克夫、有制化無妨。③日支本氣傷官，男性取美貌之妻或才高之妻，有離婚的可能。④生日傷官有印制，命貴。⑤生日傷官，他柱劫財太重，貧困。"},
        { "四柱十神": "時干傷官", "十神": "傷官", "各柱": "時干", "註解1": "傷官現時干，對工作充滿鬥志及野心，但自我設限過高，凡事易鑽角尖，自尋煩惱。男命對子息管教嚴厲，易與子息生口舌爭端且難和睦相處，或是沒有子嗣。頭胎易生女或子女體弱多病，晚年與子女聚少離多。女命易疼惜子女且偏溺愛，常因子女之事煩心。不論男女，工作上易因部屬之故而遭受損失，對工作不滿常發牢騷，與上司缺乏溝通管道。", "註解2": "子嗣不旺，或有流產、夭折者。女命婚姻多不美滿。四柱無正官，晚年逢財運即發達。時支劫財，少年發達，晚年不幸；逢官殺歲運發達。", "註解3": "①傷官旺而無制，子女不服管教，愛惹是生非，連累父母。②男命傷官旺，妻子頭胎多生女。③傷官為喜用，晚年享兒女福。④傷官居子女宮受克太過，恐怕子女夭折。⑤時透傷官，時支劫財，晚年財源不好，多有損耗。"},
        { "四柱十神": "時支傷官", "十神": "傷官", "各柱": "時支", "註解1": "", "註解2": "時支坐傷官，子夭折，晚景單薄。「時支若要逢傷官，剋子多把姑娘生」。", "註解3": ""},
        { "四柱十神": "年干比肩", "十神": "比肩", "各柱": "年干", "註解1": "比肩現年干，多不是長子，必有兄姐，或易成為他人養子。家境貧寒，且不斷花長輩的錢，自身幼小時因好玩而影響學業。易得長親扶助，與父親易有代溝。個性獨立，好交朋友。女命在年月柱帶比肩者，大都是美人，但多任性驕縱。", "註解2": "很有個性，自我觀念強，在兄弟姐妹中比較突出。父親自立，能力強，固執，精力旺盛，努力不懈。一般而言，年干現比肩者，大都不是家中的獨生子女，如果月干或月支出現官星者，則有身為長子或長女的可能。唯若月支不是印星，或月柱干支均非正官時，則非身為長子。", "註解3": "①年干比肩，為忌，幼時家貧。②年干比肩坐財，有印綬生身，出生於富裕人家，或出生后家境轉好。③年干比肩旺而有印綬生，命局身強無官殺，出生后家境轉差。"},
        { "四柱十神": "年支比肩", "十神": "比肩", "各柱": "年支", "註解1": "", "註解2": "年支坐比肩，兄弟姐妹的個性固執，不能溝通相容，大都自立門戶。年干亦是比肩者，晚婚且與生父母無緣（可能為養子女，或繼承兩家的基業）。當日主當令身強又見年柱干支比肩重疊者；或日主已當令，而年、月兩干再現比肩或劫財者，出身時家境清寒，必須自立更生、白手起家之命。", "註解3": ""},
        { "四柱十神": "月干比肩", "十神": "比肩", "各柱": "月干", "註解1": "比肩現月干，擇善固執，注重工作效率，意志堅定，具有貫徹使命之精神。交友廣泛，重友誼，朋友對錢財有請求時一定付出，賺錢與人分享。兄弟姐妹多，但親兄弟不會幫忙，要靠自己打拼。喜獨靜沉思。感情易有三角糾紛，易成晚婚或單身之人。。", "註解2": "自我觀念強，不願受限制，是難以駕馭的人。女性在職業婦女界相當活躍。適合從事獨資事業。必有兄弟姐妹，若逢空亡，雖有亦不得力。", "註解3": "①月干比肩緊帖幫身，日主太過無制，逞強好勝不馴服。②月干比肩坐衰絕之地，又被官殺克伐，出身貧困。③月干比肩為喜用，可得手足之助；為忌，手足緣薄。"},
        { "四柱十神": "月支比肩", "十神": "比肩", "各柱": "月支", "註解1": "", "註解2": "月支坐比肩，「建祿格」，天干透官者貴，透財者富。《五言獨步》云：「建祿生是月，財官喜透天；不宜身再旺，惟喜茂財源。」有主見，有「人不犯我，我不犯人」的做人原則。獨立能力強，敢作敢當。做事重視經驗法則，成功屬「積沙成塔」型。", "註解3": ""},
        { "四柱十神": "日支比肩", "十神": "比肩", "各柱": "日支", "註解1": "比肩現日支，獨立自主，精力旺盛，已定目標堅決貫徹。責任心重，有擔當力，自尊心強，不太愿意麻煩別人。交際不懂圓滑通融，不擅變通，不善於掩飾，說話太過率直，言語間容易傷害別人。配偶性格剛毅敏捷，思想與己相似，追求比自己年長、成熟之異性為伴侶，較依賴配偶。", "註解2": "有獨身、同性戀的傾向。不善於理財，忌合夥事業。結婚多「先上車後補票」（庚申、辛酉日生尤重）。與同胞緣薄，與朋友、異性緣厚。己未日生者，多剋父；女命無官殺者無子女。", "註解3": "①比肩為喜用，多得配偶幫扶，但口角多；為忌時，受配偶拖累。②男命日主強旺，身坐比肩，幾度新郎。③日支比肩，他柱劫財，婚姻上容易導致色情糾紛。④身強，與父親緣薄。"},
        { "四柱十神": "時干比肩", "十神": "比肩", "各柱": "時干", "註解1": "比肩現時干，易有弟妹。對工作拘謹，行事有幹勁，不喜身心焦慮之工作，累積一生財富容易流失。思想固執脫俗，與年幼者較易相處，唯在工作場中易受同性排斥。與子女關係雖密切但感情淡薄。晚年身體、經濟狀況不好。", "註解2": "子女不多（時支有官、殺時可增多），甚至無子女，須領養。女命婚姻不慎。中、晚年事業多失敗，生涯常寂寞。時支坐羊刃剋父。比肩坐絕者如：乙日乙酉時、辛日辛卯時，男性大都無兄弟，女性無姐妹。", "註解3": "①時干比肩強旺，父親壽短。②時干比肩強旺又坐偏印，子女頑劣。③身弱，時柱透比肩，老年發家。"},
        { "四柱十神": "時支比肩", "十神": "比肩", "各柱": "時支", "註解1": "", "註解2": "時支坐比肩，獨立行事。干支皆比肩，無子。女性夫緣不好。", "註解3": ""},
        { "四柱十神": "年干劫財", "十神": "劫財", "各柱": "年干", "註解1": "劫財現年干，祖上零落，家境清寒，自身早別祖居地，易過繼他人，如非己則手足中有其一命運如此。若家境狀況富裕，長上可能有虧錢，不會存錢的狀況。想要的東西有人競爭。異性手足較多，易成獨子或獨女，早出社會謀職。", "註解2": "雙親重視人際關係，尤其是母親，不是家庭主婦型。大多數的人不會得到遺產。不是長子或長女。", "註解3": "①財星弱而劫財旺，出生貧寒，幼時困苦。②劫財強旺，坐下正印衰弱，母先亡。③年干劫財，他柱劫財眾多，出生后家道漸衰。④年干劫財不遭官殺克伐，年支財星旺不遭他柱克破，出生后家境轉好。"},
        { "四柱十神": "年支劫財", "十神": "劫財", "各柱": "年支", "註解1": "", "註解2": "年支坐劫財，兄弟姐妹的個性外柔內剛，其中的一個可能過房給他人。", "註解3": ""},
        { "四柱十神": "月干劫財", "十神": "劫財", "各柱": "月干", "註解1": "劫財現月干，急躁掘強，外緣佳但內緣不理想。慷慨好施不易積財，喜投機冒險。易因賭、色引起是非破財，自身是醋桶。青年時期事業起伏變化較大，決斷力強。女性在月柱帶劫財，其美跟過比肩，個性不輸男人。", "註解2": "浪費奢侈，揮霍成性，若月支有正財，一生不會富。會結交酒肉朋友。很照顧朋友但兄弟姐妹常吃虧。熱衷政治，與妻不和，生性慷慨。", "註解3": "①月干劫財為忌，少時家貧。②身強劫財透月干，兄弟爭財，薄情失和。③月干劫財為喜用，但遭官殺重克，出生貧寒。④月透劫財喜用，兄弟姐妹相幫。"},
        { "四柱十神": "月支劫財", "十神": "劫財", "各柱": "月支", "註解1": "", "註解2": "月支坐劫財，口快心直，喜歡批評人或罵人。重視外表，說話不算話，常懷不平不滿之心，好投機、賭博。", "註解3": ""},
        { "四柱十神": "日支劫財", "十神": "劫財", "各柱": "日支", "註解1": "劫財現日支，自身剛傲自負，好高騖遠，愛出鋒頭，不愿聽取忠言，自以為是，對別人不易讓步，容易處處樹敵，不受人指使，固執且好辯。為人有投機心，有博賭性格，有勇無謀，容易因考慮不周而做出急切、急進、衝動的行為，而導致很大的損失。大男人主義，異性緣雖佳，但對妻不體貼。女命行事乾脆，有男性化之性格，對夫有輔助之功，但易與夫有意見衝突，易為職業婦女。男女命易因異性破財。", "註解2": "配偶的品貌或學歷大都不高，容貌不漂亮。婚姻不合諧，甚至破裂。丁巳日生人為「文星」，有文學、繪畫才華。容易散財。不利於合夥事業。", "註解3": "①與妻緣薄，口角多，為忌時容易離婚。②沖動、好動、耗財、糾紛。"},
        { "四柱十神": "時干劫財", "十神": "劫財", "各柱": "時干", "註解1": "劫財現時干，作情緒不穩，常發牢騷，與上司易有口舌，因而不易升遷；在上者亦難得部屬支持，工作性質常變動。子息性格頑強，叛逆不易管教，且子女好揮霍金錢，自身亦有偏心之嫌。晚年與子息聚少離多。以投機或短期投資為主，但不宜合夥。 愛佔小便宜、短視、醋桶。", "註解2": "大都無子，或長子難管教，喜歡唱反調。晚年寂莫（妻或子早亡）。", "註解3": "①劫財多而旺，子女容易連累父母。②為忌，晚年勞苦。③為喜用，晚年可得子女之福。"},
        { "四柱十神": "時支劫財", "十神": "劫財", "各柱": "時支", "註解1": "", "註解2": "時支坐劫財，大都無子，或長子難管教，喜歡唱反調。晚年寂莫（妻或子早亡）。", "註解3": ""}
    ];

    var 論斷項目='<span class = "本命論斷項目">四柱十神</span><br>';

    var 十神在各干 = ["年干"+命盤.年干.十神, "月干"+命盤.月干.十神, "時干"+命盤.時干.十神];
    var 十神在各支 = ["年支"+命盤.年支.十神1, "月支"+命盤.月支.十神1, "日支"+命盤.日支.十神1, "時支"+命盤.時支.十神1];

    var 論斷矩陣 = [];
    var 單項矩陣 = [];
    var 天干資料索引, 地支資料索引;

    for (var i = 0; i < 4;i++){

        天干資料索引 = (i!=2) ? (_.findIndex(四柱十神資料, {四柱十神: 十神在各干[i] })):-1;
        地支資料索引 = _.findIndex(四柱十神資料, { 四柱十神: 十神在各支[i] });

        if (天干資料索引 != -1) {
            var 資料註解 = 四柱十神資料[天干資料索引].註解1 +"<br>" + 四柱十神資料[天干資料索引].註解3;
	        論斷矩陣.push(資料註解);
	    }

        if (地支資料索引 != -1) {
            var 地支註解 = 四柱十神資料[地支資料索引].註解1;
            var 日支註解 = 四柱十神資料[地支資料索引].註解2 + "<br>" + 四柱十神資料[地支資料索引].註解3;

            if(日支註解!="") 論斷矩陣.push("<br>"+地支註解+"<br>"+日支註解); else 論斷矩陣.push("<br>"+地支註解);
            }
	    }
    //論斷矩陣.unshift(論斷項目);
    return 論斷項目+論斷矩陣.join("<br>");
}


function 夫妻關係十神定位斷訣(命盤){
    var 性別 = 命盤.性別;
    var 日支十神 = 命盤.日支.十神1;
    var 年支十神 = 命盤.年支.十神1;
    var 月支十神 = 命盤.月支.十神1;
    var 月支五神 = 十神轉五神(月支十神);
    var 年支五神 = 十神轉五神(年支十神);
    var 日月支神 = 日支十神 + 月支五神;

    var 夫妻關係論斷矩陣 = [];

	var 夫妻十神定位資料 = [
        { "日支月支": "比肩比劫", "日支": "比肩", "月支": "比劫", "註解": "日支比肩，月支劫財、比肩：夫妻恩愛，但雙方都固執已見。", "男命": "男性對妻子有無法溝通自己之意見的情形。"},
        { "日支月支": "比肩印梟", "日支": "比肩", "月支": "印梟", "註解": "日支比肩，月支正印、偏印：配偶缺乏協調性，你須以體貼對方的心情來維持夫妻關係。", "男命": ""},
        { "日支月支": "比肩官殺", "日支": "比肩", "月支": "官殺", "註解": "日支比肩，月支正官、七殺：容易造成夫妻間的隔閡。有食神、傷官時可化解。夫妻經常爭執，因配偶的頑固壓迫，而累積不安，且因無法對付。若互相頂嘴，會演成大事件。", "男命": ""},
        { "日支月支": "比肩財才", "日支": "比肩", "月支": "財才", "註解": "日支比肩，月支正財、偏財：與配偶貌合神離，心照不宣。", "男命": ""},
        { "日支月支": "比肩食傷", "日支": "比肩", "月支": "食傷", "註解": "日支比肩，月支食神、傷官：有緩和配偶的固執，使婚姻圓滿的能力。", "男命": ""},
        { "日支月支": "劫財比劫", "日支": "劫財", "月支": "比劫", "註解": "日支劫財，月支劫財、比肩：若雙方不固執已見，夫妻是很恩愛的。", "男命": "男性易對妻子不忠實，女性不會。"},
        { "日支月支": "劫財印梟", "日支": "劫財", "月支": "印梟", "註解": "日支劫財，月支正印、偏印：能幫助配偶，感情融洽。", "男命": ""},
        { "日支月支": "劫財官殺", "日支": "劫財", "月支": "官殺", "註解": "日支劫財，月支正官、七殺：夫妻性情不相投，時生不滿、隔閡。", "男命": ""},
        { "日支月支": "劫財財才", "日支": "劫財", "月支": "財才", "註解": "日支劫財，月支正財、偏財：因配偶不顧家庭，困擾很多。", "男命": ""},
        { "日支月支": "劫財食傷", "日支": "劫財", "月支": "食傷", "註解": "日支劫財，月支食神、傷官：配偶雖熱衷於交際，但不會忘對你體貼，夫妻感情還算圓滿。", "男命": ""},
        { "日支月支": "偏印比劫", "日支": "偏印", "月支": "比劫", "註解": "日支偏印，月支劫財、比肩：配偶有濃厚的體貼心，婚姻美滿。", "男命": ""},
        { "日支月支": "偏印印梟", "日支": "偏印", "月支": "印梟", "註解": "日支偏印，月支正印、偏印：夫妻即使發生衝突，亦不至於反目。", "男命": "男性，因妻子容易唱反調而困擾。"},
        { "日支月支": "偏印官殺", "日支": "偏印", "月支": "官殺", "註解": "日支偏印，月支正官、七殺：夫妻感情融洽。", "男命": ""},
        { "日支月支": "偏印財才", "日支": "偏印", "月支": "財才", "註解": "日支偏印，月支正財、偏財：由於意氣用事，夫妻常起爭執。", "男命": ""},
        { "日支月支": "偏印食傷", "日支": "偏印", "月支": "食傷", "註解": "日支偏印，月支食神、傷官：夫妻性情怪異，婚姻不正常。有比、劫星能化解。", "男命": ""},
        { "日支月支": "正印比劫", "日支": "正印", "月支": "比劫", "註解": "日支正印，月支劫財、比肩：配偶愛情專一，但是你必須接受配偶的指使。", "男命": ""},
        { "日支月支": "正印印梟", "日支": "正印", "月支": "印梟", "註解": "日支正印，月支正印、偏印：夫妻感情如朋友，久之冷淡。", "男命": "男性較顯著。"},
        { "日支月支": "正印官殺", "日支": "正印", "月支": "官殺", "註解": "日支正印，月支正官、七殺：能體貼配偶。", "男命": ""},
        { "日支月支": "正印財才", "日支": "正印", "月支": "財才", "註解": "日支正印，月支正財、偏財：夫妻不能和諧，若不尊重對方意見時，則起爭執。", "男命": ""},
        { "日支月支": "正印食傷", "日支": "正印", "月支": "食傷", "註解": "日支正印，月支食神、傷官：配偶容易啐啐唸，回家如回旅館，感覺很吵。", "男命": ""},
        { "日支月支": "七殺比劫", "日支": "七殺", "月支": "比劫", "註解": "日支七殺，月支劫財、比肩：夫妻間衝突、隔閡多，容易意氣用事，印星可化解。", "男命": ""},
        { "日支月支": "七殺印梟", "日支": "七殺", "月支": "印梟", "註解": "日支七殺，月支正印、偏印：夫妻能融洽相處，你很會照顧對方。", "男命": ""},
        { "日支月支": "七殺官殺", "日支": "七殺", "月支": "官殺", "註解": "日支七殺，月支正官、七殺：意見雖衝突，也不致失去原有的夫妻感情。", "男命": ""},
        { "日支月支": "七殺財才", "日支": "七殺", "月支": "財才", "註解": "日支七殺，月支正財、偏財：配偶能直率地接受你的體貼，雖然對方脾氣暴燥，不會輕易改過，但夫妻感情還算融洽。", "男命": ""},
        { "日支月支": "七殺食傷", "日支": "七殺", "月支": "食傷", "註解": "日支七殺，月支食神、傷官：夫妻很難和睦相處，吵架的原因者因你而起，至於把事情鬧大的是你的配偶。", "男命": ""},
        { "日支月支": "正官比劫", "日支": "正官", "月支": "比劫", "註解": "日支正官，月支劫財、比肩：由於你的感情用事，傷及配偶的自尊心，夫妻常發生磨擦。", "男命": ""},
        { "日支月支": "正官印梟", "日支": "正官", "月支": "印梟", "註解": "日支正官，月支正印、偏印：夫妻生活美滿，配偶善體人意。", "男命": ""},
        { "日支月支": "正官官殺", "日支": "正官", "月支": "官殺", "註解": "日支正官，月支正官、七殺：夫妻皆能自制，即使有意見上的衝突。", "男命": ""},
        { "日支月支": "正官財才", "日支": "正官", "月支": "財才", "註解": "日支正官，月支正財、偏財：能享受婚姻之樂。", "男命": ""},
        { "日支月支": "正官食傷", "日支": "正官", "月支": "食傷", "註解": "日支正官，月支食神、傷官：夫妻感情極惡劣，惟有尊重對方才能和睦。", "男命": ""},
        { "日支月支": "偏財比劫", "日支": "偏財", "月支": "比劫", "註解": "日支偏財，月支劫財、比肩：配偶帶給你麻煩，造成隔閡。", "男命": ""},
        { "日支月支": "偏財印梟", "日支": "偏財", "月支": "印梟", "註解": "日支偏財，月支正印、偏印：夫妻時生磨擦，同床異夢。", "男命": ""},
        { "日支月支": "偏財官殺", "日支": "偏財", "月支": "官殺", "註解": "日支偏財，月支正官、七殺：配偶身心健全，夫妻圓滿。", "男命": ""},
        { "日支月支": "偏財財才", "日支": "偏財", "月支": "財才", "註解": "日支偏財，月支正財、偏財：夫妻「床頭打床尾和」，在任何情形下，皆能保持和庇。", "男命": "男性容易在外拈花惹草。"},
        { "日支月支": "偏財食傷", "日支": "偏財", "月支": "食傷", "註解": "日支偏財，月支食神、傷官：配偶的依賴性強。夫妻能和睦。", "男命": ""},
        { "日支月支": "正財比劫", "日支": "正財", "月支": "比劫", "註解": "日支正財，月支劫財、比肩：因不重視配偶的意見，時起爭熱。", "男命": ""},
        { "日支月支": "正財印梟", "日支": "正財", "月支": "印梟", "註解": "日支正財，月支正印、偏印：配偶會約束你，夫妻間常生不滿。", "男命": ""},
        { "日支月支": "正財官殺", "日支": "正財", "月支": "官殺", "註解": "日支正財，月支正官、七殺：配偶相當關心你，但是有時會關心得過火，讓你吃不消。", "男命": "男性易對妻子不忠實。"},
        { "日支月支": "正財財才", "日支": "正財", "月支": "財才", "註解": "日支正財，月支正財、偏財：夫妻相敬如賓。", "男命": ""},
        { "日支月支": "正財食傷", "日支": "正財", "月支": "食傷", "註解": "日支正財，月支食神、傷官：對配偶能體貼，夫妻恩愛。", "男命": ""},
        { "日支月支": "食神比劫", "日支": "食神", "月支": "比劫", "註解": "日支食神，月支劫財、比肩：配偶對工作不熱衷，但能聽從命主的勸告。", "男命": ""},
        { "日支月支": "食神印梟", "日支": "食神", "月支": "印梟", "註解": "日支食神，月支正印、偏印：夫妻之間存有隔閡、紛爭、冷戰時常發生。若其他部位又有比、劫星，有離婚之可能。", "男命": ""},
        { "日支月支": "食神官殺", "日支": "食神", "月支": "官殺", "註解": "日支食神，月支正官、七殺：不滿配偶的生活態度、方式，夫妻常因此而反目。", "男命": ""},
        { "日支月支": "食神財才", "日支": "食神", "月支": "財才", "註解": "日支食神，月支正財、偏財：配偶的雍容華貴能予你支持力，夫妻感情融洽。", "男命": ""},
        { "日支月支": "食神食傷", "日支": "食神", "月支": "食傷", "註解": "日支食神，月支食神、傷官：夫妻恩愛。", "男命": "男性，不能駕馭妻子，聽從己意。"},
        { "日支月支": "傷官比劫", "日支": "傷官", "月支": "比劫", "註解": "日支傷官，月支劫財、比肩：配偶會與你唱反調，但最後能順從你。", "男命": ""},
        { "日支月支": "傷官印梟", "日支": "傷官", "月支": "印梟", "註解": "日支傷官，月支正印、偏印：夫妻關係不正常。雙方都喜歡強辯。", "男命": ""},
        { "日支月支": "傷官官殺", "日支": "傷官", "月支": "官殺", "註解": "日支傷官，月支正官、七殺：夫妻關係不正常，若不自重自愛婚姻一家破裂。", "男命": ""},
        { "日支月支": "傷官財才", "日支": "傷官", "月支": "財才", "註解": "日支傷官，月支正財、偏財：配偶個性孤僻，但能體貼你。", "男命": ""},
        { "日支月支": "傷官食傷", "日支": "傷官", "月支": "食傷", "註解": "日支傷官，月支食神、傷官：夫妻感情相敬如賓，偶而會爭執。", "男命": ""}
    ];

    var 論斷項目='<span class = "本命論斷項目">夫妻關係十神定位斷訣：</span>';
    var 資料索引=_.findIndex(夫妻十神定位資料, {日支月支: 日月支神});
    var 男命資料 = (性別 == "男") ? 夫妻十神定位資料[資料索引].男命 : "";
    
    if (資料索引 != -1) {
        var 資料註解 = 夫妻十神定位資料[資料索引].註解 + 男命資料;
        夫妻關係論斷矩陣.push(論斷項目);
        夫妻關係論斷矩陣.push(資料註解);
	}
	else alert("夫妻關係十神定位斷訣 沒有搜尋到資料！");


    switch(日支十神) {
        case "偏印":
            if (年支五神=="印梟") 夫妻關係論斷矩陣.push("日支偏印，年支正印、偏印：容易再婚。");
            break;
        case "偏財":
            if (年支十神=="偏財") 夫妻關係論斷矩陣.push("日支偏財，年支偏財：容易再婚。");
            break;
        case "正財":
            if (年支五神=="財才") 夫妻關係論斷矩陣.push("日支正財， 年支正財、偏財：再婚。或配偶是已結過婚的人。");
            break;
        case "正財":
            if (年支五神=="財才") 夫妻關係論斷矩陣.push("日支正財， 年支正財、偏財：再婚。或配偶是已結過婚的人。");
            break;
        case "食神":
            if (年支五神=="食傷") 夫妻關係論斷矩陣.push("日支食神，年支食神、傷官：有再婚之可能。");
            break;
        case "傷官":
            if (年支五神=="食傷") 夫妻關係論斷矩陣.push("日支傷官，年支食神、傷官：再婚。");
            break;
    }
    return 夫妻關係論斷矩陣.join("<br>");
}


function 父子關係十神斷訣(命盤) {
    //var 性別 = 命盤.性別;
    var 年干十神 = 命盤.年干.十神;
    var 年支十神 = 命盤.年支.十神1;
    var 月干十神 = 命盤.月干.十神;
    var 月支十神 = 命盤.月支.十神1;
    var 月支五神 = 十神轉五神(月支十神);
    //var 年支五神 = 十神轉五神(年支十神);
    var 年干月支十神 = "年"+年干十神 + "月"+月支五神;

    var 父子關係論斷矩陣 = [];

    var 父子十神論斷資料 = [
        { "年干月支": "年比肩月比劫", "年干": "比肩", "月支": "比劫", "註解": ""},
        { "年干月支": "年比肩月食傷", "年干": "比肩", "月支": "食傷", "註解": "年干比肩，月支食神、傷官：受雙親寵愛。"},
        { "年干月支": "年比肩月財才", "年干": "比肩", "月支": "財才", "註解": "年干比肩，月支正財、偏財：因雙親的意見而不安，若其它部位有俯視或傷官時，與雙親的感情就比較融洽。"},
        { "年干月支": "年比肩月官殺", "年干": "比肩", "月支": "官殺", "註解": "年干比肩，月支正官、七殺：與雙親不和，會*雙親順從己意。其他部位又有正官、七殺星很多時、雙親勞苦，有印星則不會。"},
        { "年干月支": "年比肩月印梟", "年干": "比肩", "月支": "印梟", "註解": "年干比肩，月支正印、偏印：為孝子，時時惦記雙親。"},
        { "年干月支": "年劫財月比劫", "年干": "劫財", "月支": "比劫", "註解": "年干劫財，月支比肩、劫財：與雙親在意見沖突時，關系會變得很惡劣。"},
        { "年干月支": "年劫財月食傷", "年干": "劫財", "月支": "食傷", "註解": "年干劫財，月支食神、傷官：能得雙親之愛護，感情融洽。"},
        { "年干月支": "年劫財月財才", "年干": "劫財", "月支": "財才", "註解": "年干劫財，月支正財、偏財：受雙親掣肘，以致覺得令人厭煩，甚至斷絕親子關系。其他位置有食神、傷官時會緩和，娶妻子后，與父母不能融洽相處。"},
        { "年干月支": "年劫財月官殺", "年干": "劫財", "月支": "官殺", "註解": "年干劫財，月支正官、七殺：經常為難父母，使父母傷心煩惱。"},
        { "年干月支": "年劫財月印梟", "年干": "劫財", "月支": "印梟", "註解": ""},
        { "年干月支": "年偏印月比劫", "年干": "偏印", "月支": "比劫", "註解": "年干偏印，月支比肩、劫財：對父母冷淡，父母對你卻有深厚的親情。"},
        { "年干月支": "年偏印月食傷", "年干": "偏印", "月支": "食傷", "註解": "年干偏印，月支食神、傷官：與父母微此無法了解，意見對立，甚至決裂，月支是傷官時更甚。年干偏印、月支食神或傷官，年干是日干的死或色，在未成年之前會失去父母中的一位。其他部位有比肩或劫財時，可避免此災厄。"},
        { "年干月支": "年偏印月財才", "年干": "偏印", "月支": "財才", "註解": "年干偏印，月支正財、偏財：與雙親之間常有糾紛發生。"},
        { "年干月支": "年偏印月官殺", "年干": "偏印", "月支": "官殺", "註解": "年干偏印，月支正官、七殺：教順父母。若年干、日支、月干又都是官殺星時，兄弟姐妹、配偶、兒女都孝順你的父母。"},
        { "年干月支": "年偏印月印梟", "年干": "偏印", "月支": "印梟", "註解": "年干偏印，月支正印、偏印：與父母感情如朋友。"},
        { "年干月支": "年正印月比劫", "年干": "正印", "月支": "比劫", "註解": "年干正印，月支比肩、劫財：父母相當溺愛你，比劫太多時，父母基至為你犧牲。"},
        { "年干月支": "年正印月食傷", "年干": "正印", "月支": "食傷", "註解": "年干正印，月支食神、傷官：與父母不能溝通，關系惡劣。有比、劫星則能化解。"},
        { "年干月支": "年正印月財才", "年干": "正印", "月支": "財才", "註解": "年干正印，月支正財、偏財：常使父母*心勞苦。"},
        { "年干月支": "年正印月官殺", "年干": "正印", "月支": "官殺", "註解": "年干正印，月支正官、七殺：與父母相處融洽，能為父母分憂，減輕負擔。"},
        { "年干月支": "年正印月印梟", "年干": "正印", "月支": "印梟", "註解": "年干正印，月支正印、偏印：與父母感情如朋友。"},
        { "年干月支": "年七殺月比劫", "年干": "七殺", "月支": "比劫", "註解": "年干七殺，月支比肩、劫財：與父母常生磨擦。父母脾氣暴燥。"},
        { "年干月支": "年七殺月食傷", "年干": "七殺", "月支": "食傷", "註解": "年干七殺，月支食神、傷官：若其他部位又有許多食傷星時，父母會因事故受傷。有偏財、正財時能化解。"},
        { "年干月支": "年七殺月財才", "年干": "七殺", "月支": "財才", "註解": "年干七殺，月支正財、偏財：與雙親關系圓滿，其他部位又有財星時，你、兄弟、姐妹、配偶、兒女皆能孝順你的父母。"},
        { "年干月支": "年七殺月官殺", "年干": "七殺", "月支": "官殺", "註解": "年干七殺，月支正官、七殺：與雙親相處如朋友，有時意見不投；但不至於決裂。"},
        { "年干月支": "年七殺月印梟", "年干": "七殺", "月支": "印梟", "註解": "年干七殺，月支正印、偏印：雙親個性溫和，給予你很多親情。"},
        { "年干月支": "年正官月比劫", "年干": "正官", "月支": "比劫", "註解": "年干正官，月支比肩、劫財：能屈服父母的意見，但是對父母不滿的心，無形中產生，久而久之，最后可能決裂。"},
        { "年干月支": "年正官月食傷", "年干": "正官", "月支": "食傷", "註解": "年干正官，月支食神、傷官：因常常惹事而使父母一輩子為你煩惱。若其他部位又有太多食傷星時，父母易遭受事故受傷。"},
        { "年干月支": "年正官月財才", "年干": "正官", "月支": "財才", "註解": "年干正官，月支正財、偏財：孝順父母，親子關系圓滿。"},
        { "年干月支": "年正官月官殺", "年干": "正官", "月支": "官殺", "註解": "年干正官，月支正官、七殺：與雙親如兄弟。"},
        { "年干月支": "年正官月印梟", "年干": "正官", "月支": "印梟", "註解": "年干正官，月支正印、偏印：雙親能以親情來感化、教導你。即使你反抗也不至於斷絕關系。"},
        { "年干月支": "年偏財月比劫", "年干": "偏財", "月支": "比劫", "註解": "年干偏財，月支比肩、劫財：因個性固執，使雙親為難，其他部位有食、傷星時不會。"},
        { "年干月支": "年偏財月食傷", "年干": "偏財", "月支": "食傷", "註解": "年干偏財，月支食神、傷官：雙親的經濟能力不錯，感情融洽，能孝順父母。"},
        { "年干月支": "年偏財月財才", "年干": "偏財", "月支": "財才", "註解": "年干偏財，月支正財、偏財：與雙親的關系如朋友一般，但觀念不能溝通。"},
        { "年干月支": "年偏財月官殺", "年干": "偏財", "月支": "官殺", "註解": "年干偏財，月支正官、七殺：孝順，能得到雙親的恩惠，其他部位有很多財星時，父母一生辛勞。"},
        { "年干月支": "年偏財月印梟", "年干": "偏財", "月支": "印梟", "註解": "年干偏財，月支正印、偏印：與父母易沖突。其他位置有官、殺星時可緩和。"},
        { "年干月支": "年正財月比劫", "年干": "正財", "月支": "比劫", "註解": "年干正財，月支比肩、劫財：個性頑固，使父母憂心。有食、傷星，可化解。"},
        { "年干月支": "年正財月食傷", "年干": "正財", "月支": "食傷", "註解": "年干正財，月支食神、傷官：對父母極孝順，其他部位若有食傷星時，父母能振興家業。"},
        { "年干月支": "年正財月財才", "年干": "正財", "月支": "財才", "註解": "年干正財，月支正財、偏財：與父母之感情如朋友，幼年物質生活豐富。"},
        { "年干月支": "年正財月官殺", "年干": "正財", "月支": "官殺", "註解": "年干正財，月支正官、七殺：雙親性情溫和，能受父母之呵護。其他部位又有太多官殺星時，父母會因某原因，為家庭犧牲。"},
        { "年干月支": "年正財月印梟", "年干": "正財", "月支": "印梟", "註解": "年干正財，月支正印、偏印：因雙親之為難而勞苦，月支是正印時更甚。"},
        { "年干月支": "年食神月比劫", "年干": "食神", "月支": "比劫", "註解": "年干食神，月支比肩、劫財：家人和睦、能孝養雙親。"},
        { "年干月支": "年食神月食傷", "年干": "食神", "月支": "食傷", "註解": "年干食神，月支食神、傷官：與雙親的關系如朋友一般親切。"},
        { "年干月支": "年食神月財才", "年干": "食神", "月支": "財才", "註解": "年干食神，月支正財、偏財：能獲得雙親的照顧，自己也很會教養兒女。"},
        { "年干月支": "年食神月官殺", "年干": "食神", "月支": "官殺", "註解": "年干食神，月支正官、七殺：與雙親不能溝通，甚至決裂，有財星則不會。"},
        { "年干月支": "年食神月印梟", "年干": "食神", "月支": "印梟", "註解": "年干食神，月支正印、偏印：與雙親無緣。若其他部位又有很多偏印、正印時，父親可能橫死。若月干、年干、或日支，有一位比肩或劫財時，才不會有這種悲劇。"},
        { "年干月支": "年傷官月比劫", "年干": "傷官", "月支": "比劫", "註解": "年干傷官，月支比肩、劫財：雙親個性怪異，但能採納你的意見。"},
        { "年干月支": "年傷官月食傷", "年干": "傷官", "月支": "食傷", "註解": "年干傷官，月支食神、傷官：與雙親和朋友一般融洽，雙親在別人眼中是怪人。"},
        { "年干月支": "年傷官月財才", "年干": "傷官", "月支": "財才", "註解": "年干傷官，月支正財、偏財：能充分得到父母的恩惠，若其他部位出現太多的正財、偏財時，雙親會因為某種原因而為全家犧牲。"},
        { "年干月支": "年傷官月官殺", "年干": "傷官", "月支": "官殺", "註解": "年干傷官，月支正官、七殺：與雙親緣薄，月支有偏官時，甚至脫離關系。"},
        { "年干月支": "年傷官月印梟", "年干": "傷官", "月支": "印梟", "註解": "年干傷官，月支正印、偏印：雙親令人厭煩，意見不能溝通，月支是偏印時更甚"}
    ];

    var 論斷項目='<span class = "本命論斷項目">父子/女關係十神斷訣：</span><br>';
    var 資料索引=_.findIndex(父子十神論斷資料, {年干月支: 年干月支十神});
    
    if (資料索引 != -1) {
        var 資料註解 = 父子十神論斷資料[資料索引].註解;
        父子關係論斷矩陣.push(資料註解);
	}
	else alert("父子/女關係十神斷訣 沒有搜尋到資料！");

    switch(年干十神) {
        case "比肩":
            if (年支十神=="比肩") 父子關係論斷矩陣.push("年干比肩，年支比肩：日主若當令，幼年時代家境貧困。");
            if (月支十神=="正官" || 月干十神=="正官") 父子關係論斷矩陣.push("年干比肩，月支正官：多為長子或長女，月干是正官時亦同。");
            if (月支十神!="正官" && 月干十神!="正官" && 月支十神!="正印") 父子關係論斷矩陣.push("年干比肩，若月干支不是正官，本氣又非正印，則多為老么，或過房、養子。");
            break;
        case "劫財":
            if (月支十神=="正印") 父子關係論斷矩陣.push("年干劫財，月支正印：有孝養雙親。");
            if (月支十神=="正官") 父子關係論斷矩陣.push("年干劫財，月支正官：與雙親不和，會令雙親順從己意。其他部位又有正官、七殺星很多時、雙親勞苦，有印星則不會。");
            if (月干十神=="比肩") 父子關係論斷矩陣.push("年干劫財，月干比肩：日主當令時，幼年家境貧困。");
            if (年支十神=="劫財") 父子關係論斷矩陣.push("年干劫財，年支劫財：日主當令時，幼年家境貧困。");
            break;
        case "食神":
            if (年支十神=="食神") 父子關係論斷矩陣.push("年干食神，年支食神：能得雙親財力之助，其他部位有財星，一生享福，能創大業。");
            break;
    }

    if(父子關係論斷矩陣.length>0){
        var 父子關係論斷字串=父子關係論斷矩陣.join("<br>");
        var 父子關係論斷字串 = 論斷項目+父子關係論斷字串;
        return 父子關係論斷字串;
    }
}


function 十神斷配偶喜忌(日支十神) {

    var 配偶喜忌資料 = [
        { "十神": "比肩", "喜": "日支比肩爲喜用，配偶剛毅穩健，積極進取，任勞任怨，負責盡職，固守本分，不貪非分，理智主動，果斷堅忍，獨當一面，獨樹一幟，意志堅強，渴望與人並駕齊驅。", "忌": "日支比肩爲忌神，配偶自私自利，只顧自己，不顧他人，消極被動，進取不足，謀事草率，固執己見，欠缺融通，不善人際關係，缺乏交際手腕，果斷不足，臨事不決，孤僻寡合，短視淺慮，缺乏毅力。"},
        { "十神": "劫財", "喜": "日支劫財爲喜用，配偶積極進取，果斷堅忍，鬥志高昂，冒險患難，善於口才，擅於交際，意志堅定，權變融通，慷慨熱心，敏捷機智，重視效率，臨事不懼，勇往邁進。", "忌": "日支劫財爲忌神，配偶盲目衝動，想法天眞，喜好投機，淺慮近視，急功好利，做事欠缺思考，橫衝直撞，有勇無謀，不知權變融通，人際關係惡劣，行動暴躁蠻橫，成事不足，敗事有餘，缺乏耐性，喜走捷徑，以爲武力可以解決一切，常把事情鬧得不可收拾。"},
        { "十神": "食神", "喜": "日支食神爲喜用，配偶溫文厚道，仁慈善良，平易近人，和藹可親、寬容厚重，善解人意，溫良恭儉，豐衣足食，表達流暢、多才多藝，思想淸新脫俗，凡事考慮周詳，不與人斤斤計較，深得人和之惠，每都心寬體胖。", "忌": "日支食神爲忌神，冷漠消極，不解人意，表裏不一，缺乏進取，沈迷享受，不知上進，固執己見，不善權變，假道斯文，浮華不實，叛逆善變，思想天真，忽略現實生活，陶醉自我世界。"},
        { "十神": "傷官", "喜": "日支傷官爲喜用，配偶聰明伶俐，英明睿智，活潑善辯，才華橫溢，雄心萬丈，表達流利，多才多藝，機關深遠，機智權變，深富謀略，積極進取，堅忍不拔，具有追求卓越之強烈榮譽感，盼望別人之肯定與讚譽。", "忌": "日支傷官爲忌神，配偶愛慕虛榮，偏激叛逆，剛愎自傲、睥睨他人，漠視法律，我行我素，恃才傲物，任性乖張，倔強固執，言論尖銳，傷害他人，以私害公，招來禍患。好勝好強，爲達目的，不擇手段。"},
        { "十神": "偏財", "喜": "日支偏財爲喜用，配偶機智靈敏，慷慨多情，重友執誼，樂於助人，圓滑機伶，權通達變，樂觀進取，不畏困難，坦率眞誠，精明能幹，熱忱豪爽，敏捷效率，富於交際手腕 ，善於把握機會，生平多機緣巧遇。", "忌": "日支偏財爲忌神，配偶虛榮浮華，奢侈浪費，投機取巧，言行不一，缺乏責任，做事馬虎，喜鑽捷徑，風流成性，玩世不恭，舉止輕浮，常有意外破耗，缺乏家庭責任。有巧言詐 欺之嫌。"},
        { "十神": "正財", "喜": "日支正財爲喜用，配偶腳踏實地，忠厚老實，勤勞樸素，守本分，不投機。守信用，能知足，正直穩重，親切大方，任勞任怨，愛護家庭，盡責盡職。做事按部就班，循序漸進，衣食富足，溫和保守。", "忌": "日支正財爲忌神，配偶苟且偸安，好逸惡勞，貪圖享受，不求上進，安於現狀，吝嗇寡情，消極怠惰，魄力不足，缺乏耐心，虎頭蛇尾，刻板嚴肅，缺乏融通，斤斤計較，因小失大，不善權通。"},
        { "十神": "七殺", "喜": "日支七殺為喜用，配偶勇敢果決，積極進取、魄力十足，機智靈敏，負責盡職，剛毅偏激，俠義急躁，明察秋毫。", "忌": "日支七殺為忌神，配偶違規叛逆，固執己見，欠缺融通，倔強霸道，臨事憂柔寡斷，猜忌多疑，凡事阻滞。"},
        { "十神": "正官", "喜": "日支正官為喜用，配偶相貌端正，做事負責盡職，循規蹈矩，光明正大，客觀理性，思慮周密，奉公守法。", "忌": "日支正官為忌神，配偶墨守成規，缺乏進取、器識不足，不善權通，猜忌多疑，刻板嚴肅，坐失良機。"},
        { "十神": "偏印", "喜": "日支偏印爲喜用，配偶精明，領悟力強，機智權變，反應迅速敏捷，行事重視效率，沈穩內向，鬥志昂揚。精於硏究，企劃、創造、冷靜理智。", "忌": "日支偏印爲忌神，配偶孤獨冷漠，不解人意，爲人輕浮，做事草率，陰沈偏頗，尖酸刻薄，過高評價自我，缺乏容人雅量，自私自利，耐力不足，做事三心兩意，多謀少成。人際關係不佳。"},
        { "十神": "正印", "喜": "日支正印爲喜用，配偶聰穎仁慈，端正賢良，樂觀開朗，穩重敦厚、平易近人，親切和藹，有容人雅量，能逆來順受。", "忌": "日支正印爲忌神，配偶反應遲鈍，不善權通，進取不足，悲觀憂悶，缺乏耐心，思想天真，不切實際 ，不善察言觀色，好面子而有掩飾缺點之心性。"}
	];

    var 經典標題='<span class = "本命論斷項目">日支十神斷配偶喜忌</span><br>';
    var 資料索引=_.findIndex(配偶喜忌資料, {十神: 日支十神});
    if (資料索引 != -1) {
        var 資料註解 = 配偶喜忌資料[資料索引].喜+"<br><br>"+配偶喜忌資料[資料索引].忌;
	    return 經典標題 + 資料註解;
	}
	else alert("日支十神斷配偶喜忌 沒有搜尋到資料！");
}

function 十神坐十神(命盤) {
    //柱名=年柱，月柱，時柱，並無日柱
    var 年月時十神坐十神 = [命盤.年干.十神+"坐"+命盤.年支.十神1, 命盤.月干.十神+"坐"+命盤.月支.十神1, 命盤.時干.十神+"坐"+命盤.時支.十神1];
    var 年月時柱 = ["年柱", "月柱", "時柱"];

    var 十神坐十神資料 = [
        { "十神坐十神": "比肩坐食神", "註解1": "大吉大利，比肩排斥食神，比肩的優點可以保留，還可以增加食神吉的力量，成事順利（食神表示福氣，比肩表示幫助力），食祿豐厚（食神是食祿之星），有創作之才（比肩能吃苦耐勞，堅定，冷靜，食神為才能的表現力）。"},
        { "十神坐十神": "比肩坐正財", "註解1": "大吉有利，比肩克不了正財，為無力克正財，與人合作事業多吉利，得財利（正財是財利），能娶到好的妻子（正財為喜用神，代表好的妻子），諸事順利。"},
        { "十神坐十神": "比肩坐七殺", "註解1": "大凶有大災，七殺可以制比肩，一生勞心勞力（比肩為多勞，又加上七殺，如雪上加霜），會為朋友多煩惱，更會有盜竊詐騙的事（七殺代表盜竊和詐騙），很多的犯罪份子都是比肩坐七殺，常會有病痛之災（比肩泄正印生病，七殺克日主也代表病災），如若是女命則多代夫受罪勞苦（七殺為夫，而克比肩會為夫代輩勞苦）。"},
        { "十神坐十神": "比肩坐正官", "註解1": "吉凶參半，比要參照八字的喜用和忌神來看，為人爭權奪利，勾心斗角，是非不斷（正官為忌神則有是非，比肩表示會爭權奪利），但如若是喜用的話，則會得到他人的敬重（正官是得人敬重，比肩是個性正直不貪）。"},
        { "十神坐十神": "比肩坐偏財", "註解1": "不吉利，會因父親或情人的原因，在事業上發生紛爭（偏財代表父親情人，小老婆，偏財被劫表示失敗），一生中常會遇到色情或疾病之災（偏財代表身體，又代表情人、小老婆）。"},
        { "十神坐十神": "比肩坐比肩", "註解1": "平常，沒有什麼大的起伏，無主見（和正官七殺是對立的），養子之合（比肩克父星，泄正印母星），會為朋友盡心盡力（如若八字中比肩是喜用則吉，事業上會得到朋友的幫助，而吉祥，如若是忌神，則會因為朋友之事而受到連累），和父親的緣份比較淡薄，有生離死別之現象（比肩克偏財），為人處事好孤獨，男命多遲婚（克偏財妻星，對抗正財，比肩是孤獨之星）。"},
        { "十神坐十神": "比肩坐偏印", "註解1": "不吉利大凶，偏印會排斥比肩，多勞苦而受到損失，做事枉費心力（比肩代表勞苦，偏印代表少福）；沒有固定的住所，沒有固定的工作，有了還會失掉（偏印代表多種職業）；為人冷酷無情（比肩為冷靜，偏印代表有心機）；婚姻不順有婚變之災（兩星都代表熱切，孤獨）。"},
        { "十神坐十神": "比肩坐正印", "註解1": "大吉大利，正印全心全力生比肩，經商或者做偏業都會得到很大的利益（正印代表副業成功，比肩代表投資合作的伙伴），能得到貴人的扶持幫助，事業繁重榮（正印為貴人，比肩代表幫助力）。"},
        { "十神坐十神": "比肩坐傷官", "註解1": "不吉利，比肩全力生傷官，則比肩性質弱，傷官性質強旺，助人不利反被忌，叫做幫人幫倒忙，出了好心沒好報（比肩是幫助別人，結果生了傷官而被泄身），常會為金錢之事打擾親朋好友（傷官星星相賺錢之星，結果泄了比肩之特性而擾了朋友親戚），為人為食養子之命而破家（比肩為養子而生傷官，傷官是破家之星），無論男女婚后家庭風波不斷（比肩無論男女皆有色情問題，失和，傷官在女命尤為不吉）。"},
        { "十神坐十神": "比肩坐劫財", "註解1": "大凶，會為家人親友蒙受損失（比劫是親友，若為喜神則不會，若是忌神才是），與人合作事業會中途散伙（比肩為忌神，表示合作的事業），兄弟間多口角是非（比劫表示兄弟為忌神時），和妻子不和（比肩為忌神，克偏財，與官對立），如若年月多見比劫者，父緣薄或父早死。"},
        { "十神坐十神": "劫財坐正財", "註解1": "大凶，克妻，詐騙，破財，為親戚朋友之事而徒生煩惱（克正財妻子，劫正當之財——透過詐騙的手段，劫的財為親戚朋友的）。"},
        { "十神坐十神": "劫財坐偏印", "註解1": "大凶，職業不穩定，生活不安定（偏印為偏業，為生活之來源，被劫財全力泄掉），經營副業多失敗，內心深處冷酷無情，離婚（偏印心機重，偏印全力泄劫財而克正偏財）。"},
        { "十神坐十神": "劫財坐比肩", "註解1": "不吉。家事，婚事，事業均不順（克偏財父星，克正財妻星），會為兄弟朋友煩心勞苦（比劫為兄弟朋友），女命則會為丈夫品行不端而煩惱（因此劫會爭合正官夫星）。"},
        { "十神坐十神": "劫財坐劫財", "註解1": "大凶。父早亡，如若沒早亡也是久病纏綿（因劫財克正偏財），與人合作的事業會中途而散，會因合伙而破財，謀事難成，不吉（劫財和代表工作的官星正官對立的），男命易克妻或婚變（克正偏財）。"},
        { "十神坐十神": "劫財坐食神", "註解1": "大吉大利，食神可以全心全力的泄掉劫財之力，有貴人扶持可得意外之財富（劫財為貴人），物質獎勵豐富（食神是食祿），但女命要經過兩次以上的婚姻才能得到幸福（劫財與正官對沖，食神克正官，女命正官為丈夫）。"},
        { "十神坐十神": "劫財坐正印", "註解1": "不吉，表面繁榮（正印原因），內裡空虛（劫財），投資大而獲利少（正印生劫財），但會因為手下人努力工作而漸漸帶來好運。"},
        { "十神坐十神": "劫財坐七殺", "註解1": "半吉半凶，七殺克劫財無力，凡事多成多敗，雖有發達的機會和條件，可惜懷才不遇，即使能夠成功也不得長久，立刻兵敗如山倒（七殺雖可壓制劫財，具備發達的條件，但終究是無效的壓制，以失敗告終）。"},
        { "十神坐十神": "劫財坐偏財", "註解1": "大凶，破財不能積財，男命離婚再娶或因小老婆散盡家財（因偏財為小老婆），女命則敗財不貞潔（劫財為敢作，偏財生七殺為外遇，故不貞潔）。"},
        { "十神坐十神": "劫財坐正官", "註解1": "半吉半凶，正官能有效地壓制劫財，雖然能使之發達，但與部屬不和（正官為長官，劫財為部屬，兩者相克故不和），有降職免職（正官為工作，遇到劫財為坐絕地），疾病（劫財可強身，受到官《官又代表病》的壓制），破財之災（正官泄偏財）。如若是女命則有被夫凌辱之苦（正官為夫，被其克制）。"},
        { "十神坐十神": "劫財坐傷官", "註解1": "大凶，品行不端，無法無天，枉法犯罪，身敗名裂，遺臭萬年（劫財敢於貪贓，傷官瞞上欺下，不正派），如若在時柱現必損妻傷兒（劫財克正財損妻，傷官克正官傷兒）。"},
        { "十神坐十神": "偏財坐正印", "註解1": "偏財正印互為異性，不會發生直接相克，陽干生人，偏財正印上下暗合，是一般配置，而陰干生人，不論身強身弱，多以吉論之，天賜福氣，主其人做事溫和理智，在外常得貴人相助，在內家庭和諧，幸福美滿。女命也是吉祥的組合，財印兩不相礙，柱中有正官出現者，更以吉論之。"},
        { "十神坐十神": "偏財坐偏財", "註解1": "日主健旺者大吉之象，其人活力旺盛，圓滑干練，機智敏銳，極富有很強交際手段以及發達的經濟頭腦，善於把握機會，謀取錢財。另一方面其人見義不惜財，樂於助人，異性緣甚佳，在錢財和女人方面常有傳奇性的得失。如果偏財為忌神，那麼其人自制力不足，喜好酒色，花天酒地，慷慨大方，一生之中多有破耗。"},
        { "十神坐十神": "偏財坐傷官", "註解1": "傷官生偏財，生力甚大，其性劇烈，身強者是大吉的配置，其人機智聰明，表達能力極佳，圓滑流利，同時擁有高明的社交手腕，以及發達的經濟頭腦，是謀財投機的強手。傷官為喜用時，損人利己，常常會因為他人的失敗而給自己帶來利益。但如果是身弱，則其人作奸犯科，鋌而走險，生涯易往非法損德的路線發展，損人損己，更易為女性而損財甚至影響家庭的穩定。"},
        { "十神坐十神": "偏財坐偏印", "註解1": "兩者直接發生相克，不論男女，身強用偏財者，大吉，特別是命局中以食神泄秀時，更吉，主異路功名，其人有優異的領悟能力與理解能力。身弱用偏印者，大忌，其人喜歡幻想而不切合實際，內心經常自相矛盾，多愁善感，臨事優柔寡斷，常常進退失據，求謀辛苦，常因他人連累而受到損失，且不得父愛，與父親不投緣。"},
        { "十神坐十神": "偏財坐正官", "註解1": "偏財生正官，身旺財官為喜用時則為吉利，其人智慧聰明，從商從政皆能發達，外出求謀輕鬆，多有貴人相助，常得到上司長輩的欣賞和提拔，凡事稱意，且具有很強的責任心，客觀理性。如果身弱遇之，則為忌神，則其人魄力不足，精神不集中，遇事優柔寡斷，理財能力不佳，求謀多波折，易受他人中傷或陷害而招來是非。女命身弱有根氣者，遇偏財正官的組合，相當吉利，丈夫能力強，事業順利，有社會地位。"},
        { "十神坐十神": "偏財坐食神", "註解1": "食神生偏財，生力適度，其性緩慢，身強者是大吉的配置，為人性格開朗，溫和樂觀，善於社會交際，人緣極佳，聰明機智，謀財順利，經商致富，且感情幸福美滿，多得異性相助。從政的話，也是官運亨通，宦海無波。身弱逢之，為一般配置。女命身有根氣者，逢之也是福氣十足，夫賢子孝。"},
        { "十神坐十神": "偏財坐正財", "註解1": "身強財星為喜用者，是吉利的配置，其人具有經濟頭腦，眼光銳利，善於經商，身兼多職，財緣極佳，生意興隆，富足之命，但命局如果他柱再有正財或偏財出現時，則其人個性輕佻，華而不實，虛有其表。如果身弱時，則財星為忌神，則身弱不勝旺財，一生多有破耗，經商不順，一生之中感情復雜，易因為女性而招致損失。"},
        { "十神坐十神": "偏財坐七殺", "註解1": "身強殺弱，以旺財資生弱殺，以吉論之，其人魄力十足，積極進取，具有開拓能力，懂得利用錢財驅使他人為自己做事，特別善於經商，利潤豐厚。但如果為忌神時，則相當不好，財生殺旺，主其人耗財敗業，事業經營不順，對人大方，易沉浸於酒色之中，而且易因女性而招來損失。女命者，七殺攻身無情，人生感情波動，柱中再有正官或傷官出現者，易配錯婚姻，以致感情不順。"},
        { "十神坐十神": "偏財坐比肩", "註解1": "比肩與偏財直接相克，身弱尚可，比肩幫身分財。身強偏財為喜者更忌，運氣難通，暗示著父運不佳，父親健康欠佳，或者與父親感情有代溝，歲運再逢比肩羊刃者，父有突發之災，或客死他鄉，自身事業也易破敗，小人陷害中傷，出現經濟紛爭或因為情色而招來風波。"},
        { "十神坐十神": "偏財坐劫財", "註解1": "偏財逢劫，財源不固，且偏財與劫財都有投機的成份，不論身強身弱，都不是吉祥的配置，逢之一生大起大落，得失明顯，易因為女性而損財敗業。女命財星被劫而夫星生源不固，主夫運不佳，丈夫難以發達，他柱遇到傷官，主婚姻會突然發生不順變化。"},
        { "十神坐十神": "正財坐食神", "註解1": "大吉大利，能得以妻子的幫助，子女賢孝，一生沒有多大的災難，事業發達成功（正財為妻、為財，食神為子孫、為祿）。何為祿？祿就是福份，國家發給你的高額的工資。"},
        { "十神坐十神": "正財坐正印", "註解1": "大凶不吉，破父財克母親（因為印上父的財，父的財就是母親），理想志願不能現實（正財坐在絕地上），印星貴人被克破，遇事沒有貴人幫助，妻子和母親不和，夫妻之間性格也不合。"},
        { "十神坐十神": "正財坐劫財", "註解1": "不吉大凶，正財被劫是無情之克，身弱的話會對妻子不利，或會有破財之象，妻子子女會被他人劫走，會有投資購屋，取媳婦，嫁女兒，事業上有投資現象。八字中如若身弱財多，遇上比劫奪財是好事情。正財坐劫財，父親會早亡，或得不到父業，父親的事業很衰弱。"},
        { "十神坐十神": "正財坐正財", "註解1": "大吉大利，事業興隆財源旺盛，講信用，守本份，但有克母之現象（正財旺盛克正印母親），如若是男命，婚姻美滿，女命則子稀與子女少緣份（正財泄食神）。"},
        { "十神坐十神": "正財坐偏財", "註解1": "平吉，利益雖多，然而開支也大，為人豪爽慷慨大方，朋友多，開支大（正財收入，偏財是有收有出），財多生官殺，事業上也是多成多敗。不滿足現狀，多數兼營多種事業，勞心勞苦（正偏財全表現的是佔有慾，表現慾），有色情之災，會為情破財（正財代表正妻，偏財代表小老婆）。"},
        { "十神坐十神": "正財坐傷官", "註解1": "半吉半凶，吉的方面是可以借他人之手而發自己之財，他人失敗有損失后，自己反而能得利，有道是鷸蚌相爭，漁翁得利，外表給人的感覺衰退，而實質上內裡很充足（傷官是指表面上的東西，傷官生財，則得利）。"},
        { "十神坐十神": "正財坐七殺", "註解1": "半吉半凶，艱險很多，花費也大，但從商會有巨大的收獲，女命地支有一殺星為鐘情於丈夫，守婦道，但隻能是七殺一位，不能見正官，風了正官就變成官殺混雜。"},
        { "十神坐十神": "正財坐正官", "註解1": "大吉利，本性高貴典雅，不負眾望，能得到上級的提拔，群眾的愛戴（正官為上級，正財為屬下），福厚利大，有官有財，女命遇之大好，能配得好老公。"},
        { "十神坐十神": "正財坐偏印", "註解1": "半吉半凶，做事欠耐力，缺誠實（正財是耐心，偏印是做事是虎頭蛇尾，偏印欠誠實，有私心），但交際廣，人緣佳，宜從事副業。"},
        { "十神坐十神": "正財坐比肩", "註解1": "大利，有得財之象，財緣佳，有異性緣（正財代表財和女緣），有兄弟親戚之間的拖累，但無關緊要（因為比肩為兄弟和親戚，兄弟之克為有情之克，所以大致還是吉利的）。"},
        { "十神坐十神": "正官坐劫財", "註解1": "喜用論：身強時，命局中再有比肩劫財透出，通常不做吉論，主兄弟姐妹之間不易和睦相處，在外也易受朋友拖累，職場上競爭大，一生之中宜防色情之災；身強時沒有比肩劫財透出，多主權柄，但易遭小人陷害。如果日主根氣弱時，劫財助身為用，但正官蓋干壓制，縱然想幫助也難以盡其力，正官再通根得生的話，則兄弟姐妹之中，易有刑克。"},
        { "十神坐十神": "正官坐正財", "註解1": "喜用論：正財正官相生，財官雙美，為命局喜用神時是大吉之配置，主其人信用良好，受人尊敬，物質豐裕。如果身弱時，那麼財官必為忌神，吉性不但減小，同時由於身弱不勝財官而致主錢財破耗，官為事業也為壓力，一生之中易有財務方面的波折，男命感情不順。"},
        { "十神坐十神": "正官坐正印", "註解1": "喜用論：正官正印相生，官星有印為真官，不論男女，身旺身弱皆為吉象，其人處事客觀理性，正直善良，誠實不欺，印星在地支，容易掌暗權，生平多逢貴人，在社會上容易博得名聲和地位，受人尊敬。"},
        { "十神坐十神": "正官坐食神", "註解1": "喜用論：日主身強，命局中正官食神一抑一泄是為吉象，一般來說陰日干之人較吉利，必有功名；陽日干之人命局中有財星透出轉化時，也為吉論，主其人平易近人，溫和樂觀，有著良好的人際關際，職場上，左右團結，同心協力。女命夫緣不錯，陽日干之人宜注意丈夫之健康以及感情的問題。如果日主根氣弱，那麼官星食神皆為忌神，克泄交加，反而不吉。"},
        { "十神坐十神": "正官坐傷官", "註解1": "喜用論：傷官見官，不論身強身弱，皆為凶象，特別是傷官在他柱天干透出或以官星為用神時更是嚴重，主其人生涯求事挫折，小人陷害，多有口舌是非，一生之中恐有官災或名譽受損之事。男女皆不利配偶，特別是女命，主夫妻感情不和，配偶健康不佳，中年有離婚或死別之憂。"},
        { "十神坐十神": "正官坐正官", "註解1": "喜用論：正官為命局喜用神時，那麼多呈現吉象，主其人做事認真負責，一心一意，秉公尚義，客觀理性，富有領導才能，受人愛戴，職場上易掌權力；如果正官為命局忌神，那麼其人個性懦弱刻板，優柔寡斷，求事多磨，女命也主婚姻感情波折，他柱再見傷官的話，則離婚再嫁難免。"},
        { "十神坐十神": "正官坐偏印", "註解1": "喜用論：偏印與正官皆為異性，身弱時用偏印泄官星生身，是為吉象，其人頭腦清晰，機智靈敏，聰明好學，善於謀略，有著優秀的理解力和創作力，以及對事物有著敏銳的感受力，在公職或企劃或學術研究方面多有發展。如果正官為命局喜用，那麼偏印泄官則以不吉論，為人多有口舌之憂，容易與人發生誤會，招致他人反感。"},
        { "十神坐十神": "正官坐偏財", "註解1": "喜用論：偏財正官相生，同樣為財官雙美，為命局喜用神時是大吉的配置，主其人有卓著的信用，圓滑而有原則，善於交際，人緣極佳，富有領導魅力。女命夫緣不錯，但夫星坐偏財，宜注意丈夫的健康，同時也主感情不安。如果正官偏財為命局之忌神，那麼吉性減小，行運不濟也會因財或女色而招是非。"},
        { "十神坐十神": "正官坐比肩", "註解1": "喜用論：正官約身，比肩助身，正官比肩又同為異性，一般情況下為吉論，主其人性情光明，正直誠懇，嚴於律己，細心謹慎，有自知之明，且具有領導和管理的才能。女命日主中和或稍弱也吉利，淑和溫柔，配得良偶，相夫教子；但命局身強而比肩透出時，則個性倔強好爭，缺乏人和，多有抗夫之嫌。"},
        { "十神坐十神": "正官坐七殺", "註解1": "喜用論：官殺同柱，官殺為喜為忌均非吉象。如果為忌神時，則更凶，生平多勞少成，為官不長久，容易遭人誹謗排斥，口舌是非多，精神集中力差，做事優柔寡斷，猶豫不決，顛三倒四，缺乏決斷力，生平求謀多費力。女命恐有桃色之災，再見傷官，易有不貞之嫌。"},
        { "十神坐十神": "七殺坐食神", "註解1": "比較平穩之命，利公職不利經商（食神雖可生財，但七殺泄財）。女命婚姻不順。"},
        { "十神坐十神": "七殺坐正財", "註解1": "吉、從公從商都能得到成功，可獲意外之財（正財是穩定之財，也生七殺的創業心），男命易得佳子，女命能得到老公的寵愛。"},
        { "十神坐十神": "七殺坐偏財", "註解1": "和父親緣份薄，做什麼事都不順心，常為金錢之事失去信用。女命則會為自己父母而受苦（偏財為金錢、生殺克我身）。"},
        { "十神坐十神": "七殺坐七殺", "註解1": "凶，不吉，無論進退都不利，諸事煩惱（七殺星克我的，代表著疾病、災凶），會為子女而操勞、辛苦。女命則會因為丈夫之事而受累。"},
        { "十神坐十神": "七殺坐劫財", "註解1": "一般平常人能變權力，但會因為義氣而遭受損失。夫妻之間感情不和，女命有再嫁之苦難。"},
        { "十神坐十神": "七殺坐正印", "註解1": "吉，印化殺之凶性，工作學習佳好，女命能得佳夫，並且能得到公公婆婆的喜愛。"},
        { "十神坐十神": "七殺坐偏印", "註解1": "平常之人，到異鄉行商，旅游名地，有福有樂有苦有痛，容易和領導長輩對著干。女命則不吉。"},
        { "十神坐十神": "七殺坐傷官", "註解1": "不吉、大凶，會因為他人或長輩之牽連而受到災難（傷官克正官，正官為長輩），並且會因為朋友之事而受牽連，破家（正印為官，傷官為破壞，七殺為克我之身），但原命局有正印和羊刃者，反吉，會化凶為吉，成績顯著而揚名。"},
        { "十神坐十神": "七殺坐比肩", "註解1": "不吉，會為朋友破財受到損耗（比肩為朋友，七殺為損耗），容易遇到盜竅、詐騙、爭執、疾病（七殺代表病痛）。女命則會為老公而遭受痛苦之事。"},
        { "十神坐十神": "七殺坐正官", "註解1": "凶，不吉，“露殺坐官，有災最大”，表面上什麼都不錯，但內裡多空虛，遇事多不順迷惑，缺乏決斷力（正官殺星是克我之星，殺是強制暴烈，正官是溫和，官殺混雜多迷惑）。女命再嫁或偷人養漢（殺為情人，暗夫，正官為正夫）。"},
        { "十神坐十神": "正印坐偏財", "註解1": "正印坐偏財雖然受克，但與正印坐正財者不同，正印與偏財互為陰陽異性，陽干生人者上下暗合，互相牽制，不論男女，不論身強身弱都不是盡善盡美，其人優柔寡斷，遇事多思多慮，常常顧此失彼；而陰干生人者，正印偏財相制，陰陽調劑，不論男女，不論身強身弱多以吉論，在外頗得人緣，利於業務的拓展。"},
        { "十神坐十神": "正印坐傷官", "註解1": "命局傷官為忌者，正印蓋上制之，多是吉象，其人言談有力，曉明事理，令人佩服。而命局傷官為喜用神者，不論身強身弱，多為不宜，其人精神壓力大，易有壓抑感或憂郁症，多有懷才不遇的心態，處理事務心有力而不足，多有挫折，得失明顯。他柱再透印者，多有智慧晚開的一面，領悟力較差。"},
        { "十神坐十神": "正印坐比肩", "註解1": "命局身弱以大吉論之，比肩性情光明，表裡如一，是日主自我意識與自尊的體現，正印生之，更加強日主旺盛的獨立自主意識的體現，為人正直剛健，有自知之明，樂觀進取，人際關系極佳，多他人幫助，也樂意對他人施以援助。其組合最宜在時柱透出，不僅晚來榮昌，而且子孝賢順。而身強者見之，也無妨，多主因人際交往而破費錢財。"},
        { "十神坐十神": "正印坐食神", "註解1": "正印與食神互為陰陽異性，陽干生人者，福壽雙全之象，不論男女，不論身強身弱多以吉論，其人生性善良，通情達理，胸懷寬廣，精神和暢，才藝優秀，大智若愚，多受他人尊敬，在職場上也易獲上司賞識而提拔。而陰干生人者，上下暗合，互相牽制，其組合發揮出來的效力減少，美中不足。"},
        { "十神坐十神": "正印坐劫財", "註解1": "命局身弱以大吉論之，劫財是表裡不一之星，又代表日主隱藏的另一面，正印生之，更加強日主外在的行為方式，表現出優異的外交和隨機應變能力，口才優秀，富有說服力，人際關系極佳，魄力十足，業務稱意，外力多助。其組合最宜在時柱透出，主晚來榮華，諸事順心，且子女發達。如果身強見之則大打折扣，反主人生多破耗，易受兄弟或朋友之拖累。"},
        { "十神坐十神": "正印坐偏印", "註解1": "身弱者多以吉論，其人有優異的領悟力和企劃設計能力。身強者雖無妨，但由於正印偏印性情之不同，以致其人精神不易集中專一，容易想東想西，偏於幻想，虎頭蛇尾，缺乏果斷的決策能力，優柔寡斷，有多愁善感的一面。女命身強見之，易與子女無緣，或多生女孩；同時，印星泄官也不利丈夫的健康或事業。"},
        { "十神坐十神": "正印坐正印", "註解1": "身弱見之多以吉論，其人沉默寡言，知識豐富，心地仁慈，稟性淡泊，不與人斤斤計較，寧可人負我不可我負人。而身強見之也無妨，隻不過印過旺會側重精神方面的追求，其人自負清高，帶有孤僻，易陶醉在不切實際的幻想之中，常因自視清高而輕視金錢，以致常常遭遇失敗，生涯多勞。女命印旺耗官以及克制食神傷官，更宜注意丈夫的健康與子女的養育。"},
        { "十神坐十神": "正印坐正財", "註解1": "命局身強印旺喜財制印反得印星的益處，但如果身弱用印者，則坐下財星為大忌。財星破印，印星無力，是貪財破印之象，家無寧日，在年月柱出現者多主父母不和，易吵鬧爭執。也主妻子與母親不和，自身左右為難。同時，其人一生謀事求財有心無力，多有波折起伏，事倍功半，歲運再遇財星時，易為健康而因憂，或因財而滋禍，貪污落職。女命身弱用印者，見財星破印，難有賢惠內助之德。"},
        { "十神坐十神": "正印坐正官", "註解1": "官印相生，不論身強身弱皆以吉論。其人氣質高雅，敦品力學，重視內涵，誠實守信，忠厚憨直，交友廣闊，做事認真負責，重視人情和諧，有統合意見與調和各種不同意見的能力，多得他人信賴，在服務型的單位之中易受到領導的提拔，多有掌實權的機遇。正是逢印看官，官印相生十有九貴，必主未來發達。女命端庄賢惠，是相夫教子的內助。"},
        { "十神坐十神": "正印坐七殺", "註解1": "殺印相生，不論身強身弱皆以吉論，其人有強烈的正義感和責任感，魄力十足，不怒而威，嫉惡如仇，言出必行，不屈不撓，誠實正直，重視信用，自強不息，果斷堅忍，有冒險進取的精神以及幸運發達的機遇，多在開創改革中獲得發展，能文能武，易掌權力。同時，印居殺地也利於母親的健康和壽命。對女命來說，可配良夫，夫資聰明，多有社會地位名聲。"},
        { "十神坐十神": "偏印坐正印", "註解1": "半吉半凶，有兼營兩種職業或者管理兩家權力之象（正印代表事業，偏印代表副業），凡事多迷惑，容易遭受損失（偏印與偏財對沖，正印與正財對沖，容易破財）。"},
        { "十神坐十神": "偏印坐正財", "註解1": "如吉，貴人明顯，如若努力奮發定會受到長輩或領導的提拔，發達迅速（偏印代表長輩和領導，因正財之克，正財本身之努力及操作，實踐能力，能克偏印，使不喜歡之長輩變成喜歡之長輩）。如若從事副業偏業可獲厚利（偏印為偏業，坐正財為胎地，故可獲利，坐偏財是坐絕地，意義不同），藝術方面能揚名（偏印為藝術業，坐正財可成名）。"},
        { "十神坐十神": "偏印坐劫財", "註解1": "大凶不吉利，辛苦不絕（偏印，劫財均代表辛勞），合作事業雙方無皆無收獲，獨自經營方佳（劫財代表合作的事業，結果偏印全力生劫財而劫正財，故不佳）。男女婚姻多不順心如意（偏印不利婚姻，劫財也不利婚姻）。"},
        { "十神坐十神": "偏印坐偏財", "註解1": "大吉大利，偏印得到偏財之克制，偏印代表災難，被克所以平安了，但是如若操縱副業必遭損失（偏印為付業，因坐絕地，財不能發揮）。"},
        { "十神坐十神": "偏印坐七殺", "註解1": "凶不利（偏印會排斥泄殺氣，七殺沒力了），開支多，收入少，入不敷出（七殺泄正財，收入少，而開支多多，偏印和偏財對沖，不喜歡賺錢），容易被人利用，不但無功，反遭損害（七殺為小人，想要生我，慾受到排斥，因此無功而有害）。如若想要和領導對著干則克身（七殺為不喜歡我反抗，若反抗則不利）。"},
        { "十神坐十神": "偏印坐比肩", "註解1": "貴人暗而不明，多為人作養子或有繼母（偏印為繼母，比肩為養子），一生勞碌辛酸常遇波折（比肩多勞，偏印多忙碌），經營副業多遭受失敗（偏印為副業，偏印生比肩克偏傷，多損失），日主處死絕之地反吉，會得到兄弟朋友的幫助。"},
        { "十神坐十神": "偏印坐正官", "註解1": "半吉半凶，外表地位、權力俱重，但內心空虛不足（正官代表地位，權力，但因正官全力生偏印而變得虛脫）。如若是女命，會背棄丈夫或被丈夫遺棄（偏印全力泄正官，正官為女命的夫星）。"},
        { "十神坐十神": "偏印坐食神", "註解1": "必受到長輩的制約，本身不得自由（偏印為長輩，食神為自己的才華發揮，因受到制約），萬事有始無終，終破家產（偏印是有始無終，因為克了食神而破了祿，稱為工資，為福氣）；若是女命，則會有難產，會和兒女有生死離別的現象（食傷代表女人的子宮或兒女）。"},
        { "十神坐十神": "偏印坐傷官", "註解1": "經濟不佳，生計困難（偏印破財，傷官雖有賺錢頭腦但被偏印所制），家庭常有災難，有家破人亡等災難（偏印為壞的庇護，代表家內不安，又代表分離）；若是女命則破夫運，又有克子災（女命傷官為子女被克制，偏印泄正官破夫運）。"},
        { "十神坐十神": "偏印坐偏印", "註解1": "不吉，生活不固定（偏印代表偏業或者多種職業），易招盜賊（偏印全力生劫財，劫財為盜賊）。有失權，患長期暗疾之凶（偏犯泄正官故失權，偏印也代表藥物和暗病）；如若為女命則會欺凌丈夫，並且子孫緣份薄（偏印泄正官夫星，克食神子星）。"},
        { "十神坐十神": "食神坐正財", "註解1": "大吉大利，能得到長輩的愛護，能得到上級領導的提拔，並常能得到大的利益，福份也大。"},
        { "十神坐十神": "食神坐正官", "註解1": "安分守紀，獲眾人信任，福分日增。女命配佳婿，家庭幸福。"},
        { "十神坐十神": "食神坐傷官", "註解1": "雖能發達，但困難重重，常常會中途停止（食神傷官均能生財，但食神坐明處，傷官坐暗處，求財則不利），無論男女都會為子女或配偶之事而苦惱（男命傷食克官殺子星。學者注重：看子女星男命看官殺，女命看食傷，女命八字中如若沒有官殺星也可將食傷看成夫星）。"},
        { "十神坐十神": "食神坐偏財", "註解1": "大富大貴，能得到巨大的財富，能得到上上下下的愛戴，艷福佳，女人緣好（偏財為女人為艷福），凡事進取有功，事業上也有所成功），女人遇到食神坐偏財會得賢孝之兒女（食神為子女星，生偏財得以發揮）。"},
        { "十神坐十神": "食神坐七殺", "註解1": "大凶不利，容易有災難，受人牽連，諸事不利不順，一生一世都為下人之命，勞勞碌碌窮苦一生（食神坐絕地，食神的優點無法發揮），性格上容易發怒，沒有修養（食神本是溫和之神，但坐絕地無法發揮，七殺暴躁本性現）。"},
        { "十神坐十神": "食神坐偏印", "註解1": "大凶，疾病諸災，連綿不斷，多成多敗，此兩星近鄰或同柱有偏財，能制凶反呈吉。"},
        { "十神坐十神": "食神坐正印", "註解1": "大吉，誠實有作用，傅得贊譽，得貴人扶持，業務繁榮，諸事順利，事業發達之命。"},
        { "十神坐十神": "食神坐比肩", "註解1": "吉利，往往會成為富家的子女或養子（比肩為養子，食神為食祿）。八字中如若食神坐比肩，具有經濟才能，能得到貴人的幫助而獲得大的成功（食神為經濟才能，比肩為貴人之幫助），對兄弟朋友多情，好布施（食神多情好布施，比肩為朋友），財緣好，艷福佳（食神主財源，財為女人及艷福）。"},
        { "十神坐十神": "食神坐食神", "註解1": "大富大貴之命，福祿豐厚，與人合作事業會大獲成功（比劫為共同的事業，可生食神再去生財而獲利），一生沒有多大的災難，不會遇到強盜土匪（食神可制七殺之盜）。但食神坐食神不是當官的料，如若做官，是非太多，禍事也多（食神是對抗正官的）。"},
        { "十神坐十神": "食神坐劫財", "註解1": "大吉大利，食神可以泄掉劫財之凶惡，使凶惡變得善良而獲利，如若遇到破緣而得利（劫財會破緣，克正財，但如若得到食神泄，反而會得利），逢近親之死而得到遺產（劫財為近親），或會因生活不景氣時被迫買家產，而反獲得高利。"},
        { "十神坐十神": "傷官坐食神", "註解1": "半吉利，傷官坐食神與長輩意見不和，易起沖突，卻受長輩之影響而獲利（與正印對沖，正偏印為長輩）。"},
        { "十神坐十神": "傷官坐正財", "註解1": "吉利，他人破財反可成全自己之利，有道是鷸蚌相爭，漁翁得利，能得妻助（正財為妻星）。"},
        { "十神坐十神": "傷官坐傷官", "註解1": "大凶，有痼疾短命之現象，一生勞碌不絕，有富氣也不得長久（傷官泄身，身體因泄身太過而虛弱，又和正印壽元星對沖，所以會短命）。傷官重疊在年柱上，則破祖業會離家在外鄉發展；在月柱則會被兄弟姐妹背棄，女命會被丈夫冷落離別，在日柱則被妻子及家人輕視；在時柱則無子或喪子（因年柱為祖輩宮，月柱為兄弟姐妹宮及夫緣宮，日柱表示妻和夫宮，時柱表示兒女宮）。"},
        { "十神坐十神": "傷官坐正印", "註解1": "吉，長壽（正印為長壽星），並且能得到他人的幫助而獲利（正印為貴人）。"},
        { "十神坐十神": "傷官坐比肩", "註解1": "不吉利，自招家庭不和，親戚不和（比肩代表親戚朋友，得傷官泄之，所以不和睦）。婚姻不順，婚后易夫妻間發生矛盾（女命正官夫星怕傷官克之，又與比肩對立）。"},
        { "十神坐十神": "傷官坐劫財", "註解1": "不吉，男命婚姻不順（娶妻以財為妻，傷官有劫財兩個星都喜歡錢的，前者用盡腦力，后者用盡手段，傷官代表腦力勞動，劫財代表手段），為人心胸狹隘，蠻不講理。太過勢利（此為傷官和劫財的特色），並且有破財，離別親人，身心勞苦特征。還有，就是與人合作的事業必被解散（劫財為合作的事業，生傷官必解散）。"},
        { "十神坐十神": "傷官坐正官", "註解1": "凶，不吉利，有惡作劇及喜歡諷刺罵人之惡癖（傷官之特色），喜歡爭權奪利而遭到失敗（正官為權力），夫妻別離（正官為夫星）。"},
        { "十神坐十神": "傷官坐七殺", "註解1": "凶，終身勞碌辛苦，並且會受人是非誹謗攻擊，甚至冤獄（傷官本身就是是非，誹謗，遇到七殺制是限制個人自由，可能入獄），夫妻會有生離死別（女命傷官克正官，暗生情夫，殺為情夫）。"},
        { "十神坐十神": "傷官坐偏財", "註解1": "大福大發，理財高手，能迅速發達（傷官是有計謀有才能，偏財是指交際手段），但易會有色情之災（偏財是色情，煩惱）。女命易成有錢的寡婦，職業比較穩定（女命為職業婦女，能賺錢，但傷官是克夫星正官的，所以不利丈夫）。"},
        { "十神坐十神": "傷官坐偏印", "註解1": "事業容易成功也容易遭到失敗，不能兼職（偏印為副業，見傷官必然失敗），還會因長輩的失敗而導致自己的破敗（偏印為長輩，不能制服傷官，自己也遭到失敗）。"}
	];

    var 論斷項目='<span class = "本命論斷項目">年、月、時柱十神坐十神</span><br>';
    var 論斷矩陣 = [];

    for(var i=0; i<3; i++){
        var 論斷開頭句 = 年月時柱[i]+年月時十神坐十神[i]+"，";
        var 資料索引=_.findIndex(十神坐十神資料, {十神坐十神: 年月時十神坐十神[i]});
        if (資料索引 != -1) 論斷矩陣.push(論斷開頭句+十神坐十神資料[資料索引].註解1); else alert("十神坐十神 沒有搜尋到資料！");
    }
    return 論斷項目 + 論斷矩陣.join("<br><br>");
}