function 天干通根(命盤){
    //**** 通根月令 ****
    var 年干月令={"運星": 日干月令對照(命盤.年柱.天干,命盤.月令,"旺相休囚死")};
    var 月干月令={"運星": 日干月令對照(命盤.年柱.天干,命盤.月令,"旺相休囚死")};
    var 日干月令={"運星": 日干月令對照(命盤.年柱.天干,命盤.月令,"旺相休囚死")};
    var 時干月令={"運星": 日干月令對照(命盤.年柱.天干,命盤.月令,"旺相休囚死")};

    if(年干月令.運星=="旺"){
        命盤.年干.通根.月 = true;
        命盤.分析.四柱.四柱數據[0].通根.月 = true;
        命盤.年干.通根.數+=1;
        命盤.分析.四柱.四柱數據[0].通根.數+=1;

        命盤.月支.透干.年 = true;
        命盤.分析.四柱.四柱數據[1].透干.年 = true;
        命盤.月支.透干.數+=1;
        命盤.分析.四柱.四柱數據[1].透干.數+=1;
    }

    if(日干月令.運星=="旺"){
        命盤.日干.通根.月 = true;
        命盤.分析.四柱.四柱數據[2].通根.月 = true;
        命盤.日干.通根.數+=1;
        命盤.分析.四柱.四柱數據[2].通根.數+=1;

        命盤.月支.透干.日 = true;
        命盤.分析.四柱.四柱數據[1].透干.日 = true;
        命盤.月支.透干.數+=1;
        命盤.分析.四柱.四柱數據[1].透干.數+=1;
    }

    if(時干月令.運星=="旺"){
        命盤.時干.通根.月 = true;
        命盤.分析.四柱.四柱數據[3].通根.月 = true;
        命盤.時干.通根.數+=1;
        命盤.分析.四柱.四柱數據[3].通根.數+=1;
        
        命盤.月支.透干.時 = true;
        命盤.分析.四柱.四柱數據[1].透干.時 = true;
        命盤.月支.透干.數+=1;
        命盤.分析.四柱.四柱數據[1].透干.數+=1;
    }
    

    //**** 坐基形態 ****
    var 年干坐基={"形態": 六十干支屬性(命盤.年柱.干支, "干支關係")};
    var 月干坐基={"形態": 六十干支屬性(命盤.月柱.干支, "干支關係")};
    var 日干坐基={"形態": 六十干支屬性(命盤.日柱.干支, "干支關係")};
    var 時干坐基={"形態": 六十干支屬性(命盤.時柱.干支, "干支關係")};

    if(年干坐基.形態=="專氣"){
        命盤.年干.通根.年 = true;
        命盤.分析.四柱.四柱數據[0].通根.年 = true;
        命盤.年干.通根.數+=1;
        命盤.分析.四柱.四柱數據[0].通根.數+=1;

        命盤.年支.透干.年 = true;
        命盤.分析.四柱.四柱數據[0].透干.年 = true;
        命盤.年支.透干.數+=1;
        命盤.分析.四柱.四柱數據[0].透干.數+=1;
    }

    if(月干坐基.形態=="專氣"){
        命盤.月干.通根.月 = true;
        命盤.分析.四柱.四柱數據[1].通根.月 = true;
        命盤.月干.通根.數+=1;
        命盤.分析.四柱.四柱數據[1].通根.數+=1;

        命盤.月支.透干.月 = true;
        命盤.分析.四柱.四柱數據[1].透干.月 = true;
        命盤.月支.透干.數+=1;
        命盤.分析.四柱.四柱數據[1].透干.數+=1;
    }

    if(日干坐基.形態=="專氣"){
        命盤.日干.通根.日 = true;
        命盤.分析.四柱.四柱數據[2].通根.日 = true;
        命盤.日干.通根.數+=1;
        命盤.分析.四柱.四柱數據[2].通根.數+=1;

        命盤.日支.透干.日 = true;
        命盤.分析.四柱.四柱數據[2].透干.日 = true;
        命盤.日支.透干.數+=1;
        命盤.分析.四柱.四柱數據[2].透干.數+=1;
    }

    if(時干坐基.形態=="專氣"){
        命盤.時干.通根.時 = true;
        命盤.分析.四柱.四柱數據[3].通根.時 = true;
        命盤.時干.通根.數+=1;
        命盤.分析.四柱.四柱數據[3].通根.數+=1;

        命盤.時支.透干.時 = true;
        命盤.分析.四柱.四柱數據[3].透干.時 = true;
        命盤.時支.透干.數+=1;
        命盤.分析.四柱.四柱數據[3].透干.數+=1;
    }

    //************************** 通根 非月令、坐基 **************************
    
    // ----- 日干通根 -----
    
    if(命盤.日干.五行==命盤.年支.五行){
        命盤.日干.通根.年 = true;
        命盤.分析.四柱.四柱數據[2].通根.年 = true;
        命盤.日干.通根.數+=1;
        命盤.分析.四柱.四柱數據[2].通根.數+=1;
    }
    

    if(命盤.日干.五行==命盤.時支.五行){
        命盤.日干.通根.時 = true;
        命盤.分析.四柱.四柱數據[2].通根.時 = true;
        命盤.日干.通根.數+=1;
        命盤.分析.四柱.四柱數據[2].通根.數+=1;
    }

    // ----- 月干通根 -----
    if(命盤.月干.五行==命盤.年支.五行){
        命盤.月干.通根.年 = true;
        命盤.分析.四柱.四柱數據[1].通根.年 = true;
        命盤.月干.通根.數+=1;
        命盤.分析.四柱.四柱數據[1].通根.數+=1;
    }

    if(命盤.月干.五行==命盤.日支.五行){
        命盤.月干.通根.日 = true;
        命盤.分析.四柱.四柱數據[1].通根.日 = true;
        命盤.月干.通根.數+=1;
        命盤.分析.四柱.四柱數據[1].通根.數+=1;
    }
    

    if(命盤.月干.五行==命盤.時支.五行){
        命盤.月干.通根.時 = true;
        命盤.分析.四柱.四柱數據[1].通根.時 = true;
        命盤.月干.通根.數+=1;
        命盤.分析.四柱.四柱數據[1].通根.數+=1;
    }


    // ----- 時干通根 -----
    if(命盤.時干.五行==命盤.日支.五行){
        命盤.時干.通根.日 = true;
        命盤.分析.四柱.四柱數據[3].通根.日 = true;
        命盤.時干.通根.數+=1;
        命盤.分析.四柱.四柱數據[3].通根.數+=1;
    }

    if(命盤.時干.五行==命盤.年支.五行){
        命盤.時干.通根.年 = true;
        命盤.分析.四柱.四柱數據[3].通根.年 = true;
        命盤.時干.通根.數+=1;
        命盤.分析.四柱.四柱數據[3].通根.數+=1;

    }


    // ----- 年干通根 -----
    if(命盤.年干.五行==命盤.日支.五行){
        命盤.年干.通根.日 = true;
        命盤.分析.四柱.四柱數據[0].通根.日 = true;
        命盤.年干.通根.數+=1;
        命盤.分析.四柱.四柱數據[0].通根.數+=1;
    }

    if(命盤.年干.五行==命盤.時支.五行){
        命盤.年干.通根.時 = true;
        命盤.分析.四柱.四柱數據[0].通根.時 = true;
        命盤.年干.通根.數+=1;
        命盤.分析.四柱.四柱數據[0].通根.數+=1;
    }

    // ^^^^^^^^^^^^^^^^^^^^^^^^^  天 干 含 祿 刃 分 析^^^^^^^^^^^^^^^^^^^^^^^^^  
    // ----- 日干自坐祿刃 -----
    if(命盤.日柱.運星 == "帝旺" || 命盤.日柱.運星 == "臨官") {  //自坐祿刃
        命盤.分析.強弱.註解.push("自坐"+命盤.日柱.運星);
        
        if(命盤.日干.陰陽=="陽" && 命盤.日柱.運星 == "帝旺"){
            命盤.日干.陽刃.日=true;
            命盤.日干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[2].陽刃.日=true;
            命盤.分析.四柱.四柱數據[2].陽刃.數 +=1;
        }

        if(命盤.日干.陰陽=="陰" && 命盤.日柱.運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.日干.帝旺.日=true;
            命盤.日干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[2].帝旺.日=true;
            命盤.分析.四柱.四柱數據[2].帝旺.數 +=1;
        }
        
        if(命盤.日柱.運星 == "臨官"){  //自坐刃, no additional points, counted by 專氣
            命盤.日干.生祿.日=true;
            命盤.日干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[2].生祿.日=true;
            命盤.分析.四柱.四柱數據[2].生祿.數 +=1;
        }
    }

    // ----- 日干月令是祿刃 -----

    if(命盤.月柱.運星 == "帝旺" || 命盤.月柱.運星 == "臨官") { //月令祿刃, no additional points, counted by 月令
        if(命盤.日干.陰陽=="陽" && 命盤.月柱.運星 == "帝旺"){
            命盤.日干.陽刃.月=true;
            命盤.日干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[2].陽刃.月=true;
            命盤.分析.四柱.四柱數據[2].陽刃.數 +=1;
        }

        if(命盤.日干.陰陽=="陰" && 命盤.月柱.運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.日干.帝旺.月=true;
            命盤.日干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[2].帝旺.月=true;
            命盤.分析.四柱.四柱數據[2].帝旺.數 +=1;
        }
        
        if(命盤.月柱.運星 == "臨官"){
            命盤.日干.生祿.月=true;
            命盤.日干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[2].生祿.月=true;
            命盤.分析.四柱.四柱數據[2].生祿.數 +=1;
        }
    }

    // ----- 日干年支是祿刃 -----
    if(命盤.年柱.運星 == "帝旺" || 命盤.年柱.運星 == "臨官") {
        if(命盤.日干.陰陽=="陽" && 命盤.年柱.運星 == "帝旺"){
            命盤.日干.陽刃.年=true;
            命盤.日干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[2].陽刃.年=true;
            命盤.分析.四柱.四柱數據[2].陽刃.數 +=1;
        }

        if(命盤.日干.陰陽=="陰" && 命盤.年柱.運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.日干.帝旺.年=true;
            命盤.日干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[2].帝旺.年=true;
            命盤.分析.四柱.四柱數據[2].帝旺.數 +=1;
        }
        
        if(命盤.年柱.運星 == "臨官"){
            命盤.日干.生祿.年=true;
            命盤.日干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[2].生祿.年=true;
            命盤.分析.四柱.四柱數據[2].生祿.數 +=1;
        }       
    }

    // ----- 日干時支是祿刃 -----
    if(命盤.時柱.運星 == "帝旺" || 命盤.時柱.運星 == "臨官") {
        if(命盤.日干.陰陽=="陽" && 命盤.時柱.運星 == "帝旺"){
            命盤.日干.陽刃.時=true;
            命盤.日干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[2].陽刃.時=true;
            命盤.分析.四柱.四柱數據[2].陽刃.數 +=1;
        }

        if(命盤.日干.陰陽=="陰" && 命盤.時柱.運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.日干.帝旺.時=true;
            命盤.日干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[2].帝旺.時=true;
            命盤.分析.四柱.四柱數據[2].帝旺.數 +=1;
        }
        
        if(命盤.時柱.運星 == "臨官"){
            命盤.日干.生祿.時=true;
            命盤.日干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[2].生祿.時=true;
            命盤.分析.四柱.四柱數據[2].生祿.數 +=1;
        }
    }

    // ----- 月干地支含祿刃 -----
    var 月干對年支運星 = 十二星運數轉字(十二星運(命盤.月干.天干, 命盤.年支.地支));
    var 月干對月支運星 = 十二星運數轉字(十二星運(命盤.月干.天干, 命盤.月支.地支));
    var 月干對日支運星 = 十二星運數轉字(十二星運(命盤.月干.天干, 命盤.日支.地支));
    var 月干對時支運星 = 十二星運數轉字(十二星運(命盤.月干.天干, 命盤.時支.地支));
    
    if(月干對月支運星 == "帝旺" || 月干對月支運星 == "臨官") { //自坐
        if(命盤.月干.陰陽=="陽" && 月干對月支運星 == "帝旺"){
            命盤.月干.陽刃.月=true;
            命盤.月干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[1].陽刃.月=true;
            命盤.分析.四柱.四柱數據[1].陽刃.數 +=1;
        }
        
        if(命盤.月干.陰陽=="陰" && 月干對月支運星 == "帝旺"){
            命盤.月干.帝旺.月=true;
            命盤.月干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[1].帝旺.月=true;
            命盤.分析.四柱.四柱數據[1].帝旺.數 +=1;
        }


        if(月干對月支運星 == "臨官"){
            命盤.月干.生祿.月=true;
            命盤.月干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[1].生祿.月=true;
            命盤.分析.四柱.四柱數據[1].生祿.數 +=1;
        }
    }

    if(月干對年支運星 == "帝旺" || 月干對年支運星 == "臨官") { //月對年
        if(命盤.月干.陰陽=="陽" && 月干對年支運星 == "帝旺"){
            命盤.月干.陽刃.年=true;
            命盤.月干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[1].陽刃.年=true;
            命盤.分析.四柱.四柱數據[1].陽刃.數 +=1;
        }

        if(命盤.月干.陰陽=="陰" && 月干對年支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.月干.帝旺.年=true;
            命盤.月干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[1].帝旺.年=true;
            命盤.分析.四柱.四柱數據[1].帝旺.數 +=1;
        }
        
        if(月干對年支運星 == "臨官"){
            命盤.月干.生祿.年=true;
            命盤.月干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[1].生祿.年=true;
            命盤.分析.四柱.四柱數據[1].生祿.數 +=1;
        }
    }
    
    if(月干對日支運星 == "帝旺" || 月干對日支運星 == "臨官") {  //月對日
        if(命盤.月干.陰陽=="陽" && 月干對日支運星 == "帝旺"){
            命盤.月干.陽刃.日=true;
            命盤.月干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[1].陽刃.日=true;
            命盤.分析.四柱.四柱數據[1].陽刃.數 +=1;
        }

        if(命盤.月干.陰陽=="陰" && 月干對日支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.月干.帝旺.日=true;
            命盤.月干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[1].帝旺.日=true;
            命盤.分析.四柱.四柱數據[1].帝旺.數 +=1;
        }
        
        if(月干對日支運星 == "臨官"){
            命盤.月干.生祿.日=true;
            命盤.月干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[1].生祿.日=true;
            命盤.分析.四柱.四柱數據[1].生祿.數 +=1;
        }
    }

    if(月干對時支運星 == "帝旺" || 月干對時支運星 == "臨官") {  //月對時
        if(命盤.月干.陰陽=="陽" && 月干對時支運星 == "帝旺"){
            命盤.月干.陽刃.時=true;
            命盤.月干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[1].陽刃.時=true;
            命盤.分析.四柱.四柱數據[1].陽刃.數 +=1;
        }

        if(命盤.月干.陰陽=="陰" && 月干對時支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.月干.帝旺.時=true;
            命盤.月干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[1].帝旺.時=true;
            命盤.分析.四柱.四柱數據[1].帝旺.數 +=1;
        }
        
        if(月干對時支運星 == "臨官"){
            命盤.月干.生祿.時=true;
            命盤.月干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[1].生祿.時=true;
            命盤.分析.四柱.四柱數據[1].生祿.數 +=1;
        }
    }

    // ----- 時干地支含祿刃 -----
    var 時干對年支運星 = 十二星運數轉字(十二星運(命盤.時干.天干, 命盤.年支.地支));
    var 時干對月支運星 = 十二星運數轉字(十二星運(命盤.時干.天干, 命盤.月支.地支));
    var 時干對日支運星 = 十二星運數轉字(十二星運(命盤.時干.天干, 命盤.日支.地支));
    var 時干對時支運星 = 十二星運數轉字(十二星運(命盤.時干.天干, 命盤.時支.地支));
    
    if(時干對時支運星 == "帝旺" || 時干對時支運星 == "臨官") { //自坐
        if(命盤.時干.陰陽=="陽" && 時干對時支運星 == "帝旺"){
            命盤.時干.陽刃.時=true;
            命盤.時干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[3].陽刃.時=true;
            命盤.分析.四柱.四柱數據[3].陽刃.數 +=1;
        }

        if(命盤.時干.陰陽=="陰" && 時干對時支運星 == "帝旺"){
            命盤.時干.帝旺.時=true;
            命盤.時干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[3].帝旺.時=true;
            命盤.分析.四柱.四柱數據[3].帝旺.數 +=1;
        }

        if(時干對時支運星 == "臨官"){
            命盤.時干.生祿.時=true;
            命盤.時干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[3].生祿.時=true;
            命盤.分析.四柱.四柱數據[3].生祿.數 +=1;
        }
    }

    if(時干對日支運星 == "帝旺" || 時干對日支運星 == "臨官") {
        if(命盤.時干.陰陽=="陽" && 時干對日支運星 == "帝旺"){
            命盤.時干.陽刃.日=true;
            命盤.時干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[3].陽刃.日=true;
            命盤.分析.四柱.四柱數據[3].陽刃.數 +=1;
        }

        if(命盤.時干.陰陽=="陰" && 時干對日支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.時干.帝旺.日=true;
            命盤.時干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[3].帝旺.日=true;
            命盤.分析.四柱.四柱數據[3].帝旺.數 +=1;
        }
        
        if(時干對日支運星 == "臨官"){
            命盤.時干.生祿.日=true;
            命盤.時干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[3].生祿.日=true;
            命盤.分析.四柱.四柱數據[3].生祿.數 +=1;
        }
    }

    if(時干對月支運星 == "帝旺" || 時干對月支運星 == "臨官") {
        if(命盤.時干.陰陽=="陽" && 時干對月支運星 == "帝旺"){
            命盤.時干.陽刃.月=true;
            命盤.時干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[3].陽刃.月=true;
            命盤.分析.四柱.四柱數據[3].陽刃.數 +=1;
        }

        if(命盤.時干.陰陽=="陰" && 時干對月支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.時干.帝旺.月=true;
            命盤.時干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[3].帝旺.月=true;
            命盤.分析.四柱.四柱數據[3].帝旺.數 +=1;
        }
        
        if(時干對月支運星 == "臨官"){
            命盤.時干.生祿.月=true;
            命盤.時干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[3].生祿.月=true;
            命盤.分析.四柱.四柱數據[3].生祿.數 +=1;
        }
    }

    if(時干對年支運星 == "帝旺" || 時干對年支運星 == "臨官") {
        if(命盤.時干.陰陽=="陽" && 時干對年支運星 == "帝旺"){
            命盤.時干.陽刃.年=true;
            命盤.時干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[3].陽刃.年=true;
            命盤.分析.四柱.四柱數據[3].陽刃.數 +=1;
        }

        if(命盤.時干.陰陽=="陰" && 時干對年支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.時干.帝旺.年=true;
            命盤.時干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[3].帝旺.年=true;
            命盤.分析.四柱.四柱數據[3].帝旺.數 +=1;
        }
        
        if(時干對年支運星 == "臨官"){
            命盤.時干.生祿.年=true;
            命盤.時干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[3].生祿.年=true;
            命盤.分析.四柱.四柱數據[3].生祿.數 +=1;
        }
    }

    // ----- 年干地支含祿刃 -----
    var 年干對年支運星 = 十二星運數轉字(十二星運(命盤.年干.天干, 命盤.年支.地支));
    var 年干對月支運星 = 十二星運數轉字(十二星運(命盤.年干.天干, 命盤.月支.地支));
    var 年干對日支運星 = 十二星運數轉字(十二星運(命盤.年干.天干, 命盤.日支.地支));
    var 年干對時支運星 = 十二星運數轉字(十二星運(命盤.年干.天干, 命盤.時支.地支));
    
    if(年干對年支運星 == "帝旺" || 年干對年支運星 == "臨官") { //自坐
        if(命盤.年干.陰陽=="陽" && 年干對年支運星 == "帝旺"){
            命盤.年干.陽刃.年=true;
            命盤.年干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[0].陽刃.年=true;
            命盤.分析.四柱.四柱數據[0].陽刃.數 +=1;
        }

        if(命盤.年干.陰陽=="陰" && 年干對年支運星 == "帝旺"){
            命盤.年干.帝旺.年=true;
            命盤.年干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[0].帝旺.年=true;
            命盤.分析.四柱.四柱數據[0].帝旺.數 +=1;
        }

        if(年干對年支運星 == "臨官"){
            命盤.年干.生祿.年=true;
            命盤.年干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[0].生祿.年=true;
            命盤.分析.四柱.四柱數據[0].生祿.數 +=1; 
        }
    }

    if(年干對月支運星 == "帝旺" || 年干對月支運星 == "臨官") { //年對月
        if(命盤.年干.陰陽=="陽" && 年干對月支運星 == "帝旺"){
            命盤.年干.陽刃.月=true;
            命盤.年干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[0].陽刃.月=true;
            命盤.分析.四柱.四柱數據[0].陽刃.數 +=1;
        }

        if(命盤.年干.陰陽=="陰" && 年干對月支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.年干.帝旺.月=true;
            命盤.年干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[0].帝旺.月=true;
            命盤.分析.四柱.四柱數據[0].帝旺.數 +=1;
        }
        
        if(年干對月支運星 == "臨官"){
            命盤.年干.生祿.月=true;
            命盤.年干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[0].生祿.月=true;
            命盤.分析.四柱.四柱數據[0].生祿.數 +=1;
        }
    }


    if(年干對日支運星 == "帝旺" || 年干對日支運星 == "臨官") { //自坐
        if(命盤.年干.陰陽=="陽" && 年干對日支運星 == "帝旺"){
            命盤.年干.陽刃.日=true;
            命盤.年干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[0].陽刃.日=true;
            命盤.分析.四柱.四柱數據[0].陽刃.數 +=1;
        }

        if(命盤.年干.陰陽=="陰" && 年干對日支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.年干.帝旺.日=true;
            命盤.年干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[0].帝旺.日=true;
            命盤.分析.四柱.四柱數據[0].帝旺.數 +=1;
        }
        
        if(年干對日支運星 == "臨官"){
            命盤.年干.生祿.日=true;
            命盤.年干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[0].生祿.日=true;
            命盤.分析.四柱.四柱數據[0].生祿.數 +=1;
        }
    }

    if(年干對時支運星 == "帝旺" || 年干對時支運星 == "臨官") {
        if(命盤.年干.陰陽=="陽" && 年干對時支運星 == "帝旺"){
            命盤.年干.陽刃.時=true;
            命盤.年干.陽刃.數 +=1;
            命盤.分析.四柱.四柱數據[0].陽刃.時=true;
            命盤.分析.四柱.四柱數據[0].陽刃.數 +=1;
        }

        if(命盤.年干.陰陽=="陰" && 年干對時支運星 == "帝旺"){  //陰干沒有陽刃，以通根算
            命盤.年干.帝旺.時=true;
            命盤.年干.帝旺.數 +=1;
            命盤.分析.四柱.四柱數據[0].帝旺.時=true;
            命盤.分析.四柱.四柱數據[0].帝旺.數 +=1; 
        }
        
        if(年干對時支運星 == "臨官"){
            命盤.年干.生祿.時=true;
            命盤.年干.生祿.數 +=1;
            命盤.分析.四柱.四柱數據[0].生祿.時==true;
            命盤.分析.四柱.四柱數據[0].生祿.數 +=1;
        }
    }


}



 // #############################################################################
 // **                                地  支  分  析                           **
 // #############################################################################

function 地支透干(命盤){
    // ----- 年支透干 -----
    if(命盤.年支.五行==命盤.月干.五行){
        命盤.年支.透干.月 = true;
        命盤.分析.四柱.四柱數據[0].透干.月 = true;
        命盤.年支.透干.數+=1;
        命盤.分析.四柱.四柱數據[0].透干.數+=1;
    }

    if(命盤.年支.五行==命盤.日干.五行){
        命盤.年支.透干.日 = true;
        命盤.分析.四柱.四柱數據[0].透干.日 = true;
        命盤.年支.透干.數+=1;
        命盤.分析.四柱.四柱數據[0].透干.數+=1;
    }

    if(命盤.年支.五行==命盤.時干.五行){
        命盤.年支.透干.時 = true;
        命盤.分析.四柱.四柱數據[0].透干.時 = true;
        命盤.年支.透干.數+=1;
        命盤.分析.四柱.四柱數據[0].透干.數+=1;
    }

        // ----- 月支透干 -----
    if(命盤.月支.五行==命盤.年干.五行){
        命盤.月支.透干.年 = true;
        命盤.分析.四柱.四柱數據[2].透干.年 = true;
        命盤.月支.透干.數+=1;
        命盤.分析.四柱.四柱數據[2].透干.數+=1;
    }
    
    if(命盤.月支.五行==命盤.日干.五行){
        命盤.月支.透干.日 = true;
        命盤.分析.四柱.四柱數據[2].透干.日 = true;
        命盤.月支.透干.數+=1;
        命盤.分析.四柱.四柱數據[2].透干.數+=1;
    }
    
    if(命盤.月支.五行==命盤.時干.五行){
        命盤.月支.透干.時 = true;
        命盤.分析.四柱.四柱數據[2].透干.時 = true;
        命盤.月支.透干.數+=1;
        命盤.分析.四柱.四柱數據[2].透干.數+=1;
    }
    
    // ----- 日支透干 -----
    if(命盤.日支.五行==命盤.年干.五行){
        命盤.日支.透干.年 = true;
        命盤.分析.四柱.四柱數據[2].透干.年 = true;
        命盤.日支.透干.數+=1;
        命盤.分析.四柱.四柱數據[2].透干.數+=1;
    }

    if(命盤.日支.五行==命盤.月干.五行){
        命盤.日支.透干.月 = true;
        命盤.分析.四柱.四柱數據[2].透干.月 = true;
        命盤.日支.透干.數+=1;
        命盤.分析.四柱.四柱數據[2].透干.數+=1;
    }

    if(命盤.日支.五行==命盤.時干.五行){
        命盤.日支.透干.時 = true;
        命盤.分析.四柱.四柱數據[2].透干.時 = true;
        命盤.日支.透干.數+=1;
        命盤.分析.四柱.四柱數據[2].透干.數+=1;
    }

    // ----- 時支透干 -----
    if(命盤.時支.五行==命盤.年干.五行){
        命盤.時支.透干.年 = true;
        命盤.分析.四柱.四柱數據[3].透干.年 = true;
        命盤.時支.透干.數+=1;
        命盤.分析.四柱.四柱數據[3].透干.數+=1;
    }
    
    if(命盤.時支.五行==命盤.月干.五行){
        命盤.時支.透干.月 = true;
        命盤.分析.四柱.四柱數據[3].透干.月 = true;
        命盤.時支.透干.數+=1;
        命盤.分析.四柱.四柱數據[3].透干.數+=1;
    }
    
    if(命盤.時支.五行==命盤.日干.五行){
        命盤.時支.透干.日 = true;
        命盤.分析.四柱.四柱數據[3].透干.日 = true;
        命盤.時支.透干.數+=1;
        命盤.分析.四柱.四柱數據[3].透干.數+=1;
    }
}


// *****************************************************************************
// **                               干支力度分析                              **
// #############################################################################
// **                                天 干 力 度                              **
// #############################################################################


function 天干力度分析(命盤){
    //******************** 地支含祿刃 ********************

    var 年干地支含祿刃 = 0, 月干地支含祿刃 = 0, 日干地支含祿刃 = 0, 時干地支含祿刃 = 0;
    var 自坐=1, 隔一位=0.75, 隔二位=0.5, 隔三位=0.25, 陽刃力度=0.5, 生祿力度=0.35;
    var 祿刃註解=[];
    
    //************************** 通根 非月令、坐基 力量計算 **************************
    var 日干通根力量 = 0, 月干通根力量 = 0, 年干通根力量 = 0, 時干通根力量 = 0, 通根非月令坐基=1, 通根註解=[];
    var 干支基數=命盤.系統參數.運算.干支基數*通根非月令坐基;
    var 陽刃帝旺臨官力量=0;
    //var 隔一位=0.5, 隔二位=0.25, 隔三位=0.125;

    // ****** 日干通根 年、時 ******


    if(命盤.日干.通根.年 && 命盤.日干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔二位;
        祿刃註解.push("日干通根年支 +" + 陽刃帝旺臨官力量);
        命盤.分析.強弱.註解.push("日干通根年支");
        日干地支含祿刃 += 陽刃帝旺臨官力量;
    }

    if(命盤.日干.通根.時 && 命盤.日干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔一位;
        祿刃註解.push("日干通根時支 +" + 陽刃帝旺臨官力量);
        命盤.分析.強弱.註解.push("日干通根時支");
        日干地支含祿刃 += 陽刃帝旺臨官力量;
    }

    // ****** 月干同根 年、日、時 ******
    if(命盤.月干.通根.年 && 命盤.月干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔一位;
        祿刃註解.push("月干通根年支 +"+陽刃帝旺臨官力量);
        月干地支含祿刃 += 陽刃帝旺臨官力量;
    }

    if(命盤.月干.通根.日 && 命盤.月干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔一位;
        祿刃註解.push("月干通根日支 +"+陽刃帝旺臨官力量);
        月干地支含祿刃 += 陽刃帝旺臨官力量;      
    }

    if(命盤.月干.通根.時 && 命盤.月干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔二位;
        祿刃註解.push("月干通根時支 +"+陽刃帝旺臨官力量);
        月干地支含祿刃 += 陽刃帝旺臨官力量;
    }

    // ****** 時干同根 年、日******
    if(命盤.時干.通根.日 && 命盤.時干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔一位;
        祿刃註解.push("時干通根日支 +"+陽刃帝旺臨官力量);
        時干地支含祿刃 += 陽刃帝旺臨官力量;
    }

    if(命盤.時干.通根.年 && 命盤.時干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔三位;
        祿刃註解.push("時干通根年支 +"+陽刃帝旺臨官力量);
        時干地支含祿刃 += 陽刃帝旺臨官力量;   
    }

    // ****** 年干同根 日、時******
    if(命盤.年干.通根.日 && 命盤.年干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔二位;
        祿刃註解.push("年干通根日支 +"+陽刃帝旺臨官力量.toFixed(2));
        年干地支含祿刃 += 陽刃帝旺臨官力量;  
    }

    if(命盤.年干.通根.時 && 命盤.年干.五行=="土"){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔三位;
        祿刃註解.push("年干通根時支 +"+陽刃帝旺臨官力量.toFixed(2));
        年干地支含祿刃 += 陽刃帝旺臨官力量;
    }


    // ^^^^^^^^^^^^^^^^^^^^^^^^^  天 干 含 祿 刃 分 析^^^^^^^^^^^^^^^^^^^^^^^^^
    // ------------- 日 干 坐 祿 刃 -------------
    if(命盤.日干.陽刃.日){
        祿刃註解.push("日干坐陽刃 +0");
        命盤.分析.強弱.註解.push("自坐陽刃");
    }

    if(命盤.日干.帝旺.日){
        祿刃註解.push("日干坐帝旺 +0");
        命盤.分析.強弱.註解.push("自坐帝旺");
    }

    if(命盤.日干.生祿.日){
        祿刃註解.push("日干坐臨官 +0");
        命盤.分析.強弱.註解.push("自坐"+命盤.日柱.運星);
    }

    // ------------- 日 干 月 令 是 祿 刃 -------------
    if(命盤.日干.陽刃.月) {
        祿刃註解.push("日干月支坐陽刃 +0");
        命盤.分析.強弱.註解.push("日干月支坐陽刃");
    }
    if(命盤.日干.帝旺.月) {
        祿刃註解.push("日干月支坐帝旺 +0");
        命盤.分析.強弱.註解.push("日干月支坐帝旺");
    }
    if(命盤.日干.生祿.月) {
        祿刃註解.push("日干月支坐臨官 +0");
        命盤.分析.強弱.註解.push("日干月支坐臨官");
    }

    // ------------- 日 干 祿 刃 年 支 -------------
    if(命盤.日干.陽刃.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔二位;
        日干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("日干年支有陽刃 +"+陽刃帝旺臨官力量.toFixed(2));
        命盤.分析.強弱.註解.push("日干年支有陽刃");
    }

    if(命盤.日干.帝旺.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔二位;
        日干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("日干年支坐帝旺 +"+陽刃帝旺臨官力量.toFixed(2));
        命盤.分析.強弱.註解.push("日干年支坐帝旺");
    }

    if(命盤.日干.生祿.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 生祿力度 * 隔二位;
        日干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("日干年支有臨官 +"+日干地支含祿刃.toFixed(2));
        命盤.分析.強弱.註解.push("日干年支有臨官");
    }

    // ------------- 日 干 祿 刃 時 支 -------------
    if(命盤.日干.陽刃.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔一位;
        日干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("日干時支有陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        命盤.分析.強弱.註解.push("日干時支有陽刃");
    }

    if(命盤.日干.帝旺.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔一位;
        日干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("日干時支有帝旺 +"+陽刃帝旺臨官力量);
        命盤.分析.強弱.註解.push("日干時支有帝旺");
    }

    if(命盤.日干.生祿.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 生祿力度 * 隔一位;
        日干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("日干時支有臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        命盤.分析.強弱.註解.push("日干時支有臨官");
    }

    // ------------- 月 干 自 坐 祿 刃 -------------
    if(命盤.月干.陽刃.月){
        祿刃註解.push("月干坐陽刃 +0");
        //命盤.分析.強弱.註解.push("月支坐陽刃");
    }

    if(命盤.月干.帝旺.月){
        祿刃註解.push("月干坐帝旺 +0");
        //命盤.分析.強弱.註解.push("時支坐帝旺");
    }

    if(命盤.月干.生祿.月){
        祿刃註解.push("月干坐臨官 +0");
        //命盤.分析.強弱.註解.push("時支坐祿");
    }

    // ------------- 月 干 祿 刃 年 支 -------------
    if(命盤.月干.陽刃.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔一位;
        月干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("月干年支有陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("月干年支有陽刃");
    }

    if(命盤.月干.帝旺.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔一位;
        月干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("月干年支有帝旺 +"+陽刃帝旺臨官力量);
        //命盤.分析.強弱.註解.push("月干年支有帝旺");
    }

    if(命盤.月干.生祿.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 生祿力度 * 隔一位;
        月干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("月干年支有臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("月干年支有臨官");
    }

    // ------------- 月 干 祿 刃 日 支 -------------
    if(命盤.月干.陽刃.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔一位;
        月干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("月干日支有陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("月干日支有陽刃");
    }

    if(命盤.月干.帝旺.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔一位;
        月干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("月干日支坐帝旺 +"+陽刃帝旺臨官力量);
        //命盤.分析.強弱.註解.push("月干日支坐帝旺");
    }

    if(命盤.月干.生祿.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 生祿力度 * 隔一位;
        月干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("月干日支有臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("月干日支有臨官");
    }

   // ------------- 月 干 祿 刃 時 支 -------------
    if(命盤.月干.陽刃.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔二位;
        月干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("月干時支坐陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("月干時支坐陽刃");
    }

    if(命盤.月干.帝旺.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔二位;
        月干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("月干時支坐帝旺 +"+陽刃帝旺臨官力量);
        //命盤.分析.強弱.註解.push("月干時支坐帝旺");
    }

    if(命盤.月干.生祿.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 生祿力度 * 隔二位;
        月干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("月干時支坐臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("月干時支坐臨官");
    }

    // ------------- 時 干 自 坐 祿 刃 -------------
    if(命盤.時干.陽刃.時){
        祿刃註解.push("時干坐陽刃 +0");
        //命盤.分析.強弱.註解.push("時支坐陽刃");
    }

    if(命盤.時干.帝旺.時){
        祿刃註解.push("時干坐帝旺 +0");
        //命盤.分析.強弱.註解.push("時支坐帝旺");
    }

    if(命盤.時干.生祿.時){
        祿刃註解.push("時干坐臨官 +0");
        //命盤.分析.強弱.註解.push("時支坐祿");
    }

    // ------------- 時 干 祿 刃 年 支 -------------
    if(命盤.時干.陽刃.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔三位;
        時干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("時干年支坐陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("時干年支坐陽刃");
    }

    if(命盤.時干.帝旺.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 陽刃力度 * 隔三位;
        月干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("時干年支坐帝旺 +"+陽刃帝旺臨官力量);
        //命盤.分析.強弱.註解.push("時干年支坐帝旺");
    }

    if(命盤.時干.生祿.年){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"年柱") * 生祿力度 * 隔三位;
        時干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("時干年支坐臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("時干年支坐臨官");
    }

    // ------------- 時 干 祿 刃 日 支 -------------
    if(命盤.時干.陽刃.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔一位;
        時干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("時干日支坐陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("時干日支坐陽刃");
    }

    if(命盤.時干.帝旺.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔一位;
        月干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("時干日支坐帝旺 +"+陽刃帝旺臨官力量);
        //命盤.分析.強弱.註解.push("時干日支坐帝旺");
    }

    if(命盤.時干.生祿.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 生祿力度 * 隔一位;
        時干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("時干日支坐臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("時干日支坐臨官");
    }

    // ------------- 時 干 祿 刃 月 支 -------------
    if(命盤.時干.陽刃.月){
        祿刃註解.push("時干月支坐陽刃 +0");
        //命盤.分析.強弱.註解.push("時干月支坐陽刃");
    }

    if(命盤.時干.帝旺.月){
        祿刃註解.push("時干月支坐帝旺 +0");
        //命盤.分析.強弱.註解.push("時干月支坐帝旺");
    }

    if(命盤.時干.生祿.月){
        祿刃註解.push("時干月支坐臨官 +0");
        //命盤.分析.強弱.註解.push("時干月支坐臨官");
    }

        // ------------- 年 干 自 坐 祿 刃 -------------
    if(命盤.年干.陽刃.年){
        祿刃註解.push("年干坐陽刃 +0");
        //命盤.分析.強弱.註解.push("年干坐陽刃");
    }

    if(命盤.年干.帝旺.年){
        祿刃註解.push("年干坐帝旺 +0");
        //命盤.分析.強弱.註解.push("年干坐帝旺");
    }

    if(命盤.年干.生祿.年){
        祿刃註解.push("年干坐臨官 +0");
        //命盤.分析.強弱.註解.push("年干坐臨官");
    }

    // ------------- 年 干 祿 刃 月 支 -------------
    if(命盤.年干.陽刃.月){
        祿刃註解.push("年干月支坐陽刃 +0");
        //命盤.分析.強弱.註解.push("年干月支坐陽刃");
    }

    if(命盤.年干.帝旺.月){
        祿刃註解.push("年干月支坐帝旺 +0");
        //命盤.分析.強弱.註解.push("年干月支坐帝旺");
    }

    if(命盤.年干.生祿.月){
        祿刃註解.push("年干月支坐臨官 +0");
        //命盤.分析.強弱.註解.push("年干月支坐臨官");
    }
    // ------------- 年 干 祿 刃 日 支 -------------
    if(命盤.年干.陽刃.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔二位;
        年干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("年干日支坐陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("年干日支坐陽刃");
    }

    if(命盤.年干.帝旺.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 陽刃力度 * 隔二位;
        年干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("年干日支坐帝旺 +"+陽刃帝旺臨官力量);
        //命盤.分析.強弱.註解.push("年干日支坐帝旺");
    }

    if(命盤.年干.生祿.日){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"日柱") * 生祿力度 * 隔二位;
        年干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("年干日支坐臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("年干日支坐臨官");
    }

    // ------------- 年 干 祿 刃 時 支 -------------
    if(命盤.年干.陽刃.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔三位;
        年干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("年干時支坐陽刃 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("年干時支坐陽刃");
    }

    if(命盤.年干.帝旺.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 陽刃力度 * 隔三位;
        年干地支含祿刃 += 陽刃帝旺臨官力量;
        祿刃註解.push("年干時支坐帝旺 +"+陽刃帝旺臨官力量);
        //命盤.分析.強弱.註解.push("年干時支坐帝旺");
    }

    if(命盤.年干.生祿.時){
        陽刃帝旺臨官力量 = 干支基數 * 刑冲合會害影響比率(命盤,"時柱") * 生祿力度 * 隔三位;
        年干地支含祿刃 +=  陽刃帝旺臨官力量;
        祿刃註解.push("年干時支坐臨官 +"+(陽刃帝旺臨官力量).toFixed(2));
        //命盤.分析.強弱.註解.push("年干時支坐臨官");
    }



    // ********************** 計算天干的力度 **********************
    var 天干力度矩陣 = [];
    var 天干力度註解=[];
    var 力量基數=命盤.系統參數.運算.干支基數;
    var 時干月令函數=0.75; //因為時支距離月令遠，所以月令的影響較弱
    //var 天干力度 = { "柱": -1, "旺相休囚死": "", "力度加減": 0, "備註": "" };

    //**** 月令 運星 ****
    var 年干月令={ "因素": "月令", "條件": 命盤.年柱.天干+"生於"+命盤.月令+"月", "形態": 日干月令對照(命盤.年柱.天干,命盤.月令,"旺相休囚死"), "力度加減": 0};
    var 月干月令={ "因素": "月令", "條件": 命盤.月柱.天干+"生於"+命盤.月令+"月", "形態": 日干月令對照(命盤.月柱.天干,命盤.月令,"旺相休囚死"), "力度加減": 0};
    var 日干月令={ "因素": "月令", "條件": 命盤.日柱.天干+"生於"+命盤.月令+"月", "形態": 日干月令對照(命盤.日柱.天干,命盤.月令,"旺相休囚死"), "力度加減": 0};
    var 時干月令={ "因素": "月令", "條件": 命盤.時柱.天干+"生於"+命盤.月令+"月", "形態": 日干月令對照(命盤.時柱.天干,命盤.月令,"旺相休囚死"), "力度加減": 0};
    
    年干月令.力度加減=(月令旺相休囚死力度(日干月令對照(命盤.年柱.天干,命盤.月令,"旺相休囚死"))*力量基數*刑冲合會害影響比率(命盤,"年柱")).toFixed(1);
    月干月令.力度加減=(月令旺相休囚死力度(日干月令對照(命盤.月柱.天干,命盤.月令,"旺相休囚死"))*力量基數*刑冲合會害影響比率(命盤,"月柱")).toFixed(1);
    日干月令.力度加減=(月令旺相休囚死力度(日干月令對照(命盤.日柱.天干,命盤.月令,"旺相休囚死"))*力量基數*刑冲合會害影響比率(命盤,"日柱")).toFixed(1);
    時干月令.力度加減=(月令旺相休囚死力度(日干月令對照(命盤.時柱.天干,命盤.月令,"旺相休囚死"))*力量基數*刑冲合會害影響比率(命盤,"時柱")*時干月令函數).toFixed(1);

    var 月令因素 = ["月令",時干月令.力度加減, 日干月令.力度加減, 0, 年干月令.力度加減, ""]; //月令只是對月支，只用坐基考量

    命盤.分析.強弱.註解.push("日主"+命盤.日柱.天干+"干生於"+命盤.月令+"月得"+日干月令.形態+"令"); 

    //**** 坐基力度計算 ****
    var 年干坐基={ "因素": "坐基", "條件": 命盤.年柱.干支, "形態": 六十干支屬性(命盤.年柱.干支, "干支關係"), "力度加減": 0};
    var 月干坐基={ "因素": "坐基", "條件": 命盤.月柱.干支, "形態": 六十干支屬性(命盤.月柱.干支, "干支關係"), "力度加減": 0};
    var 日干坐基={ "因素": "坐基", "條件": 命盤.日柱.干支, "形態": 六十干支屬性(命盤.日柱.干支, "干支關係"), "力度加減": 0};
    var 時干坐基={ "因素": "坐基", "條件": 命盤.時柱.干支, "形態": 六十干支屬性(命盤.時柱.干支, "干支關係"), "力度加減": 0};

    //console.log(命盤);
    //console.log(刑冲合會害影響比率("月柱"));

    年干坐基.力度加減=(六十干支屬性(命盤.年柱.干支, "天干力度")*力量基數*刑冲合會害影響比率(命盤,"年柱")).toFixed(1);
    月干坐基.力度加減=(六十干支屬性(命盤.月柱.干支, "天干力度")*力量基數*刑冲合會害影響比率(命盤,"月柱")).toFixed(1);
    日干坐基.力度加減=(六十干支屬性(命盤.日柱.干支, "天干力度")*力量基數*刑冲合會害影響比率(命盤,"日柱")).toFixed(1);
    時干坐基.力度加減=(六十干支屬性(命盤.時柱.干支, "天干力度")*力量基數*刑冲合會害影響比率(命盤,"時柱")).toFixed(1);

    var 坐基因素 = ["坐基", 時干坐基.力度加減, 日干坐基.力度加減, 月干坐基.力度加減, 年干坐基.力度加減, ""];
    命盤.分析.強弱.註解.push("日柱"+命盤.日柱.干支+"為"+日干坐基.形態);

    // --------------------- 
           
    //var 通根因素 = ["通根", 時干通根力量.toFixed(1), 日干通根力量.toFixed(1), 月干通根力量.toFixed(1), 年干通根力量.toFixed(1), ""];
    var 祿刃因素 = ["祿刃", 時干地支含祿刃.toFixed(1), 日干地支含祿刃.toFixed(1), 月干地支含祿刃.toFixed(1), 年干地支含祿刃.toFixed(1)];
    var 天干基數 = ["基數", 力量基數, 力量基數, 力量基數, 力量基數, ""];
    
    //if(通根註解.length>0) 天干力度註解.push(通根註解.join("，"));
    if(祿刃註解.length>0) 天干力度註解.push(祿刃註解.join("，"));

    天干力度矩陣 = [天干基數, 坐基因素, 月令因素, 祿刃因素];

    //*** 天干合化 ***
    for (var i = 0; i < 命盤.分析.刑冲合會害表.length; i++){
        if(命盤.分析.刑冲合會害表[i][0]=="天干" && 命盤.分析.刑冲合會害表[i][13]==1){  //天干 && 納入計算
            var 天干合化因素 = [命盤.分析.刑冲合會害表[i][2]+命盤.分析.刑冲合會害表[i][16], 命盤.分析.刑冲合會害表[i][9],命盤.分析.刑冲合會害表[i][10],命盤.分析.刑冲合會害表[i][11],命盤.分析.刑冲合會害表[i][12],命盤.分析.刑冲合會害表[i][15]];
            天干力度矩陣.push(天干合化因素);
        }
    }

    var 天干總和 = SumArrayByColumn(天干力度矩陣, true, false, 1, "fixed", 1);

    //******* 將計算出來的力度加入命盤架構 *******
    命盤.年干.力量 = parseFloat(天干總和[3]);
    命盤.月干.力量 = parseFloat(天干總和[2]);
    命盤.日干.力量 = parseFloat(天干總和[1]);
    命盤.時干.力量 = parseFloat(天干總和[0]);

    //******* 建立表格 *******
    天干總和.unshift("總和");
    天干總和.push("-"); //總和註解
    天干力度矩陣.push(天干總和); //將天干總和加入天干力度矩陣
    天干力度矩陣.unshift(["天干", 命盤.時柱.天干, 命盤.日柱.天干, 命盤.月柱.天干, 命盤.年柱.天干, "-"]);
    天干力度矩陣.unshift(["四柱", "時柱", "日柱", "月柱", "年柱", "-"]);

    var ArryTblProp = {
        "Caption": true, //with caption
        "CaptionStr": "天干力度表",
        "CaptionCSS": "default",
        "TableTitle": "",
        "RowHeight": 24, //px
        "ColumnWidth": [90, 50, 50, 50, 50], //width for each column
        "HighligtedRow": [],
        "HighligtedCSS": "",
        "FirstRowIsTitle": true,
        "FirstColIsTitle": true,
        "RowTitleCSS": "",
        "ColTitleCSS": ""
    };

    var 天干力度表 = ArryToTable(RemoveColumnFromArray(天干力度矩陣, 5), ArryTblProp);  //註解刪掉, column 5
    if(天干力度註解.length>0) {
        var ulCSS = 'style="font:14px Trebuchet;"';
        var 天干力度註解字串=Array2UnorderedList(天干力度註解, "", ulCSS);
        //alert(天干力度註解字串);
        天干力度表 +=天干力度註解字串;
    }
    return 天干力度表;
}


function 地支力度分析(命盤){

    // ********************** 計算地支的力度 **********************
    var 地支力度矩陣 = [];
    var 地支力度註解=[];
    var 地支基數=命盤.系統參數.運算.干支基數;

    //**** 干頭 ****
    var 年支干頭={ "因素": "干頭", "條件": 命盤.年柱.干支, "形態": 六十干支屬性(命盤.年柱.干支, "干支關係"), "力度加減": 0};
    var 月支干頭={ "因素": "干頭", "條件": 命盤.月柱.干支, "形態": 六十干支屬性(命盤.月柱.干支, "干支關係"), "力度加減": 0};
    var 日支干頭={ "因素": "干頭", "條件": 命盤.日柱.干支, "形態": 六十干支屬性(命盤.日柱.干支, "干支關係"), "力度加減": 0};
    var 時支干頭={ "因素": "干頭", "條件": 命盤.時柱.干支, "形態": 六十干支屬性(命盤.時柱.干支, "干支關係"), "力度加減": 0};

    年支干頭.力度加減=六十干支屬性(命盤.年柱.干支, "地支力度")*地支基數; //*刑冲合會害影響比率(命盤,"年柱");
    月支干頭.力度加減=六十干支屬性(命盤.月柱.干支, "地支力度")*地支基數; //*刑冲合會害影響比率(命盤,"月柱");
    日支干頭.力度加減=六十干支屬性(命盤.日柱.干支, "地支力度")*地支基數; //*刑冲合會害影響比率(命盤,"日柱");
    時支干頭.力度加減=六十干支屬性(命盤.時柱.干支, "地支力度")*地支基數; //*刑冲合會害影響比率(命盤,"時柱");

    var 干頭因素 = ["干頭",時支干頭.力度加減.toFixed(1), 日支干頭.力度加減.toFixed(1), 月支干頭.力度加減.toFixed(1), 年支干頭.力度加減.toFixed(1), ""];

    var 地支基數= ["基數",命盤.系統參數.運算.干支基數, 命盤.系統參數.運算.干支基數, 命盤.系統參數.運算.干支基數, 命盤.系統參數.運算.干支基數, ""];
    地支力度矩陣 = [地支基數, 干頭因素];
    
    //************************** 透干非月令、坐基 **************************
    var 自坐=1, 隔一位=0.75, 隔二位=0.5, 隔三位=0.25, 透干力度=0.5, 通根非月令坐基=1;
    var 透干力量, 日支透干力量 = 0, 月支透干力量 = 0, 年支透干力量 = 0, 時支透干力量 = 0, 透干註解=[];
    
    // ************************************** 透 干 **************************************
    // *** 透干沒有納入計算當中 

    // ****** 年支透干 月、日、時 ******
    /*
    if(命盤.年支.透干.月){
        透干力量=地支基數 * 透干力度 * 隔一位;
        透干註解.push("年支透月干 +"+(透干力量).toFixed(2));
        年支透干力量 += 透干力量; //命盤.系統參數.運算.干支基數 * 隔一位 * 通根非月令坐基;  
    }
    
    if(命盤.年支.透干.日){
        透干力量=地支基數 * 透干力度 * 隔二位;
        透干註解.push("年支透日干 +"+(透干力量).toFixed(2));
        年支透干力量 += 透干力量;
    }
    
    if(命盤.年支.透干.時){
        透干力量=地支基數 * 透干力度 * 隔三位;
        透干註解.push("年支透時干 +"+(透干力量).toFixed(2));
        年支透干力量 += 透干力量;
    }

    // ****** 月支透干 月、日、時 ******
    if(命盤.月支.透干.年){
        透干力量=地支基數 * 透干力度 * 隔一位;
        透干註解.push("月支透年干 +"+(透干力量).toFixed(2));
        月支透干力量 += 透干力量;  
    }
    
    if(命盤.月支.透干.日){
        透干力量=地支基數 * 透干力度 * 隔一位;
        透干註解.push("月支透日干 +"+(透干力量).toFixed(2));
        月支透干力量 += 透干力量;
    }
    
    if(命盤.月支.透干.時){
        透干力量=地支基數 * 透干力度 * 隔二位;
        透干註解.push("月支透時干 +"+透干力量.toFixed(2));
        月支透干力量 += 透干力量;
    }
    
    // ****** 日支透干 年、月、時 ******
    if(命盤.日支.透干.年){
        透干力量=地支基數 * 透干力度 * 隔二位;
        透干註解.push("日支透年干 +"+(透干力量).toFixed(2));
        日支透干力量 += 透干力量;
    }
    
    if(命盤.日支.透干.月){
        透干力量=地支基數 * 透干力度 * 隔一位;
        透干註解.push("日支透月干 +"+(透干力量).toFixed(2));
        日支透干力量 += 透干力量;
    }
    
    if(命盤.日支.透干.時){
        透干力量=地支基數 * 透干力度 * 隔一位;
        透干註解.push("日支透時干 +"+(透干力量).toFixed(2));
        日支透干力量 += 透干力量;  
    }
    
    // ****** 時支透干 年、月、日 ******
    
    if(命盤.時支.透干.年){
        透干力量=地支基數 * 透干力度 * 隔三位;
        透干註解.push("時支透年干 +"+(透干力量).toFixed(2));
        時支透干力量 += 透干力量;  
    }
    
    if(命盤.時支.透干.月){
        透干力量=地支基數 * 透干力度 * 隔二位;
        透干註解.push("時支透月干 +"+(透干力量).toFixed(2));
        時支透干力量 += 透干力量;  
    }
    
    if(命盤.時支.透干.日){
        透干力量=地支基數 * 透干力度 * 隔一位;
        透干註解.push("時支透日干 +"+(透干力量).toFixed(2));
        時支透干力量 += 透干力量;
    }
    
    
    var 地支透干=["透干",時支透干力量.toFixed(1), 日支透干力量.toFixed(1), 月支透干力量.toFixed(1), 年支透干力量.toFixed(1), ""];
    
    地支力度矩陣.push(地支透干);
    */
    // ***************** end ***************************
    
    //*** 地支刑冲合會害 ***
    for (var i = 0; i < 命盤.分析.刑冲合會害表.length; i++){
        if(命盤.分析.刑冲合會害表[i][0]=="地支" && 命盤.分析.刑冲合會害表[i][13]==1 && 命盤.分析.刑冲合會害表[i][13]=="相冲"){  //地支 && 納入計算
            var 地支刑冲合會害因素 = [命盤.分析.刑冲合會害表[i][2]+命盤.分析.刑冲合會害表[i][16], (命盤.分析.刑冲合會害表[i][9]).toFixed(1),(命盤.分析.刑冲合會害表[i][10]).toFixed(1), (命盤.分析.刑冲合會害表[i][11]).toFixed(1), (命盤.分析.刑冲合會害表[i][12]).toFixed(1),命盤.分析.刑冲合會害表[i][15]];
            地支力度矩陣.push(地支刑冲合會害因素);
        }
    }

    var 地支總和 = SumArrayByColumn(地支力度矩陣, true, false, 1, "fixed", 1);

    //******* 將計算出來的力度加入命盤架構 *******
    命盤.年支.力量 = parseFloat(地支總和[3]);
    命盤.月支.力量 = parseFloat(地支總和[2]);
    命盤.日支.力量 = parseFloat(地支總和[1]);
    命盤.時支.力量 = parseFloat(地支總和[0]);

    // ***** 建立表格 *****
    地支總和.unshift("總和");
    地支總和.push("-"); //總和註解
    地支力度矩陣.push(地支總和); //將地支總和加入地支力度矩陣
    地支力度矩陣.unshift(["地支", 命盤.時柱.地支, 命盤.日柱.地支, 命盤.月柱.地支, 命盤.年柱.地支, "-"]);
    地支力度矩陣.unshift(["四柱", "時柱", "日柱", "月柱", "年柱", "-"]);

    if(透干註解.length>0) 地支力度註解.push(透干註解.join("，"));
    
    var ArryTblProp = {
        "Caption": true, //with caption
        "CaptionStr": "地支力度表",
        "CaptionCSS": "default",
        "TableTitle": "",
        "RowHeight": 24, //px
        "ColumnWidth": [90, 50, 50, 50, 50], //width for each column
        "HighligtedRow": [],
        "HighligtedCSS": "",
        "FirstRowIsTitle": true,
        "FirstColIsTitle": true,
        "RowTitleCSS": "",
        "ColTitleCSS": ""
    };

    var 地支力度表 = ArryToTable(RemoveColumnFromArray(地支力度矩陣, 5), ArryTblProp);  //註解刪掉, column 5

    if(地支力度註解.length>0) {
        var ulCSS = 'style="font:14px Trebuchet;"';
        var 地支力度註解字串=Array2UnorderedList(地支力度註解, "", ulCSS);
        //alert(天干力度註解字串);
        地支力度表 +=地支力度註解字串;
    }
    return 地支力度表;

}

function 五行合化力度分析(命盤){
    合會化力度矩陣 = [];
    合會化力度矩陣.push(["合化五行", "木", "火", "土", "金", "水"]);

    for (var i = 0; i < 命盤.分析.刑冲合會害表.length; i++){
        if(命盤.分析.刑冲合會害表[i][3]!="" && 命盤.分析.刑冲合會害表[i][13]==1){  //合化五行成立 && 納入計算
            var 合化矩陣 = 五行位置輸入矩陣(命盤.分析.刑冲合會害表[i][3], (命盤.分析.刑冲合會害表[i][6]).toFixed(1), 1, 命盤.分析.刑冲合會害表[i][2]+命盤.分析.刑冲合會害表[i][16],0);
            合會化力度矩陣.push(合化矩陣);
            
            // add to 命盤架構：命盤.分析.陰陽五行.<五行>.合化
            switch(命盤.分析.刑冲合會害表[i][3]){
                case "木":
                    命盤.分析.陰陽五行.木.合化 += 命盤.分析.刑冲合會害表[i][6];
                    break;
                case "火":
                    命盤.分析.陰陽五行.火.合化 += 命盤.分析.刑冲合會害表[i][6];
                    break;
                case "土":
                    命盤.分析.陰陽五行.土.合化 += 命盤.分析.刑冲合會害表[i][6];
                    break;
                case "金":
                    命盤.分析.陰陽五行.金.合化 += 命盤.分析.刑冲合會害表[i][6];
                    break;
                case "水":
                    命盤.分析.陰陽五行.水.合化 += 命盤.分析.刑冲合會害表[i][6];
            }// end switch
        } // end if 有合化
    } // end for
    
    if(合會化力度矩陣.length<=1) return "";  //如果沒有合化，直接退出
    
    var ArryTblProp = {
        "Caption": true, //with caption
        "CaptionStr": "五行合化表",
        "CaptionCSS": "default",
        "TableTitle": "",
        "RowHeight": 24, //px
        "ColumnWidth": [120, 60, 60, 60, 60, 60], //width for each column
        "HighligtedRow": [],
        "HighligtedCSS": "",
        "FirstRowIsTitle": true,
        "FirstColIsTitle": true,
        "RowTitleCSS": "",
        "ColTitleCSS": ""
    };

    var 五行合化表 = ArryToTable(RemoveColumnFromArray(合會化力度矩陣, "-"), ArryTblProp);

    return 五行合化表;
}