function 測八字條件(){
    //1. 全陽、全陰

    var YYDate;
    var theDate="01011924";
    var daycount = (10*31*12*6)+100;
    var CountDate, DateDt, GZDate;
    var StartDate=日期值轉換("04021984231900", 1);  //1924: "06021924095000"; 1984: "04021984231900"
    var EndDate=日期值轉換("15022037000000", 1); //1924: "04021984231900"; 1984: "15022037"
    var 地支純陽=["寅","申"];
    var 地支純陰=["丑","卯","未","酉"];
    var 年柱, 月柱, 日柱, 時柱, 年干陰陽, 月干陰陽, 日干陰陽, 時干陰陽;
    var TimePack=["003000", "020000", "040000", "060000", "080000", "100000", "120000", "140000", "160000", "180000", "200000", "220000", "233000"];
    var 全陽八字=[], 全陰八字=[];
    var YangCounter=1;
    var YinCounter=1;
    //var YYDate=StartDate;
    var CurYear=StartDate.getFullYear();
    do {
        for(var j=0; j<13; j++){
            var CountDate=theDate+TimePack[j];
            YYDate = 日期值轉換(CountDate, 1);

            if(YYDate>=StartDate && YYDate<EndDate){
                YYDateDt = 西曆轉換(YYDate);
                YYGZDate=YYDateDt[0][0];
                
                年柱=YYGZDate.substr(0,2);
                月柱=YYGZDate.substr(2,2);
                日柱=YYGZDate.substr(4,2);
                時柱=YYGZDate.substr(6,2);

                年干陰陽=天干屬性(年柱.substr(0,1),"陰陽");
                月干陰陽=天干屬性(月柱.substr(0,1),"陰陽");
                日干陰陽=天干屬性(日柱.substr(0,1),"陰陽");
                時干陰陽=天干屬性(時柱.substr(0,1),"陰陽");

                //************************* 條 件 ************************* 
                if(年干陰陽=="陽" && 月干陰陽=="陽" && 日干陰陽=="陽" & 時干陰陽=="陽") {
                    var 全純陽="全陽";
                    if((地支純陽.indexOf(年柱.substr(1,1)) >=0) && (地支純陽.indexOf(月柱.substr(1,1)) >=0) && (地支純陽.indexOf(日柱.substr(1,1)) >=0) && (地支純陽.indexOf(時柱.substr(1,1)) >=0)) 全純陽="純陽";
                    var PrnYear=YYDate.getFullYear();
                    var PrnMonth=YYDate.getMonth()+1;
                    var PrnDay=YYDate.getDate();
                    var PrnHour=YYDate.getHours();
                    var PrnDate=PrnYear+"-"+PrnMonth+"-"+PrnDay+" : "+PrnHour;
                    var PrnStatement = YangCounter +", " + PrnDate + ", " + 年柱+" " +月柱 + " "+日柱+" " +時柱 + ", " + 全純陽;
                    YangCounter ++;
                    //console.log(PrnDate+", "+年柱+月柱+日柱+時柱);
                    全陽八字.push(PrnStatement);
                } // end if yang

                if(年干陰陽=="陰" && 月干陰陽=="陰" && 日干陰陽=="陰" & 時干陰陽=="陰") {
                    var 全純陰="全陰";
                    if((地支純陰.indexOf(年柱.substr(1,1)) >=0) && (地支純陰.indexOf(月柱.substr(1,1)) >=0) && (地支純陰.indexOf(日柱.substr(1,1)) >=0) && (地支純陰.indexOf(時柱.substr(1,1)) >=0)) 全純陰="純陰";
                    var PrnYear=YYDate.getFullYear();
                    var PrnMonth=YYDate.getMonth()+1;
                    var PrnDay=YYDate.getDate();
                    var PrnHour=YYDate.getHours();
                    var PrnDate=PrnYear+"-"+PrnMonth+"-"+PrnDay+" : "+PrnHour;
                    var PrnStatement = YinCounter +", " + PrnDate + ", " + 年柱+" " +月柱 + " "+日柱+" " +時柱 + ", " + 全純陰;
                    YinCounter ++;
                    //console.log(PrnDate+", "+年柱+月柱+日柱+時柱);
                    全陰八字.push(PrnStatement);
                } // end if yang
                //************************************************************

            }  // if YYdate > theDate
        } // end for j
        //console.log(YYDate);
        YYDate.setDate(YYDate.getDate()+1);
        theDate=zeroPad(YYDate.getDate(), 2) + zeroPad(YYDate.getMonth()+1, 2) + YYDate.getFullYear();
        CurYear=YYDate.getFullYear();
    } while (YYDate < EndDate); //(YangCounter < 1000);

    // *********** grap the Div tag to output ***********
    $("#qyang").html(全陽八字.join("<br>"));
    $("#qyin").html(全陰八字.join("<br>"));
}


// ******************* 流年十二神煞 *******************
function 流年十二神煞(農曆生年, 農曆生月, 農曆生日, 農曆生時, 選項){
    var 流年虛歲=new Date().getFullYear()-農曆生年+1;
    //var 流年虛歲=2014-農曆生年+1;
    var 流年神煞矩陣=[];
    var 流年神煞註解=[];
    var 年神煞數=流年虛歲%12;
    var 月神煞數=(年神煞數+農曆生月-1)%12;
    var 日神煞數=(月神煞數+農曆生日-1)%12;
    var 生時=農曆生時;
    if(生時=="早子" || 生時=="夜子") 生時="子"
    var 時數=地支字轉值(生時);
    if (時數==0) 時數=12;  //亥時
    var 時神煞數=(日神煞數+時數-1)%12;
    
    var 押運神=十二神煞(年神煞數);  //年
    var 串宮神=十二神煞(月神煞數);  //月
    var 守護神=十二神煞(日神煞數);  //日
    var 巡門神=十二神煞(時神煞數);  //時
    
    switch(選項){
        case 1: case "神煞":
            流年神煞矩陣.push(押運神.名稱);
            流年神煞矩陣.push(串宮神.名稱);
            流年神煞矩陣.push(守護神.名稱);
            流年神煞矩陣.push(巡門神.名稱);
            return 流年神煞矩陣;
        case 2: case "流年十二神煞論斷":
            //var 十二神煞註解;
            //十二神煞註解="押運神："+押運神.名稱+"（"+押運神.吉凶+"）："+押運神.註解1+押運神.註解2;
            流年神煞註解.push("押運神："+押運神.名稱+"（"+押運神.吉凶+"）："+押運神.註解1+押運神.註解2);
            流年神煞註解.push("串宮神："+串宮神.名稱+"（"+串宮神.吉凶+"）："+串宮神.註解1+串宮神.註解2);
            流年神煞註解.push("守護神："+守護神.名稱+"（"+守護神.吉凶+"）："+守護神.註解1+守護神.註解2);
            流年神煞註解.push("巡門神："+巡門神.名稱+"（"+巡門神.吉凶+"）："+巡門神.註解1+巡門神.註解2);
            //console.log(流年神煞註解.join("<br><br>"));
            return 流年神煞註解.join("<br><br>");
    } //end switch 選項
}

function 十二神煞(神煞數){
    //var 神煞數=流年虛歲%12;
    var 十二神煞屬性={"名稱": "", "吉凶": "", "註解1": "", "註解2": ""};
    var 神煞=十二神煞屬性;
    
    switch(神煞數){
        case 0:
            神煞.名稱="病符";
            神煞.吉凶="小凶";
            神煞.註解1="病符壓運很難強，事要三思免禍殃。病魔纏身使人憂，三災八難難躲藏。";
            神煞.註解2="病符入命惡重重，疾病纏身家不寧，辦事處事心不順，朝朝暮暮愁雲生，憑你是個硬神漢，也得脫上皮幾層。";
            break;
        case 1:
            神煞.名稱="太歲";
            神煞.吉凶="小凶";
            神煞.註解1="太歲當頭座，無福便有禍，防車關、刀金之傷，小人容易近身，宜安奉太歲符祈安自吉，外出遠行宜避免。";
            神煞.註解2="太歲壓運不是福就是禍，是福無限美，是禍多憂愁。太歲壓運起禍端，傷財惹氣心不甘。驚天動地禍來臨,現是現非把人纏。他人閑事莫要管,防備自己得安然。太歲運年多憂愁，口舌臨門不自由，疾病纏身小人侵，婚姻錢財莫強求。運逢太歲難行舟，勸君慎重莫遠游。";
            break;
        case 2:
            神煞.名稱="青龍";
            神煞.吉凶="吉";
            神煞.註解1="青龍是喜神，大喜有幾重，荷花生貴子，門前應挂紅。青龍入命大吉祥，創業謀事有人幫，添人進口生貴子，家中喜事一樁樁。";
            神煞.註解2="官運亨通財運好，即使有禍不為殃。忌獨斷獨行，親人失和，但因貴人高照，喜事重重，貴人提拔，遠行有財利可得，生意興隆，財利大好，一切事事如意。";
            break;            
        case 3:
            神煞.名稱="喪門";
            神煞.吉凶="凶";
            神煞.註解1="喪門是哭星，落淚有幾行。";
            神煞.註解2="喪門運年心不安，求財望喜多枉然，不是傷人就損財，憂思重重整一年，不有內孝有外孝，犯著喪門淚漣漣。喪門入宮，不利探病，並忌喪事，犯喪孝，探病帶災，防小人設計，心情浮沉不定，事事要小心，以免發生意外，要防平地起風波，凶多吉少，要注意。";
            break;
        case 4:
            神煞.名稱="六合";
            神煞.吉凶="吉";
            神煞.註解1="六合見六合，必定喜事多。有妻生貴子，無妻娶嬌娥。";
            神煞.註解2="六合入命大吉昌，萬事順隨人丁旺，多得親友來輔助，縱有逆風不起浪，求財謀利皆如意，添喜進財時運強。";
            break;
        case 5:
            神煞.名稱="官符";
            神煞.吉凶="中";
            神煞.註解1="官符為紅鸞，有喜在當年。少惹是非事，免禍在身邊。官符還代表財運和事業。";
            神煞.註解2="官符入命令人憂，是非口舌無止休，平地也會起風波，憂思如麻不斷頭，財帛易散物易損，犯了官符難自由。";
            break;
        case 6:
            神煞.名稱="小耗";
            神煞.吉凶="中";
            神煞.註解1="時運多顛倒，做事不牢靠。金銀多耗散，家財遭鬼盜。";
            神煞.註解2="小耗之年多煩惱，是非口舌幾多招，官非易起氣易惹，金銀錢財易損耗，東奔西跑無定處，辦事不遂多阻撓。";
            break;
        case 7:
            神煞.名稱="大耗";
            神煞.吉凶="凶";
            神煞.註解1="大耗定不祥，父母有人傷。今年財要損，朋友來反目。背運有人傷，落井會下石。";
            神煞.註解2="年逢歲破禍非輕，官司竊騙極易生，不是破財遭凶事，就是體弱身染病，若與白虎連一起，凶喪孝服災更重。";
            break;
        case 8:
            神煞.名稱="朱雀";
            神煞.吉凶="小凶";
            神煞.註解1="朱雀壓運凶，口舌是非多。內外來磨磋，小人當前橫。事事犯啰唆，有理無人理。有冤無處訴，還要背黑鍋。";
            神煞.註解2="朱雀入命口舌生，風波擾得心不寧，求名求財皆不利，凡事多磨少成功，幸喜紫微當頭照，逢凶化吉保太平。";
            break;           
        case 9:
            神煞.名稱="白虎";
            神煞.吉凶="凶";
            神煞.註解1="白虎當頭坐，無災也有禍。鐵羅漢落井，有力難施展。白虎下山來，先遭口舌運，又遭凶災氣。";
            神煞.註解2="白虎入命最凶險，血光傷疾度難關，更有內外孝服事，天災橫禍需防范，白虎之年心難安，一年四季不消閑。";
            break;
        case 10:
            神煞.名稱="貴神";
            神煞.吉凶="吉";
            神煞.註解1="貴神壓運事吉祥，財源廣進喜又和。春不見喜秋也見，財喜雙全不用說。男遇貴神天賜祥，女見貴神喜事多。";
            神煞.註解2="貴神入命福壽長，財運亨通身安康，善與人交受人敬，高官厚祿名遠揚，凡事都有貴人幫，運逢貴神心歡暢。";
            break;
        case 11:
            神煞.名稱="吊客";
            神煞.吉凶="中";
            神煞.註解1="吊客壓運事有凶，定有是非鬧災行。男犯吊客主不順，女犯吊客有災星。";
            神煞.註解2="吊客流年也為凶，四方親人不太平，求財謀利難如意，晦氣會有幾多重，歲逢吊客心不安，舊愁去了新愁添。";
            break;
        default:
            神煞.名稱="";
            神煞.吉凶="";
            神煞.註解1="";
            神煞.註解2="";            
    }// end switch
    return 神煞;
}
