function 雜項算命主控(西曆生日, 性別) {
    輸入資料 = {
        "西曆日期": 西曆生日, 
        "運算西曆": 西曆生日,  // same as 西曆日期, since not doing any adjustment here
        "性別": 性別,
        "城市": "台北",  //default value, not used in 紫微斗數, but needed for 干支曆法
        "節氣用區域時間": false,
        "節氣用軌道太陽時": false,
        "干支曆": "",
        "農曆": "",
        "四柱": "",
        "生年干支": "",
        "四季": "",
        "生年納音": "",
        "備註": ""
    }; // end 輸入資料
    
    輸入資料.干支曆 = 西曆轉換干支曆(輸入資料);
    輸入資料.農曆 = 西曆轉換農曆(輸入資料.西曆日期, "", true, false, false, false, false, true); //附帶二十八宿論命內容
    輸入資料.四柱 = 輸入資料.干支曆.四柱;
    輸入資料.節令 = 輸入資料.干支曆.節令;
    
    輸入資料.四季 = 輸入資料.干支曆.四季;
    輸入資料.生年干支 = 輸入資料.農曆.干支年;
    輸入資料.生年納音 = 六十干支屬性(輸入資料.生年干支).納音;
    
    雜項論命 = {}; 雜項論命.輸入資料 = 輸入資料;
    雜項論命.壽生經 = 壽生經資料(輸入資料.生年干支);
    雜項論命.稱骨算命 = 袁天罡稱骨(輸入資料);
    雜項論命.二十八宿批命 = 二十八宿論斷(輸入資料, "批命"); //內容可以是排列批命或是擇日的資料
    
    // *** 神 煞 論 命 ***
    雜項論命.神煞 = {};
    雜項論命.神煞.童子煞 = 盲派_童子煞(輸入資料);
    雜項論命.神煞.鐵掃帚 = 盲派_鐵掃帚(輸入資料);
    雜項論命.神煞.天掃星 = 盲派_天掃星(輸入資料);
    雜項論命.神煞.地掃星 = 盲派_地掃星(輸入資料);
    雜項論命.神煞.四廢日 = 盲派_四廢日(輸入資料);
    雜項論命.神煞.八專日 = 盲派_八專日(輸入資料);
    雜項論命.神煞.九丑日 = 盲派_九丑日(輸入資料);
    雜項論命.神煞.陰陽差錯日 = 盲派_陰陽差錯日(輸入資料);
    雜項論命.神煞.十惡大敗日 = 盲派_十惡大敗日(輸入資料);  //十二大敗
    
    // *** 納 音 論 命 ***
    雜項論命.納音 = {};
    雜項論命.納音.論斷 = 盲派納音_總論(輸入資料);

    
    // *** 三 世 論 命 ***
    var 三世書命盤 = JSON.parse(JSON.stringify(輸入資料));
    delete 三世書命盤.運算西曆; delete 三世書命盤.城市; delete 三世書命盤.節氣用區域時間; delete 三世書命盤.節氣用軌道太陽時;
    三世書命盤.四柱 = 三世書命盤.干支曆.四柱;
    三世書命盤.生年支 = 三世書命盤.農曆.干支年.substr(1,1);
    三世書命盤.生月數 = 三世書命盤.農曆.月;
    三世書命盤.生月支 = 三世書命盤.干支曆.月柱.substr(1,1);;
    三世書命盤.生日數 = 三世書命盤.農曆.日;
    三世書命盤.生時支 = 三世書命盤.農曆.時;
    三世書命盤.生年納音五行 = 三世書命盤.生年納音.substr(2,1);
    
    雜項論命.三世書 = 三世書演算(三世書命盤);
    
    //console.log("-----"); console.log(三世書命盤);
    
    // ****************** 總結 ******************
    var 雜項論命註解矩陣 = [];

    雜項論命註解矩陣.push("壽生經：<br>" + 雜項論命.壽生經.判斷句+"。");
    雜項論命註解矩陣.push("袁天罡稱骨算命：<br>" + 雜項論命.稱骨算命.重量文字計算 + "<br>歌訣：" + 雜項論命.稱骨算命.歌訣);
    雜項論命註解矩陣.push("二十八宿批命：<br>" + 雜項論命.二十八宿批命);
    
    if(雜項論命.神煞.童子煞.成立) 雜項論命註解矩陣.push("童子煞：<br>" + 雜項論命.神煞.童子煞.註解);
    if(雜項論命.神煞.鐵掃帚.成立) 雜項論命註解矩陣.push("鐵掃帚：<br>" + 雜項論命.神煞.鐵掃帚.註解);
    if(雜項論命.神煞.天掃星.成立) 雜項論命註解矩陣.push("天掃星：<br>" + 雜項論命.神煞.天掃星.註解);
    if(雜項論命.神煞.地掃星.成立) 雜項論命註解矩陣.push("地掃星：<br>" + 雜項論命.神煞.地掃星.註解);
    if(雜項論命.神煞.四廢日.成立) 雜項論命註解矩陣.push("四廢日：<br>" + 雜項論命.神煞.四廢日.註解);
    if(雜項論命.神煞.八專日.成立) 雜項論命註解矩陣.push("八專日：<br>" + 雜項論命.神煞.八專日.註解);
    if(雜項論命.神煞.九丑日.成立) 雜項論命註解矩陣.push("九丑日：<br>" + 雜項論命.神煞.九丑日.註解);
    if(雜項論命.神煞.陰陽差錯日.成立) 雜項論命註解矩陣.push("陰陽差錯日：<br>" + 雜項論命.神煞.陰陽差錯日.註解);
    if(雜項論命.神煞.十惡大敗日.成立) 雜項論命註解矩陣.push("十惡大敗日：<br>" + 雜項論命.神煞.十惡大敗日.註解);
    
    if(雜項論命.納音.論斷.成立) 雜項論命註解矩陣.push("納音論命：<br>" + 雜項論命.納音.論斷.註解);
    
    雜項論命.總結 = 雜項論命註解矩陣.join("<br><br>");
    
    // ****************** 總結 ******************
    
    return 雜項論命;
}  // end function 雜項算命主控




function 壽生經資料(六十甲子) {
	var 資料索引;

	var 壽生資料 = [
        { "生年干支": "甲子", "欠錢貫": "五萬三千", "欠錢數": 53000, "看經卷": "十八", "納庫": "三", "曹官姓": "元"},
        { "生年干支": "乙丑", "欠錢貫": "二十八萬", "欠錢數": 280000, "看經卷": "九十四", "納庫": "十三", "曹官姓": "田"},
        { "生年干支": "丙寅", "欠錢貫": "八萬", "欠錢數": 80000, "看經卷": "二十七", "納庫": "十", "曹官姓": "馬"},
        { "生年干支": "丁卯", "欠錢貫": "二萬三千", "欠錢數": 23000, "看經卷": "八", "納庫": "十六", "曹官姓": "許"},
        { "生年干支": "戊辰", "欠錢貫": "五萬四千", "欠錢數": 54000, "看經卷": "十八", "納庫": "十四", "曹官姓": "馮"},
        { "生年干支": "己巳", "欠錢貫": "七萬二千", "欠錢數": 72000, "看經卷": "二十四", "納庫": "二十二", "曹官姓": "曹"},
        { "生年干支": "庚午", "欠錢貫": "六萬二千", "欠錢數": 62000, "看經卷": "二十一", "納庫": "四十二", "曹官姓": "陳"},
        { "生年干支": "辛未", "欠錢貫": "十萬一千", "欠錢數": 101000, "看經卷": "三十四", "納庫": "五十九", "曹官姓": "常"},
        { "生年干支": "壬申", "欠錢貫": "四萬二千", "欠錢數": 42000, "看經卷": "十四", "納庫": "四十九", "曹官姓": "王"},
        { "生年干支": "癸酉", "欠錢貫": "五萬", "欠錢數": 50000, "看經卷": "十七", "納庫": "十二", "曹官姓": "申"},
        { "生年干支": "甲戌", "欠錢貫": "二萬七千", "欠錢數": 27000, "看經卷": "九", "納庫": "十七", "曹官姓": "井"},
        { "生年干支": "乙亥", "欠錢貫": "四萬八千", "欠錢數": 48000, "看經卷": "十六", "納庫": "四十二", "曹官姓": "成"},
        { "生年干支": "丙子", "欠錢貫": "七萬三千", "欠錢數": 73000, "看經卷": "二十五", "納庫": "九", "曹官姓": "王"},
        { "生年干支": "丁丑", "欠錢貫": "四萬二千", "欠錢數": 42000, "看經卷": "十五", "納庫": "三", "曹官姓": "崔"},
        { "生年干支": "戊寅", "欠錢貫": "六萬", "欠錢數": 60000, "看經卷": "二十", "納庫": "十一", "曹官姓": "鄭"},
        { "生年干支": "己卯", "欠錢貫": "八萬", "欠錢數": 80000, "看經卷": "二十七", "納庫": "二十六", "曹官姓": "宋"},
        { "生年干支": "庚辰", "欠錢貫": "五萬七千", "欠錢數": 57000, "看經卷": "十九", "納庫": "二十四", "曹官姓": "劉"},
        { "生年干支": "辛巳", "欠錢貫": "五萬七千", "欠錢數": 57000, "看經卷": "十九", "納庫": "三十七", "曹官姓": "高"},
        { "生年干支": "壬午", "欠錢貫": "七萬", "欠錢數": 70000, "看經卷": "二十四", "納庫": "四十四", "曹官姓": "孔"},
        { "生年干支": "癸未", "欠錢貫": "五萬二千", "欠錢數": 52000, "看經卷": "十八", "納庫": "四十九", "曹官姓": "朱"},
        { "生年干支": "甲申", "欠錢貫": "七萬", "欠錢數": 70000, "看經卷": "二十四", "納庫": "五十六", "曹官姓": "呂"},
        { "生年干支": "乙酉", "欠錢貫": "四萬", "欠錢數": 40000, "看經卷": "十四", "納庫": "二", "曹官姓": "安"},
        { "生年干支": "丙戌", "欠錢貫": "八萬", "欠錢數": 80000, "看經卷": "二十七", "納庫": "三", "曹官姓": "左"},
        { "生年干支": "丁亥", "欠錢貫": "三萬九千", "欠錢數": 39000, "看經卷": "十三", "納庫": "四十", "曹官姓": "吉"},
        { "生年干支": "戊子", "欠錢貫": "六萬三千", "欠錢數": 63000, "看經卷": "二十一", "納庫": "六", "曹官姓": "伍"},
        { "生年干支": "己丑", "欠錢貫": "八萬", "欠錢數": 80000, "看經卷": "二十七", "納庫": "七", "曹官姓": "周"},
        { "生年干支": "庚寅", "欠錢貫": "五萬一千", "欠錢數": 51000, "看經卷": "十七", "納庫": "十五", "曹官姓": "毛"},
        { "生年干支": "辛卯", "欠錢貫": "八萬", "欠錢數": 80000, "看經卷": "二十七", "納庫": "四", "曹官姓": "張"},
        { "生年干支": "壬辰", "欠錢貫": "四萬五千", "欠錢數": 45000, "看經卷": "十五", "納庫": "一", "曹官姓": "趙"},
        { "生年干支": "癸巳", "欠錢貫": "三萬九千", "欠錢數": 39000, "看經卷": "十三", "納庫": "五十", "曹官姓": "卞"},
        { "生年干支": "甲午", "欠錢貫": "四萬", "欠錢數": 40000, "看經卷": "十四", "納庫": "二十一", "曹官姓": "牛"},
        { "生年干支": "乙未", "欠錢貫": "四萬", "欠錢數": 40000, "看經卷": "十四", "納庫": "五十一", "曹官姓": "皇"},
        { "生年干支": "丙申", "欠錢貫": "三萬三千", "欠錢數": 33000, "看經卷": "十一", "納庫": "五十七", "曹官姓": "鈕"},
        { "生年干支": "丁酉", "欠錢貫": "十七萬", "欠錢數": 170000, "看經卷": "五十七", "納庫": "二十九", "曹官姓": "胡"},
        { "生年干支": "戊戌", "欠錢貫": "四萬二千", "欠錢數": 42000, "看經卷": "十四", "納庫": "三十六", "曹官姓": "晉"},
        { "生年干支": "己亥", "欠錢貫": "七萬二千", "欠錢數": 72000, "看經卷": "二十四", "納庫": "五十", "曹官姓": "卞"},
        { "生年干支": "庚子", "欠錢貫": "十一萬", "欠錢數": 110000, "看經卷": "三十七", "納庫": "九", "曹官姓": "李"},
        { "生年干支": "辛丑", "欠錢貫": "十一萬", "欠錢數": 110000, "看經卷": "三十七", "納庫": "十八", "曹官姓": "吉"},
        { "生年干支": "壬寅", "欠錢貫": "九萬六千", "欠錢數": 96000, "看經卷": "三十二", "納庫": "十一", "曹官姓": "施"},
        { "生年干支": "癸卯", "欠錢貫": "三萬三千", "欠錢數": 33000, "看經卷": "十一", "納庫": "二十二", "曹官姓": "王"},
        { "生年干支": "甲辰", "欠錢貫": "二萬九千", "欠錢數": 29000, "看經卷": "十", "納庫": "十九", "曹官姓": "董"},
        { "生年干支": "乙巳", "欠錢貫": "九萬", "欠錢數": 90000, "看經卷": "三十", "納庫": "二十一", "曹官姓": "楊"},
        { "生年干支": "丙午", "欠錢貫": "五萬三千", "欠錢數": 53000, "看經卷": "十八", "納庫": "六十", "曹官姓": "蕭"},
        { "生年干支": "丁未", "欠錢貫": "九萬一千", "欠錢數": 91000, "看經卷": "三十一", "納庫": "五十八", "曹官姓": "朱"},
        { "生年干支": "戊申", "欠錢貫": "八萬", "欠錢數": 80000, "看經卷": "二十七", "納庫": "五十八", "曹官姓": "柴"},
        { "生年干支": "己酉", "欠錢貫": "九萬", "欠錢數": 90000, "看經卷": "三十", "納庫": "二十二", "曹官姓": "孫"},
        { "生年干支": "庚戌", "欠錢貫": "十一萬", "欠錢數": 110000, "看經卷": "三十七", "納庫": "二", "曹官姓": "辛"},
        { "生年干支": "辛亥", "欠錢貫": "七萬一千", "欠錢數": 71000, "看經卷": "二十四", "納庫": "四十", "曹官姓": "卞"},
        { "生年干支": "壬子", "欠錢貫": "七萬", "欠錢數": 70000, "看經卷": "二十四", "納庫": "三", "曹官姓": "孟"},
        { "生年干支": "癸丑", "欠錢貫": "二萬七千", "欠錢數": 27000, "看經卷": "九", "納庫": "八三", "曹官姓": "習"},
        { "生年干支": "甲寅", "欠錢貫": "三萬三千", "欠錢數": 33000, "看經卷": "十一", "納庫": "十一", "曹官姓": "杜"},
        { "生年干支": "乙卯", "欠錢貫": "八萬", "欠錢數": 80000, "看經卷": "二十七", "納庫": "十八", "曹官姓": "柳"},
        { "生年干支": "丙辰", "欠錢貫": "三萬二千", "欠錢數": 32000, "看經卷": "十一", "納庫": "三十三", "曹官姓": "賈"},
        { "生年干支": "丁巳", "欠錢貫": "七萬", "欠錢數": 70000, "看經卷": "二十四", "納庫": "十六", "曹官姓": "程"},
        { "生年干支": "戊午", "欠錢貫": "九萬", "欠錢數": 90000, "看經卷": "三十", "納庫": "三十九", "曹官姓": "史"},
        { "生年干支": "己未", "欠錢貫": "四萬三千", "欠錢數": 43000, "看經卷": "十五", "納庫": "五", "曹官姓": "卞"},
        { "生年干支": "庚申", "欠錢貫": "六萬一千", "欠錢數": 61000, "看經卷": "二十一", "納庫": "四十二", "曹官姓": "胡"},
        { "生年干支": "辛酉", "欠錢貫": "二萬七千", "欠錢數": 27000, "看經卷": "九", "納庫": "十五", "曹官姓": "丁"},
        { "生年干支": "壬戌", "欠錢貫": "七萬二千", "欠錢數": 72000, "看經卷": "二十四", "納庫": "四十", "曹官姓": "彭"},
        { "生年干支": "癸亥", "欠錢貫": "七萬五千", "欠錢數": 75000, "看經卷": "二十五", "納庫": "四十三", "曹官姓": "仇"}
	];

	資料索引=_.findIndex(壽生資料, {生年干支: 六十甲子});
    var 回傳資料 = {
        "干支": 六十甲子,
        "欠錢貫": "",
        "欠錢數": 0,
        "看經卷": "",
        "納庫": "",
        "曹官姓": "",
        "判斷句": "",
        "備註": ""
    };
    
    if (資料索引 != -1) {
        回傳資料.干支 = 六十甲子;
        回傳資料.欠錢貫 = 壽生資料[資料索引].欠錢貫;
        回傳資料.欠錢數 = 壽生資料[資料索引].欠錢數;
        回傳資料.看經卷 = 壽生資料[資料索引].看經卷;
        回傳資料.納庫 = 壽生資料[資料索引].納庫;
        回傳資料.曹官姓 = 壽生資料[資料索引].曹官姓;
        回傳資料.判斷句 = 回傳資料.干支 + "命欠錢" + 回傳資料.欠錢貫 + "貫，看經" + 回傳資料.看經卷 +  "卷，納" + 回傳資料.納庫 + "庫，曹官姓" + 回傳資料.曹官姓; 
        //console.log(資料註解);
    }  // end if
    return 回傳資料;
}  //end function 壽生經資料




