
/*
$(document).on("click", "#身強弱量規", function () {
    身強弱量規值.update(命盤.分析.強弱.印比.數據);
});
*/

// --------------------------------------------------------------------------


function 八字命盤排列(命盤) {
    //document.getElementById("content").innerHTML='<object type="text/html" data="home.html" ></object>';
    
    /*
    命盤 = new 八字命盤模塊(西曆生日時, 性別, 國家, 系統.設定);
    if (命盤.運行參數.運算.ChartNull == true) {
        $("#BaziChart").html(GenBaziChart());
        命盤.運行參數.運算.ChartNull = false;
    }
    */
    console.log(命盤);

    $("#BaziChart").html(GenBaziChart());
    $("#BaziChart").show();
    //$("#tabbed-nav").show();

    $(".大運干支格子").eq(9-命盤.運行.大運數).trigger("click"); // click 現行的大運
    命盤.運行.大運流年數 = 現行大運流年數(命盤.大運[命盤.運行.大運數].起年);
    $(".流年干支格子").eq(9-命盤.運行.大運流年數).trigger("click"); // click 現行的流年

    var 生日資訊;
    //if(命盤.生日.日光節約!="") {
    //    生日資訊 = 命盤.陽男陰女 + ", " + 命盤.生日.節氣 + ", " + 命盤.生日.日光節約;
    //}
    生日資訊 = 命盤.陽男陰女 + ", " + 命盤.生日.生肖 + ", " + 命盤.生日.星座 + ", " + 命盤.生日.節氣;
    
    var 西曆中文=命盤.生日.西曆中文;
    if(命盤.生日.交節日!="") 西曆中文 += "，（交節日）";
    
    var 橫幅附加="";
    系統.設定.用戶設定.四柱歲數.年柱="1-16"; 系統.設定.用戶設定.四柱歲數.月柱="17-32"; 系統.設定.用戶設定.四柱歲數.日柱="33-48"; 系統.設定.用戶設定.四柱歲數.時柱="49-64"; 

    if(系統.設定.用戶設定.象論盤) {
        橫幅附加=" * ";
        系統.設定.用戶設定.四柱歲數.年柱="1-15"; 系統.設定.用戶設定.四柱歲數.月柱="16-30"; 系統.設定.用戶設定.四柱歲數.日柱="31-45"; 系統.設定.用戶設定.四柱歲數.時柱="45-60"; 
    }

    $("#橫幅名稱").html(橫幅附加 + 系統.版本.平台標題+橫幅附加);
    
    $("#版本名稱").html(系統.版本.版本顯示);
    $("#CopyrightID").html(系統.版本.copyright);
    
    $("#mpxs-生日資訊").html(生日資訊);
    $("#mpxs-西曆生日").html(西曆中文);
    $("#mpxs-農曆生日").html(命盤.生日.農曆);

    var 元男元女 = (命盤.性別 == "男") ? "元男" : "元女";
    $("#mpxs-日元").html(元男元女);

    // *********** 導入 四柱歲數 範圍 ***********
    $("#mpxs-時柱歲數").html(系統.設定.用戶設定.四柱歲數.時柱);
    $("#mpxs-日柱歲數").html(系統.設定.用戶設定.四柱歲數.日柱);
    $("#mpxs-月柱歲數").html(系統.設定.用戶設定.四柱歲數.月柱);
    $("#mpxs-年柱歲數").html(系統.設定.用戶設定.四柱歲數.年柱);

    // *********** 導入 八字干支、藏干 ***********
    $("#mpxs-年干").html(命盤.年干.天干);
    $("#mpxs-年支").html(命盤.年支.地支);

    $("#mpxs-月干").html(命盤.月干.天干);
    $("#mpxs-月支").html(命盤.月支.地支);

    $("#mpxs-日干").html(命盤.日干.天干);
    $("#mpxs-日支").html(命盤.日支.地支);

    $("#mpxs-時干").html(命盤.時干.天干);
    $("#mpxs-時支").html(命盤.時支.地支);
    
    $("#mpxs-年支藏干1").html(命盤.年支.藏干1 + " " + 命盤.年支.十神1 + "<br>");
    $("#mpxs-年支藏干2").html(命盤.年支.藏干2 + " " + 命盤.年支.十神2 + "<br>");
    $("#mpxs-年支藏干3").html(命盤.年支.藏干3 + " " + 命盤.年支.十神3);
    
    $("#mpxs-月支藏干1").html(命盤.月支.藏干1 + " " + 命盤.月支.十神1 + "<br>");
    $("#mpxs-月支藏干2").html(命盤.月支.藏干2 + " " + 命盤.月支.十神2 + "<br>");
    $("#mpxs-月支藏干3").html(命盤.月支.藏干3 + " " + 命盤.月支.十神3);

    $("#mpxs-日支藏干1").html(命盤.日支.藏干1 + " " + 命盤.日支.十神1 + "<br>");
    $("#mpxs-日支藏干2").html(命盤.日支.藏干2 + " " + 命盤.日支.十神2 + "<br>");
    $("#mpxs-日支藏干3").html(命盤.日支.藏干3 + " " + 命盤.日支.十神3);

    $("#mpxs-時支藏干1").html(命盤.時支.藏干1 + " " + 命盤.時支.十神1 + "<br>");
    $("#mpxs-時支藏干2").html(命盤.時支.藏干2 + " " + 命盤.時支.十神2 + "<br>");
    $("#mpxs-時支藏干3").html(命盤.時支.藏干3 + " " + 命盤.時支.十神3);
    
    
    // *********** 導入 主星、副星 十神 ***********
    $("#mpxs-年干十神").html(命盤.年干.十神);
    $("#mpxs-月干十神").html(命盤.月干.十神);
    $("#mpxs-時干十神").html(命盤.時干.十神);
    
    if($("#mpxs-時干").html()=="-") $("#mpxs-時干十神").html("吉時"); //沒有時辰的時干十神設為 吉時
 

    // *********** 導入 運星 ***********
    if(系統.設定.用戶設定.命盤顯示.運星){
        $("#mpxs-年運星").html(命盤.年柱.運星);
        $("#mpxs-月運星").html(命盤.月柱.運星);
        $("#mpxs-日運星").html(命盤.日柱.運星);
        $("#mpxs-時運星").html(命盤.時柱.運星);
    }

     // *********** 導入 納音 ***********
    if(系統.設定.用戶設定.命盤顯示.納音){
        $("#mpxs-年柱納音").html(命盤.年柱.納音);
        $("#mpxs-月柱納音").html(命盤.月柱.納音);
        $("#mpxs-日柱納音").html(命盤.日柱.納音);
        $("#mpxs-時柱納音").html(命盤.時柱.納音);
    }

    // *********** 導入 神煞 ***********
    if(系統.設定.用戶設定.命盤顯示.神煞){
        $("#mpxs-年柱神煞").html(命盤.神煞.年柱.join("<br>"));
        $("#mpxs-月柱神煞").html(命盤.神煞.月柱.join("<br>"));
        $("#mpxs-日柱神煞").html(命盤.神煞.日柱.join("<br>"));
        $("#mpxs-時柱神煞").html(命盤.神煞.時柱.join("<br>"));
    }
    // ******** 導入 大運干支起歲 ********
    for (var j = 0; j <= 9; j++) {
        $("#mpxs-大運" + j + "干支").html(VerticalString(命盤.大運[j].大運顯示, "大運干支字"));
        $("#mpxs-大運" + j + "起歲").html(命盤.大運[j].起歲);
        $("#mpxs-大運" + j + "起年").html(命盤.大運[j].起年);
    }
    /*
    // ******** 導入 起運 、宮位********
    $("#mpxs-起運").html(命盤.分析句.起運);
    
    // ******** 導入 命盤提示 ********
    var 命盤提示內容=[];
    if(命盤.命盤提示.夏令!="") 命盤提示內容.push(命盤.命盤提示.夏令);
    命盤提示內容.push(命盤.命盤提示.上運+ "。" + 命盤.命盤提示.交脫);
    命盤提示內容.push(命盤.命盤提示.人元司令);
    命盤提示內容.push(命盤.命盤提示.宮位);
    $("#mpxs-命盤提示").html(Array2UnorderedList(命盤提示內容, "命盤提示"));
    */

    //命盤內容建立(命盤);  //本命論斷
    
    //$("#身強弱量規").trigger("click"); // click to refresh liquid fill gauge new value

    刷新命盤顏色(命盤);  //jQueryInitCtrl


    //流年十二神煞(命盤.生日.農曆年, 命盤.生日.農曆月, 命盤.生日.農曆日, 命盤.生日.農曆時, "流年十二神煞論斷");

} //end function 八字排盤










/*
$(document).on("click touchstart", ".流月干支格子", function () {
    if (命盤.分析.行運註解.流月用 == 1) {
        $('.流月干支格子').css('background', '#FAFAFA');
        $(this).css('background', 'yellow');
        var 流月數 = $(this).attr("data-流月數");
        命盤.運行.流月數 = 流月數;
        命盤.運行.流月份 = Number(流月數) + 1;
        //$(".流月干支格子").eq(流月數).addClass("運限背景顏色當選");

        命盤.分析.行運註解.流月 = 行運分析模塊(命盤, "流月");
        $("#流月註解").html(命盤.分析.行運註解.流月);
    }
}); //end 流年月格子 on click

$(document).on("dblclick", ".流月干支格子", function () {
    if (命盤.分析.行運註解.流月用 == 1) {
        $('.流月干支格子').css('background', '#FAFAFA');
        $(this).css('background', 'yellow');
        var 流月數 = $(this).attr("data-流月數");
        命盤.運行.流月數 = 流月數;
        命盤.運行.流月份 = Number(流月數) + 1;
        //$(".流月干支格子").eq(流月數).addClass("運限背景顏色當選");

        //命盤.分析.行運註解.流月 = 行運分析模塊(命盤, "流月");
        //$("#dlg流運分析").html(命盤.分析.行運註解.流月);
        //$("#dlg流運分析").dialog('option', 'title', '流月分析：');
        //$("#dlg流運分析").dialog("open");
        
    }
}); //end 流年月格子 on double click - dialog !!
*/
