function 命盤神煞(命盤){
    //this is using general 神煞 determination without details, to be deleted once done
    var 論斷項目='<span class = "傳統論斷項目">命盤神煞</span>';
    var 各柱神煞矩陣 = [];

    各柱神煞矩陣.push(論斷項目);
    if (命盤.神煞.年柱!="") 各柱神煞矩陣.push("年柱神煞："+命盤.神煞.年柱);
    if (命盤.神煞.月柱!="") 各柱神煞矩陣.push("月柱神煞："+命盤.神煞.月柱);
    if (命盤.神煞.日柱!="") 各柱神煞矩陣.push("日柱神煞："+命盤.神煞.日柱);
    if (命盤.神煞.時柱!="") 各柱神煞矩陣.push("時柱神煞："+命盤.神煞.時柱);
    //if (命盤.神煞.命盤!="") 各柱神煞矩陣.push("其他神煞："+命盤.神煞.命盤);

    //var 神煞註解=神煞尋簡註(命盤.神煞.命盤); // 建立神煞註解表
    //$("#nrxs-神煞").html(ObjArry2PanelGrp(神煞註解, "神煞", "神煞"));

    return 各柱神煞矩陣.join("<br>");
}

function 判斷神煞(命盤) {
    // 判斷各柱是否有該神煞，標註在四柱與各柱
    斷魁罡(命盤);
    斷空亡(命盤);
    斷羊刃(命盤);
}

function 論斷神煞(命盤) {
    //神煞的分析與註解
    var 神煞論斷矩陣=[];
    
    var 魁罡論斷 = 論魁罡(命盤);
    var 空亡論斷 = 論空亡(命盤);
    
    if(魁罡論斷!="") 神煞論斷矩陣.push(魁罡論斷);
    if(空亡論斷!="") 神煞論斷矩陣.push(空亡論斷);
    
    return 神煞論斷矩陣.join("<br>");
}

// ********************************************************************************************************

function 斷空亡(命盤){
    var 年柱空亡=判空亡(命盤.年柱.干支);
    var 日柱空亡=判空亡(命盤.日柱.干支);

    var 空亡原矩陣 = [年柱空亡.substr(0,1), 年柱空亡.substr(1,1), 日柱空亡.substr(0,1), 日柱空亡.substr(1,1)];
    var 空亡矩陣 = [];

    $.each(空亡原矩陣, function(i, el){
        if($.inArray(el, 空亡矩陣) === -1) 空亡矩陣.push(el);
    });

    for(var i=0;i<4;i++){
        for(var j=0;j<空亡矩陣.length;j++){
            if(命盤.分析.四柱.四柱數據[i].地支 == 空亡矩陣[j]){  
                命盤.分析.四柱.四柱數據[i].神煞.空亡 = true;
                命盤.分析.四柱.四柱數據[i].神煞矩陣.push("空亡");
                命盤.分析.四柱.神煞.空亡++;
            }
        }
    }
}

function 論空亡(命盤){
    var 空亡註解 = [];
    var 索引過的十神 = [];
    var 索引過的運星 = [];
    var 空亡句子;
    //var 命盤有空亡=false;
    
    for (var i = 0; i < 4; i++) {
        if(命盤.分析.四柱.四柱數據[i].神煞.空亡){
            switch(i){
                case 0:
                    空亡句子 = "年柱被空亡，多主幼年未能受到良好的照顧，一生多辛苦，祖上無力，多須白手起家。<br>年柱又是祖上兼父母官之所在，被空亡，則祖上或父母自然力量較為薄弱，無法充分妥善的照顧子女。因此，在十六歲之前常因父母或祖上之運勢不揚而備受辛苦。";
                    if(命盤.分析.四柱.四柱數據[0].天干十神 == "傷官" || 命盤.分析.四柱.四柱數據[0].地支十神1 == "傷官") 空亡句子 = 空亡句子 + "<br>年柱有傷官，又空亡，恐祖先之中有一位斷壽者。";
                    if(命盤.分析.四柱.四柱數據[1].神煞.空亡) 空亡句子 = 空亡句子 + "<br>年月柱皆空亡者，易離妻子。";
                    break;
                case 1:
                    空亡句子 = "月柱是經管十七歲到三十二歲至青年運之大運，被空亡，主此段期間阻逆較多，求學也較容易發生阻礙與波折。<br>又月柱是兄弟宮所在之地，被空亡，常有兄弟早別離或喪亡，或者不得力不和睦，或是兄弟緣薄。<br>月柱空亡者，常有家運不興或家業不順而連帶地使自己受苦者頗多。";
                    break;
                case 2:
                    空亡句子 = "日柱是經管三十三歲到四十八歲至第三大運，又是夫妻宮之位，被空亡，夫妻不能白頭偕老之意也，或是夫妻聚少離多，或是姻緣有破、或是本人或配偶有早喪之現象，離婚、再婚、婚姻感情多波折之暗示。<br>又意味著在三十三到四十八歲之間，本身、家庭、夫妻等多困厄，多阻逆或災劫之暗示。";
                    break;
                case 3:
                    空亡句子 = "時柱是管轄四十九歲以後之晚年運之第四大運，同時，時柱為子女宮與事業宮之所在，被空亡，表示子息少子孫乏，或是子息不得力，或是生女兒之機會較大，男兒較少，較難享子女福，也易白髮送黑髮。晚景較容易陷於孤獨、貧寒、困逆之境。若加上晚年行運不佳的話，更加應驗。<br>另外時柱是事業宮之所在，被空亡，也暗示著事業工作上較多阻逆之現象。";
                    break;
            } // end switch

            空亡註解.push(空亡句子);
            if ((_.indexOf(索引過的十神, 命盤.分析.四柱.四柱數據[i].天干十神) < 0) && i!=2) { 
                空亡註解.push(十神空亡(命盤.分析.四柱.四柱數據[i].天干十神, 命盤.性別, 0));
                索引過的十神.push(命盤.分析.四柱.四柱數據[i].天干十神);
            }

            if (_.indexOf(索引過的十神, 命盤.分析.四柱.四柱數據[i].地支十神1) < 0) { 
                空亡註解.push(十神空亡(命盤.分析.四柱.四柱數據[i].地支十神1, 命盤.性別, 0));
                索引過的十神.push(命盤.分析.四柱.四柱數據[i].地支十神1);
            }
            if (命盤.分析.四柱.四柱數據[i].三合 != "" || 命盤.分析.四柱.四柱數據[i].半合 != "" || 命盤.分析.四柱.四柱數據[i].六合 != ""|| 命盤.分析.四柱.四柱數據[i].三會 != "") 空亡註解.push("空亡之支逢鄰支來合會，可以解除空亡。");
            if (命盤.分析.四柱.四柱數據[i].相冲 != "") 空亡註解.push("空亡逢冲，反而更凶。");

            if (_.indexOf(索引過的運星, 命盤.分析.四柱.四柱數據[i].運星) < 0) { 
                空亡註解.push(運星空亡(命盤.分析.四柱.四柱數據[i].運星, 命盤.性別));
                索引過的運星.push(命盤.分析.四柱.四柱數據[i].運星);
            }
        } // end if 空亡
    } // end for

    //-------------
    if (空亡註解.length > 0) {
        var 單元標題 = '<span class = "傳統論斷項目">論空亡</span>';
        空亡註解.unshift(單元標題);
        return 空亡註解.join("<br><br>"); 
    }
    else return "";
}

function 十神空亡(十神, 性別, 四柱){
    //四柱：0，1，2，3 年柱、月柱
    //性別：男，女
    var 十神空亡註解;
    switch(十神){
        case "正官":
            十神空亡註解 = "正官代表行政權柄、學歷。因此，正官空亡，學歷常因意外而受變化，使得原命應有的學歷受到挫折，不能如願完成學業。從事政治亦不吉，容易有頭無尾，縱使獲得官位，亦不能長久在位，總會由於其他事端而失去官職。";
            if (性別 == "女") {
                十神空亡註解 = 十神空亡註解 + "正官對於女性是夫星，被空亡則夫緣不佳。";
                if (命盤.分析.十神.數據[十神字轉數("正官")].天干地支 == 1) {
                    if (四柱 == 1 || 四柱 == 2) 十神空亡註解 = 十神空亡註解 + "<br>女命僅有一位正官，坐落於月柱或日柱，而被空亡者，必與丈夫生離或死別。";
                    if (四柱 == 0 || 四柱 == 3) 十神空亡註解 = 十神空亡註解 + "<br>女命僅有一位正官，不在月日兩柱而被空亡者，亦易與原配夫君發生感情凶變，終須離開丈夫或分居。";
                }
                if (命盤.分析.十神.數據[十神字轉數("正官")].天干地支 > 1) {
                    十神空亡註解 = 十神空亡註解 + "<br>命官星有兩位以上，而其中之一落入空亡者，乃離婚再嫁之兆。";
                }

            }
            if (性別 == "男") 十神空亡註解 = 十神空亡註解 + "<br>正官對男命而言，代表兒子，被空亡的話，表示兒子身體不佳，甚或早夭，多為兒子操心，或兒子少而女兒多之暗示。";
            break;

        case "七殺":
            十神空亡註解 = "七殺代表行政權柄、學歷。逢空亡，學歷常因意外而受變化，使得原命應有的學歷受到挫折，不能如願完成學業。從事政治亦不吉，容易有頭無尾，縱使獲得官位，亦不能長久在位，總會由於其他事端而失去官職。";
            if (性別 == "女") {
                十神空亡註解 = 十神空亡註解 + "<br>七殺對於女性亦是夫星，被空亡夫緣不佳，不得夫之疼愛，容易婚變或早年喪偶。<br>*七殺若是忌神又合日柱者更驗。<br>女命七殺逢空亡，往往與配偶之兄弟手足不睦。*<br>命局官殺混淆雜，其中之一逢空亡，婚姻反而較少波折。";
                if (命盤.分析.十神.數據[十神字轉數("七殺")].天干地支 == 1 && 命盤.分析.十神.數據[十神字轉數("正官")].天干地支 ==0 ) {
                    if (四柱 == 1 || 四柱 == 2) 十神空亡註解 = 十神空亡註解 + "<br>女命沒有正官，僅有一位七殺，坐落於月柱或日柱，而被空亡者，必與丈夫生離或死別。";
                    if (四柱 == 0 || 四柱 == 3) 十神空亡註解 = 十神空亡註解 + "<br>女命沒有正官，僅有一位七殺，不在月日兩柱而被空亡者，亦易與原配夫君發生感情凶變，終須離開丈夫或分居。";
                }

            }
            if (性別 == "男") 十神空亡註解 = 十神空亡註解 + "<br>七殺對男命而言，代表女兒，被空亡的話，表示不易得女兒而多男兒。或者女兒早別，或是男兒獲遲，且其男兒較遲才能言語。";
            break;

        case "正財":
            十神空亡註解 = "正財象徵財政之權柄，逢空亡，意味著財政權柄旁落，合資做生意時，財權落入他人手中，生涯之中身上少帶巨款，但並非無財，只是無權支配財權。而且未來恐有破產敗業或事業遭受損失或改業之兆。<br>不論男女，正財逢空亡，均易破財，財來財去，較不易積存，且要注意財物被盜而受到損失。";
            if (性別 == "男") {
                十神空亡註解 = 十神空亡註解 + "<br>正財對男命而言，代表原配夫人，若逢空亡的話，容易與原配夫人發生感情兇變，甚至於離異或喪偶，再婚或配偶之身體病弱，比自己早喪。";
                if (命盤.分析.十神.數據[十神字轉數("正財")].天干地支 ==1 && (四柱 == 1 || 四柱 == 2) ) {
                    十神空亡註解 = 十神空亡註解 + "<br>男命正財星僅有一個又出現在月柱或日柱，而被空亡者有喪妻之憂。";
                }
            }
            break;

        case "偏財":
            十神空亡註解 = "偏財亦是財政權柄，逢空亡，有財權旁落，易破財、破產、事業損失或改業之兆，或是財來財去，積財不易之象。<br>";
            if (性別 == "男") {
                十神空亡註解 = 十神空亡註解 + "<br>男命而言，偏財亦代表配偶，逢空亡，易與原配分離再娶，喪偶或妻病弱，殘疾之象。";
                if (命盤.分析.十神.數據[十神字轉數("偏財")].天干地支 ==1 && 命盤.分析.十神.數據[十神字轉數("正財")].天干地支 ==0 &&(四柱 == 1 || 四柱 == 2) ) {
                    十神空亡註解 = 十神空亡註解 + "<br>男命無正財，偏財星僅有一個又出現在月柱或日柱，而被空亡者有喪妻之憂。";
                }
            }
            break;

        case "正印":
            十神空亡註解 = "正印代表文書權柄，代表學術之成就，逢空亡，暗示着學術難有大成就。也要注意與文書有關之權柄之喪失，或因之受害，對於簽訂契約、稅金、護照、支票、本票、作保等等與文書或蓋章〈正印代表印璽)有關之事必須小心處理，以免受害。<br>正印逢空亡，常有退票或申請被駁回之事，所謂印逢空亡，蓋章無效也。<br>正印亦是母星，逢空亡的話，暗示着會與母親不和，關係變得疏遠，淡薄，與母親之關係由好轉壞，或者母親病弱，早喪或帶疾在身。";
            break;

        case "偏印":
            十神空亡註解 = "偏印代表文書權柄，代表學術之成就，逢空亡，暗示着學術難有大成就。也要注意與文書有關之權柄之喪失，或因之受害，對於簽訂契約、稅金、護照、支票、本票、作保等等與文書有關之事必須小心處理，以免受害。<br>偏印亦是母星，逢空亡的話，暗示着會與母親不和，關係變得疏遠，淡薄，與母親之關係由好轉壞，或者母親（若有繼母，則繼母不利）病弱，早喪或帶疾在身。";
            break;

        case "食神":
            if (性別 == "男") {
                十神空亡註解 = "男命食神逢空亡，男兒較少，若食神為用神而被空亡者，則本人不壽。且子女有損傷或夭折之慮。";
            }

            if (性別 == "女") {
                十神空亡註解 = "女命而言，食神是子星，逢空亡的話，易損子，或多生男而不生女。或子女之中有比自己早喪者。<br>*若食神是用神而被空亡者，有損胎、流產或子女早夭之憂。";
            }
            break;

        case "傷官":
            if (性別 == "男") {
                十神空亡註解 = "男命傷官逢空亡，易犯性系統之疾病，尋花問柳，更須小心防範。或與子女不和，或被認為養子。想要經商發財卻得不到貴人之助力。";
            }

            if (性別 == "女") {
                十神空亡註解 = "女命傷官逢空亡，易損子息，或不生男、多生女，或子女之中有比自己早喪者。而且，婚姻易遭阻擾，口舌或波折，結婚之後不易得翁婆寵愛，與子息不睦，或有損胎、流產之憂。";
            }
            break;

        case "比肩":
            十神空亡註解 = "比肩逢空亡，同性之同胞較少。比劫星逢空亡，表示兄弟姐妹緣薄，易早別離，或不睦或有早喪者。<br>合夥事業較不順利，較易吃虧。手足、朋友、同事、同業無助力之兆。同時關係易變得疏遠。嚴重時，甚至於受兄弟、友人、同事、同業之累。";
            break;

        case "劫財":
            十神空亡註解 = "劫財逢空亡，異性之同胞較少。比劫星逢空亡，表示兄弟姐妹緣薄，易早別離，或不睦或有早喪者。<br>合夥事業較不順利，較易吃虧。手足、朋友、同事、同業無助力之兆。同時關係易變得疏遠。嚴重時，甚至於受兄弟、友人、同事、同業之累。";
            break;

        case "": //日元
            十神空亡註解 = "";
            break;
        default:
            alert(十神 + "：十神空亡的十神錯誤 ！！");
            十神空亡註解 = "";
    }
    if (十神空亡註解!="") return 十神空亡註解;
}

function 運星空亡(運星, 性別) {
    //性別：男，女
    var 十神空亡註解;
    switch (運星) {
        case "長生":
            運星空亡註解 = "長生空亡，可能跟親人緣薄且淡，缺乏助力，須自立。";
            break;
        case "沐浴":
            運星空亡註解 = "沐浴空亡，一生中可能較會奔走變動，生活較不安定。";
            break;
        case "冠帶":
            運星空亡註解 = "冠帶空亡，凡事易生挫折，名譽上也較容易受損。";
            break;
        case "臨官":
            運星空亡註解 = "臨官空亡，會為他人擔保而受累，夫妻常會爭吵，奔波。";
            break;
        case "帝旺":
            運星空亡註解 = "帝旺空亡，與配偶、子女緣薄且淡，且目標易改變，一生成敗兩極。";
            break;
        case "衰":
            運星空亡註解 = "衰空亡，心情常感不安和不踏實，且有神經質，也較感孤獨。";
            break;
        case "病":
            運星空亡註解 = "病空亡，身體、心態呈病弱狀態，對配偶容易輕佻。";
            break;
        case "死":
            運星空亡註解 = "死空亡，心態純真，因不善交際，故不宜從商。";
            break;
        case "墓":
            運星空亡註解 = "墓空亡，可能會與人爭吵或不睦，親族也可能會受辱，也會喜新厭舊。";
            break;
        case "絕":
            運星空亡註解 = "絕空亡，有宗教信仰也太執著。";
            if(性別=="女") 運星空亡註解 =運星空亡註解 +"女命持家有方。";
            break;
        case "胎":
            運星空亡註解 = "胎空亡，心性不穩定，疑心病很重。";
            break;
        case "養":
            運星空亡註解 = "養空亡，做事不穩當，住所及職業常變動。";
            break;
        default:
            alert(運星 + "：運星空亡，運星錯誤");
            break;
    }
    if (運星空亡註解!="") return 運星空亡註解;
}
// ********************************************************************************************************

function 斷魁罡(命盤) {
    //壬辰、庚戌、庚辰、戊戌
    if(命盤.日柱.干支=="壬辰" || 命盤.日柱.干支=="庚戌" || 命盤.日柱.干支=="庚辰" || 命盤.日柱.干支=="戊戌"){
        命盤.分析.四柱.四柱數據[2].神煞.魁罡 = true;
        命盤.分析.四柱.四柱數據[2].神煞矩陣.push("魁罡");
        命盤.分析.四柱.神煞.魁罡++;

        if (命盤.月柱.干支 == "壬辰" || 命盤.月柱.干支 == "庚戌" || 命盤.月柱.干支 == "庚辰" || 命盤.月柱.干支 == "戊戌") {
            命盤.分析.四柱.四柱數據[1].神煞.魁罡 = true;
            命盤.分析.四柱.四柱數據[1].神煞矩陣.push("魁罡");
            命盤.分析.四柱.神煞.魁罡++;
        }
        if (命盤.時柱.干支 == "壬辰" || 命盤.時柱.干支 == "庚戌" || 命盤.時柱.干支 == "庚辰" || 命盤.時柱.干支 == "戊戌") {
            命盤.分析.四柱.四柱數據[3].神煞.魁罡 = true;
            命盤.分析.四柱.四柱數據[3].神煞矩陣.push("魁罡");
            命盤.分析.四柱.神煞.魁罡++;
        }
        if (命盤.年柱.干支 == "壬辰" || 命盤.年柱.干支 == "庚戌" || 命盤.年柱.干支 == "庚辰" || 命盤.年柱.干支 == "戊戌") {
            命盤.分析.四柱.四柱數據[0].神煞.魁罡 = true;
            命盤.分析.四柱.四柱數據[0].神煞矩陣.push("魁罡");
            命盤.分析.四柱.神煞.魁罡++;
        }
    }

}

function 論魁罡(命盤){
    var 魁罡註解 = [];
    var 魁罡破格 = false;
    var 破格句子;

    if(命盤.分析.四柱.神煞.魁罡==0) return "";

    魁罡註解.push("魁罡是制伏眾人之星，有領導大眾之權威、也有強烈不屈之性情。魁罡之人嘴硬心軟，好掌權威，喜歡「我說了算」。性格多剛烈，好攻擊性侵犯性，個性耿直，嫉惡如仇，殺伐果斷，賞罰分明。<br>命帶魁罡者，爲人過於嚴謹、聰明，兼有學術、運動方面之專長，但個性果斷任性、驕傲。");
    魁罡註解.push("*魁罡格需原命四柱逢強印或比劫星，文章振發，發福百般。魁罡身弱一見財官，則必窮之禍患，行身旺運，定發大福得大利。");

    if ((命盤.日柱.干支 == "庚戌" || 命盤.日柱.干支 == "庚辰") && (命盤.分析.十神.數據[十神字轉數("正官")].天干地支+命盤.分析.十神.數據[十神字轉數("七殺")].天干地支>0)){
        魁罡破格 = true;
        //庚辰及庚戌日生者，忌見官殺，但天干有水制者亦成
        if(命盤.年干.五行=="水" || 命盤.月干.五行=="水" || 命盤.時干.五行=="水") 魁罡破格 = false;
        破格句子=(魁罡破格)? "<br>庚戌、庚辰兩曰生之人，四柱之中忌見正偏官星來破，破則變貧寒。此因貪貴而損財，多因交際而受苦。": "庚辰及庚戌日生者，忌見官殺，但天干有水制，故不論為破。";
        魁罡註解.push(破格句子);
    }

    if ((命盤.日柱.干支 == "戊戌" || 命盤.日柱.干支 == "壬辰") && ((命盤.分析.十神.數據[十神字轉數("正財")].天干地支 + 命盤.分析.十神.數據[十神字轉數("偏財")].天干地支)>0)){
        魁罡破格 = true;
        //壬辰及戊戌日生者，忌見財星，但財被合往者亦成。
        破格句子=(魁罡破格)? "<br>戊戌、壬辰兩日生之人，四柱之中忌見正偏財星來破，破則變貧賤了，此因貪財而招賤。*但若財星被合往者，則不論破。": "壬辰及戊戌日生者，忌見財星，但財被合往者亦成。";
        魁罡註解.push(破格句子);
    }
        
    if (魁罡破格==false) 魁罡註解.push("<br>魁罡無破者生於富裕之家（如幼運兼好者方驗)，並且本人終生也得富裕。<br>命中無犯破為真魁罡，決斷果斷，文學博通之威格。<br>真魁罡較易得貴富，但其暗含有暴戾殺生反面及強性之殺伐。");

    if(命盤.性別 == "女") {
        var 魁罡註釋 = "<br>女命带魁罡，多長得美麗，然心性過度的剛強，夫緣薄，婚姻欠佳，易為紅顔薄命。否則必自剋而常苦於病災。";
        if (命盤.分析.四柱.四柱數據[1].神煞.魁罡 || 命盤.分析.四柱.四柱數據[3].神煞.魁罡) 魁罡註釋 = 魁罡註釋 + "特別是月、時柱又再見魁罡者，其特性將更加倍。";
        魁罡註解.push(魁罡註釋);
    }

    if (命盤.性別 == "男") {
        var 魁罡註釋 = "<br>男性命帶此星者，好攻擊性之議論，有潔癖，心思靈巧，氣運旺盛。";
        if (命盤.分析.四柱.神煞.魁罡 > 1 && !魁罡破格) 魁罡註釋 = 魁罡註釋 + "四柱中見二個以上，而無破，必爲富貴顯達之士。";
        if (命盤.分析.四柱.神煞.魁罡 == 1) 魁罡註釋 = 魁罡註釋 + "如只日柱，*但別干支又多見幫扶有力者，也發富貴。";
        魁罡註解.push(魁罡註釋);
    }

    if(命盤.分析.四柱.神煞.將星>0) 魁罡註解.push("<br>八字中命帶魁罡再有將星之人，多有極端之命，不是高權在握就有牢獄之災。");
    if(命盤.分析.十神.數據[十神字轉數("七殺")].天干地支>0) 魁罡註解.push("<br>魁罡帶七殺，生平性傲剛強。");
    if(命盤.分析.四柱.四柱數據[3].神煞.魁罡) 魁罡註解.push("<br>魁罡日，魁罡時生的人，生平最適宜帶刀的行業，如古代劊子手，現代之廚師、理髮師、裁縫師，及裁剪之職業。");
    if(命盤.分析.四柱.四柱數據[2].相冲柱.indexOf("1")>-1 || 命盤.分析.四柱.四柱數據[2].相冲柱.indexOf("3")>-1) 魁罡註解.push("<br>魁罡日生之人，最忌被月、時支所冲尅，必遇非常危險之凶禍。");

    var 單元標題 = '<span class = "傳統論斷項目">論魁罡</span>';
    魁罡註解.unshift(單元標題);
    return 魁罡註解.join("<br>");
}

// ********************************************************************************************************
function 判羊刃(天干) {
    switch(天干){
        case "癸": return "亥";
        case "甲": return "卯";
        case "乙": return "寅";
        case "丙": return "午";
        case "丁": return "巳";
        case "戊": return "午";
        case "己": return "巳";
        case "庚": return "酉";
        case "辛": return "申";
        case "壬": return "子";
        default:
            alert(天干+"：斷羊刃的天干輸入錯誤");
            return "";
    }
}

function 斷羊刃(命盤){
    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].地支 == 判羊刃(命盤.日主)){
            命盤.分析.四柱.四柱數據[i].神煞.羊刃 = true;
            命盤.分析.四柱.四柱數據[i].神煞矩陣.push("羊刃");
            命盤.分析.四柱.神煞.羊刃++;
        }
    }
}




// &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&

// ******************** 神煞 **************************
function 尋神煞(年柱, 月柱, 日柱, 時柱, 陽男陰女) {
    var 年干=年柱.substr(0,1);
    var 年支=年柱.substr(1,1);
    var 月干=月柱.substr(0,1);
    var 月支=月柱.substr(1,1);
    var 日干=日柱.substr(0,1);
    var 日支=日柱.substr(1,1);
    var 時干=時柱.substr(0,1);
    var 時支=時柱.substr(1,1);
    var 四柱地支=年支+月支+日支+時支;
	var 四柱天干=年干+月干+日干+時干;
    var 性別 = 陽男陰女.substr(1,1);
    
    //var 斷日干神煞=日干神煞(日干, 四柱地支);
    var 斷年支神煞=年支神煞(年支, 四柱地支);
    var 斷各支神煞=各支神煞(四柱地支, 四柱天干);
    //var 斷日支神煞=日支神煞(日支, 四柱地支);
    //var 斷月支神煞=月支神煞(月支, 四柱地支, 四柱天干);
    var 斷日柱神煞=日干支神煞(日柱, 性別);
    var 斷特殊神煞=特殊神煞(年柱, 月柱, 日柱, 時柱, 陽男陰女);
    
    //alert(斷日柱神煞);
    
    var 年柱神煞=斷特殊神煞[0].concat(斷各支神煞[0]);  //var 年柱神煞=斷特殊神煞[0].concat(斷日干神煞[0], 斷年支神煞[0], 斷日支神煞[0], 斷月支神煞[0]);
    var 月柱神煞=斷特殊神煞[1].concat(斷各支神煞[1]);
    var 日柱神煞=斷特殊神煞[2].concat(斷各支神煞[2], 斷日柱神煞);
    var 時柱神煞=斷特殊神煞[3].concat(斷各支神煞[3]);

    //var 命盤神煞=斷日干神煞[4];
    
    var 神煞數據=[];
    神煞數據 = [命盤神煞, 年柱神煞, 月柱神煞, 日柱神煞, 時柱神煞];

    return 神煞數據;
    
    //alert(斷特殊神煞[2]);  
    //alert(斷月支神煞[0]);
    //alert(斷月支神煞[1]);
    //alert(斷月支神煞[2]);
    //alert(斷月支神煞[3]);

    //alert("年柱神煞："+年柱神煞);
    //alert("月柱神煞："+月柱神煞);
    //alert("日柱神煞："+日柱神煞);
    //alert("時柱神煞："+時柱神煞);
    //alert("命盤神煞："+命盤神煞);
} 


function 各支神煞(四柱地支, 四柱天干) {  //年日干神煞(年干, 日干, 四柱地支)
        // 四柱地支 是年月日時柱的地支順序
        // 年支, 月柱, 日柱, 時柱 are arrays contains 各柱的神煞
        // 年日干神煞為：天乙貴人，文昌，天廚，福星，金轝
        //日干神煞為：太極貴人，羊刃
        //日支神煞為：天德，月德貴人，以日柱遇到最好，時柱較次
		
    var 地支;
    var 年干=四柱天干.substr(0,1);
    var 日干=四柱天干.substr(2,1);
    var 年支=四柱地支.substr(0,1);
    var 日支=四柱地支.substr(2,1);
    var 月支=四柱地支.substr(1,1);
    var 年柱神煞=[];
    var 月柱神煞=[];
    var 日柱神煞=[];
    var 時柱神煞=[];
    var 各柱神煞=[年柱神煞, 月柱神煞, 日柱神煞, 時柱神煞, 命盤神煞];
    var 日時地支=四柱地支.substr(2,2);
    var 日時天干=四柱天干.substr(2,2);
    var 納入=false;
    var 已論斷神煞=[];
    
    for (var i=0; i<4; i++){
        地支=四柱地支.substr(i,1);
            switch(地支){
                case "子":
                    if(日干=="乙" || 日干=="己") 各柱神煞[i].push("天乙貴人");  //淵海子平只用日干，不取年干
                    if(日干=="辛") 各柱神煞[i].push("文昌");
                    if(日干=="壬") 各柱神煞[i].push("羊刃");
                    //無 福星、金轝
                    if(日干=="丙") 各柱神煞[i].push("天廚"); //淵海子平
                    if(日干=="癸") 各柱神煞[i].push("十干祿"); //淵海子平
                    if(日干=="辛" && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="壬") 各柱神煞[i].push("紅艷");
                    if(日干=="丙" && i==3) 各柱神煞[3].push("福星");
                    

                    if((四柱地支.indexOf("午")>=0) && (日干=="甲" || 日干=="乙")) { 
						// && (_.indexOf(已論斷神煞, "太極貴人")<0)
                        各柱神煞[2].push("太極貴人");  //圖解八字
                        已論斷神煞.push("太極貴人");
                    }
					
					
                    //if(日干=="甲" || 日干=="乙") 各柱神煞[i].push("太極貴人");  //淵海子平
					
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="卯") 各柱神煞[i].push("紅鸞");
                    if(年支=="酉") 各柱神煞[i].push("天喜");
                    //if(年支=="亥" || 日支=="亥" || 年支=="卯" || 日支=="卯" || 年支=="未" || 日支=="未") 各柱神煞[i].push("桃花");
                    
                    
                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時地支.indexOf("巳")>=0) 各柱神煞[日時地支.indexOf("巳")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="壬") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="丑") 各柱神煞[i].push("天醫");

                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="亥" || 日支=="卯" || 日支=="未") 各柱神煞[i].push("桃花");
                    if((日支=="申" || 日支=="子" || 日支=="辰") && i!=2) 各柱神煞[i].push("將星");  //有的說用年、日支，程式只用日
                    if(日支=="戌") 各柱神煞[i].push("喪門");

                    // ----------------------- 時支神煞 -----------------------
                    break;

                case "丑":
                    if(日干=="甲" || 日干=="戊" || 日干=="庚") 各柱神煞[i].push("天乙貴人");
                    if(日干=="壬") 各柱神煞[i].push("金轝");
                    //if(日干=="乙" || 日干=="癸") 各柱神煞[i].push("福星");
                    if(日干=="丙" || 日干=="戊") 各柱神煞[i].push("國印");
                    if(日干=="乙" && i==3) 各柱神煞[3].push("福星");
                    //無 天廚
                    if((四柱地支.indexOf("未")>=0) && (日干=="戊" || 日干=="己") && (_.indexOf(已論斷神煞, "太極貴人")<0)) {
                        各柱神煞[2].push("太極貴人");  //圖解八字
                        已論斷神煞.push("太極貴人");
                    }
                    
                    // ----------------------- 年支神煞 -----------------------
                    
                    if(年支=="寅") 各柱神煞[i].push("紅鸞");
                    if(年支=="申") 各柱神煞[i].push("天喜");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("庚")>=0) 各柱神煞[日時天干.indexOf("庚")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="庚") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="寅") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if((日支=="巳" || 日支=="酉" || 日支=="丑") && i!=2) 各柱神煞[i].push("華蓋");
                    if(年支=="寅" || 年支=="卯" || 年支=="辰") 各柱神煞[i].push("寡宿"); //只判斷夫妻宮
                    if(日支=="亥") 各柱神煞[i].push("喪門");

                    break;
                    
                case "寅":
                    if(日干=="辛") 各柱神煞[i].push("天乙貴人");
                    if(日干=="壬") 各柱神煞[i].push("文昌");
                    if(日干=="癸") 各柱神煞[i].push("金轝");
                    if(日干=="乙") 各柱神煞[i].push("羊刃");
                    //if(日干=="甲" || 日干=="丙") 各柱神煞[i].push("福星");
                    if(日干=="甲" && i==3) 各柱神煞[3].push("福星");
                    if(日干=="庚") 各柱神煞[i].push("天廚"); //淵海子平
                    if(日干=="甲") 各柱神煞[i].push("十干祿"); //淵海子平
                    if((日干=="丙" || 日干=="戊")  && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="丁" || 日干=="己") 各柱神煞[i].push("國印");
                    if(日干=="癸") 各柱神煞[i].push("流霞");

                    if((四柱地支.indexOf("亥")>=0) && (日干=="庚" || 日干=="辛") && (_.indexOf(已論斷神煞, "太極貴人")<0)) {
                        各柱神煞[2].push("太極貴人");  //圖解八字
                        已論斷神煞.push("太極貴人");
                    }
                    if(i==3 && 日干=="壬") 各柱神煞[3].push("天官貴人");  //淵海子平
                    if(日干=="丙") 各柱神煞[i].push("紅艷");
                    
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="丑") 各柱神煞[i].push("紅鸞");
                    if(年支=="未") 各柱神煞[i].push("天喜");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("丁")>=0) 各柱神煞[日時天干.indexOf("丁")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="丙") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="卯") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="申" || 日支=="子" || 日支=="辰") 各柱神煞[i].push("驛馬");
                    if(日支=="巳" || 日支=="酉" || 日支=="丑") 各柱神煞[i].push("劫煞");  //有的說用年、日支，程式只用日
                    if(日支=="亥" || 日支=="卯" || 日支=="未") 各柱神煞[i].push("亡神");  //有的說用年、日支，程式只用日
                    if(年支=="亥" || 年支=="子" || 年支=="丑") 各柱神煞[i].push("孤辰"); //只判斷夫妻宮
                    if(日支=="子") 各柱神煞[i].push("喪門");

                    // ----------------------- 時支神煞 -----------------------
                    break;
                    
                case "卯":
                    if(日干=="壬" || 日干=="癸") 各柱神煞[i].push("天乙貴人");
                    if(日干=="癸") 各柱神煞[i].push("文昌");
                    if(日干=="甲") 各柱神煞[i].push("羊刃");
                    //無 天廚、金轝
                    if((四柱地支.indexOf("酉")>=0) && (日干=="丙" || 日干=="丁") && (_.indexOf(已論斷神煞, "太極貴人")<0)) {
                        各柱神煞[2].push("太極貴人");  //圖解八字
                        已論斷神煞.push("太極貴人");
                    }
                    if(i==3 && 日干=="己") 各柱神煞[3].push("天官貴人");  //淵海子平
                    //if(日干=="乙" || 日干=="癸") 各柱神煞[i].push("福星");
                    if(日干=="癸" && i==3) 各柱神煞[3].push("福星");
                    if(日干=="乙") 各柱神煞[i].push("十干祿"); //淵海子平
                    if(日干=="癸" && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="辛") 各柱神煞[i].push("流霞");
                    
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="子") 各柱神煞[i].push("紅鸞");
                    if(年支=="午") 各柱神煞[i].push("天喜");
                    //if(年支=="寅" || 日支=="寅" || 年支=="午" || 日支=="午" || 年支=="戌" || 日支=="戌") 各柱神煞[i].push("桃花");
                    
                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時地支.indexOf("申")>=0) 各柱神煞[日時地支.indexOf("申")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="甲") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="辰") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="寅" || 日支=="午" || 日支=="戌") 各柱神煞[i].push("桃花");
                    if((日支=="亥" || 日支=="卯" || 日支=="未") && i!=2) 各柱神煞[i].push("將星");  //有的說用年、日支，程式只用日
                    if(日支=="丑") 各柱神煞[i].push("喪門");

                    break;
                    
                case "辰":
                    if(日干=="甲") 各柱神煞[i].push("金轝");
                    //if(日干=="壬") 各柱神煞[i].push("福星");
                    if(日干=="壬" && i==3) 各柱神煞[3].push("福星");
                    if(日干=="庚") 各柱神煞[i].push("國印");
                    if(日干=="庚") 各柱神煞[i].push("流霞");
                    //無 天廚
                    if((四柱地支.indexOf("戌")>=0) && (日干=="戊" || 日干=="己") && (_.indexOf(已論斷神煞, "太極貴人")<0)) {
                        各柱神煞[2].push("太極貴人");  //圖解八字
                        已論斷神煞.push("太極貴人");
                    }
                    if(i==3 && 日干=="乙") 各柱神煞[3].push("天官貴人");  //淵海子平
                    if(日干=="戊" || 日干=="己") 各柱神煞[i].push("紅艷");
                    
                    // ----------------------- 年支神煞 -----------------------
                    
                    if(年支=="亥") 各柱神煞[i].push("紅鸞");
                    if(年支=="巳") 各柱神煞[i].push("天喜");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("壬")>=0) 各柱神煞[日時天干.indexOf("壬")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="壬") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="巳") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if((日支=="申" || 日支=="子" || 日支=="辰") && i!=2) 各柱神煞[i].push("華蓋");
                    if(年支=="巳" || 年支=="午" || 年支=="未") 各柱神煞[i].push("寡宿"); //只判斷夫妻宮
                    if(日支=="寅") 各柱神煞[i].push("喪門");

                    // ----------------------- 時支神煞 -----------------------
                    break;

                case "巳":
                    if(日干=="壬" || 日干=="癸") 各柱神煞[i].push("天乙貴人");
                    if(日干=="甲") 各柱神煞[i].push("文昌");
                    if(日干=="乙") 各柱神煞[i].push("金轝");
                    if(日干=="丁" || 日干=="己") 各柱神煞[i].push("羊刃");
                    //if(日干=="辛") 各柱神煞[i].push("福星");
                    if(日干=="辛" && i==3) 各柱神煞[3].push("福星");
                    if(日干=="甲" || 日干=="丁") 各柱神煞[i].push("天廚"); //淵海子平
                    if(日干=="丙" || 日干=="戊") 各柱神煞[i].push("十干祿"); //淵海子平
                    if(日干=="庚" && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="辛") 各柱神煞[i].push("國印");
                    if(日干=="戊") 各柱神煞[i].push("流霞");
                    
                    if((四柱地支.indexOf("申")>=0) && (日干=="壬" || 日干=="癸") && (_.indexOf(已論斷神煞, "太極貴人")<0)) {
                        各柱神煞[2].push("太極貴人");  //圖解八字
                        已論斷神煞.push("太極貴人");
                    }
                    if(i==3 && 日干=="丙") 各柱神煞[3].push("天官貴人");  //淵海子平
                    
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="戌") 各柱神煞[i].push("紅鸞");
                    if(年支=="辰") 各柱神煞[i].push("天喜");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("辛")>=0) 各柱神煞[日時天干.indexOf("辛")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="庚") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="午") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="亥" || 日支=="卯" || 日支=="未") 各柱神煞[i].push("驛馬");
                    if(日支=="申" || 日支=="子" || 日支=="辰") 各柱神煞[i].push("劫煞");  //有的說用年、日支，程式只用日
                    if(日支=="寅" || 日支=="午" || 日支=="戌") 各柱神煞[i].push("亡神");  //有的說用年、日支，程式只用日
                    if(年支=="寅" || 年支=="卯" || 年支=="辰") 各柱神煞[i].push("孤辰"); //只判斷夫妻宮
                    if(日支=="卯") 各柱神煞[i].push("喪門");

                    break;
                    
                case "午":
                    if(日干=="辛") 各柱神煞[i].push("天乙貴人");
                    if(日干=="乙") 各柱神煞[i].push("文昌");
                    if(日干=="丙" || 日干=="戊") 各柱神煞[i].push("羊刃");
                    //if(日干=="庚") 各柱神煞[i].push("福星");
                    if(日干=="庚" && i==3) 各柱神煞[3].push("福星");
                    if(日干=="乙" || 日干=="戊" || 日干=="辛") 各柱神煞[i].push("天廚"); //淵海子平
					if(日干=="丁" || 日干=="己") 各柱神煞[i].push("十干祿"); //淵海子平
                    
                    if(日干=="甲" || 日干=="乙") 各柱神煞[i].push("紅艷");
					//太極貴人，參考子
					if(i==3 && 日干=="癸") 各柱神煞[3].push("天官貴人");  //淵海子平
                    if(日干=="乙" && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="己") 各柱神煞[i].push("流霞");

                    //無 金轝
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="卯") 各柱神煞[i].push("天喜");
                    if(年支=="酉") 各柱神煞[i].push("紅鸞");
                    //if(年支=="巳" || 日支=="巳" || 年支=="酉" || 日支=="酉" || 年支=="丑" || 日支=="丑") 各柱神煞[i].push("桃花");
                    
                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時地支.indexOf("亥")>=0) 各柱神煞[日時地支.indexOf("亥")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="丙") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="未") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="巳" || 日支=="酉" || 日支=="丑") 各柱神煞[i].push("桃花");
                    if((日支=="寅" || 日支=="午" || 日支=="戌") && i!=2) 各柱神煞[i].push("將星");  //有的說用年、日支，程式只用日
                    if(日支=="辰") 各柱神煞[i].push("喪門");

                    // ----------------------- 時支神煞 -----------------------
                    break;
                    
                case "未":
                    if(日干=="甲" || 日干=="戊" || 日干=="庚") 各柱神煞[i].push("天乙貴人");
                    if(日干=="丙" || 日干=="戊") 各柱神煞[i].push("金轝");
                    //if(日干=="己") 各柱神煞[i].push("福星");
                    if(日干=="己" && i==3) 各柱神煞[3].push("福星");
					if(日干=="壬") 各柱神煞[i].push("國印");
                    
                    if(i==3 && 日干=="甲") 各柱神煞[3].push("天官貴人");  //淵海子平
                    if(日干=="丁") 各柱神煞[i].push("紅艷");
                    if(日干=="丙") 各柱神煞[i].push("流霞");

                    //無 天廚， 太極貴人參考丑
                    
                    // ----------------------- 年支神煞 -----------------------
                    
                    if(年支=="寅") 各柱神煞[i].push("天喜");
                    if(年支=="申") 各柱神煞[i].push("紅鸞");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("甲")>=0) 各柱神煞[日時天干.indexOf("甲")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="甲") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="申") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if((日支=="亥" || 日支=="卯" || 日支=="未") && i!=2) 各柱神煞[i].push("華蓋");
                    if(年支=="申" || 年支=="酉" || 年支=="戌") 各柱神煞[i].push("寡宿");
                    if(日支=="巳") 各柱神煞[i].push("喪門");

                    // ----------------------- 時支神煞 -----------------------

                    break;
                    
                case "申":
                    if(日干=="乙" || 日干=="己") 各柱神煞[i].push("天乙貴人");
                    if(日干=="丙" || 日干=="戊") 各柱神煞[i].push("文昌");
                    if(日干=="丁" || 日干=="己") 各柱神煞[i].push("金轝");
                    if(日干=="辛") 各柱神煞[i].push("羊刃");
                    //if(日干=="戊") 各柱神煞[i].push("福星");
                    if(日干=="戊" && i==3) 各柱神煞[3].push("福星");
                    if(日干=="己") 各柱神煞[i].push("天廚"); //淵海子平
                    if(日干=="庚") 各柱神煞[i].push("十干祿"); //淵海子平
                    if(日干=="壬" && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="癸") 各柱神煞[i].push("國印");
                    if(日干=="丁") 各柱神煞[i].push("流霞");

					//太極貴人，參考巳
                    if(i==3 && 日干=="辛") 各柱神煞[3].push("天官貴人");  //淵海子平
                    
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="丑") 各柱神煞[i].push("天喜");
                    if(年支=="未") 各柱神煞[i].push("紅鸞");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("酉")>=0) 各柱神煞[日時天干.indexOf("酉")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="壬") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="酉") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="寅" || 日支=="午" || 日支=="戌") 各柱神煞[i].push("驛馬");
                    if(日支=="亥" || 日支=="卯" || 日支=="未") 各柱神煞[i].push("劫煞");  //有的說用年、日支，程式只用日
                    if(日支=="巳" || 日支=="酉" || 日支=="丑") 各柱神煞[i].push("亡神");  //有的說用年、日支，程式只用日
                    if(年支=="巳" || 年支=="午" || 年支=="未") 各柱神煞[i].push("孤辰"); //只判斷夫妻宮
                    if(日支=="午") 各柱神煞[i].push("喪門");

                    // ----------------------- 時支神煞 -----------------------
                    if(i==3 && (年干=="乙" || 年干=="癸")) 各柱神煞[3].push("紅艷");
                    break;
                    
                case "酉":
                    if(日干=="丙" || 日干=="丁") 各柱神煞[i].push("天乙貴人");
                    if(日干=="丁" || 日干=="己") 各柱神煞[i].push("文昌");
                    if(日干=="庚") 各柱神煞[i].push("羊刃");
                    //if(年干=="丁" || 日干=="丁") 各柱神煞[i].push("福星");
                    if(日干=="丁" && i==3) 各柱神煞[3].push("福星");
                    if(日干=="壬") 各柱神煞[i].push("天廚");
					if(日干=="辛") 各柱神煞[i].push("十干祿"); //淵海子平
                    if((日干=="丁" || 日干=="己") && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="辛") 各柱神煞[i].push("紅艷");
                    if(日干=="甲") 各柱神煞[i].push("流霞");

					//太極貴人，參考卯
                    if(i==3 && 日干=="丁") 各柱神煞[3].push("天官貴人");  //淵海子平
                    //無 金轝
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="子") 各柱神煞[i].push("天喜");
                    if(年支=="午") 各柱神煞[i].push("紅鸞");
                    //if(年支=="申" || 日支=="申" || 年支=="子" || 日支=="子" || 年支=="辰" || 日支=="辰") 各柱神煞[i].push("桃花");
                    
                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時地支.indexOf("寅")>=0) 各柱神煞[日時地支.indexOf("寅")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="庚") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="戌") 各柱神煞[i].push("天醫");

                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="申" || 日支=="子" || 日支=="辰") 各柱神煞[i].push("桃花");
                    if((日支=="巳" || 日支=="酉" || 日支=="丑") && i!=2) 各柱神煞[i].push("將星");  //有的說用年、日支，程式只用日
                    if(日支=="未") 各柱神煞[i].push("喪門");

                    // ----------------------- 時支神煞 -----------------------

                    break;

                case "戌":
                    if(日干=="庚") 各柱神煞[i].push("金轝");
                    if(日干=="甲") 各柱神煞[i].push("國印");
                    //if(年干=="丙" || 日干=="丙") 各柱神煞[i].push("福星");
                    //無 天廚
					
					//太極貴人，參考辰
                    if(i==3 && 日干=="戊") 各柱神煞[3].push("天官貴人");  //淵海子平
                    if(日干=="庚") 各柱神煞[i].push("紅艷");
                    if(日干=="乙") 各柱神煞[i].push("流霞");

                    // ----------------------- 年支神煞 -----------------------
                    
                    if(年支=="亥") 各柱神煞[i].push("天喜");
                    if(年支=="巳") 各柱神煞[i].push("紅鸞");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("丙")>=0) 各柱神煞[日時天干.indexOf("丙")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="丙") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="亥") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 時支神煞 -----------------------

                    // ----------------------- 地支神煞 -----------------------
                    if((日支=="寅" || 日支=="午" || 日支=="戌") && i!=2) 各柱神煞[i].push("華蓋");
                    if(年支=="亥" || 年支=="子" || 年支=="丑") 各柱神煞[i].push("寡宿");
                    if(日支=="申") 各柱神煞[i].push("喪門");

                    break;

                case "亥":
                    if(日干=="丙" || 日干=="丁") 各柱神煞[i].push("天乙貴人");
                    if(日干=="庚") 各柱神煞[i].push("文昌");
                    if(日干=="辛") 各柱神煞[i].push("金轝");
                    if(日干=="癸") 各柱神煞[i].push("羊刃");
                    //if(日干=="丁") 各柱神煞[i].push("福星");
                    if(日干=="癸") 各柱神煞[i].push("天廚");
                    if(日干=="壬") 各柱神煞[i].push("十干祿"); //淵海子平
                    if(日干=="甲" && i==2) 各柱神煞[i].push("垣城"); //淵海子平
                    if(日干=="乙") 各柱神煞[i].push("國印");
                    if(日干=="壬") 各柱神煞[i].push("流霞");
					//太極貴人，參考寅
                    if(i==3 && 日干=="庚") 各柱神煞[3].push("天官貴人");  //淵海子平
                    
                    // ----------------------- 年支神煞 -----------------------
                    if(年支=="戌") 各柱神煞[i].push("天喜");
                    if(年支=="辰") 各柱神煞[i].push("紅鸞");

                    // ----------------------- 月支神煞 -----------------------
                    if(i==1 && 日時天干.indexOf("乙")>=0) 各柱神煞[日時天干.indexOf("乙")+2].push("天德"); //圖解八字
                    if(i==1 && 日干=="甲") 各柱神煞[1].push("月德"); //淵海子平
                    if(月支=="子") 各柱神煞[i].push("天醫");
                    
                    // ----------------------- 日支神煞 -----------------------
                    if(日支=="巳" || 日支=="酉" || 日支=="丑") 各柱神煞[i].push("驛馬");
                    if(日支=="寅" || 日支=="午" || 日支=="戌") 各柱神煞[i].push("劫煞");  //有的說用年、日支，程式只用日
                    if(日支=="申" || 日支=="子" || 日支=="辰") 各柱神煞[i].push("亡神");  //有的說用年、日支，程式只用日
                    if(年支=="申" || 年支=="酉" || 年支=="戌") 各柱神煞[i].push("孤辰"); //只判斷夫妻宮
                    if(日支=="酉") 各柱神煞[i].push("喪門");

                    break;
            } //end switch
    } //end for
    return 各柱神煞;
}

function 年支神煞(年支, 四柱地支) {
         // 四柱地支 是年月日時柱的地支順序
         // 年支, 月柱, 日柱, 時柱 are arrays contains 各柱的神煞
         // 年支神煞為：龍德, 金匱, 紅鸞, 天狗, 勾絞, 歲破, 破碎, 大耗, 五鬼, 桃花①, 血刃①
    var 地支;
    var 年柱神煞=[];
    var 月柱神煞=[];
    var 日柱神煞=[];
    var 時柱神煞=[];
    var 各柱神煞=[年柱神煞, 月柱神煞, 日柱神煞, 時柱神煞];

    for (var i=0; i<4; i++){
        地支=四柱地支.substr(i,1);
        switch (年支) {
            case "子":
                switch(地支){
                    case "未":
                        各柱神煞[i].push("龍德");
                        break;
                    case "子":
                        各柱神煞[i].push("金匱");
                        break;
                    case "卯":
                        各柱神煞[i].push("紅鸞");
                        各柱神煞[i].push("勾絞");
                        break;
                    case "戌":
                        各柱神煞[i].push("天狗");
                        各柱神煞[i].push("血刃①");
                        break;
                    case "午":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "辰":
                        各柱神煞[i].push("五鬼");
                        break;
                    case "酉":
                        //各柱神煞[i].push("桃花①");
                        break;               
                }
                break;
            case "丑":
                switch(地支){
                    case "申":
                        各柱神煞[i].push("龍德");
                        break;
                    case "酉":
                        各柱神煞[i].push("金匱");
                        各柱神煞[i].push("血刃①");
                        break;
                    case "寅":
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "亥":
                        各柱神煞[i].push("天狗");
                        break;
                    case "辰": 
                        各柱神煞[i].push("勾絞");
                        break;
                    case "未":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "巳":
                        各柱神煞[i].push("五鬼");
                        break;
                    case "午":
                        //各柱神煞[i].push("桃花①");
                        break;                
                }
                break;
            case "寅":
                switch(地支){
                    case "酉":
                        各柱神煞[i].push("龍德");
                        break;
                    case "午":
                        各柱神煞[i].push("金匱");
                        各柱神煞[i].push("五鬼");
                        break;
                    case "丑":
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "子":
                        各柱神煞[i].push("天狗");
                        break;
                    case "巳":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "申":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        各柱神煞[i].push("血刃①");
                        break;
                    case "卯":
                        //各柱神煞[i].push("桃花①");
                        break;                
                }
                break;
            case "卯":
                switch(地支){
                    case "戌":
                        各柱神煞[i].push("龍德");
                        break;
                    case "卯":
                        各柱神煞[i].push("金匱");
                        break;
                    case "子":
                        各柱神煞[i].push("紅鸞");
                        //各柱神煞[i].push("桃花①");
                        break;
                    case "丑":
                        各柱神煞[i].push("天狗");
                        break;
                    case "午":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "酉":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "未":
                        各柱神煞[i].push("五鬼");
                        各柱神煞[i].push("血刃①");
                        break;               
                }
                break;
            case "辰":
                switch(地支){
                    case "亥":
                        各柱神煞[i].push("龍德");
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "子":
                        各柱神煞[i].push("金匱");
                        break;
                    case "寅":
                        各柱神煞[i].push("天狗");
                        break;
                    case "未":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "戌":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "申":
                        各柱神煞[i].push("五鬼");
                        break;
                    case "酉":
                        //各柱神煞[i].push("桃花①");
                        break;  
                    case "午": 
                        各柱神煞[i].push("血刃①");
                        break;                 
                }
                break;
            case "巳":
                switch(地支){
                    case "子":
                        各柱神煞[i].push("龍德");
                        break;
                    case "酉":
                        各柱神煞[i].push("金匱");
                        各柱神煞[i].push("五鬼");
                        break;
                    case "戌":
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "卯":
                        各柱神煞[i].push("天狗");
                        break;
                    case "申":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "亥":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "午":
                        //各柱神煞[i].push("桃花①");
                        break;  
                    case "巳": 
                        各柱神煞[i].push("血刃①");
                        break;                 
                }
                break;
            case "午":
                switch(地支){
                    case "丑":
                        各柱神煞[i].push("龍德");
                        break;
                    case "午":
                        各柱神煞[i].push("金匱");
                        break;
                    case "酉":
                        各柱神煞[i].push("紅鸞");
                        各柱神煞[i].push("勾絞");
                        break;
                    case "辰":
                        各柱神煞[i].push("天狗");
                        break;
                    case "子":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "戌":
                        各柱神煞[i].push("五鬼");
                        break;
                    case "卯":
                        //各柱神煞[i].push("桃花①");
                        break;  
                    case "辰": 
                        各柱神煞[i].push("血刃①");
                        break;                 
                }
                break;
            case "未":
                switch(地支){
                    case "寅":
                        各柱神煞[i].push("龍德");
                        break;
                    case "卯":
                        各柱神煞[i].push("金匱");
                        各柱神煞[i].push("血刃①");
                        break;
                    case "申":
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "巳":
                        各柱神煞[i].push("天狗");
                        break;
                    case "戌":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "丑":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "亥":
                        各柱神煞[i].push("五鬼");
                        break;
                    case "子":
                        //各柱神煞[i].push("桃花①");
                        break;             
                }
                break;
            case "申":
                switch(地支){
                    case "卯":
                        各柱神煞[i].push("龍德");
                        break;
                    case "子":
                        各柱神煞[i].push("金匱");
                        各柱神煞[i].push("五鬼");
                        break;
                    case "未":
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "午":
                        各柱神煞[i].push("天狗");
                        break;
                    case "亥":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "寅":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        各柱神煞[i].push("血刃①");
                        break;
                    case "酉":
                        //各柱神煞[i].push("桃花①");
                        break;       
                }
                break;
            case "酉":
                switch(地支){
                    case "辰":
                        各柱神煞[i].push("龍德");
                        break;
                    case "酉":
                        各柱神煞[i].push("金匱");
                        break;
                    case "午":
                        各柱神煞[i].push("紅鸞");
                        //各柱神煞[i].push("桃花①");
                        break;
                    case "未":
                        各柱神煞[i].push("天狗");
                        break;
                    case "子":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "卯":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "丑":
                        各柱神煞[i].push("五鬼");
                        各柱神煞[i].push("血刃①");
                        break;              
                }
                break;
            case "戌":
                switch(地支){
                    case "巳":
                        各柱神煞[i].push("龍德");
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "午":
                        各柱神煞[i].push("金匱");
                        break;
                    case "申":
                        各柱神煞[i].push("天狗");
                        break;
                    case "丑":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "辰":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "寅":
                        各柱神煞[i].push("五鬼");
                        break;
                    case "卯":
                        //各柱神煞[i].push("桃花①");
                        break;  
                    case "子": 
                        各柱神煞[i].push("血刃①");
                        break;                 
                }
                break;
            case "亥":
                switch(地支){
                    case "午":
                        各柱神煞[i].push("龍德");
                        break;
                    case "卯":
                        各柱神煞[i].push("金匱");
                        各柱神煞[i].push("五鬼");
                        break;
                    case "辰":
                        各柱神煞[i].push("紅鸞");
                        break;
                    case "酉":
                        各柱神煞[i].push("天狗");
                        break;
                    case "寅":
                        各柱神煞[i].push("勾絞");
                        break;
                    case "巳":
                        各柱神煞[i].push("歲破");
                        各柱神煞[i].push("破碎");
                        各柱神煞[i].push("大耗");
                        break;
                    case "子":
                        //各柱神煞[i].push("桃花①");
                        break;  
                    case "亥": 
                        各柱神煞[i].push("血刃①");
                        break;                 
                }
                break;
        } //end switch
    } // end for
    return 各柱神煞;
}

function 日支神煞(日支, 四柱地支) {
         // 四柱地支 是年月日時柱的地支順序
         // 年支, 月柱, 日柱, 時柱 are arrays contains 各柱的神煞
         // 日支神煞為：華蓋, 將星, 驛馬, 桃花②, 血刃②, 孤辰, 寡宿, 喪門, 劫煞, 隔角, 亡神
    var 地支;
    var 年柱神煞=[];
    var 月柱神煞=[];
    var 日柱神煞=[];
    var 時柱神煞=[];
    var 各柱神煞=[年柱神煞, 月柱神煞, 日柱神煞, 時柱神煞];

    for (var i=0; i<4; i++){
        地支=四柱地支.substr(i,1);
        if(i!=2){
        switch (日支) {
            case "子":
                switch(地支){
                    case "辰":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "子":
                        各柱神煞[i].push("將星");
                        break;
                    case "寅":
                        //*各柱神煞[i].push("驛馬");
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "酉":
                        各柱神煞[i].push("咸池");
                        break;
                    case "戌":
                        //各柱神煞[i].push("血刃");
                        break;
                    case "巳":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "亥":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "丑":
                switch(地支){
                    case "丑":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "酉":
                        各柱神煞[i].push("將星");
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "亥":
                        //*各柱神煞[i].push("驛馬");
                        break;
                    case "午":
                        各柱神煞[i].push("咸池");
                        break;
                    case "寅":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "戌":
                        break;
                    case "卯":
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "申":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "寅":
                switch(地支){
                    case "戌":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "午":
                        各柱神煞[i].push("將星");
                        break;
                    case "申":
                        //*各柱神煞[i].push("驛馬");
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "卯":
                        各柱神煞[i].push("咸池");
                        break;
                    case "巳":
                        各柱神煞[i].push("亡神");
                        break;
                    case "丑":
                        break;
                    case "辰":
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "亥":
                        各柱神煞[i].push("劫煞");
                        break;
                }
                break;
            case "卯":
                switch(地支){
                    case "未":
                        //*各柱神煞[i].push("華蓋");
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "卯":
                        各柱神煞[i].push("將星");
                        break;
                    case "巳":
                        //*各柱神煞[i].push("驛馬");
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "子":
                        各柱神煞[i].push("咸池");
                        break;
                    case "丑":
                        break;
                    case "申":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "寅":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "辰":
                switch(地支){
                    case "辰":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "子":
                        各柱神煞[i].push("將星");
                        break;
                    case "寅":
                        //*各柱神煞[i].push("驛馬");
                        break;
                    case "酉":
                        各柱神煞[i].push("咸池");
                        break;
                    case "午":
                        //*各柱神煞[i].push("血刃");
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "巳":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "丑":
                        break;
                    case "亥":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "巳":
                switch(地支){
                    case "丑":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "酉":
                        各柱神煞[i].push("將星");
                        break;
                    case "亥":
                        //*各柱神煞[i].push("驛馬");
                        break;
                    case "午":
                        各柱神煞[i].push("咸池");
                        break;
                    case "巳":
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "申":
                        各柱神煞[i].push("亡神");
                        break;
                    case "辰":
                        break;
                    case "未": 
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "寅":
                        各柱神煞[i].push("劫煞");
                        break;
                }
                break;
            case "午":
                switch(地支){
                    case "戌":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "午":
                        各柱神煞[i].push("將星");
                        break;
                    case "申":
                        //*各柱神煞[i].push("驛馬");
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "卯":
                        各柱神煞[i].push("咸池");
                        break;
                    case "辰":
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "亥":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "巳":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "未":
                switch(地支){
                    case "未":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "卯":
                        各柱神煞[i].push("將星");
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "巳":
                        //*各柱神煞[i].push("驛馬");
                        break;
                    case "子":
                        各柱神煞[i].push("咸池");
                        break;
                    case "申":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "辰":
                        break;
                    case "酉":
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "寅":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "申":
                switch(地支){
                    case "辰":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "子":
                        各柱神煞[i].push("將星");
                        break;
                    case "寅":
                        //*各柱神煞[i].push("驛馬");
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "酉":
                        各柱神煞[i].push("咸池");
                        break;
                    case "亥":
                        break;
                    case "未":
                        break;
                    case "戌":
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "巳":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "亥":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "酉":
                switch(地支){
                    case "丑":
                        //*各柱神煞[i].push("華蓋");
                        //*各柱神煞[i].push("血刃");
                        break;
                    case "酉":
                        各柱神煞[i].push("將星");
                        break;
                    case "亥":
                        //*各柱神煞[i].push("驛馬");
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "午":
                        各柱神煞[i].push("咸池");
                        break;
                    case "未":
                        break;
                    case "寅":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "申":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "戌":
                switch(地支){
                    case "戌":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "午":
                        各柱神煞[i].push("將星");
                        break;
                    case "申":
                        //*各柱神煞[i].push("驛馬");
                        break;
                    case "卯":
                        各柱神煞[i].push("咸池");
                        break;
                    case "子":
                        //*各柱神煞[i].push("血刃");
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "亥":
                        各柱神煞[i].push("劫煞");
                        break;
                    case "未":
                        break;
                    case "巳":
                        各柱神煞[i].push("亡神");
                        break;
                }
                break;
            case "亥":
                switch(地支){
                    case "未":
                        //*各柱神煞[i].push("華蓋");
                        break;
                    case "卯":
                        各柱神煞[i].push("將星");
                        break;
                    case "巳":
                        //*各柱神煞[i].push("驛馬");
                        break;
                    case "子":
                        各柱神煞[i].push("咸池");
                        break;
                    case "亥":
                        各柱神煞[i].push("血刃");
                        break;
                    case "寅":
                        各柱神煞[i].push("亡神");
                        break;
                    case "戌":
                        break;
                    case "丑":
                        各柱神煞[i].push("喪門");
                        各柱神煞[i].push("隔角");
                        break;
                    case "申":
                        各柱神煞[i].push("劫煞");
                        break;
                }
                break;  
        }// end switch
    } // end if
    } //end for
    return 各柱神煞;
}

function 日干支神煞(日柱, 性別) {
    var 日神煞=[];

    //*if (日柱=="甲寅" || 日柱=="乙丑" || 日柱=="乙亥" || 日柱=="丙子" || 日柱=="丙戌" || 日柱=="丁酉" || 日柱=="戊申" || 日柱=="己未" || 日柱=="庚午" || 日柱=="辛巳" || 日柱=="壬辰" || 日柱=="癸卯") 日神煞.push("福星貴");
    if (日柱=="甲辰" || 日柱=="乙亥" || 日柱=="丙辰" || 日柱=="丁酉" || 日柱=="戊午" || 日柱=="庚戌" || 日柱=="庚寅" || 日柱=="辛亥" || 日柱=="壬寅") 日神煞.push("十靈日");
    //*if (日柱=="甲寅" || 日柱=="丙辰" || 日柱=="戊辰" || 日柱=="庚辰" || 日柱=="壬戌") {日神煞.push("日德");}
    //*if (日柱=="丁酉" || 日柱=="丁亥" || 日柱=="癸卯" || 日柱=="癸巳") 日神煞.push("日貴");
    if (日柱=="甲子" || 日柱=="甲午" || 日柱=="己卯" || 日柱=="己酉") 日神煞.push("進神");
    if (日柱=="丁丑" || 日柱=="丁未" || 日柱=="壬辰" || 日柱=="壬戌") 日神煞.push("退神");
    //*if (日柱=="丙午" || 日柱=="丁未" || 日柱=="戊子" || 日柱=="戊午" || 日柱=="己丑" || 日柱=="己未") {日神煞.push("六秀日");}
    if (日柱=="甲申" || 日柱=="乙酉" || 日柱=="丙子" || 日柱=="丁亥" || 日柱=="戊寅" || 日柱=="己亥" || 日柱=="庚寅" || 日柱=="辛卯" || 日柱=="壬午" || 日柱=="癸未") 日神煞.push("胞胎日");
    if (日柱=="甲寅" || 日柱=="乙卯" || 日柱=="戊戌" || 日柱=="己未" || 日柱=="丁未" || 日柱=="庚申" || 日柱=="辛酉" || 日柱=="癸丑") 日神煞.push("八專");
    if (日柱=="戊子" || 日柱=="丁酉" || 日柱=="丁卯" || 日柱=="戊午" || 日柱=="己酉" || 日柱=="己卯" || 日柱=="壬子" || 日柱=="壬午" || 日柱=="辛卯") 日神煞.push("九醜");
    if (性別=="女") { if (日柱=="辛卯" || 日柱=="壬辰" || 日柱=="癸巳" || 日柱=="丙午" || 日柱=="丁未" || 日柱=="戊申" || 日柱=="辛酉") 日神煞.push("陰錯"); }
    if (性別=="男") { if (日柱=="丙子" || 日柱=="丁丑" || 日柱=="戊寅" || 日柱=="壬戌" || 日柱=="癸亥") 日神煞.push("陽差"); }
    
    //if (日柱=="甲午" || 日柱=="丙寅" || 日柱=="丁未" || 日柱=="戊辰" || 日柱=="辛酉" || 日柱=="庚戌" || 日柱=="壬子" || 日柱=="癸申") 日神煞.push("紅艷");  // 紅艷: 乙日見午月, 己日見辰月, 補充在'特殊神煞'
    if (日柱=="戊戌" || 日柱=="庚辰" || 日柱=="庚戌" || 日柱=="壬辰") 日神煞.push("魁罡");
    //日刃日是指：丙午、戊午、壬子、丁巳、己巳、癸亥六日，是指日主坐在羊刃之上

    return 日神煞;
}


function 特殊神煞(年柱, 月柱, 日柱, 時柱, 陽男陰女) {
    var 年干=年柱.substr(0,1);
    var 年支=年柱.substr(1,1);
    var 月干=月柱.substr(0,1);
    var 月支=月柱.substr(1,1);
    var 日干=日柱.substr(0,1);
    var 日支=日柱.substr(1,1);
    var 時干=時柱.substr(0,1);
    var 時支=時柱.substr(1,1);
    var 四柱地支=年支+月支+日支+時支;
	var 四柱天干=年干+月干+日干+時干;
    var 四柱干支矩陣=[年柱, 月柱, 日柱, 時柱];
    
    var 年柱神煞=[];
    var 月柱神煞=[];
    var 日柱神煞=[];
    var 時柱神煞=[];
    var 命盤神煞=[];
    var 各柱神煞=[年柱神煞, 月柱神煞, 日柱神煞, 時柱神煞, 命盤神煞];

    // ******************************* 三奇貴 與 三台貴 ***********************************
    // 甲戊庚: 1984年4月26日14時, 壬癸辛: 2012年3月11日12時, 乙丙丁: 1925年10月20日14時
    //if ((月干+日干+時干=="甲戊庚") || (年干+月干+日干=="甲戊庚")) 各柱神煞[2].push("三奇貴");
    //if ((月干+日干+時干=="壬癸辛") || (年干+月干+日干=="壬癸辛")) 各柱神煞[2].push("三奇貴");
    //if ((月干+日干+時干=="乙丙丁") || (年干+月干+日干=="乙丙丁")) 各柱神煞[2].push("三奇貴");
    
    // 寅辰申: 1974年4月13日14時, 卯巳午: 1975年5月12日14時, 亥子酉: 1983年12月23日14時
    /*
    var 三台貴字串=['寅辰申', '卯巳午', '亥子酉'];
    for(var i=0; i<三台貴字串.length; i++) {
        var HasChar1=四柱地支.indexOf(三台貴字串[i].substr(0,1));
        var HasChar2=四柱地支.indexOf(三台貴字串[i].substr(1,1));
        var HasChar3=四柱地支.indexOf(三台貴字串[i].substr(2,1));
        //alert(HasChar1 + " /" + HasChar2 + " / "+ HasChar3);
        if ((HasChar1>=0) && (HasChar2>=0) && (HasChar3>=0)) { 各柱神煞[4].push("三台貴"); }
    }
    */

    // ******************************* 天赦貴, 天地轉殺, 四廢日, 桃花劫, 月德合***********************************
    
    if((月支=="寅" || 月支=="卯" || 月支=="辰") && 日柱=="戊寅") 各柱神煞[2].push("天赦日");
    if((月支=="巳" || 月支=="午" || 月支=="未") && 日柱=="甲午") 各柱神煞[2].push("天赦日");
    if((月支=="申" || 月支=="酉" || 月支=="戌") && 日柱=="戊申") 各柱神煞[2].push("天赦日");
    if((月支=="亥" || 月支=="子" || 月支=="丑") && 日柱=="甲子") 各柱神煞[2].push("天赦日");

    if((月支=="寅" || 月支=="卯" || 月支=="辰") && (日柱=="乙卯" || 日柱=="辛卯")) 各柱神煞[2].push("天地轉殺");
    if((月支=="巳" || 月支=="午" || 月支=="未") && (日柱=="丙午" || 日柱=="戊午")) 各柱神煞[2].push("天地轉殺");
    if((月支=="申" || 月支=="酉" || 月支=="戌") && (日柱=="辛酉" || 日柱=="癸酉")) 各柱神煞[2].push("天地轉殺");
    if((月支=="亥" || 月支=="子" || 月支=="丑") && (日柱=="壬子" || 日柱=="丙子")) 各柱神煞[2].push("天地轉殺");

    if((月支=="寅" || 月支=="卯" || 月支=="辰") && (日柱=="庚申" || 日柱=="辛酉")) 各柱神煞[2].push("四廢日");
    if((月支=="巳" || 月支=="午" || 月支=="未") && (日柱=="壬子" || 日柱=="癸亥")) 各柱神煞[2].push("四廢日");
    if((月支=="申" || 月支=="酉" || 月支=="戌") && (日柱=="甲寅" || 日柱=="乙卯")) 各柱神煞[2].push("四廢日");
    if((月支=="亥" || 月支=="子" || 月支=="丑") && (日柱=="丙午" || 日柱=="丁巳")) 各柱神煞[2].push("四廢日");
    
    //if ((年柱=="庚戌" && 日柱=="甲辰") || (年柱=="辛亥" && 日柱=="乙巳") || (年柱=="壬寅" && 日柱=="丙辰") || (年柱=="癸巳" && 日柱=="丁亥") || (年柱=="甲戌" && 日柱=="庚辰") || (年柱=="甲辰" && 日柱=="戊戌") || (年柱=="乙亥" && 日柱=="辛巳") || (年柱=="乙未" && 日柱=="己丑") || (年柱=="丙寅" && 日柱=="壬申")  || (年柱=="丁巳" && 日柱=="癸亥")) 各柱神煞[2].push("十惡大敗");
    if ((日柱=="甲辰") || (日柱=="乙巳") || (日柱=="丙申") || (日柱=="丁亥") || (日柱=="庚辰") || (日柱=="戊戌") || (日柱=="辛巳") || (日柱=="己丑") || (日柱=="壬申")  || (日柱=="癸亥")) 各柱神煞[2].push("十惡大敗");
    if ((日柱=="甲寅" || 日柱=="乙巳" || 日柱=="丙午" || 日柱=="丁巳" || 日柱=="戊午" || 日柱=="戊申" || 日柱=="辛亥" || 日柱=="壬子" || 日柱=="癸巳") && (時柱=="甲寅" || 時柱=="乙巳" || 時柱=="丙午" || 時柱=="丁巳" || 時柱=="戊午" || 時柱=="戊申" || 時柱=="辛亥" || 時柱=="壬子" || 時柱=="癸巳") && 日柱!=時柱) 各柱神煞[3].push("孤鸞");
    /*
  
    //if((月支=="寅" || 月支=="卯" || 月支=="辰") && (日支=="巳" || 日支=="酉" || 日支=="丑") && 時支=="寅") {各柱神煞[2].push("桃花劫"); }
    //if((月支=="巳" || 月支=="午" || 月支=="未") && (日支=="申" || 日支=="子" || 日支=="辰") && 時支=="巳") {各柱神煞[2].push("桃花劫"); }
    //if((月支=="申" || 月支=="酉" || 月支=="戌") && (日支=="亥" || 日支=="卯" || 日支=="未") && 時支=="申") {各柱神煞[2].push("桃花劫"); }
    //if((月支=="亥" || 月支=="子" || 月支=="丑") && (日支=="寅" || 日支=="午" || 日支=="戌") && 時支=="亥") {各柱神煞[2].push("桃花劫"); }
    */
    // ******************************* 各類桃花 ***********************************
    //if ((日干+日支=="甲子") || (時干+時支=="庚午")) {各柱神煞[2].push("桃花煞");}
    //if ((日干+日支=="庚午") || (時干+時支=="甲子")) {各柱神煞[2].push("桃花煞");}
    
    //if ((日干+日支=="丙子") || (時干+時支=="辛卯")) {各柱神煞[2].push("滾桃花");}
    //if ((日干+日支=="辛卯") || (時干+時支=="丙子")) {各柱神煞[2].push("滾桃花");}
    
    /*
    if((日支=="申" || 日支=="子" || 日支=="辰") && (月支=="巳" || 月支=="午" || 月支=="未") && 時支=="巳") {各柱神煞[2].push("殘花煞"); }
    if((日支=="寅" || 日支=="午" || 日支=="戌") && (月支=="亥" || 月支=="子" || 月支=="丑") && 時支=="亥") {各柱神煞[2].push("殘花煞"); }
    if((日支=="巳" || 日支=="酉" || 日支=="丑") && (月支=="寅" || 月支=="卯" || 月支=="辰") && 時支=="寅") {各柱神煞[2].push("殘花煞"); }
    if((日支=="亥" || 日支=="卯" || 日支=="未") && (月支=="申" || 月支=="酉" || 月支=="戌") && 時支=="申") {各柱神煞[2].push("殘花煞"); }
    */
    //if((月支=="午") && (日干=="乙")) 各柱神煞[2].push("紅艷"); // 紅艷: 乙日見午月, 己日見辰月
    //if((月支=="辰") && (日干=="己")) 各柱神煞[2].push("紅艷");

    //if((日支=="申" || 日支=="子" || 日支=="辰") && 時支=="酉") {各柱神煞[2].push("桃花"); }
    //if((日支=="寅" || 日支=="午" || 日支=="戌") && 時支=="卯") {各柱神煞[2].push("桃花"); }
    //if((日支=="巳" || 日支=="酉" || 日支=="丑") && 時支=="午") {各柱神煞[2].push("桃花"); }
    //if((日支=="亥" || 日支=="卯" || 日支=="未") && 時支=="子") {各柱神煞[2].push("桃花"); }

    //if((時支=="子" || 時支=="午" || 時支=="卯" || 時支=="酉") && (日支=="子" || 日支=="午" || 日支=="卯" || 日支=="酉")) {各柱神煞[2].push("外桃花"); }
    
    // ****************************************************************************
    /*
    if(月支=="寅" || 月支=="午" || 月支=="戌") {
        if(四柱天干.indexOf("丙")>=0 && 四柱天干.indexOf("辛")>=0) {各柱神煞[1].push("月德合"); } }
    if(月支=="申" || 月支=="子" || 月支=="辰") {
        if(四柱天干.indexOf("壬")>=0 && 四柱天干.indexOf("丁")>=0) {各柱神煞[1].push("月德合"); } }
    if(月支=="亥" || 月支=="卯" || 月支=="未") {
        if(四柱天干.indexOf("甲")>=0 && 四柱天干.indexOf("己")>=0) {各柱神煞[1].push("月德合"); } }
    if(月支=="巳" || 月支=="酉" || 月支=="丑") {
        if(四柱天干.indexOf("乙")>=0 && 四柱天干.indexOf("庚")>=0) {各柱神煞[1].push("月德合"); } }       

    // ******************************* 拱祿, 交祿 ***********************************
    if (日柱=="戊辰") {
        if(年柱=="丙午"){各柱神煞[0].push("拱祿"); }
        if(月柱=="丙午"){各柱神煞[1].push("拱祿"); }
        if(時柱=="丙午"){各柱神煞[3].push("拱祿"); }
    }

    if (日柱=="丙午") {
        if(年柱=="戊辰"){各柱神煞[0].push("拱祿"); }
        if(月柱=="戊辰"){各柱神煞[1].push("拱祿"); }
        if(時柱=="戊辰"){各柱神煞[3].push("拱祿"); }
    }

    if (日柱=="丁巳") {
        if(年柱=="己未"){各柱神煞[0].push("拱祿"); }
        if(月柱=="己未"){各柱神煞[1].push("拱祿"); }
        if(時柱=="己未"){各柱神煞[3].push("拱祿"); }
    }

    if (日柱=="己未") {
        if(年柱=="丁巳"){各柱神煞[0].push("拱祿"); }
        if(月柱=="丁巳"){各柱神煞[1].push("拱祿"); }
        if(時柱=="丁巳"){各柱神煞[3].push("拱祿"); }
    }

    if (日柱=="甲申") {
        if(年柱=="庚寅"){各柱神煞[0].push("交祿"); }
        if(月柱=="庚寅"){各柱神煞[1].push("交祿"); }
        if(時柱=="庚寅"){各柱神煞[3].push("交祿"); }
    }

    if (日柱=="庚寅") {
        if(年柱=="甲申"){各柱神煞[0].push("交祿"); }
        if(月柱=="甲申"){各柱神煞[1].push("交祿"); }
        if(時柱=="甲申"){各柱神煞[3].push("交祿"); }
    }
    */
    // ******************************* 元辰/大耗 ***********************************
    var 大耗地支數;
    var 年支數=地支字轉值(年支);
    for(var i=1; i<4; i++) {
        if (陽男陰女=="陽男" || 陽男陰女=="陰女") {
            大耗地支數=地支滾動(年支數, 7);
            if (四柱地支.substr(i,1)==地支數轉字(大耗地支數)){
                各柱神煞[i].push("元辰");
            }
        }
        if (陽男陰女=="陽女" || 陽男陰女=="陰男") {
            大耗地支數=地支滾動(年支數, 5);
            if (四柱地支.substr(i,1)==地支數轉字(大耗地支數)){
                各柱神煞[i].push("元辰");
            }
        }
    } //end for

    // ******************************* 金神 ***********************************
    if((日柱=="乙丑" || 日柱=="己巳" || 日柱=="癸酉") && 日柱==時柱) {
        var 四柱有木=((干支轉五行(年干)=="木") || (干支轉五行(年支)=="木") || (干支轉五行(月干)=="木") || (干支轉五行(月支)=="木"))? true : false;
        var 四柱無水=((干支轉五行(年干)!="水") && (干支轉五行(年支)!="水") && (干支轉五行(月干)!="水") && (干支轉五行(月支)!="水"))? true : false;
        if(四柱有木 && 四柱無水) 各柱神煞[2].push("金神");
    }
    
    // ******************************* 天羅地網 ***********************************
    var 年柱納音五行=六十干支屬性(六十干支字轉值(年柱), "五行");
    switch(年柱納音五行){
        case "火":
            if(日支=="戌" || 日支=="亥") 各柱神煞[2].push("天羅");
            break;
        case "水": case "土":
            if(日支=="辰" || 日支=="巳") 各柱神煞[2].push("地網");
            break;
    }

    // ******************************* 帝座***********************************
    /*
    var 時柱納音五行=六十干支屬性(六十干支字轉值(時柱), "五行");
    
    for(var i=0; i<4; i++) {
        switch(時柱納音五行){
            case "金":
                if (四柱地支.substr(i,1)=="酉"){各柱神煞[i].push("帝座");}
                break;
            case "木":
                if (四柱地支.substr(i,1)=="卯"){各柱神煞[i].push("帝座");}
                break;
            case "水":
                if (四柱地支.substr(i,1)=="子"){各柱神煞[i].push("帝座");}
                break;
            case "火":
                if (四柱地支.substr(i,1)=="午"){各柱神煞[i].push("帝座");}
                break;
            case "土":
                if (四柱地支.substr(i,1)=="子"){各柱神煞[i].push("帝座");}
                break;
        }
    }
    */
    // ******************************* 空亡 ***********************************
    var 年柱, 年空亡, 日柱, 日空亡;
    
    年空亡=判空亡(年柱); //日柱數=(六十干支字轉值(日柱)!=0)?六十干支字轉值(日柱):60;     
    日空亡=判空亡(日柱);
    
    for(var i=1; i<4; i++) {
        if ((四柱地支.substr(i,1)==年空亡.substr(0,1)) || (四柱地支.substr(i,1)==年空亡.substr(1,1))) {
            各柱神煞[i].push("年空亡");
        }
    }
    
    for(var i=0; i<4; i++) {
        if (((四柱地支.substr(i,1)==日空亡.substr(0,1)) || (四柱地支.substr(i,1)==日空亡.substr(1,1)))&& i!=2) {
            各柱神煞[i].push("日空亡");
        }
    }

    // ******************************* 截路空亡 ***********************************
    /*
    盲门截路空亡口诀是：
    甲戌、己卯二日生申酉时，一生最为愁
    乙酉、庚寅二日生午未时，此命莫追求
    丙申、辛丑二日生辰巳时，劳碌何须问
    丁未、壬子二日生寅卯时，追求一场空
    戊午、癸亥二日生子丑时，君子万事休
    */
    if((日柱=="甲戌" || 日柱=="己卯") && (時支=="申" || 日干=="酉")) 各柱神煞[3].push("截路空亡");
    if((日柱=="乙酉" || 日柱=="庚寅") && (時支=="午" || 日干=="未")) 各柱神煞[3].push("截路空亡");
    if((日干=="丙申" || 日干=="辛丑") && (時支=="辰" || 日干=="巳")) 各柱神煞[3].push("截路空亡");
    if((日干=="丁未" || 日干=="壬子") && (時支=="寅" || 日干=="卯")) 各柱神煞[3].push("截路空亡");
    if((日干=="戊午" || 日干=="癸亥") && (時支=="子" || 日干=="丑")) 各柱神煞[3].push("截路空亡");
    
    /* 淵海子平的截路空亡，不可靠，改用盲派的
    if((日干=="甲" || 日干=="己") && (時支=="申" || 日干=="酉")) 各柱神煞[3].push("截路空亡");
    if((日干=="乙" || 日干=="庚") && (時支=="午" || 日干=="未")) 各柱神煞[3].push("截路空亡");
    if((日干=="丙" || 日干=="辛") && (時支=="辰" || 日干=="巳")) 各柱神煞[3].push("截路空亡");
    if((日干=="丁" || 日干=="壬") && (時支=="寅" || 日干=="卯")) 各柱神煞[3].push("截路空亡");
    if((日干=="戊" || 日干=="癸") && (時支=="子" || 日干=="丑")) 各柱神煞[3].push("截路空亡");
    */
    
    // ******************************* 學堂 ***********************************
    //var 日干五行=干支轉五行(日干);
    var 日柱納音五行=六十干支屬性(日柱, "納音").substr(2,1);
    switch(日柱納音五行){
        case "木":
            if(年柱=="己亥") 各柱神煞[0].push("學堂");
            if(月柱=="己亥") 各柱神煞[1].push("學堂");
            if(時柱=="己亥") 各柱神煞[3].push("學堂");
            break;
        case "火":
            if(年柱=="丙寅") 各柱神煞[0].push("學堂");
            if(月柱=="丙寅") 各柱神煞[1].push("學堂");
            if(時柱=="丙寅") 各柱神煞[3].push("學堂");
            break;
        case "土":
            if(年柱=="戊申") 各柱神煞[0].push("學堂");
            if(月柱=="戊申") 各柱神煞[1].push("學堂");
            if(時柱=="戊申") 各柱神煞[3].push("學堂");
            break;   
        case "金":
            if(年柱=="辛巳") 各柱神煞[0].push("學堂");
            if(月柱=="辛巳") 各柱神煞[1].push("學堂");
            if(時柱=="辛巳") 各柱神煞[3].push("學堂");
            break;
        case "水":
            if(年柱=="甲申") 各柱神煞[0].push("學堂");
            if(月柱=="甲申") 各柱神煞[1].push("學堂");
            if(時柱=="甲申") 各柱神煞[3].push("學堂");
            break; 
    }
    
    /*
    for(var i=0; i<4; i++) {
        if(i!=2){
            //console.log(i+日干五行+四柱干支矩陣[i]);
            switch(日干五行){
                case "木":
                    if(四柱干支矩陣[i]=="己亥") 各柱神煞[i].push("學堂");
                    break;
                case "火":
                    if(四柱干支矩陣[i]=="丙寅") 各柱神煞[i].push("學堂");
                    break;
                case "土":
                    if(四柱干支矩陣[i]=="戊申") 各柱神煞[i].push("學堂");
                    break;
                case "金":
                    if(四柱干支矩陣[i]=="辛巳") 各柱神煞[i].push("學堂");
                    break;
                case "水":
                    if(四柱干支矩陣[i]=="甲申") 各柱神煞[i].push("學堂");
                    break;
            } //end switch
        }// end if
    } //end for
    */

    // ************************ 六甲趨乾, 六壬趨艮 *****************************
    /*
    if(日干=="壬" && 時支=="寅") {各柱神煞[4].push("六壬趨艮"); }
    if(日干=="甲" && 時支=="亥") {各柱神煞[4].push("六甲趨乾"); }
    
    // ------------------------- 拱祿, 拱貴 ---------------------------
    if(日柱=="癸亥" && 時柱=="癸丑") {各柱神煞[4].push("拱祿"); }
    if(日柱=="癸丑" && 時柱=="癸亥") {各柱神煞[4].push("拱祿"); }
    if(日柱=="丁巳" && 時柱=="丁未") {各柱神煞[4].push("拱祿"); }
    if(日柱=="己未" && 時柱=="己巳") {各柱神煞[4].push("拱祿"); }
    if(日柱=="戊辰" && 時柱=="戊午") {各柱神煞[4].push("拱祿"); }
    
    if(日柱=="甲申" && 時柱=="甲戌") {各柱神煞[4].push("拱貴"); }
    if(日柱=="乙未" && 時柱=="乙酉") {各柱神煞[4].push("拱貴"); }
    if(日柱=="甲寅" && 時柱=="甲子") {各柱神煞[4].push("拱貴"); }
    if(日柱=="戊申" && 時柱=="戊午") {各柱神煞[4].push("拱貴"); }
    if(日柱=="辛丑" && 時柱=="辛卯") {各柱神煞[4].push("拱貴"); }
    
    // ------------------------- 十二支分配地理 ---------------------------
    if(年支=="子" && 時柱=="癸亥") {各柱神煞[4].push("雙魚游墨"); }
    if(年支=="午" && 時支=="辰") {各柱神煞[4].push("馬化龍駒"); }
    if(年支=="卯" && 時柱=="己未") {各柱神煞[4].push("兔入月宮"); }
    if(年支=="酉" && 時支=="寅") {各柱神煞[4].push("鐘鳴谷應"); }
    if(年支=="寅" && 時柱=="戊辰") {各柱神煞[4].push("威震萬里"); }
    if(年支=="申" && 時支=="亥") {各柱神煞[4].push("地天交泰"); }
    if(年支=="巳" && 時支=="辰") {各柱神煞[4].push("千里龍駒"); }
    if(年支=="亥" && (時支=="寅" || 時支=="辰")) {各柱神煞[4].push("水拱雷門"); }
    if(年支=="辰" && (月柱=="壬戌" || 月柱=="癸亥" || 日柱=="壬戌" || 日柱=="癸亥" || 時柱=="壬戌" || 時柱=="癸亥")) {各柱神煞[4].push("龍歸大海"); }
    if(年支=="戌" && 時支=="卯") {各柱神煞[4].push("春入燒痕"); }
    if(年支=="丑" && 時柱=="己未") {各柱神煞[4].push("月照柳梢"); }
    if(年支=="未" && 時柱=="戊戌") {各柱神煞[4].push("雙飛格"); }
    */
    return 各柱神煞;
}

function 含神煞(命盤, 神煞, 四柱){
    var 神煞矩陣;
    switch(四柱){
        case "命盤": //整體命盤
            神煞矩陣 = 命盤.神煞.命盤;
            break;
    }

    return _.indexOf(神煞矩陣, 神煞);
}

// ****************************** 單柱的神煞 ************************

function 單柱神煞(命盤, 單柱干支){
    var 神煞矩陣=流運神煞(命盤, 單柱干支);
    return 神煞矩陣;
}

function 流運神煞(命盤, 流運干支, 流運) {

    var 四柱地支=命盤.年支.地支+命盤.月支.地支+命盤.日支.地支+命盤.時支.地支;
	var 四柱天干=命盤.年干.天干+命盤.月干.天干+命盤.日干.天干+命盤.時干.天干;
    var 流運天干=流運干支.substr(0,1);
    var 流運地支=流運干支.substr(1,1);

    var 年干=四柱天干.substr(0,1);
    var 日干=四柱天干.substr(2,1);
    var 年支=四柱地支.substr(0,1);
    var 日支=四柱地支.substr(2,1);
    var 月支=四柱地支.substr(1,1);
    var 流運神煞=[];
    var 日時地支=四柱地支.substr(2,2);
    var 日時天干=四柱天干.substr(2,2);
    var 納入=false;
    var 已論斷神煞=[];
    var 流年=false; // default to false

    if(流運=="流年") 流年 = true;  

    // 太極貴人, 垣城, 天廚, 天醫, 天德,月德,天醫
        switch(流運地支){
            case "子":
                if(日干=="乙" || 日干=="己") 流運神煞.push("天乙貴人");  //淵海子平只用日干，不取年干
                if(日干=="辛") 流運神煞.push("文昌");
                if(日干=="壬") 流運神煞.push("羊刃");
                //無 福星、金轝
                //*if(日干=="丙") 流運神煞.push("天廚"); //淵海子平
                if(日干=="癸") 流運神煞.push("十干祿"); //淵海子平
                ///*if(日干=="辛" && i==2) 流運神煞.push("垣城"); //淵海子平

                // ----------------------- 年支神煞 -----------------------
                if(年支=="卯") 流運神煞.push("紅鸞");
                if(年支=="酉") 流運神煞.push("天喜");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="亥" || 日支=="卯" || 日支=="未") 流運神煞.push("桃花");
                if((日支=="申" || 日支=="子" || 日支=="辰") && 流運地支!=日支) 流運神煞.push("將星");  //有的說用年、日支，程式只用日
                if(日支=="戌") 流運神煞.push("喪門");


                // ----------------------- 時支神煞 -----------------------
                break;

            case "丑":
                if(日干=="甲" || 日干=="戊" || 日干=="庚") 流運神煞.push("天乙貴人");
                //if(日干=="壬") 流運神煞.push("金轝");
                //*if(日干=="丙" || 日干=="戊") 流運神煞.push("國印");
                //無 天廚

                // ----------------------- 年支神煞 -----------------------
                if(年支=="寅" || 年支=="卯" || 年支=="辰") 流運神煞.push("寡宿");
                if(年支=="寅") 流運神煞.push("紅鸞");
                if(年支=="申") 流運神煞.push("天喜");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                //if((日支=="巳" || 日支=="酉" || 日支=="丑") && 日支!=流運地支)) 流運神煞.push("華蓋");
                if(日支=="亥") 流運神煞.push("喪門");

                // ----------------------- 日支神煞 -----------------------
                
                break;

            case "寅":
                if(日干=="辛") 流運神煞.push("天乙貴人");
                if(日干=="壬") 流運神煞.push("文昌");
                //if(日干=="癸") 流運神煞.push("金轝");
                if(日干=="乙") 流運神煞.push("羊刃");
                //*if(日干=="庚") 流運神煞.push("天廚"); //淵海子平
                if(日干=="甲") 流運神煞.push("十干祿"); //淵海子平
                if(日干=="癸") 流運神煞.push("流霞");
                //*if((日干=="丙" || 日干=="戊")  && i==2) 流運神煞.push("垣城"); //淵海子平
                //*if(日干=="丁" || 日干=="己") 流運神煞.push("國印");

                // ----------------------- 年支神煞 -----------------------
                if(年支=="丑") 流運神煞.push("紅鸞");
                if(年支=="未") 流運神煞.push("天喜");
                if(年支=="亥" || 年支=="子" || 年支=="丑") 流運神煞.push("孤辰"); //只判斷夫妻宮

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="申" || 日支=="子" || 日支=="辰") 流運神煞.push("驛馬");
                if(日支=="巳" || 日支=="酉" || 日支=="丑") 流運神煞.push("劫煞");  //有的說用年、日支，程式只用日
                if(日支=="亥" || 日支=="卯" || 日支=="未") 流運神煞.push("亡神");  //有的說用年、日支，程式只用日
                
                if(日支=="子") 流運神煞.push("喪門");

                // ----------------------- 時支神煞 -----------------------

                break;

            case "卯":
                if(日干=="壬" || 日干=="癸") 流運神煞.push("天乙貴人");
                if(日干=="癸") 流運神煞.push("文昌");
                if(日干=="甲") 流運神煞.push("羊刃");
                //無 天廚、金轝
                if(日干=="乙") 流運神煞.push("十干祿"); //淵海子平
                if(日干=="辛") 流運神煞.push("流霞");
                //*if(日干=="癸" && i==2) 流運神煞.push("垣城"); //淵海子平

                // ----------------------- 年支神煞 -----------------------
                if(年支=="子") 流運神煞.push("紅鸞");
                if(年支=="午") 流運神煞.push("天喜");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="寅" || 日支=="午" || 日支=="戌") 流運神煞.push("桃花");
                if((日支=="亥" || 日支=="卯" || 日支=="未") && 流運地支!=日支) 流運神煞.push("將星");  //有的說用年、日支，程式只用日
                if(日支=="丑") 流運神煞.push("喪門");

                break;

            case "辰":
                if(日干=="庚") 流運神煞.push("流霞");
                //if(日干=="甲") 流運神煞.push("金轝");
                //*if(日干=="庚") 流運神煞.push("國印");
                //無 天廚

                // ----------------------- 年支神煞 -----------------------
                if(年支=="亥") 流運神煞.push("紅鸞");
                if(年支=="巳") 流運神煞.push("天喜");
                if(年支=="巳" || 年支=="午" || 年支=="未") 流運神煞.push("寡宿");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                //if((日支=="申" || 日支=="子" || 日支=="辰") && 日支!=流運地支) 流運神煞.push("華蓋");
                if(日支=="寅") 流運神煞.push("喪門");

                // ----------------------- 時支神煞 -----------------------

                break;

            case "巳":
                if(日干=="壬" || 日干=="癸") 流運神煞.push("天乙貴人");
                if(日干=="甲") 流運神煞.push("文昌");
                //if(日干=="乙") 流運神煞.push("金轝");
                if(日干=="丁" || 日干=="己") 流運神煞.push("羊刃");
                //*if(日干=="甲" || 日干=="丁") 流運神煞.push("天廚"); //淵海子平
                if(日干=="丙" || 日干=="戊") 流運神煞.push("十干祿"); //淵海子平
                if(日干=="戊") 流運神煞.push("流霞");
                //*if(日干=="庚" && i==2) 流運神煞.push("垣城"); //淵海子平
                //*if(日干=="辛") 流運神煞.push("國印");

                // ----------------------- 年支神煞 -----------------------
                if(年支=="戌") 流運神煞.push("紅鸞");
                if(年支=="辰") 流運神煞.push("天喜");
                if(年支=="寅" || 年支=="卯" || 年支=="辰") 流運神煞.push("孤辰");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="亥" || 日支=="卯" || 日支=="未") 流運神煞.push("驛馬");
                if(日支=="申" || 日支=="子" || 日支=="辰") 流運神煞.push("劫煞");  //有的說用年、日支，程式只用日
                if(日支=="寅" || 日支=="午" || 日支=="戌") 流運神煞.push("亡神");  //有的說用年、日支，程式只用日
                
                if(日支=="卯") 流運神煞.push("喪門");

                break;

            case "午":
                if(日干=="辛") 流運神煞.push("天乙貴人");
                if(日干=="乙") 流運神煞.push("文昌");
                if(日干=="丙" || 日干=="戊") 流運神煞.push("羊刃");
                //*if(日干=="乙" || 日干=="戊" || 日干=="辛") 流運神煞.push("天廚"); //淵海子平
                if(日干=="丁" || 日干=="己") 流運神煞.push("十干祿"); //淵海子平
                if(日干=="己") 流運神煞.push("流霞");
                //太極貴人，參考子
                //*if(日干=="乙" && i==2) 流運神煞.push("垣城"); //淵海子平
                //無 金轝
                // ----------------------- 年支神煞 -----------------------
                if(年支=="卯") 流運神煞.push("天喜");
                if(年支=="酉") 流運神煞.push("紅鸞");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="巳" || 日支=="酉" || 日支=="丑") 流運神煞.push("桃花");
                if((日支=="寅" || 日支=="午" || 日支=="戌") && 流運地支!=日支) 流運神煞.push("將星");  //有的說用年、日支，程式只用日
                if(日支=="辰") 流運神煞.push("喪門");

                // ----------------------- 時支神煞 -----------------------
                break;

            case "未":
                if(日干=="甲" || 日干=="戊" || 日干=="庚") 流運神煞.push("天乙貴人");
                if(日干=="丙") 流運神煞.push("流霞");
                //if(日干=="丙" || 日干=="戊") 流運神煞.push("金轝");
                //*if(日干=="壬") 流運神煞.push("國印");

                // ----------------------- 年支神煞 -----------------------
                if(年支=="寅") 流運神煞.push("天喜");
                if(年支=="申") 流運神煞.push("紅鸞");
                if(年支=="申" || 年支=="酉" || 年支=="戌") 流運神煞.push("寡宿");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                //if((日支=="亥" || 日支=="卯" || 日支=="未") && 流運地支!=日支) 流運神煞.push("華蓋");
                
                if(日支=="巳") 流運神煞.push("喪門");


                // ----------------------- 時支神煞 -----------------------

                // ----------------------- 地支神煞 -----------------------
                break;

            case "申":
                if(日干=="乙" || 日干=="己") 流運神煞.push("天乙貴人");
                if(日干=="丙" || 日干=="戊") 流運神煞.push("文昌");
                //if(日干=="丁" || 日干=="己") 流運神煞.push("金轝");
                if(日干=="辛") 流運神煞.push("羊刃");
                //*if(日干=="己") 流運神煞.push("天廚"); //淵海子平
                if(日干=="庚") 流運神煞.push("十干祿"); //淵海子平
                if(日干=="丁") 流運神煞.push("流霞");
                //*if(日干=="壬" && i==2) 流運神煞.push("垣城"); //淵海子平
                //*if(日干=="癸") 流運神煞.push("國印");

                // ----------------------- 年支神煞 -----------------------
                if(年支=="丑") 流運神煞.push("天喜");
                if(年支=="未") 流運神煞.push("紅鸞");
                if(年支=="巳" || 年支=="午" || 年支=="未") 流運神煞.push("孤辰"); //只判斷夫妻宮

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="寅" || 日支=="午" || 日支=="戌") 流運神煞.push("驛馬");
                if(日支=="亥" || 日支=="卯" || 日支=="未") 流運神煞.push("劫煞");  //有的說用年、日支，程式只用日
                if(日支=="巳" || 日支=="酉" || 日支=="丑") 流運神煞.push("亡神");  //有的說用年、日支，程式只用日
                
                if(日支=="午") 流運神煞.push("喪門");


                // ----------------------- 時支神煞 -----------------------
                break;

            case "酉":
                if(日干=="丙" || 日干=="丁") 流運神煞.push("天乙貴人");
                if(日干=="丁" || 日干=="己") 流運神煞.push("文昌");
                if(日干=="庚") 流運神煞.push("羊刃");
                //*if(日干=="壬") 流運神煞.push("天廚");
                if(日干=="辛") 流運神煞.push("十干祿"); //淵海子平
                if(日干=="甲") 流運神煞.push("流霞");
                //*if((日干=="丁" || 日干=="己") && i==2) 流運神煞.push("垣城"); //淵海子平

                //太極貴人，參考卯
                //無 金轝
                // ----------------------- 年支神煞 -----------------------
                if(年支=="子") 流運神煞.push("天喜");
                if(年支=="午") 流運神煞.push("紅鸞");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="申" || 日支=="子" || 日支=="辰") 流運神煞.push("桃花");
                if((日支=="巳" || 日支=="酉" || 日支=="丑") && 流運地支!=日支) 流運神煞.push("將星");  //有的說用年、日支，程式只用日
                if(日支=="未") 流運神煞.push("喪門");

                // ----------------------- 時支神煞 -----------------------

                break;

            case "戌":
                if(日干=="乙") 流運神煞.push("流霞");
                //if(日干=="庚") 流運神煞.push("金轝");
                //*if(日干=="甲") 流運神煞.push("國印");
                //無 天廚

                //太極貴人，參考辰

                // ----------------------- 年支神煞 -----------------------
                if(年支=="亥") 流運神煞.push("天喜");
                if(年支=="巳") 流運神煞.push("紅鸞");
                if(年支=="亥" || 年支=="子" || 年支=="丑") 流運神煞.push("寡宿");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                //if((日支=="寅" || 日支=="午" || 日支=="戌") && 日支!=流運地支) 流運神煞.push("華蓋");
                
                if(日支=="申") 流運神煞.push("喪門");

                // ----------------------- 時支神煞 -----------------------
                break;

            case "亥":
                if(日干=="丙" || 日干=="丁") 流運神煞.push("天乙貴人");
                if(日干=="庚") 流運神煞.push("文昌");
                //if(日干=="辛") 流運神煞.push("金轝");
                if(日干=="癸") 流運神煞.push("羊刃");
                //*if(日干=="癸") 流運神煞.push("天廚");
                if(日干=="壬") 流運神煞.push("十干祿"); //淵海子平
                if(日干=="壬") 流運神煞.push("流霞");
                //*if(日干=="甲" && i==2) 流運神煞.push("垣城"); //淵海子平
                //*if(日干=="乙") 流運神煞.push("國印");

                // ----------------------- 年支神煞 -----------------------
                if(年支=="戌") 流運神煞.push("天喜");
                if(年支=="辰") 流運神煞.push("紅鸞");
                if(年支=="申" || 年支=="酉" || 年支=="戌") 流運神煞.push("孤辰");

                // ----------------------- 月支神煞 -----------------------

                // ----------------------- 日支神煞 -----------------------
                if(日支=="巳" || 日支=="酉" || 日支=="丑") 流運神煞.push("驛馬");
                if(日支=="寅" || 日支=="午" || 日支=="戌") 流運神煞.push("劫煞");  //有的說用年、日支，程式只用日
                if(日支=="申" || 日支=="子" || 日支=="辰") 流運神煞.push("亡神");  //有的說用年、日支，程式只用日
                
                if(日支=="酉") 流運神煞.push("喪門");

                break;
        } //end switch
    
    // ******************************* 特殊神煞 ***********************************
    // ******************************* 空亡 ***********************************
    //var 年柱, 年空亡, 日柱, 日空亡;
    
    var 年空亡=判空亡(命盤.年柱.干支); //日柱數=(六十干支字轉值(日柱)!=0)?六十干支字轉值(日柱):60;     
    var 日空亡=判空亡(命盤.日柱.干支);
    
    if (流運地支==年空亡.substr(0,1) || 流運地支==年空亡.substr(1,1)) 流運神煞.push("年空亡");
    if (流運地支==日空亡.substr(0,1) || 流運地支==日空亡.substr(1,1)) 流運神煞.push("日空亡");  
    
    // ******************************* 元辰 ***********************************
    var 大耗地支數;
    var 年支數=地支字轉值(命盤.年支.地支);

    if (命盤.陽男陰女=="陽男" || 命盤.陽男陰女=="陰女") {
        大耗地支數=地支滾動(年支數, 7);
        if(流運地支==地支數轉字(大耗地支數)) 流運神煞.push("元辰");
    }
    
    if (命盤.陽男陰女=="陽女" || 命盤.陽男陰女=="陰男") {
        大耗地支數=地支滾動(年支數, 5);
        if(流運地支==地支數轉字(大耗地支數)) 流運神煞.push("元辰");
    }
    return 流運神煞;
}


// ************************ to delete *****************************


function 特殊的神煞(命盤, 單柱干支){
    var 天干=單柱干支.substr(0, 1);
    var 地支=單柱干支.substr(1, 1);
    var 神煞=[];
    
    // ******************************* 空亡 ***********************************
    //var 年柱, 年空亡, 日柱, 日空亡;
    
    年空亡=判空亡(命盤.年柱.干支); //日柱數=(六十干支字轉值(日柱)!=0)?六十干支字轉值(日柱):60;     
    日空亡=判空亡(命盤.日柱.干支);
    
    if (地支==年空亡.substr(0,1) || 地支==年空亡.substr(1,1)) 神煞.push("年空亡");
    if (地支==日空亡.substr(0,1) || 地支==日空亡.substr(1,1)) 神煞.push("日空亡");


    // ******************************* 元辰 ***********************************
    var 大耗地支數;
    var 年支數=地支字轉值(命盤.年支.地支);

    if (命盤.陽男陰女=="陽男" || 命盤.陽男陰女=="陰女") {
        大耗地支數=地支滾動(年支數, 7);
        if(地支==地支數轉字(大耗地支數))神煞.push("元辰");
    }
    
    if (命盤.陽男陰女=="陽女" || 命盤.陽男陰女=="陰男") {
        大耗地支數=地支滾動(年支數, 5);
        if(地支==地支數轉字(大耗地支數))神煞.push("元辰");
    }

} //end function 特殊的神煞

// **************************************************
function 神煞尋簡註(神煞原矩陣){
    //輸入神煞的矩陣，建立神煞矩陣with簡註
    //_.union([34,35,45,48,49], [48,55]);
    var 神煞矩陣=神煞原矩陣.slice();
    var 單一神煞 = [];
    var 神煞帶註解=[];
    var 神煞註解句;
    
    // *********** 神煞名稱 偷龍轉鳳 ****************
    if(神煞矩陣.indexOf("天羅")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("天羅"), 1, "天羅地網");
    if(神煞矩陣.indexOf("地網")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("地網"), 1, "天羅地網");
    if(神煞矩陣.indexOf("陰錯")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("陰錯"), 1, "陰錯陽差");
    if(神煞矩陣.indexOf("陽差")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("陽差"), 1, "陰錯陽差");
    if(神煞矩陣.indexOf("喪門")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("喪門"), 1, "喪門吊客");
    if(神煞矩陣.indexOf("吊客")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("吊客"), 1, "喪門吊客");
    if(神煞矩陣.indexOf("日空亡")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("日空亡"), 1, "空亡");
    if(神煞矩陣.indexOf("年空亡")>=0) 神煞矩陣.splice(神煞矩陣.indexOf("年空亡"), 1, "空亡");
    
    // remove duplicated 神煞
    $.each(神煞矩陣, function(i, el){ if($.inArray(el, 單一神煞) === -1) 單一神煞.push(el); });
    
    // 尋神煞註解
    var 神煞元件={"神煞": "", "神煞註解": ""};

    for(var i=0; i<(單一神煞.length -1); i++){
        神煞註解句=神煞簡註(單一神煞[i]);
        if(神煞註解句!="") {
            神煞元件={"神煞": 單一神煞[i], "神煞註解": 神煞註解句};
            神煞帶註解.push(神煞元件);
        } //end if
    } // end for
    return 神煞帶註解;
}

function 神煞簡註(尋神煞註解){
    //單一神煞簡註
    var 神煞資料 = [
        { "神煞": "天乙貴人", "註解": "《三命通會》：「天乙者，乃天上之神，在紫微恒闔門外，與太乙並列，事天皇大帝，下游三辰，家在鬥牛之次。。。較量天人之事，名曰天乙也，其神最尊貴，所至之處，一切兇殺隱然而避。」《燭神經》：「天乙貴人遇生旺，則形貌軒昂，性靈穎悟，理義分明，不喜雜術，純粹大器，身蘊道德，眾人欽愛。死絕則執拗自是，喜遊近貴。與劫煞並則貌有威，多謀足計。與官符並，則文翰飄逸，高談雄辨。與建祿並，則文翰純實，濟惠廣游，君子人也。」<br>《三車一攬賦》云：「天乙文星，得之聰明智慧」。《驚神賦》云：「日干座貴，一世清高」。天乙貴人，命中最吉之神，若人遇之則榮，功名早達，官祿易進，如命乘旺氣，終將登將相公候方位。大小運行年至此，亦主升官進財。一切加臨至此，皆為吉。凡貴人所臨之處，大概喜生旺無衝破，道理順天乙貴人遇天月二德最佳，得之者聰明智慧。日干坐貴，一世清高。天乙貴人最忌刑沖克害，空亡死絕之地，遇者為禍，福力減少，一生勞碌。辰戌為魁罡之地，貴人不臨，故辰戌二支無天乙貴人。<br>命有天乙貴人，遇事有人幫，臨難有人解，是逢凶化吉最有力的貴人之星。<br>遇吉神，則有喜上加喜之慶；遇凶煞，則有逢凶化吉之功！逢而為喜，富加且貴，是最吉之神。<br>凡人命遇之，昌榮有望；達人逢之，功名早顯。<br>天乙貴人入命：心性聰明，出入近貴。<br>大運、流年見天乙貴人：有生官、發財之機，最少亦有吉祥慶事加臨。<br>天乙貴人坐旺地：福增疾少，福祿加倍。<br>天乙貴人逢合為忌：多見勞苦，勞苦功高。<br>天乙貴人逢刑沖：多見勞苦，勞苦功高；遇事則貴人去。<br>女命，天乙貴人入命、日主自坐二德者：可嫁貴夫。"},
        { "神煞": "太極貴人", "註解": "《三命通會》：「太極者，太初也，始也，物造於初為太極，成也，收也。物有歸曰極，造化始終相保。乃曰太極貴人也。甲乙木造乎子，坎水而生，后終乎午，離火焚而死，丙丁火，先喜出乎震，卯也。后喜藏乎兌，酉也。庚辛金得寅，乃金生乎艮，見亥乃金廟乎乾。壬癸水先得申而生，后得巳而納。」<br>太極貴人，人命逢之，主聰明好學，有鑽勁，喜文史哲宗教等科目。為人正直，做事有始有終。如得生旺及有貴格吉星相扶助，主氣宇軒昂，福壽雙全，富貴人間。"},
        { "神煞": "十靈日", "註解": "入命主聰明靈敏，容易出名，能得名望高，博學才智佳，直覺敏銳，善於察言觀色、領悟力、善解人意等心性皆強。"},
        { "神煞": "三奇貴人", "註解": "凡命遇三奇，主人精神異常，襟懷卓越，好奇尚大，博學多能。帶天乙貴人者，勛業超群。帶天月二德者，凶災不犯。帶三合入局者，國家柱石。帶官符劫煞者，器識宏遠。帶空生旺者，脫塵離俗，富貴不淫，威武不屈。<br>三奇必須命局配合得體，並有其它貴人吉星，如天乙，天月德貴人扶持才有榮華福壽，如果只有三奇無貴地，命局逆亂不堪，勢必貧窮下賤被欺凌。三奇必須得時得地，不得死絕。帶元辰，桃花，天羅地網為無用。即使命局較清粹，若三奇不落貴地而落空亡，不是孤獨，即是蓬萊三島客，雲游四方了。<br>古歌云：「天上三奇甲戊庚，地上三奇乙丙丁，壬間三奇壬癸辛；人命若值三奇貴，狀元及第冠群英。」<br>《三命通會》云：「凡命遇三奇，主人精華異常，襟懷卓越，博學多能，好奇尚大；帶天乙貴人者，勛業超群；帶天月二德者，凶災消散；帶三合入局者，國士良臣；帶空亡生旺者，林泉高士，誠上格也。」"},
        { "神煞": "文昌", "註解": "文昌多取食神之臨官為貴，為食神建祿之稱。文昌入命，主聰明過人，又主逢凶化吉。氣質雅秀，舉止溫文，男命逢著內涵，女命逢著儀容。好學新知，具上進心。一生近官利貴，不與粗俗之輩亂交。<br>文昌入命：心性聰明，出入近貴，氣質文雅，著重內涵，好學新知，一生可以近貴利官。<br>文昌坐旺地：福增疾少，福祿加倍，利科考，貴氣十足。<br>文昌逢合為喜：富加且貴。<br>文昌逢合為忌或逢刑沖：多見勞苦，勞苦功高。<br>主天資聰明，逢凶化吉。"},
        { "神煞": "魁罡", "註解": "辰為天罡，戌為河魁，乃陰陽絕滅之地，故名。辰是水庫屬天罡，戌是火庫屬地魁，辰戌相見為天沖地擊。魁罡格在日柱方能入格，其他三格不算，且不能沖破。魁罡格需日主健旺，也即以財官為喜用，因為魁罡格，具有攻擊性且格局雄壯，日主衰弱需印生，與魁罡性格相反，即不成為魁罡格了。古歌云：「魁罡四日最為先，疊疊相逢掌大權，庚戌庚辰怕顯官，戊戌壬辰畏財運。主人性格多聰慧，好殺之心斷不偏，倘有刑沖兼破害，一貧徹骨受笞鞭。」<br>身值天罡地魁，衰則徹骨貧寒，強則絕倫顯貴，魁罡聚會，發福非常。主為人性格聰明，文章振發，臨事果斷，秉權好殺。魁罡性嚴有操持。運行身旺發福百端，一見財官，禍患立至，或帶刑殺尤甚。倘日位獨處，刑沖克制重臨，必是小人，刑責不已，窮必徹骨。運臨財旺官旺處，主防奇禍，若月令見財官印綬，日主一位，即以財官印食取用，雖微破財，財官印食得位即無大害。<br>庚戌，庚辰二日無官星，若魁罡重疊有情，主富貴於名，但見財官則不成局，歲運再見財旺之鄉，禍不可測。<br>柱帶魁罡者，雖有領導才能，聲宏氣壯，且好權術，好勝心強，但婚姻終為不順。此外，如不遵紀守法，難免牢獄之苦。<br>魁罡日出生的命格，具有侵犯和攻擊的特質！能任魁罡霸氣者可以作威作福，不恰當者反遭飛來禍害。也就是八字身旺，有天時、地利、人和者，可以成就名利；八字身弱，又不得天時、地利、人和者，反被自作聰明或其霸氣所害。<br>魁罡坐命，心性剛強，聰明果斷，性不服輸，臨事果斷，惟是好殺。<br>魁罡身弱的八字：凡事最好不要強出頭，以免惹來不必要的飛來橫禍。<br>帶雙魁罡：秉權，好殺，具領導才能。<br>魁罡：如日位加臨者眾，必是福星。<br>魁罡坐命：性嚴有操持，而為人聰敏；必須身旺，才能任其霸氣。<br>古人說，魁罡入命的八字最好不要吃牛肉，並且適合修道養性以斷其霸氣傷人之性。<br>「魁罡四柱日多同，貴氣期來在此中；日主獨逢沖剋重，財官顯露福無窮。」<br>「戊戌庚辰殺最強，壬辰庚戌號魁罡；日加重者方為福，身旺逢之貴異常。」<br>「人帶魁罡性必強，鬼神愁立此身傍；如逢一位沖刑重，澈骨貧窮不可當。」<br>「魁罡四日最為先，疊疊相逢掌大權；庚戌庚辰怕官顯，壬戌壬辰見財連。主人性格多聰慧，好殺之心斷不偏；柱有刑沖兼破害，一貧徹骨受笞鞭。」"},
        { "神煞": "國印", "註解": "四柱帶國印者，主人誠實可靠，嚴守清規，照章行事，辦事公道。為人和悅,禮義仁慈，氣質軒昂。<br>如國印逢生旺，有其它吉星相助，不逢沖破克害，不僅可以有掌印之能，可亦為官掌實權。"},
        { "神煞": "華蓋", "註解": "《命理新論》云：「人命帶華蓋，必為聰明勤學，清靜寡欲,但不免較為孤僻。」<br>如果華蓋逢印綬而臨旺相，在官場一定有相當的地位，如果華蓋與空亡，或遭破壞，則不免為僧道或孤或寡，否則必過房入贅，或挾一技而走江湖了。」<br>《壺中子》云：「華蓋為藝術之星，主孤。」，《燭神經》說：「華蓋為庇蔭清神，主人曠達神清，性情恬淡寡欲，一生不利財物，惟與夾貴並則為福，清貴特達。」<br>《三車一覽》云：「華蓋重重，勤心學藝」，又說：「華蓋乃聰明之士」。古歌云:「生逢華蓋，主文章藝術。」<br>《通明賦》云：「華蓋臨身，定為方外之人，留心於蓮社蘭台，容膝於蒲圃竹偈。」<br>命帶華蓋星之人，性情恬淡，雅潔高致並主其人資質聰敏，富於文才與藝術性，其性情傾向於哲學，宗教。如果女命帶華蓋又帶桃花又帶貴人，則必為名歌星或名影星；如華蓋在時支可能是過房之子或入贅孤寡之命。<br>雙華蓋入命：命中多貴人。<br>華蓋為八字吉神：一生利官進貴，技藝出眾。<br>歲運華蓋逢刑沖：事職有動；若歲運不利，恐見災禍連連，甚或危害到生命。<br>華蓋帶將星，福氣深厚。<br>華蓋坐空亡、或逢刑沖：工作多起伏、變動。<br>華蓋在空亡、死、絕之地：最好速速修身養性，修習佛理，可保消災解厄。<br>女命，華蓋坐日支：形同寡宿。<br>凡人命中得之，多主孤寡；縱貴，亦不免孤獨也。<br>華蓋主孤寡，縱貴亦不免孤獨；所以華蓋遙空，偏宜僧道。<br>華蓋多，主辛苦。<br>印逢華蓋，主顯達。"},
        { "神煞": "將星", "註解": "命帶將星的人，給人權威不可侵犯的感覺，很自然的散發出一種無形、難以言喻的權威感，讓人一望而生敬畏之心。很多做官的人或工商高層主管八字裡面大都帶有將星，所以將星也同時稱為「將權」；八字帶有將星，稱做「將權入命」。<br>將星喜吉星相扶，貴殺加臨乃為吉慶。<br>若同亡神臨，為國家棟梁之臣，言吉星助之貴，更加貴墓庫，純粹不雜者，出將入相之格。<br>《古歌》云：「將星文武兩相宜,祿重權高足可知。」<br>凡命帶將星，如無破壞，主在官界顯達,四柱配合得宜，可以掌握權柄，以將星坐正官為佳。<br>如果坐七煞羊刃，則主掌生死大權。如從事其它事業，多成就卓越。<br>將星是一顆權力之星，具有組織領導指揮才能，有懾眾之威。<br>但死絕沖破者不利，若與凶星會合，則增凶星之氣，如命忌劫財，將星臨之，其害倍增。<br>將星入命：能文能武，一生有權柄威信，具有組織領導能力，必見掌權之機。<br>將星為真格：須正官、七殺有力，或印星有力。<br>將星入命，歲運為財官：大權在握，利祿亨通。<br>將星無破：財、官運亨通。<br>將星與亡神同現：才智過人，深具謀略，必是棟樑之才。<br>將星逢三合為忌神：一生多勞，其害倍增。<br>將星逢沖剋，權力、事職有變動。<br>古歌云：「將星文武兩相宜，祿重權高足可知。」雖為吉星；然與凶星會，亦足增凶星之氣燄，其害倍增也。"},
        { "神煞": "金輿", "註解": "金輿，金者，貴也。輿者，車也。故金輿有金車之象，為君子，貴人所乘之車，譬之君子居官得祿，須坐車以載之。<br>金輿為吉星，為華麗之車，是富貴之徵，為高官顯貴人所乘之交通工具，遇此之人福最殊，偏主聰明多富貴，性柔貌願，舉止溫和，一身清泰無虞。生日生時遇之為佳。所以，凡有福之人，男的遇之多妻妾，骨肉安泰，子孫茂盛。女的得之多富貴。<br>若金輿馬星同位，不僅騎馬坐車，更是車來人往，接送頻繁，八面威風。"},
        { "神煞": "天羅地網", "註解": "天羅地網，多主牢獄之災，大運流年遇之，於人不利。若天月二德解救無憂。"},
        { "神煞": "天赦", "註解": "天赦是逢凶化吉之星，能解人災禍。尤其對犯法之人，有寬大處理之可能。"},
        { "神煞": "拱祿", "註解": "《三命通會》云：「凡拱格，需日時同干，貴與月令通氣。運行身旺及貴祿旺地方大好，印綬傷官食神財運大吉。忌行沖破害或羊刃七殺傷了日時，拱不住貴氣，大忌填實空亡。譬如器皿，虛則能容物，實則無用。所以隻宜虛拱。完則能盛，破則無用，所以怕見空亡，歲運同。」<br>《古詩》云:「日時雙拱祿中庭，金匱藏珠格最清，至貴至高君子命，必須月令看支提，提綱有用提綱重，月令無神用此奇，所拱之位怕填實，又怕傷官在月支。羊刃重重來破格，如無此破貴無疑。」"},
        { "神煞": "祿神", "註解": "祿，爵祿也，當得勢而享，乃謂之祿。祿為養命之源。祿落空亡或犯沖謂之破祿，如取以為用，又不得吉神解厄，貴人停職剝官，常人衣祿不足；或月支建祿，貧祖無屋，拋鄉離故，奔走他方營謀。"},
        { "神煞": "天醫", "註解": "天醫是掌管疾病之事的星神。四柱逢天醫，如不旺，又無貴人吉神相扶，不是常患疾病就是身弱無力。<br>若生旺又有貴人相生助，不僅身體健壯，而且特別適合從醫、心理學，哲學等。<br>天醫入命，學習力、理解力、觀察力、模仿力、好奇心、研究心、直覺觀等能力皆強。<br>《理通鑒》云：天醫拱照，可作良醫。"},
        { "神煞": "金神", "註解": "《相心賦》云：「金神貴格，火地奇哉，有剛斷明敏之才，無刻薄欺瞞之意。」柱中有火，不行火鄉難發，原局火無力，逢火運顯貴。<br>「金神入火鄉，富貴天下響」，「金神遇火威震邊疆」。<br>金見水則沉，故金神不喜水鄉，不利西北；金神喜見財，行財運則發；財運雖美，火鄉更妙。"},
        { "神煞": "羊刃", "註解": "《三車一攬》云：「羊，言剛也；刃者，取宰割之義。祿過則刃生，功成當退不退，則過越其分。如羊之在刃，有傷也。」<br>身強不喜羊刃，因為羊刃能奪財，劫官，破壞八字的富貴氣。如果日干不強，有七殺駕羊刃，則主此人武貴非凡，掌生殺之大權。歲運旺的時候，自然轉禍為福，若命局有刃有印無殺，歲運逢殺的時候也可成福。<br>羊刃格印重身強，若再見刑沖，原局沒有足夠的食傷或官殺貼近日主克制泄化，性格大多性急剛惡，沖動暴戾，外貌溫和，內情執拗，自以為是，對別人採取不信任的態度，主觀意識很強，不輕易採納別人意見，思想容易走極端。年支遇羊刃。<br>主破祖先遺業，或有以怨報德的趨勢。月支遇羊刃。主性情乖僻。日支遇羊刃。主性急暴躁，遇事易頭腦發漲，沉不住氣，另配偶多疾病。時支遇羊刃。<br>見財官則為禍不淺，歲運相沖並相合，則災禍勃然臨門。《喜忌篇》云：「劫財羊刃，切忌時逢，歲運並臨，災殃立至。」<br>八字有羊刃，古人說是「命中帶刀」，如果這把刀並非命中所喜，則是一件很不利的事情！輕者不利六親，嚴重者一生難免牢獄、血光之災不離身，尤其羊刃是八字忌神。<br>羊刃命裡多見或太強旺，身旺的命格：性情容易變得急燥、凶暴，喜歡結交惡友、小人，一生難免惹事生非、徒生是非；做事會不擇手段，甚至為了達到目的會不顧情份、反目無情。常見到有人做出殺害父母、妻子、兒女的人，很多都是這種命格。<br>羊刃入命：錢財不容易留住，一生防小人暗害的意外之災。<br>身弱而得羊刃助身、或者羊刃得到適當制伏、五行中和的八字，只要有歲運、流年的配合，將會有很不錯的發展。<br>古人說：「羊刃忌神逢沖剋，必作無頭之鬼，有極凶之災。」人命八字、流年、大運最怕碰到羊刃；運走羊刃之地，縱不見奇災臨難，亦將見及財物耗散之憂。<br>羊刃入命：主破財；年為祖上，月為父母，日為夫妻，時為子女。<br>年坐羊刃：祖業破敗。<br>月令坐羊刃：生性乖張，不與人同。<br>日坐羊刃：妻多疾厄災事。<br>時帶羊刃：剋妻、害子，五十歲後易遭奇災、禍害。<br>羊刃為忌：是非多災，生性暴烈，乃知恩反怨之人。<br>身旺見刃：災禍橫生，歲運再逢更凶。<br>身旺羊刃見刑沖：破耗財及災訟，尤歲運再逢。<br>身弱財旺、或從勢格：歲運行刃地主進財，但須防病災之厄。<br>身旺羊刃駕殺：心毒言詐。<br>身弱羊刃駕殺：事職有成，自主心強旺，為人專制，性乏妥協；運行正官、正印，貴不堪言，然爭訟不免。<br>羊刃與七殺同柱：縱富貴亦不久。<br>身旺羊刃駕殺，柱見官星：多為兄弟人，一生多見官訟；尤歲運再逢羊刃。<br>羊刃與正印同柱：恐見殘疾在身，歲運行羊刃亦同。<br>歲運羊刃為喜：災禍不免。<br>歲運羊刃為忌：破財災現連連，甚有血光、大難發生。<br>歲運羊刃逢沖：多見死於非命，殘局收場；尤日刃格。<br>羊刃刑沖太歲：重禍臨身。<br>羊刃逢刑沖：災禍，破耗財。<br>身弱羊刃逢合：能巧多勞。<br>羊刃、元辰同柱為忌：為人殘暴，毫無良心；甚者殺人。<br>羊刃、元辰同現為忌：與同柱相比情形較輕。<br>女命，羊刃沖剋夫星：不利姻緣、或離異。<br>羊刃乃旺極之氣也；弱者喜刃，旺者忌刃。經云：「殺刃兩停，位至王侯。」又云：「身強遇刃，災禍勃然。」<br>《說文》云：「刃，刀堅也。」象刀有刃之形，古人以極盛之處曰羊刃；蓋言其至剛至堅，臨於危險邊緣也。"},
        { "神煞": "亡神", "註解": "亡神，亡者，失也，自內失之謂之亡。<br>劫在五行絕處，亡在五行旺處。亡神臨財局為財旺，臨官局為官旺，臨印局為印旺，臨傷官局為泄氣。<br>《三命通會》云：「亡神吉則峻歷有威，謀略算計，料事如神，事不露機，兵行詭詐，始終爭勝，言事折辯，壯年進用，則生旺與貴煞並也。凶則性燥心窄，顛詐狂妄，浮蕩是非，酒色風流，官符獄訟，兵刑責難，即死絕與惡煞並也。<br>若貴人建祿並，專弄筆硯，撰飾文詞，因公起家，干涉官利或為胥徒。」<br>亡神入命，為八字凶神的人會讓人變得魂不守舍、有魂無體，作起事來總感覺無精打采，特別不利家運，一生免不了爭紛是非；嚴重者只怕有官司、牢獄之災，容易涉足酒色風月場所。<br>男命不利妻子、兒女，女命不利夫運又刑傷子女。<br>亡神入命：城府多深，做事疑慮。<br>亡神與天乙貴人同現：老謀深算。<br>亡神為喜：面有威儀、足智多謀、處事嚴謹、斷事如神，是一個真人不露相的人。<br>最怕亡神是命中凶忌之神：其人心性難定、氣量變小、事難如願、脾氣粗俗。<br>《三命通會》云：「以年為主，日時見之重，月見之輕。」<br>古歌云：「亡神入命禍非輕，用盡機關心不寧。」亡者失也，自內失之謂之亡，乃在五行臨官之地也。"},
        { "神煞": "劫煞", "註解": "劫者，奪也，自外奪之謂之劫。劫煞又名大耗。<br>古歌云：「劫煞為災不可當，徒然奔走名利場，須防祖業盡消亡，妻子如何得久長，。。。。。。劫神包裹遇官星，主執兵權助聖明，不怒而威人仰慕，需合華夏得安榮。」<br>《三命通會》說：「劫煞吉則聰慧過人，才智超群，事不留行，胸羅萬象，高明爽邁，武德橫財。凶則昏濁邪侈，毒害性重，宿疾刑徒，兵刀折傷，執拗內狠，貪奪無情。」<br>劫煞一旦成為命裡忌神，最怕一生名利虛浮，做事總是事與願違，也有人一輩子錢財留不住，或是不論怎麼努力還是事業不順；再有流年、歲運不利，經常會碰上災劫橫禍發生，而且行為偏激怪異、思緒變得不清，很容易疑神疑鬼。<br>劫煞者：才智也，喜沖不喜合。<br>劫煞為喜：才智過人，生性俊秀，聰明，上進，勤勉，果斷。<br>劫煞為八字忌神：行事偏叵，庸人自擾，思想偏激，災劫橫生，名利虛浮。<br>劫煞逢合又化忌：思緒不清，災劫橫生，名利虛浮。<br>劫煞與貴星同柱：謀事有成。<br>劫煞與天乙貴人、或喜用神同柱：主人有才智。<br>劫煞與陽刃同柱：橫禍不免。<br>《三命通會》云：「以年為主，日時見之重，月見之輕。」古歌云：「劫煞為災不可當，徒然奔走利名場。」劫者奪也，自外奪之謂之劫；蓋劫在五行絕處也。《三命通會》：「劫煞吉則聰慧過人，才智超群，事不留行，胸羅萬象，高明爽邁，武德橫財。凶則昏濁邪侈，毒害性重，宿疾刑徒，兵刀折傷，執拗內狠，貪奪無情。」"},
        { "神煞": "災煞", "註解": "災煞是將星受沖克之煞，又名白虎煞。災煞怕克，生處卻見祥，四柱交加見，福少禍連綿。<br>此煞主血光橫死，在水火防焚溺，在土防墜落瘟疫。克身大凶，若有吉神相助，多有武權。"},
        { "神煞": "勾絞煞", "註解": "勾者，牽連之義，絞者，羈絆之名，二煞如亡劫當堂對沖。命帶勾絞煞，一生之中，人際關係很不好，與人相處意見很難偕同，經常會有無禮相向的事情發生，行年至此，亦口舌刑獄等事。<br>兩位全者重，一位輕，有官殺者重，無者輕。<br>身若克煞，多心路技巧，主掌刑法之任，或為將帥，專行誅戮。<br>勾絞煞犯命，對感情、婚緣也非常不利，爭吵、相害、怨恨等現象是常有的事。<br>勾或絞臨日與歲運逢之，主傷身破財等災事。"},
        { "神煞": "孤辰", "註解": "孤辰入命，生性多孤獨，孤枕獨眠。<br>男命：為人孤獨。女命：為人獨立。<br>男命，最怕孤辰落在財星之地、或日主的死絕之方：這現象造成緣份難偕久之憾，難免一生刑剋，內心多悽苦；尤其是孤辰、寡宿入命、又見空亡的八字，註定一生無人能靠、少人能依。<br>凡人命犯孤寡，主形孤肉露，面無和氣，不利六親。生旺稍可，死絕尤甚。與驛馬並，放蕩他鄉。與空亡並，自小無倚。<br>男命生於妻絕之中而逢孤辰，平生難於婚配。女命生於絕夫之位而遇寡宿，屢嫁不能偕老。男孤定為他鄉客，女寡定是異省婦。<br>孤寡如有貴神相扶，不至為害，甚至「孤辰寡宿帶官印，定做叢林領袖」。但婚姻不順尤為突出。<br>孤辰、寡宿也叫做「隔角煞」，又叫「絕情煞」；男怕孤辰，女怕寡宿。在年柱、月柱，與六親緣份淡薄，獨立自成之命；在日柱，夫妻、男女緣份淡薄；在時柱，與子孫緣份淡薄。<br>孤辰、寡宿同現：常見事與願違；凡事多見無所謂，乃四大皆空。八字最忌孤辰、寡宿同時入命。<br>命帶孤辰或寡宿，八字又有華蓋出現：是一個聰明絕頂的孤獨之人，具有特殊才華；很多藝術家、哲學家、五術家，或是修道者、和尚、尼姑、牧師、神父，都是這種命格。<br>命帶孤辰、寡宿的人，比較不具備交際能力與手腕，兄弟、朋友情誼也顯得有始無終；這就是「孤寡入，終須寂」的道理。所以八字有孤辰、寡宿的人，其實無須汲汲追求社交或過份接近喧囂人潮；養性獨處反而顯得怡然自得。"},
        { "神煞": "寡宿", "註解": "寡宿入命，孤枕獨眠，生性多孤獨。<br>男命：為人孤僻。女命：為人孤獨，老年孤單寂寥。<br>女命，最怕寡宿落在夫星之地，或日主的死絕之方：這現象造成緣份難偕久之憾，難免一生刑剋，內心多悽苦；尤其是孤辰、寡宿入命、又見空亡的八字，註定一生無人能靠、少人能依。<br>凡人命犯孤寡，主形孤肉露，面無和氣，不利六親。生旺稍可，死絕尤甚。與驛馬並，放蕩他鄉。與空亡並，自小無倚。<br>男命生於妻絕之中而逢孤辰，平生難於婚配。女命生於絕夫之位而遇寡宿，屢嫁不能偕老。男孤定為他鄉客，女寡定是異省婦。<br>孤寡如有貴神相扶，不至為害，甚至「孤辰寡宿帶官印，定做叢林領袖」。但婚姻不順尤為突出。<br>孤辰、寡宿也叫做「隔角煞」，又叫「絕情煞」；男怕孤辰，女怕寡宿。在年柱、月柱，與六親緣份淡薄，獨立自成之命；在日柱，夫妻、男女緣份淡薄；在時柱，與子孫緣份淡薄。<br>孤辰、寡宿同現：常見事與願違；凡事多見無所謂，乃四大皆空。八字最忌孤辰、寡宿同時入命。<br>命帶孤辰或寡宿，八字又有華蓋出現：是一個聰明絕頂的孤獨之人，具有特殊才華；很多藝術家、哲學家、五術家，或是修道者、和尚、尼姑、牧師、神父，都是這種命格。<br>命帶孤辰、寡宿的人，比較不具備交際能力與手腕，兄弟、朋友情誼也顯得有始無終；這就是「孤寡入，終須寂」的道理。所以八字有孤辰、寡宿的人，其實無須汲汲追求社交或過份接近喧囂人潮；養性獨處反而顯得怡然自得。"},
        { "神煞": "元辰", "註解": "元辰，又名大耗，別而不合之名。<br>陽前陰后，則有所屈，屈則事無所伸；陰前陽后，則直而遂，於事暴而不治，難與同事，故名元辰。<br>命帶元辰，思緒偏枯，生旺則落魄大度，不別是非，不分良善，顛倒鶻突。死絕則寒酸薄劣，形貌猬下，語言渾濁，不知羞辱，破敗坎坷，貪飲好情，甘習下流。<br>元辰入命：如臨風暴，諸事不詳，內心情境不能平靜。<br>人命逢之，形貌有陷（頭骨凸露、低鼻、大口、眼凶、腦凸、臀高、手腳僵硬、聲音沉濁）。若值生旺則外表大方，是非不分、善惡不辨，個性難以捉摸。死絕則寒酸、下流，語言渾濁、沒有羞恥觀念、破敗坎坷，自甘墜落。<br>元辰為忌見刑沖：如臨風暴，災侵之患，眼神銳利，露凶光，為人貪杯；更見凶煞助旺，大難臨頭。<br>女命，元辰見刑沖：不識大體，不守禮法；尤再見劫煞。<br>元辰入命的男女，一生最怕情事、桃花或酒色之災，或見無妄之災，官司、牢獄之災亦或有之；但是，元辰逢合化解，亦多有論富取貴。<br>元辰在日，克配偶。<br>元辰與官符並見，會無緣無故受到挫折。<br>元辰與劫殺並見，男人做事不能注意小節，動招危辱，窮賤無恥。婦人聲粗雄，性糊塗，私通淫邪，不遵禮法，一生多災難，生子性拗不孝。<br>大運見之，十年可畏；流年見之，一年動搖顛倒；縱有吉星貴人扶持，亦不免福禍參半，喜憂無常。<br>八字或是歲運、流年，元辰逢合而質變：為喜則見吉慶加臨，為忌則更助其凶訊。<br>歲、運元辰逢沖：有凶訊，病災不免。"},
        { "神煞": "八專", "註解": "八專入命的人，大抵天干坐祿或冠帶，所以比較多情，很容易在平常的相處之中即讓自己不知不覺而陷入感情漩渦，很多畸情的發生未必命帶桃花。八專入命的男女性的能力較強，容易因酒、色而招來困擾。古人論命視八專為桃花的一種，因為命帶八專的人容易發生不為人知的戀情產生。"},
        { "神煞": "九醜", "註解": "九醜坐命，感情多有爭端，為人多情，易見產厄。男命：短壽，不得善終。女命：防產厄。<br>九醜入命的男女，感情的心路歷程勢必會有不為人所知的疑惑或辛酸，或有婚外情或是畸情戀曲的發生。<br>不為人知、不能公開，是九醜的心情寫照。"},
        { "神煞": "陰錯陽差", "註解": "陰錯陽差坐命，行事陰陽顛倒，多有事成反敗之虞，諸事多見在陰錯陽差下，或完成、或結束。<br>男命：不利妻財，敗家。女命：翁姑不合，不利外家，克夫運、不利子息。<br>事與願違，是陰錯陽差最好的解釋。很多事情的發生，總是來得莫名其妙，也發生得無能抗拒。<br>古人稱此煞為陰差陽錯煞，其意相同。此煞影響人命最大的是在於人際關係的變壞以及錢財的虛花耗費，很多人不論如何努力，就是很難達成心中的理想。<br>女子逢之，公姑寡合，妯娌不足，夫家冷退；男子逢之，主退妻家，也與妻家是非寡合。<br>其煞不論男女，月日時兩重或三重犯之極重，日上犯之主不得外家之力，縱有妻財亦成虛花，久后仍與妻家為仇，不相往來。<br>陰陽差錯因孝娶，外祖兩重或入贅，不然決要克其妻，或者殘房來作婿。<br>陰陽差錯不風流，花燭迎郎不自由，不是寒房因孝娶，殘房入宿兩家仇。"},
        { "神煞": "四廢日", "註解": "命遇四廢，主身弱多病，做事無成，有始無終。如不遇生扶，又受克害，凶煞制者，主傷殘，官司口舌，甚至牢獄之災，或為僧道之人。"},
        { "神煞": "空亡", "註解": "《三命通會》說：「凡帶此煞生旺，則氣度寬大，動招虛名，長大肥滿，多意外無心之福，死絕則一生成敗漂泊，但在我有氣之地，則不能為禍。大忌干支與空亡相合，是謂小人得位，則奸詐譎詭，靡所不為。若為我克，是為空亡受殃，反為特達之福。其神性無常，與官符並，則佞媚多文；與劫煞並，則狡勇；與亡神並，則飄蓬；與大耗並，則顛倒唐突；與建祿並，一生起伏。惟夾貴華蓋三奇學堂並者，則為大聰明脫俗之士。」<br>空亡見三會，三合，六合不作空亡論。吉神空而喜見合，凶星空而忌見合。<br>空亡在年支上，一是祖業空，二是母空，或辭世，或改嫁，或出走遠離，或母不顧子。<br>空亡在月支上，多主無兄弟姐妹，或兄弟姐妹無靠。<br>時值空亡多拗性，更遇華蓋決主少子。<br>胎元支落空亡。昏蒙飄零。<br>命中有空亡與咸池，沐浴多者是野鄙藝人.若空亡與貴人，華蓋一齊出現，則此人有大智慧，性情恬淡，品德清高，具有追求真理與智慧的超凡入聖之士，每易為世人欽仰與皈依。<br>空亡入命，為八字忌神：判斷多誤，事易差錯，人多迷糊，乏主見；多有無心之過錯或是災殃，一生常見飄蓬破散。<br>古人說：「空亡入命，只怕萬事成空、心難如願。」總是事與願違、勞苦心力、怨難得志。空亡入命，制喜助凶，果然天命難違；是否如此，或吉凶福禍如何，依八字而論定。<br>帶雙空亡：修行出家之人，或見在家居士，多為吃齋人。<br>最怕時柱落空，八字有孤寡：註定一生孤獨，乃性拗、孤傲之人。<br>傷官與空亡同柱：一生做事多見憂擾。<br>食神與空亡同柱：福祿減壽。<br>正財與空亡同柱：做事辛苦，財錢不聚。<br>偏財與空亡同柱：一生無橫財。<br>正官與空亡同柱：不利公職，威信不足。<br>七殺與空亡同柱：權力難保。<br>空亡與正印同柱：潛心修道之人，一生終見黃袍加身。<br>比肩與空亡同柱：兄弟、朋友相交無情義可言。<br>劫財與空亡同柱：財錢難儲，有來去之患。<br>財星、祿神落入空亡之地：註定一生錯蒙飄零，顛倒耗損，無大作為。<br>空亡在喜用之地：喜神受制，失其功能。<br>空亡在忌神之地：助其凶猛，卻藏其凶訊。<br>空亡逢合化吉：初凶終吉。<br>空亡逢合化忌：始終皆凶。<br>空亡逢沖，則空亡去。<br>女命，食神與空亡同柱：子息少，甚者不孕。<br>女命，空亡與正官或七殺同柱：不利姻緣。"},
        { "神煞": "孤鸞", "註解": "孤鸞煞入命，不論男女，生活上難免顯得孤立，很多事必須獨立自主；不一定無緣，但很多人因孤鸞煞入命而難論婚嫁。八字有孤鸞煞入命，對婚緣很不利。<br>男命：傷妻，夫妻多紛爭，外遇多見。女命：傷夫，夫妻多紛爭，多見外遇，難得良緣，多為晚婚；須防家庭暴力，身體易見傷痕，主女寡而男孤。<br>命犯孤鸞煞，主婚姻不順。<br>「孤鸞犯日本無兒， 一見官星得子奇， 運遇旺鄉名姐妹， 臨風惆悵綠樓時。」"},
        { "神煞": "福星", "註解": "命中帶有福星貴人，遇事不為凶，更有逢凶化吉的福氣，一生可以享受優遊福祿；如果再有歲運、流年的配合，可以肯定是一個福祿興昌、榮華耀祖的命；縱然不得歲運、流年的扶助，也可以享受平安快樂的生活。所以，福星貴人是很高貴的吉星。"},
        { "神煞": "天廚", "註解": "天廚乃「食神建祿」之宮，食神是人命福星；食神既能得祿，其福必厚，故謂之「天廚」。<br>天廚貴人入命，可以享天降之祿、得天賜之福，是一個得福又得祿的吉星。八字帶有天廚貴人的命，一生大都能夠平安吉順，遇事可以逢凶化吉、福祿優遊。"},
        { "神煞": "喪門", "註解": "八字帶有喪門、弔客的命格，先天不利六親。年柱、月柱帶者，三十五歲前刑傷父、母、祖上；日柱、時柱帶者，三十五歲後不利六親、兄弟。"},
        { "神煞": "日刃", "註解": "主人性剛果毅，為人易受打擊，乃脆弱之人；心性多急，兇暴多殘，喜親近惡黨。生旺稍可；一旦身弱死絕，多犯無妄之災，沉淪九流，常見勞苦迫害，難得安逸之日。女命，日刃格，婚姻欠佳。"},
        { "神煞": "學堂", "註解": "又稱「官貴學堂」，八字帶學堂的命格，大都詩書能讀，有很好的記憶力，行為舉止無形間給人一種高貴氣質的感覺，很多高學歷，甚至達官顯貴之人。<br>八字都有學堂貴星的加臨。八字如果見到文昌又有學堂，可以說是一個貴氣十足的命格；而其中只要見到一位，一般都很能讀書，一生當中也都能夠逢凶化吉，增福添祿。<br>賦云︰「聰明坐學堂」。"},
        { "神煞": "桃花", "註解": "桃花主人緣，入命情緒起伏大，為人多情，善交際、好花錢、慾望強，易耽於酒色，桃花易犯；一生須防情事風波危害，並防酒色之災。<br>桃花在年月：稱為「內桃花」，主夫妻恩愛。<br>桃花在日時：稱為「外桃花」，主夫妻多紛爭；尤歲運再逢。<br>時上桃花：桃花最強，晚節不保。<br>桃花入命，干見殺星：為人多情、縱慾。<br>桃花與祿神同柱：有異性緣。<br>桃花與陽刃同柱：色慾風波，是非多災。<br>桃花與空亡同柱：人緣有欠缺之憂，註定一生為情多苦。<br>桃花與元辰同現、或桃花逢刑沖：多為財、色招惹災迍。<br>不易犯桃花者：桃花坐空亡、命不帶桃花。<br>男命，桃花合祿：一生多有女貴人，多見助益。<br>男命，桃花與祿神同柱：能得桃花之助力。<br>女命，流年、大運見桃花刑沖：不利姻緣，注意感情糾紛多事。"},
        { "神煞": "驛馬", "註解": "命帶驛馬的人比較閒不下來，經常總是把自己弄得很忙，古人說：「驛馬入命，心不安閒！」。<br>驛馬為喜用：心高氣爽，動則有喜；四柱財官有力。<br>驛馬為喜用，自坐財官地：歲運逢財、官星，主升遷。<br>吉神坐馬：有超遷之喜或順動之利。<br>凶神坐馬：勞苦奔波。<br>驛馬坐旺地：利祿亨通。<br>馬星生財者：有名揚之機。<br>驛馬與財星同柱：為喜則財源廣進，為忌則勞碌奔波。<br>驛馬與財、官、貴人同柱：才是真馬。<br>驛馬與正官同柱：為喜者，風儒雅士；為忌者，傷風敗俗。<br>驛馬坐七殺，帶陽刃或劫煞：災傷不輕。<br>流年驛馬逢沖：此年多奔波，有遷異職動之機，並多見出國或遠行。<br>驛馬逢沖：心猿意馬，奔波，忙碌，乃天涯之客。<br>驛馬為忌且逢沖：是非波動。<br>驛馬逢沖，帶陽刃、元辰、空亡：防血光、病災。<br>驛馬沖動，帶陽刃、血支等凶煞：最宜諸事小心。<br>驛馬見合：有牽制之慮。<br>驛馬坐死、墓、絕、陽刃、劫煞：做事有始無終，一生飄泊無定，事業少成。<br>驛馬自坐絕地：凶，尤歲運再逢沖。<br>驛馬自坐死、絕方：做事少成，有頭無尾。<br>桃花坐馬：為色受難。<br>驛馬坐劫煞或陽刃：勞碌奔波，心性多衝動；尤歲運再逢。<br>劫煞坐馬：災傷小心。<br>男命，驛馬自坐財星：娶他鄉富女。<br>女命，驛馬與天乙貴人同柱：不利姻緣。<br>女命，驛馬坐獨官：夫為有用之人，兒孫亦同。<br>女命，驛馬自坐官、殺：嫁遠鄉。<br>驛馬雖為吉星，然命中有此，亦多奔波勞頓。<br>驛馬會吉星則更增其吉，遇所喜之辰，或財、官、印綬，皆主速發；遇凶星則凶。<br>驛馬帶劍鋒，則為馬頭帶劍，主有鎮守邊疆之望；以庚辛金或納音金為佳。<br>驛馬主勞碌好動；如吉神為馬，大則超遷之喜，小則順動之利；凶神為馬，大則奔蹶之患，小則馳逐之勞。<br>驛馬逢沖，譬之加鞭；遇合，等於掣足；行運、流年亦然。"},
        { "神煞": "紅艷", "註解": "紅艷入命，一生須防情事相傷！<br>女命，紅艷坐喜神：凶訊暗藏不顯。<br>女命，紅艷坐忌神：較無貞操觀念，浪漫淫奔；尤歲運再逢。<br>女命，紅艷與正官或正印同柱：乃良婦也。<br>女命，紅艷與七殺同柱：易見外遇，不利姻緣。<br>女命，紅艷逢沖：須防病災、血光。<br>女命，紅艷逢合：桃花不斷。<br>女命，紅艷坐凶煞：必見桃花災。<br>凡女命帶之，多主人見人愛，生性風流。<br>「多情多慾少人知，六丙逢寅辛見雞；癸臨申上丁見未，眉開眼笑樂嘻嘻；甲乙午上庚見戌，世間只是眾人妻；戊己怕辰壬怕子，祿馬相逢作路妓；任是富豪宦官女，花前月下亦偷期。」"},
        { "神煞": "金轝", "註解": "金轝，又稱「金轝祿神」，此星入命能得蔭福扶助，一生能得富貴。女人逢之，幸福安吉、骨肉安泰；男人逢之，得賢妻妾、享妻錢財，榮富顯貴。古代皇族，多帶此星。<br>男命，命帶金轝：得祖蔭之貲。<br>男命，日坐金轝：能得異性之助。<br>女命，命帶金轝：有祖德之蔭，人緣好、財源豐。<br>女命，日坐金轝：能得異性之助。"},
        { "神煞": "喪門吊客", "註解": "《喪吊煞》，又稱「鎖關煞」，也叫做「索命煞」或「討命煞」。<br>八字帶有喪門、弔客的命格，先天不利六親。<br>年柱、月柱帶者，三十五歲前刑傷父、母、祖上；日柱、時柱帶者，三十五歲後不利六親、兄弟。<br>古歌云︰「橫關一煞知多少，歲月最怕命來傷；縱有吉星來照會，不遭刑戳也傾倒。」，尤其又有凶煞併臨、刑沖剋害於歲運不利之地，凶禍必到。<br>大運、流年遇喪吊，須防孝服、或喪六親。<br>《三命消息賦》云：「喪吊臨人，變宮商為薤露。」人為人元，宮商為唱曲，薤露為挽歌。流年、運限遇喪、吊星入宅墓宮，主喪服之憂。"},
        { "神煞": "日貴", "註解": "貴氣聚於日，更有財官印食，相助貴氣為福。<br>日貴坐命：主為人純粹，有仁德，有姿色，不傲物氣高，有慈祥愷悌之號，德行尊重之名。<br>「日貴支干一位同，空亡大忌帶官沖；仁慈廣德多姿色，會合財官空自崇。」<br>「丁日豬雞癸兔蛇，刑沖破害漫咨嗟；財臨會合方成貴，終始合建乃是佳。」<br>「癸丁蛇卯屈豬雞，官被刑沖禍必隨；純粹施為有仁德，尊崇富貴出希奇。」<br>「日貴看來是兔蛇，格生亥酉越堪誇；刑沖不遇空亡位，輔佐功勳在帝家。」<br>流年犯之尤凶，若有帶羊刃來助殺氣，則為「橫關」。<br>古歌曰：「橫關一殺少人知，月祿凶神又及時；縱有吉星重疊至，不遭刑戮也傾危。」<br>大抵喪、吊星逢之是主喪服、破財之事。"},
        { "神煞": "日德", "註解": "日德俱多，福必豐厚，運行生旺，大是奇絕；若有財官加臨，別尋他格，正能免非橫之禍。<br>日德入命，主人性格慈善。<br>日德者：其福要多，忌刑沖破害、官星、財旺，加臨會合。但怕空亡而忌魁罡；此數者，乃格之大忌也。<br>「壬戌庚辰日德宮，甲寅戊丙要騎龍；運逢身旺心慈善，日德居多福自豐。」<br>「刑沖破害官財旺，空與魁罡會合凶；剋戰孤貧危險甚，縱交發跡命還終。」<br>「甲寅壬戌與庚辰，丙戊逢辰日德真；不喜空亡嫌祿破，更逢破害與刑沖。」<br>「丙辰切忌見壬辰，壬戌提防戊戌臨；日坐庚辰與庚戌，甲寅還且慮庚辰。」<br>「日德不喜見魁罡，化成殺曜最難當；局中重見須還疾，運限逢之必定亡。」<br>「日德重逢免禍殃，官星切忌見財鄉；更無沖破空刑物，堪作朝中一棟樑。」"},
        { "神煞": "金神", "註解": "金神坐命，其人有剛斷明敏之才，倔強不可馴伏之志。<br>金神貴格：有剛斷明敏之才，無刻剝欺瞞之心。<br>金神者：乃破敗之神，要制伏，入火鄉為勝；如四柱中更帶七殺陽刃，真貴人也。<br>金神入火鄉：名氣之格。<br>金神帶殺，身旺為奇；更行火地，名利當時。運行火鄉，四柱有火局，便為貴命；懼水鄉。<br>「甲午時上見金神，殺刃相臨真貴人；火木運中財祿發，如逢金水必傷身。」<br>「性多狠暴才明敏，遇水相生立困窮；制伏運行逢火局，超遷貴顯祿千鍾。」<br>「金神遇火貴無疑，金水災殃定有之；運到火鄉多發達，官崇家富兩相宜。」<br>「時遇金神貴氣多，如逢陽刃卻中和；若逢水運貧而疾，火制名高爵位峨。」<br>「癸酉己巳并乙丑，時上逢之是福神；傲物恃才宜制伏，交逢殺刃貴人真。」"},
        { "神煞": "天官貴人", "註解": "如日主生旺主半勤奮，公私分明，辦事認真，心性不貪，較有始有終，故得上司器重，在職場上較有升遷的機會。<br>但逢日主衰弱死絕，則為人好高鶩遠，做起事來三心二意，勞苦奔波，忙碌一生。<br>凡命局有天官貴人者，最適合從事公職，因盡忠職守，辦事細膩，所以皆有主官之職也。"},
        { "神煞": "十惡大敗", "註解": "「十惡大敗日」也叫作「無祿日」，主本身賺錢艱難，卻花錢如流水，一生錢財難聚。若地支逢沖，錢財消耗得更快，若是天剋地沖，則更為不吉，多主成少敗多，空費心機，不善理財，破財敗家等難以蓄財。"},
        { "神煞": "十干祿", "註解": "年支見祿為「歲祿」，月支見祿為「建祿」，日支見祿為「專祿」，時支見祿為「歸祿」；蓋即旺氣所居之意也。<br>祿神入命：予人有財、有富之感覺！一生重視錢財，有金錢觀念，精神力超強，腳踏實地，多見努力，企劃技術能力強；個性稍見內向，較不善交際，能得人望。<br>祿神在空亡之地：稱為「財庫落空」，一生做事只怕是有勞無功，虛名虛利，不足取食。<br>祿神逢沖：稱為「破祿」，就是一般所謂「破財」。祿神沖破，輕則耗財消災，重則生命垂危；大運、流年逢之，切不可輕言忽視，稍有不慎，將引致無法挽救之大難。<br>八字有祿有財：豐盈一生。<br>八字有祿無財：祖先庇蔭。<br>八字無祿有財：白手起家。<br>大運、流年與祿神相沖剋：有凶訊！小則破財，大則嚴重病災不免。<br>女命，祿神與桃花同柱：為異性多付出。<br>女命，祿神、陽刃同現：特別不利財錢與姻緣。"},
        { "神煞": "進神", "註解": "命帶進神，一生中發跡快，容貌多俊秀美麗或容光煥發。個性積極向前做事果斷。獨立自主，做事有成，好研究不肯退讓。但怕逢諸桃花星，男命則易因色破敗，或犯桃花劫；女命為很漂亮之美女，討人喜愛，但仍受桃花之困擾，或多情慾。<br>進神入命，主觀意識強烈、任性驕傲自負、不服輸、剛毅急躁，凡事進退有據。"},
        { "神煞": "退神", "註解": "命值退神，比較容易遭降薪或退職，行事推展不易也不順，成事較困難。做事如能有時退後，又以退為進或許較為有利，若欲強出頭，反招致失敗。"},
        { "神煞": "流霞", "註解": "古人稱為血煞、血支、血刃、流霞都和身體受到傷害有關；輕者皮肉傷折血光之災，重者會有生死意外之禍。血煞犯命的八字，一生難逃血光事件發生；只有輕重的區別。<br>流霞逢沖：易犯血光。<br>流霞逢沖：男命：酒色。<br>女命，流霞犯命：容易有產厄、血崩之災，生產必須注意大量流血的事情發生。<br>命犯血煞，最怕八字凶神帶重，大運、流年又走在凶煞沖剋之地：大部份的人都難逃劫數而傷殘或死亡。<br>血煞犯命，就是歲運走在流霞、血支、血刃的流年：不論輕重，或多或少都會有血光發生。在不利的流年歲月期間，外出、開車多加小心謹慎，防止意外發生的嚴重性增加。"},
        { "神煞": "血支", "註解": "血支入命，一生謹防血光、意外事生。"},
        { "神煞": "血刃", "註解": "血刃入命，一生謹防血光、意外事生。"},
        { "神煞": "六秀", "註解": "六秀坐命，主其人有秀氣，生性聰敏。"},
        { "神煞": "紅鸞", "註解": "紅鸞入命，異性緣、浪漫思想、靜態藝術色系組合能力皆強，較專情，桃花較花心。<br>鸞是鴛鴦配之意，喜是洋洋得意之意，命運或流年遇紅蠻天喜，主謀事求財，一切順利，又主婚姻得成，夫妻和順。<br>紅鸞星動逢流年、大運入主命宮，要看此時男女雙方夫妻宮逢流年大運時會照的星曜是否吉利，如果都是吉星的話，婚姻通常能順水推舟。<br>歌訣：「紅鸞天喜入命宮，出入求財事事通，且看桃花開艷色，重重相遇貴人逢。」"},
        { "神煞": "天喜", "註解": "天喜入命，喜悅如意愉快之星，具有幽默感、親和力、人情味。<br>歌訣：「紅鸞天喜入命宮，出入求財事事通，且看桃花開艷色，重重相遇貴人逢。」"},
        { "神煞": "天德", "註解": "天德入命，智略優秀、榮譽心包容力皆強，凡事能逢凶化吉，貴人相助。<br>《子平賦》說：「印綬得同天德，官刑不至，至老無災。」凡八字中有天月二德，其人愷悌慈祥，待人至誠仁厚。煞帶天月德，明敏果決而仁厚，食傷帶天月德，聰明秀慧而仁厚。」《書云》：素食慈心，印綬逢於天德，良以秉性慈祥故也。二德以天德為重，月德次之，臨財官印綬，加一倍福力，日干尤吉。<br>《古詩》云：「天德原來大吉昌，若逢日時更為良，修文必定登科甲，庶俗營謀百事強。。。人命若逢天月德，百事所求多利益，士農工商各相宜，兄弟妻兒無克破。。。陰陽二命煞星通，化煞為權德在中，日時若逢天月德，男當一品女褒封。天月二德喜重逢，貴比汾陽富石崇，祖蔭豐肥承厚，不然少年步蟾宮。」<br>天德、月德比較趨向於一個人個性方面的表現；也就是說天德、月德談的是性格，而不是福份或貴氣之有無。<br>一般來說，八字有天德、月德入命的人，具有貴氣的特質，個性表現良善，行為處事坦白而無私，也可以說比較有慈悲心或者同情心。<br>《易經》云：「積善之家，必有餘慶！」所以天德、月德也具有遇事逢凶化吉的功能。<br>天月德助，處世無殃。臨財增財之吉、臨官增官之吉、臨煞而減凶。<br>陳喜庵云：「人命值此二德〔天德月德〕，吉者增吉，凶者減凶。臨於財官印食，福力倍隆。即臨梟殺劫傷，暴橫益化。若二德自遭沖剋，則亦無力。」"},
        { "神煞": "月德", "註解": "月德入命，人緣、社交緣、親和力、恭敬心、責任心、適應力皆強。<br>《子平賦》說：「印綬得同天德，官刑不至，至老無災。」凡八字中有天月二德，其人愷悌慈祥，待人至誠仁厚。煞帶天月德，明敏果決而仁厚，食傷帶天月德，聰明秀慧而仁厚。」《書云》：素食慈心，印綬逢於天德，良以秉性慈祥故也。二德以天德為重，月德次之，臨財官印綬，加一倍福力，日干尤吉。<br>《古詩》云：「天德原來大吉昌，若逢日時更為良，修文必定登科甲，庶俗營謀百事強。。。人命若逢天月德，百事所求多利益，士農工商各相宜，兄弟妻兒無克破。。。陰陽二命煞星通，化煞為權德在中，日時若逢天月德，男當一品女褒封。天月二德喜重逢，貴比汾陽富石崇，祖蔭豐肥承厚，不然少年步蟾宮。」<br>天德、月德比較趨向於一個人個性方面的表現；也就是說天德、月德談的是性格，而不是福份或貴氣之有無。<br>一般來說，八字有天德、月德入命的人，具有貴氣的特質，個性表現良善，行為處事坦白而無私，也可以說比較有慈悲心或者同情心。<br>《易經》云：「積善之家，必有餘慶！」所以天德、月德也具有遇事逢凶化吉的功能。<br>天月德助，處世無殃。臨財增財之吉、臨官增官之吉、臨煞而減凶。<br>陳喜庵云：「人命值此二德〔天德月德〕，吉者增吉，凶者減凶。臨於財官印食，福力倍隆。即臨梟殺劫傷，暴橫益化。若二德自遭沖剋，則亦無力。」"},
        { "神煞": "飛刃", "註解": "攻擊、意外、爭端、是非之星，出現在月時兩柱最嚴重。（除非有貴人星化解，最忌刑沖）"},
        { "神煞": "學士", "註解": "研究心、好奇心、探索欲、背誦能力。"},
        { "神煞": "隔角", "註解": "是非、口舌、糾紛、官非訴訟之星，若逢刑沖，必有官非訴訟牢獄之災。"},
        { "神煞": "德秀貴人", "註解": "德者，本月生旺之德；秀者，合天地中和之秀五行變化而成者也。德者，陰陽解凶之神；凡人命中得此德秀，無沖破克壓者，賦性聰明，溫厚和氣，若遇學堂，更帶財官，主貴，沖克力減。總之，德秀也是一種貴人，它能逢凶化吉，獻瑞呈祥，人命帶之，主內涵充實，精神爽朗，儀表清奇，才華出眾。"},
        { "神煞": "截路空亡", "註解": "命有截路空亡，作事多阻礙、難以推展進行、中途受挫、或白忙一場。表明人生定有一段阻滯時期，或有錯失良好機遇的事，或者是自己放棄某次轉折人生的機會，或者是由於客觀原因而不得不放棄它。在歲運遇到截路空亡時出國、上任、貿易、嫁娶、求財等事都沒有好結果。"},
        { "神煞": "胞胎日", "註解": "又名「受氣」，容易出名，最宜於影歌星、藝術家等名氣的職業。<br>《三命通會》云：「甲申、乙酉、丙子、丁亥、戊寅、辛卯、壬午、癸未，十日生人切不可遲言身弱遇鬼，但有依託，便為貴命」，生於正印之月令最佳。<br>經云：「胞胎逢印綬，祿享千鐘」，月、時之干有正印亦吉。身旺、財旺、官旺，是大富大貴之人。"},
        { "神煞": "天地轉殺", "註解": "物極而反謂之轉，旺連天干曰天轉，旺連納音曰地轉，謂之天地轉。<br>如春木旺之時，見乙卯乃天連天，謂之天轉。見辛卯乃旺連納音，謂之地轉。<br>夏乃火旺，見丙午爲天轉，見戊午爲地轉。<br>秋乃金旺，見辛酉爲天轉，見癸酉爲地轉。<br>冬乃水旺之時，見壬子爲天轉，丙子爲地轉。<br>地轉取納音爲是，其日最忌，上官受職、出行商賈、造作、嫁娶，必主凶。命逢此日，必主夭折。<br>天地轉殺是一種凶命，它的來源是盛極而轉衰，都是增一倍旺盛而帶來的災禍，是過猶不及的中庸哲學思想。官位高極顯赫，如不急流勇退，殺身之禍不遠了；家財萬貫，富裕至極，家破人亡為時不遠了。"},
        { "神煞": "垣城", "註解": "垣城是在日干的長生之處，得此星者多方妻子賢淑，多才藝，善持家。且美麗健康，端庄大方。垣城與馬星相合，主妻子有淫私之事。"}
    ];

    var 資料索引=_.findIndex(神煞資料, {神煞: 尋神煞註解});
    if (資料索引 != -1) {
        var 資料註解 = 神煞資料[資料索引].註解;
	    return 資料註解;
	} //end if
	else {
        alert(尋神煞註解 + ": 沒有搜尋到註解！");
        return "";
    } // end else
}