
// ******************** 計算命盤陰陽五行的數據 ***************************



function 八字全陰陽判斷(命盤){
    //純陰：1975年3月22日卯時
    //純陽：1968年8月18日寅時
    
    var 全純陰陽="";
    if(命盤.分析.陰陽五行.陰!=8 && 命盤.分析.陰陽五行.陽!=8) return "";
    
    var 地支純陽=["寅","申"];
    var 地支純陰=["丑","卯","未","酉"];  //丑、卯、未、酉
    var 地支=[命盤.年支.地支,命盤.月支.地支,命盤.日支.地支,命盤.時支.地支];
    
    if(命盤.分析.陰陽五行.陰==8){
        全純陰陽="八字全陰";
        if (_.difference(地支, 地支純陰).length == 0) 全純陰陽 = "八字純陰";
    }
    
    if(命盤.分析.陰陽五行.陽==8) {
        全純陰陽="八字全陽";
        if(_.difference(地支, 地支純陽).length==0) 全純陰陽="八字純陽";
    }

    return 全純陰陽;
}  //end function 八字全陰陽



// ************* 其他 ***************

function 判斷財庫(命盤){
    /*
　- 日柱天干為“甲、乙”，那你的財庫就是戌，假如八字的四個地支中有戌字，就說明你命裡有財庫。
　- 日柱天干為“丙、丁”，那你的財庫就是丑，假如八字的四個地支中有丑字，就說明你命裡有財庫。
　- 日柱天干為“戊、己”，那你的財庫就是辰，假如八字的四個地支中有辰字，就說明你命裡有財庫。
　- 日柱天干為“庚、辛”，那你的財庫就是未，假如八字的四個地支中有未字，就說明你命裡有財庫。
　- 日柱天干為“壬、癸”，那你的財庫就是戌，假如八字的四個地支中有戌字，就說明你命裡有財庫。
    */
    var 財庫地支, 財庫句子;
    var 財庫矩陣 = [];

    switch(命盤.日主){
        case "甲": case "乙":
            財庫地支 = "戌";
            break;
        case "丙": case "丁":
            財庫地支 = "丑";
            break;
        case "戊": case "己":
            財庫地支 = "辰";
            break;
        case "庚": case "辛":
            財庫地支 = "未";
            break;
        case "壬": case "癸":
            財庫地支 = "戌";
            break;
    }  //end switch

    for(i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].地支 == 財庫地支){
            命盤.分析.四柱.四柱數據[i].財庫 = true;
            財庫矩陣.push(i);
        }  //end if
    }  //end for

    switch(財庫矩陣.length){
        case 0:
            財庫句子 = "財庫為" + 財庫地支 + "，四柱不帶財庫。";
            break;
        case 1:
            財庫句子 = "財庫為" + 財庫地支 + "，落在"+四柱名稱(財庫矩陣[0])+"。";
            break;
        case 2:
            財庫句子 = "財庫為" + 財庫地支 + "，落在"+四柱名稱(財庫矩陣[0])+"與"+四柱名稱(財庫矩陣[1])+"。";
            break;
        case 3:
            財庫句子 = "財庫為" + 財庫地支 + "，落在"+四柱名稱(財庫矩陣[0])+"、"+四柱名稱(財庫矩陣[1])+"與"+四柱名稱(財庫矩陣[2])+"。";
            break;
        case 4:
            財庫句子 = "財庫為" + 財庫地支 + "，四柱皆是財庫。";
            break;
        default:
            alert("財庫計算錯誤 ！");
    }  //end switch
    return 財庫句子;
}  //end function 判斷財庫