function 三合命盤架構分析(命盤){
    // ----- main to aggregate all the structure analysis
    三合借宮分析(命盤, true);
    三合三方四正星曜分析(命盤);
    三合對星分析(命盤);
    三方四正諸星群分析(命盤);
    
    宮位格局分析(命盤);
    
    導入地支元件入人事宮(命盤);
    
    宮位分析中宮小結(命盤);
} // end function 三合宮位架構分析


// -----------------------------------------------------

function 三合借宮分析(命盤, 建立星曜組件){

    var 地支宮, 對宮;
    
    for(var i=0; i < 12; i++){
        地支宮 = 命盤.地支宮位[i];
        if(地支宮.無主星) {
            對宮 = 命盤.地支宮位[地支滾動(i, 6)];
            if(命盤.設定.借宮模式 > 0) {
                命盤.地支宮位[i].星曜借宮.主星 = 對宮.星曜.主星;
                if(命盤.設定.借宮模式 == 2) {
                    命盤.地支宮位[i].星曜借宮.六凶星 = 對宮.星曜.六凶星;
                    命盤.地支宮位[i].星曜借宮.六吉星 = 對宮.星曜.六吉星;
                    命盤.地支宮位[i].星曜借宮.祿馬星 = 對宮.星曜.祿馬星;
                    命盤.地支宮位[i].星曜借宮.四化星 = 對宮.星曜.四化星;
                    命盤.地支宮位[i].星曜借宮.空曜 = 對宮.星曜.空曜;
                    命盤.地支宮位[i].星曜借宮.雜曜 = 對宮.星曜.雜曜;
                    命盤.地支宮位[i].星曜借宮.博士星 = 對宮.星曜.博士星; 命盤.地支宮位[i].星曜借宮.將前星 = 對宮.星曜.將前星; 命盤.地支宮位[i].星曜借宮.歲前星 = 對宮.星曜.歲前星;
                } // end if 借宮模式 == 2，借完所有星曜
            } // end if 借宮模式 > 0
        } // end if 無主星
        
        命盤.地支宮位[i].星曜本宮 = 星曜組件重組(命盤.地支宮位[i].星曜);
        if(建立星曜組件) 命盤.地支宮位[i].星曜本宮借宮 = 星曜組件重組(命盤.地支宮位[i].星曜, 命盤.地支宮位[i].星曜借宮);
    } // end for i
    
} // end function 三合借宮分析


function 三合三方四正星曜分析(命盤) {
    //console.log(宮位轉換地支數(命盤, 5)); console.log(宮位轉換地支數(命盤, "夫妻宮")); console.log(宮位轉換地支數(命盤, "戌")); console.log(宮位轉換地支數(命盤, "大限父母宮", 3));
    //console.log(宮位相應方位(命盤, "財帛宮", "對宮")); console.log(宮位相應方位(命盤, "財帛宮", "左方")); console.log(宮位相應方位(命盤, "財帛宮", "右方"));
    
    for(var i=0; i < 12; i++){
        命盤.地支宮位[i].對宮 = 宮位相應方位(命盤, i, "對宮");
        命盤.地支宮位[i].左方 = 宮位相應方位(命盤, i, "左方");
        命盤.地支宮位[i].右方 = 宮位相應方位(命盤, i, "右方");
        命盤.地支宮位[i].左鄰 = 宮位相應方位(命盤, i, "左鄰");
        命盤.地支宮位[i].右鄰 = 宮位相應方位(命盤, i, "右鄰");
        命盤.地支宮位[i].六合 = 宮位相應方位(命盤, i, "六合");
        
        命盤.地支宮位[i].星曜三方 = 星曜加總(命盤.地支宮位[i].左方.星曜, 命盤.地支宮位[i].右方.星曜);
        命盤.地支宮位[i].星曜三方 = 星曜加總(命盤.地支宮位[i].星曜本宮, 命盤.地支宮位[i].星曜三方);
        
        命盤.地支宮位[i].星曜四正 = 星曜加總(命盤.地支宮位[i].對宮.星曜, 命盤.地支宮位[i].星曜三方);
    }  // end for
    
}  // end function 三合三方四正星曜分析


// .........................................................

function 三合對星分析(命盤) {
    var 判斷元件, 對宮地支數;
    
    for(var i=0; i < 12; i++){
        判斷元件 = 命盤.地支宮位[i];
        判斷元件.設定 = 命盤.設定;
        對宮地支數 = 地支滾動(i, 6);
        
        命盤.地支宮位[i].星曜架構.對星.昌曲 = 三合對星判斷(判斷元件, 命盤.星曜, "文昌", "文曲");
        命盤.地支宮位[i].星曜架構.對星.輔弼 = 三合對星判斷(判斷元件, 命盤.星曜, "左輔", "右弼");
        命盤.地支宮位[i].星曜架構.對星.魁鉞 = 三合對星判斷(判斷元件, 命盤.星曜, "天魁", "天鉞");
        命盤.地支宮位[i].星曜架構.對星.祿馬 = 三合對星判斷(判斷元件, 命盤.星曜, "祿存", "天馬");
        命盤.地支宮位[i].星曜架構.對星.雙祿 = 三合對星判斷(判斷元件, 命盤.星曜, "化祿", "祿存");
        
        命盤.地支宮位[i].星曜架構.對星.羊陀 = 三合對星判斷(判斷元件, 命盤.星曜, "擎羊", "陀羅");
        命盤.地支宮位[i].星曜架構.對星.火鈴 = 三合對星判斷(判斷元件, 命盤.星曜, "火星", "鈴星");
        命盤.地支宮位[i].星曜架構.對星.空劫 = 三合對星判斷(判斷元件, 命盤.星曜, "地空", "地劫");
        
        命盤.地支宮位[i].星曜架構.對星.三台八座 = 三合對星判斷(判斷元件, 命盤.星曜, "三台", "八座");
        命盤.地支宮位[i].星曜架構.對星.恩光天貴 = 三合對星判斷(判斷元件, 命盤.星曜, "恩光", "天貴");
        命盤.地支宮位[i].星曜架構.對星.台輔封誥 = 三合對星判斷(判斷元件, 命盤.星曜, "台輔", "封誥");
        命盤.地支宮位[i].星曜架構.對星.龍池鳳閣 = 三合對星判斷(判斷元件, 命盤.星曜, "龍池", "鳳閣");
        命盤.地支宮位[i].星曜架構.對星.紅鸞天喜 = 三合對星判斷(判斷元件, 命盤.星曜, "紅鸞", "天喜");
        命盤.地支宮位[i].星曜架構.對星.天福天壽 = 三合對星判斷(判斷元件, 命盤.星曜, "天福", "天壽");
        
        命盤.地支宮位[i].星曜架構.對星.天殤天使 = 三合對星判斷(判斷元件, 命盤.星曜, "天殤", "天使");
        命盤.地支宮位[i].星曜架構.對星.天虛天哭 = 三合對星判斷(判斷元件, 命盤.星曜, "天虛", "天哭");
        命盤.地支宮位[i].星曜架構.對星.孤辰寡宿 = 三合對星判斷(判斷元件, 命盤.星曜, "孤辰", "寡宿");
        
        命盤.地支宮位[i].星曜架構.對星.太陽太陰 = 三合對星判斷(判斷元件, 命盤.星曜, "太陽", "太陰");
        delete 命盤.地支宮位[i].星曜架構.對星.太陽太陰.單見;
        delete 命盤.地支宮位[i].星曜架構.對星.太陽太陰.單見星;
        delete 命盤.地支宮位[i].星曜架構.對星.太陽太陰.不見;
        delete 命盤.地支宮位[i].星曜架構.對星.太陽太陰.夾忌;
        
        // ------------ 夾忌 --------------
        命盤.地支宮位[i].星曜架構.對星.羊陀.夾忌 = 命盤.地支宮位[i].星曜架構.對星.羊陀.相夾 && _.contains(命盤.地支宮位[i].星曜本宮借宮.四化, "化忌");
        命盤.地支宮位[i].星曜架構.對星.火鈴.夾忌 = 命盤.地支宮位[i].星曜架構.對星.火鈴.相夾 && _.contains(命盤.地支宮位[i].星曜本宮借宮.四化, "化忌");
        命盤.地支宮位[i].星曜架構.對星.空劫.夾忌 = 命盤.地支宮位[i].星曜架構.對星.空劫.相夾 && _.contains(命盤.地支宮位[i].星曜本宮借宮.四化, "化忌");
        命盤.地支宮位[i].星曜架構.對星.天殤天使.夾忌 = 命盤.地支宮位[i].星曜架構.對星.天殤天使.相夾 && _.contains(命盤.地支宮位[i].星曜本宮借宮.四化, "化忌");
        
        // ------------ 祿馬、雙祿 調整 --------------
        命盤.地支宮位[i].星曜架構.對星.祿馬.同宮相對 = (命盤.地支宮位[i].星曜架構.對星.祿馬.同宮 || 命盤.地支宮位[i].星曜架構.對星.祿馬.相對 || 命盤.地支宮位[i].星曜架構.對星.祿馬.對宮);
        命盤.地支宮位[i].星曜架構.對星.祿馬.天馬同宮 = (命盤.地支宮位[i].星曜架構.對星.祿馬.同宮相對 && 命盤.星曜.天馬.地支數 == i);
        命盤.地支宮位[i].星曜架構.對星.祿馬.天馬對宮 = (命盤.地支宮位[i].星曜架構.對星.祿馬.同宮相對 && 命盤.星曜.天馬.地支數 == 對宮地支數);
        命盤.地支宮位[i].星曜架構.對星.祿馬.祿存同宮 = (命盤.地支宮位[i].星曜架構.對星.祿馬.同宮相對 && 命盤.星曜.祿存.地支數 == i);
        命盤.地支宮位[i].星曜架構.對星.祿馬.祿存對宮 = (命盤.地支宮位[i].星曜架構.對星.祿馬.同宮相對 && 命盤.星曜.祿存.地支數 == 對宮地支數);
        命盤.地支宮位[i].星曜架構.對星.祿馬.單見天馬 = (命盤.地支宮位[i].星曜架構.對星.祿馬.單見 && 命盤.地支宮位[i].星曜架構.對星.祿馬.單見星=="天馬" && (命盤.地支宮位[i].星曜架構.對星.祿馬.天馬同宮 || 命盤.地支宮位[i].星曜架構.對星.祿馬.天馬對宮));
        
        delete 命盤.地支宮位[i].星曜架構.對星.祿馬.相夾;
        delete 命盤.地支宮位[i].星曜架構.對星.祿馬.夾忌;
        //delete 命盤.地支宮位[i].星曜架構.對星.祿馬.得;
        
        命盤.地支宮位[i].星曜架構.對星.雙祿.會 = (命盤.地支宮位[i].星曜架構.對星.雙祿.單見 || 命盤.地支宮位[i].星曜架構.對星.雙祿.三方四正); //單見或三方四正，總之有得到其中一顆祿
        命盤.地支宮位[i].星曜架構.對星.雙祿.坐 = 星曜矩陣所含星曜(命盤.地支宮位[i].星曜本宮借宮.所有 , ["祿存", "化祿"], "&&");
        命盤.地支宮位[i].星曜架構.對星.雙祿.坐祿星 = "";
        if(命盤.地支宮位[i].星曜架構.對星.雙祿.坐) 命盤.地支宮位[i].星曜架構.對星.雙祿.坐祿星 = (_.contains(命盤.地支宮位[i].星曜本宮借宮.所有, "化祿")) ? "化祿" : "祿存";
        
        
    }  // end for
    
} // end function 三合對星分析



function 三合對星判斷(判斷元件, 星曜元件, 星曜1, 星曜2) {
    // 對星：對星簡稱，比方 昌曲，魁鉞，輔弼 。。。。
    var 對星矩陣 = [星曜1, 星曜2];
    var 本宮對宮星曜 = 判斷元件.星曜本宮.所有.concat(判斷元件.對宮.星曜.所有);
    
    var 對星元件 = {
        //"對星": 對星,
        "星曜1": 星曜1,
        "星曜1地支數": 星曜元件[星曜1].地支數,
        "星曜2": 星曜2,
        "星曜2地支數": 星曜元件[星曜2].地支數,
        "同宮": false,
        "對宮": false,
        "相對": false,
        "相夾": false,
        "夾忌": false,
        "三方四正": false, "四正斜飛式": false,
        "三方": false, "三方蝴蝶式": false, "三方在偏方": false, "三方斜飛式": false,
        "單見": false,
        "單見星": "",
        "不見": false,
        "得": false, // 見於 三方四正 或 相夾
        "一星同宮": false, // 對星中有一顆星是同宮
        "備註": ""
    };
    
    // *********** 同宮、對宮、相對、相夾 ************
    對星元件.三方四正 = 星曜矩陣所含星曜(判斷元件.星曜四正.所有, 對星矩陣, "&&");
    
    對星元件.同宮 = 星曜矩陣所含星曜(判斷元件.星曜本宮.所有, 對星矩陣, "&&");
    對星元件.對宮 = 星曜矩陣所含星曜(判斷元件.對宮.星曜.所有, 對星矩陣, "&&");
    對星元件.相夾 = 星曜矩陣所含星曜(判斷元件.左鄰.星曜.所有, 對星矩陣, "||") && 星曜矩陣所含星曜(判斷元件.右鄰.星曜.所有, 對星矩陣, "||");
    對星元件.相對 = (!對星元件.同宮 && !對星元件.對宮 && 星曜矩陣所含星曜(本宮對宮星曜, 對星矩陣, "&&"));
    
    對星元件.三方 = 星曜矩陣所含星曜(判斷元件.星曜三方.所有, 對星矩陣, "&&");
    if(對星元件.三方) {
        對星元件.三方蝴蝶式 = 星曜矩陣所含星曜(判斷元件.左方.星曜.所有, 對星矩陣, "||") && 星曜矩陣所含星曜(判斷元件.右方.星曜.所有, 對星矩陣, "||");
        對星元件.三方在偏方 = 星曜矩陣所含星曜(判斷元件.左方.星曜.所有, 對星矩陣, "&&") || 星曜矩陣所含星曜(判斷元件.右方.星曜.所有, 對星矩陣, "&&");
        對星元件.三方斜飛式 = 星曜矩陣所含星曜(判斷元件.星曜本宮.所有, 對星矩陣, "||") && (星曜矩陣所含星曜(判斷元件.左方.星曜.所有, 對星矩陣, "||") || 星曜矩陣所含星曜(判斷元件.右方.星曜.所有, 對星矩陣, "||") );
        
        對星元件.三方 = !(!判斷元件.設定.三方對星在偏方 && 對星元件.三方在偏方);
    } // end if 對星元件.三方
    
    對星元件.四正斜飛式 = (對星元件.三方四正 && !對星元件.三方 && !對星元件.同宮 && !對星元件.對宮 && !對星元件.相對);  // 如果對星都在偏方，看設定決定是否符合條件
    
    對星元件.一星同宮 = (對星元件.三方四正 && 星曜矩陣所含星曜(判斷元件.星曜本宮.所有, 對星矩陣, "||"));
        
    對星元件.得 = (對星元件.三方四正 || 對星元件.相夾);
    
    if(!對星元件.三方四正) 對星元件.單見 = 星曜矩陣所含星曜(判斷元件.星曜四正.所有, 對星矩陣, "||"); // 沒有三方四正見對星，單見
    
    if(對星元件.單見) {
        if(_.contains(判斷元件.星曜四正.所有, 對星矩陣[0])) 對星元件.單見星 =  對星矩陣[0];
        if(_.contains(判斷元件.星曜四正.所有, 對星矩陣[1])) 對星元件.單見星 =  對星矩陣[1];
    }  // end if 對星元件.單見
    
    對星元件.不見 = !對星元件.三方四正 && !對星元件.單見;
        
    return 對星元件;
} // end function 三合對星判斷

// .........................................................


function 三方四正諸星群分析(命盤) {
    // 分析宮位三方四正說得的各類星群，比方有什麼煞曜，文曜、桃花曜、百官星曜 。。。。。
    var 地支三方四正星曜;
    var 中宮分析 = {"吉曜": [], "煞曜": []};
    var 對宮, 左鄰宮, 右鄰宮;
    
    for(var i=0; i < 12; i++){
        對宮 = 地支滾動(i, 6);
        //左鄰宮 = 地支滾動(i, 1);
        //右鄰宮 = 地支滾動(i, -1);
        
        地支三方四正星曜 = 命盤.地支宮位[i].星曜四正.所有;
        
        命盤.地支宮位[i].星曜架構.諸星群.四化 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.四化);
        命盤.地支宮位[i].星曜架構.諸星群.吉曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.吉曜);
        命盤.地支宮位[i].星曜架構.諸星群.祿曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.祿曜);
        命盤.地支宮位[i].星曜架構.諸星群.煞曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.煞曜);
        命盤.地支宮位[i].星曜架構.諸星群.桃花 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.桃花曜);
        命盤.地支宮位[i].星曜架構.諸星群.文曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.文曜);
        命盤.地支宮位[i].星曜架構.諸星群.科曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.科曜);
        命盤.地支宮位[i].星曜架構.諸星群.忌曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.忌曜);
        命盤.地支宮位[i].星曜架構.諸星群.刑曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.刑曜);
        命盤.地支宮位[i].星曜架構.諸星群.空曜 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.空曜);
        命盤.地支宮位[i].星曜架構.諸星群.刑耗 = 三方四正諸星群判斷(地支三方四正星曜, 命盤.定義.刑耗曜);
        
        
        // ************** 諸星群 分析 ****************
        // ------- 四化 -------
        命盤.地支宮位[i].星曜架構.諸星群.四化.坐祿 = _.contains(命盤.地支宮位[i].星曜本宮.四化, "化祿");
        命盤.地支宮位[i].星曜架構.諸星群.四化.坐權 = _.contains(命盤.地支宮位[i].星曜本宮.四化, "化權");
        命盤.地支宮位[i].星曜架構.諸星群.四化.坐科 = _.contains(命盤.地支宮位[i].星曜本宮.四化, "化科");
        命盤.地支宮位[i].星曜架構.諸星群.四化.坐忌 = _.contains(命盤.地支宮位[i].星曜本宮.四化, "化忌");
        
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科忌 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化祿") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化權") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化科") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化忌");
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化祿") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化權") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化科");
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿權 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化祿") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化權");
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿科 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化祿") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化科");
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿忌 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化祿") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化忌");
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿權忌 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化祿") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化權") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化忌");
        命盤.地支宮位[i].星曜架構.諸星群.四化.權忌 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化權") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化忌");
        命盤.地支宮位[i].星曜架構.諸星群.四化.權科 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化權") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化科");
        命盤.地支宮位[i].星曜架構.諸星群.四化.科忌 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化科") && _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化忌");
        命盤.地支宮位[i].星曜架構.諸星群.四化.會祿 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化祿");
        命盤.地支宮位[i].星曜架構.諸星群.四化.會權 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化權");
        命盤.地支宮位[i].星曜架構.諸星群.四化.會科 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化科");
        命盤.地支宮位[i].星曜架構.諸星群.四化.會忌 = _.contains(命盤.地支宮位[i].星曜架構.諸星群.四化.星曜, "化忌");
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿權夾 = 星曜矩陣所含星曜(命盤.地支宮位[i].左鄰.星曜.四化, ["化祿", "化權"], "||") && 星曜矩陣所含星曜(命盤.地支宮位[i].右鄰.星曜.四化, ["化祿", "化權"], "||");
        命盤.地支宮位[i].星曜架構.諸星群.四化.祿科夾 = 星曜矩陣所含星曜(命盤.地支宮位[i].左鄰.星曜.四化, ["化祿", "化科"], "||") && 星曜矩陣所含星曜(命盤.地支宮位[i].右鄰.星曜.四化, ["化祿", "化科"], "||");
        命盤.地支宮位[i].星曜架構.諸星群.四化.權科夾 = 星曜矩陣所含星曜(命盤.地支宮位[i].左鄰.星曜.四化, ["化權", "化科"], "||") && 星曜矩陣所含星曜(命盤.地支宮位[i].右鄰.星曜.四化, ["化權", "化科"], "||");
        
        // ------- 四化 吉化-------
        命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = false; 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "";
        if(!命盤.地支宮位[i].星曜架構.諸星群.四化.化忌) {  // 是否被四化吉化，不見化忌為首要條件
            if(_.contains(命盤.地支宮位[i].星曜本宮借宮.四化, "化科")) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "化科"; }
            if(_.contains(命盤.地支宮位[i].星曜本宮借宮.四化, "化權")) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "化權"; }
            if(_.contains(命盤.地支宮位[i].星曜本宮借宮.四化, "化祿")) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "化祿"; }
            
            if(命盤.地支宮位[i].星曜架構.諸星群.四化.權科夾) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "權科夾"; }
            if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿科夾) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "祿科夾"; }
            if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿權夾) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "祿權夾"; }
            
            if(命盤.地支宮位[i].星曜架構.諸星群.四化.權科) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "權科"; }
            if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿科) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "祿科"; }
            if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿權) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "祿權"; }
            if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科) { 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化 = true;  命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件 = "祿權科"; }
        } // end if 是否被四化吉化
        
        delete 命盤.地支宮位[i].星曜架構.諸星群.四化.分數;  //delete 命盤.地支宮位[i].星曜架構.諸星群.四化.不見; 
        
        // ------- 吉曜 -------
        var 吉曜分數 = 命盤.地支宮位[i].星曜架構.諸星群.吉曜.星曜.length / 2; // 看吉曜數量
        
            // ----- 雙星 -----
        if(命盤.地支宮位[i].星曜架構.對星.昌曲.相夾) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.輔弼.相夾) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.魁鉞.相夾) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.相夾) 吉曜分數 +=1; if(命盤.地支宮位[i].星曜架構.對星.祿馬.相夾) 吉曜分數 +=0;
        if(命盤.地支宮位[i].星曜架構.對星.昌曲.同宮) 吉曜分數 +=2.5; if(命盤.地支宮位[i].星曜架構.對星.輔弼.同宮) 吉曜分數 +=2.5; if(命盤.地支宮位[i].星曜架構.對星.魁鉞.同宮) 吉曜分數 +=2.5; if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.相夾) 吉曜分數 +=1.25; if(命盤.地支宮位[i].星曜架構.對星.祿馬.同宮) 吉曜分數 +=2; 
        if(命盤.地支宮位[i].星曜架構.對星.昌曲.對宮) 吉曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.輔弼.對宮) 吉曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.魁鉞.對宮) 吉曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.對宮) 吉曜分數 +=.75; if(命盤.地支宮位[i].星曜架構.對星.祿馬.對宮) 吉曜分數 +=1;
        if(命盤.地支宮位[i].星曜架構.對星.昌曲.相對) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.輔弼.相對) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.魁鉞.相對) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.相對) 吉曜分數 +=1; if(命盤.地支宮位[i].星曜架構.對星.祿馬.相對) 吉曜分數 +=1.5;
        if(命盤.地支宮位[i].星曜架構.對星.昌曲.三方蝴蝶式) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.輔弼.三方蝴蝶式) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.魁鉞.三方蝴蝶式) 吉曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.三方蝴蝶式) 吉曜分數 +=1; if(命盤.地支宮位[i].星曜架構.對星.祿馬.三方蝴蝶式) 吉曜分數 +=1; 
        if(命盤.地支宮位[i].星曜架構.對星.昌曲.三方斜飛式) 吉曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.輔弼.三方斜飛式) 吉曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.魁鉞.三方斜飛式) 吉曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.三方斜飛式) 吉曜分數 +=0.75; if(命盤.地支宮位[i].星曜架構.對星.祿馬.三方斜飛式) 吉曜分數 +=0.5; 
        if(命盤.地支宮位[i].星曜架構.對星.昌曲.四正斜飛式) 吉曜分數 +=1; if(命盤.地支宮位[i].星曜架構.對星.輔弼.四正斜飛式) 吉曜分數 +=1; if(命盤.地支宮位[i].星曜架構.對星.魁鉞.四正斜飛式) 吉曜分數 +=1; if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.四正斜飛式) 吉曜分數 +=0.5; if(命盤.地支宮位[i].星曜架構.對星.祿馬.四正斜飛式) 吉曜分數 +=0.5; 
        
            // ----- 見祿 -----
        if(命盤.地支宮位[i].星曜架構.對星.雙祿.同宮) 吉曜分數 +=4; 
        if(命盤.地支宮位[i].星曜架構.對星.雙祿.對宮) 吉曜分數 +=2; 
        if(命盤.地支宮位[i].星曜架構.對星.雙祿.三方蝴蝶式) 吉曜分數 +=3; 
        if(命盤.地支宮位[i].星曜架構.對星.雙祿.三方斜飛式) 吉曜分數 +=2; 
        if(命盤.地支宮位[i].星曜架構.對星.雙祿.四正斜飛式) 吉曜分數 +=1.5;
        
        if(!命盤.地支宮位[i].星曜架構.對星.雙祿.三方四正) {
            if(_.contains(命盤.地支宮位[i].星曜本宮.所有, "化祿")) 吉曜分數 +=2;
            if(!_.contains(命盤.地支宮位[i].星曜本宮.所有, "化祿") && _.contains(命盤.地支宮位[i].星曜四正.所有, "化祿")) 吉曜分數 +=1;
        } // end if 不.雙祿
        
        if(!命盤.地支宮位[i].星曜架構.對星.祿馬.三方四正) {
            if(_.contains(命盤.地支宮位[i].星曜本宮.所有, "祿存")) 吉曜分數 +=1.5;
            if(!_.contains(命盤.地支宮位[i].星曜本宮.所有, "祿存") && _.contains(命盤.地支宮位[i].星曜四正.所有, "祿存")) 吉曜分數 +=0.75;
        } // end if 不見祿馬
        
        
            // ----- 見小對星 -----
        if(命盤.地支宮位[i].星曜架構.對星.三台八座.三方四正) 吉曜分數 +=0.75;
        if(命盤.地支宮位[i].星曜架構.對星.恩光天貴.三方四正) 吉曜分數 +=0.5;
        if(命盤.地支宮位[i].星曜架構.對星.台輔封誥.三方四正) 吉曜分數 +=0.25;
        if(命盤.地支宮位[i].星曜架構.對星.龍池鳳閣.三方四正) 吉曜分數 +=0.25;
        
        命盤.地支宮位[i].星曜架構.諸星群.吉曜.分數 = 吉曜分數;
        命盤.地支宮位[i].星曜架構.諸星群.吉曜.吉化 = (吉曜分數 > 命盤.定義.吉化參數);
        
        
        // ------- 祿曜 -------
        delete 命盤.地支宮位[i].星曜架構.諸星群.祿曜.分數;
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.祿存地支數 = 命盤.星曜.祿存.地支數; 命盤.地支宮位[i].星曜架構.諸星群.祿曜.祿存地支 = 命盤.星曜.祿存.地支;
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.化祿地支數 = 命盤.星曜.化祿.地支數; 命盤.地支宮位[i].星曜架構.諸星群.祿曜.化祿地支 = 命盤.星曜.化祿.地支; 
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.坐祿 = (命盤.星曜.祿存.地支數 == i || 命盤.星曜.化祿.地支數==i);
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.坐生年祿 = 命盤.星曜.化祿.地支數==i; 命盤.地支宮位[i].星曜架構.諸星群.祿曜.化祿星 = 命盤.生年四化.化祿星;
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.祿照 = (命盤.星曜.祿存.地支數 == 對宮 && 命盤.星曜.化祿.地支數==對宮);
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.夾祿 = 命盤.地支宮位[i].星曜架構.對星.雙祿.相夾;
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.相對 = 命盤.地支宮位[i].星曜架構.對星.雙祿.相對;
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.得祿 = (命盤.地支宮位[i].星曜架構.諸星群.祿曜.星曜.length > 0);
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.雙祿 = (命盤.地支宮位[i].星曜架構.諸星群.祿曜.星曜.length ==2);
        命盤.地支宮位[i].星曜架構.諸星群.祿曜.祿馬交馳 = (命盤.地支宮位[i].星曜架構.對星.祿馬.三方四正 || 星曜矩陣所含星曜(命盤.地支宮位[i].星曜四正.所有, ["天馬", "化祿"], "&&"));
        
        // ------- 煞曜 -------
        var 煞曜分數 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.星曜.length / 2; // 看煞曜數量
        
            // ----- 雙星 -----
        if(命盤.地支宮位[i].星曜架構.對星.火鈴.相夾) 煞曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.羊陀.相夾) 煞曜分數 +=1.5; if(命盤.地支宮位[i].星曜架構.對星.空劫.相夾) 煞曜分數 +=1;
        if(命盤.地支宮位[i].星曜架構.對星.空劫.同宮) 煞曜分數 +=2; //if(命盤.地支宮位[i].星曜架構.對星.火鈴.同宮) 煞曜分數 +=2.5; if(命盤.地支宮位[i].星曜架構.對星.羊陀.同宮) 煞曜分數 +=2.5; 
        if(命盤.地支宮位[i].星曜架構.對星.空劫.對宮) 煞曜分數 +=1.5; //if(命盤.地支宮位[i].星曜架構.對星.火鈴.對宮) 煞曜分數 +=2.5; if(命盤.地支宮位[i].星曜架構.對星.羊陀.對宮) 煞曜分數 +=2.5;
        if(命盤.地支宮位[i].星曜架構.對星.空劫.相對) 煞曜分數 +=1.25; if(命盤.地支宮位[i].星曜架構.對星.火鈴.對宮) 煞曜分數 +=2; //if(命盤.地支宮位[i].星曜架構.對星.羊陀.對宮) 煞曜分數 +=0;
        if(命盤.地支宮位[i].星曜架構.對星.空劫.三方蝴蝶式) 煞曜分數 +=1.25; if(命盤.地支宮位[i].星曜架構.對星.火鈴.三方蝴蝶式) 煞曜分數 +=2.5; if(命盤.地支宮位[i].星曜架構.對星.羊陀.三方蝴蝶式) 煞曜分數 +=2.5;
        if(命盤.地支宮位[i].星曜架構.對星.空劫.三方斜飛式) 煞曜分數 +=1; if(命盤.地支宮位[i].星曜架構.對星.火鈴.三方斜飛式) 煞曜分數 +=2.25; if(命盤.地支宮位[i].星曜架構.對星.羊陀.三方斜飛式) 煞曜分數 +=2.25;
        if(命盤.地支宮位[i].星曜架構.對星.空劫.四正斜飛式) 煞曜分數 +=0.75; if(命盤.地支宮位[i].星曜架構.對星.火鈴.四正斜飛式) 煞曜分數 +=2; if(命盤.地支宮位[i].星曜架構.對星.羊陀.四正斜飛式) 煞曜分數 +=2;
            .5
             // ----- 見忌、天刑 -----
        if(_.contains(命盤.地支宮位[i].星曜本宮.所有, "化忌")) 煞曜分數 +=2;
        if(!_.contains(命盤.地支宮位[i].星曜本宮.所有, "化忌") && _.contains(命盤.地支宮位[i].星曜四正.所有, "化忌")) 煞曜分數 +=1;
        
        if(_.contains(命盤.地支宮位[i].星曜本宮.所有, "天刑")) 煞曜分數 +=0.5;
        if(!_.contains(命盤.地支宮位[i].星曜本宮.所有, "天刑") && _.contains(命盤.地支宮位[i].星曜四正.所有, "天刑")) 煞曜分數 +=0.25;
        
            // ----- 見小對星 -----
        if(命盤.地支宮位[i].星曜架構.對星.天殤天使.三方四正) 煞曜分數 +=0.25;
        if(命盤.地支宮位[i].星曜架構.對星.天虛天哭.三方四正) 煞曜分數 +=0.25;
        
        
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.分數 = 煞曜分數;
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞重 = (煞曜分數 > 命盤.定義.煞重參數);
        
        
        // ------- 空曜 -------
        var 空曜分數 = 命盤.地支宮位[i].星曜架構.諸星群.空曜.星曜.length / 2; // 看空曜數量
        
            // ----- 雙星 -----
        if(命盤.地支宮位[i].星曜架構.對星.空劫.相夾) 空曜分數 +=1; 
        if(命盤.地支宮位[i].星曜架構.對星.空劫.同宮) 空曜分數 +=2;
        if(命盤.地支宮位[i].星曜架構.對星.空劫.相對) 空曜分數 +=2;
        if(命盤.地支宮位[i].星曜架構.對星.空劫.三方) 空曜分數 +=2;
        if(!命盤.地支宮位[i].星曜架構.對星.空劫.三方 && 命盤.地支宮位[i].星曜架構.對星.空劫.三方四正) 空曜分數 +=1;
        
        命盤.地支宮位[i].星曜架構.諸星群.空曜.分數 = 空曜分數;
        命盤.地支宮位[i].星曜架構.諸星群.空曜.空曜重 = (空曜分數 > 命盤.定義.空曜參數);
        
        // ------- 桃花曜 -------
        var 桃花曜分數 = 命盤.地支宮位[i].星曜架構.諸星群.桃花.星曜.length / 2; // 看桃花曜數量
            // ----- 雙星 -----
        if(命盤.地支宮位[i].星曜架構.對星.紅鸞天喜.三方四正) 桃花曜分數 +=1;
        
        if(_.contains(命盤.地支宮位[i].星曜本宮.所有, "天姚")) 桃花曜分數 += 2;
        if(!_.contains(命盤.地支宮位[i].星曜本宮.所有, "天姚") && _.contains(命盤.地支宮位[i].星曜四正.所有, "天姚")) 桃花曜分數 +=2;
        
        命盤.地支宮位[i].星曜架構.諸星群.桃花.分數 = 桃花曜分數;
        命盤.地支宮位[i].星曜架構.諸星群.桃花.桃花重 = (桃花曜分數 > 命盤.定義.桃花重參數);
        
        
        // ************ 刑忌煞耗 ************
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞 = (命盤.地支宮位[i].星曜架構.諸星群.煞曜.星曜.length > 0); 
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.忌 = (命盤.地支宮位[i].星曜架構.諸星群.忌曜.星曜.length > 0); 
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑 = (命盤.地支宮位[i].星曜架構.諸星群.刑曜.星曜.length > 0); 
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.耗 = _.contains(命盤.地支宮位[i].星曜四正.所有, "大耗");
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞忌 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.忌;
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑煞 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞;
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.忌;
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌煞 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.忌 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞;
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌煞耗 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.忌 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.耗;
        命盤.地支宮位[i].星曜架構.諸星群.煞曜.四煞併臨 = (命盤.地支宮位[i].星曜架構.對星.火鈴.相夾 || 命盤.地支宮位[i].星曜架構.對星.火鈴.三方四正) && (命盤.地支宮位[i].星曜架構.對星.羊陀.相夾 || 命盤.地支宮位[i].星曜架構.對星.羊陀.三方四正);
        
        // ************ 宮位是否被吉化 ************
        // 吉化的條件為 1. 煞不重、不被空劫、火鈴夾，不見化忌，2. 被吉曜吉化，3.或被四化吉化
        命盤.地支宮位[i].吉化 = false;
        
        if(命盤.地支宮位[i].星曜架構.諸星群.吉曜.吉化 || 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化) 命盤.地支宮位[i].吉化 = true;
        
        //if(!命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞重 && !命盤.地支宮位[i].星曜架構.對星.空劫.相夾 && !命盤.地支宮位[i].星曜架構.對星.火鈴.相夾  && !命盤.地支宮位[i].星曜架構.諸星群.四化.化忌) {
        //    if(命盤.地支宮位[i].星曜架構.諸星群.吉曜.吉化 || 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化) 命盤.地支宮位[i].吉化 = true;
        //} // end if 吉化
    }  // end for

}  // end function 三方四正諸星群分析


function 三方四正諸星群判斷(三方四正矩陣, 諸星群){
    var 三方四正星群 = [];

    for(var i=0; i < 諸星群.length; i ++) { 
        if(_.contains(三方四正矩陣, 諸星群[i])) 三方四正星群.push(諸星群[i]) 
    };
    
    var 諸星分析 = {
        "星曜": 三方四正星群,
        "不見": false,
        "分數": 0,  // 尚未分析，以分數計算是否 “重”
        "備註": ""
    };
    
    if(諸星分析.星曜.length == 0) 諸星分析.不見 = true;
    
    return 諸星分析;
} // function 三方四正諸星群判斷


// ------------------------------------------------------------------

function 導入地支元件入人事宮(命盤){
    var 地支人事宮;
    for(var i=0; i<12; i++) {  // i = 地支
        地支人事宮 = 命盤.地支宮位[i].宮位;
        
        命盤.人事宮[地支人事宮].星曜.無主星 = 命盤.地支宮位[i].無主星;
        
        // ********** 三方、四正、二鄰 *********

        命盤.人事宮[地支人事宮].相對宮.對宮 = 命盤.地支宮位[i].對宮.宮位;
        命盤.人事宮[地支人事宮].相對宮.對宮地支數 = 命盤.地支宮位[i].對宮.地支數;
        
        命盤.人事宮[地支人事宮].相對宮.左方 = 命盤.地支宮位[i].左方.宮位;
        命盤.人事宮[地支人事宮].相對宮.左方地支數 = 命盤.地支宮位[i].左方.地支數;
        命盤.人事宮[地支人事宮].相對宮.右方 = 命盤.地支宮位[i].右方.宮位;
        命盤.人事宮[地支人事宮].相對宮.右方地支數 = 命盤.地支宮位[i].右方.地支數;
        
        命盤.人事宮[地支人事宮].相對宮.左鄰 = 命盤.地支宮位[i].左鄰.宮位;
        命盤.人事宮[地支人事宮].相對宮.左鄰地支數 = 命盤.地支宮位[i].左鄰.地支數;
        命盤.人事宮[地支人事宮].相對宮.右鄰 = 命盤.地支宮位[i].右鄰.宮位;
        命盤.人事宮[地支人事宮].相對宮.右鄰地支數 = 命盤.地支宮位[i].右鄰.地支數;
        
        
        // ********** 導入星曜 *********
        命盤.人事宮[地支人事宮].星曜.主星 = 命盤.地支宮位[i].星曜.主星;
        命盤.人事宮[地支人事宮].星曜.四化 = 命盤.地支宮位[i].星曜.四化星;
        命盤.人事宮[地支人事宮].星曜.本宮 = 命盤.地支宮位[i].星曜本宮.所有;
        命盤.人事宮[地支人事宮].星曜.本宮借宮 = 命盤.地支宮位[i].星曜本宮借宮.所有;
        命盤.人事宮[地支人事宮].星曜.四化借宮 = 命盤.地支宮位[i].星曜本宮借宮.四化;
        命盤.人事宮[地支人事宮].十二長生 = 命盤.地支宮位[i].星曜.十二長生;
        
        命盤.人事宮[地支人事宮].星曜.星曜三方 = 命盤.地支宮位[i].星曜三方.所有;
        命盤.人事宮[地支人事宮].星曜.四化三方 = 命盤.地支宮位[i].星曜三方.四化;
        
        命盤.人事宮[地支人事宮].星曜.星曜四正 = 命盤.地支宮位[i].星曜四正.所有;
        命盤.人事宮[地支人事宮].星曜.四化四正 = 命盤.地支宮位[i].星曜四正.四化;
        
        
        // ********** 導入對星分析 *********
        命盤.人事宮[地支人事宮].星曜.昌曲 = 命盤.地支宮位[i].星曜架構.對星.昌曲;
        命盤.人事宮[地支人事宮].星曜.輔弼 = 命盤.地支宮位[i].星曜架構.對星.輔弼;
        命盤.人事宮[地支人事宮].星曜.魁鉞 = 命盤.地支宮位[i].星曜架構.對星.魁鉞;
        命盤.人事宮[地支人事宮].星曜.雙祿 = 命盤.地支宮位[i].星曜架構.對星.雙祿;
        命盤.人事宮[地支人事宮].星曜.祿馬 = 命盤.地支宮位[i].星曜架構.對星.祿馬;
        
        命盤.人事宮[地支人事宮].星曜.羊陀 = 命盤.地支宮位[i].星曜架構.對星.羊陀;
        命盤.人事宮[地支人事宮].星曜.火鈴 = 命盤.地支宮位[i].星曜架構.對星.火鈴;
        命盤.人事宮[地支人事宮].星曜.空劫 = 命盤.地支宮位[i].星曜架構.對星.空劫;
        
        命盤.人事宮[地支人事宮].星曜.三台八座 = 命盤.地支宮位[i].星曜架構.對星.三台八座;
        命盤.人事宮[地支人事宮].星曜.恩光天貴 = 命盤.地支宮位[i].星曜架構.對星.恩光天貴;
        命盤.人事宮[地支人事宮].星曜.紅鸞天喜 = 命盤.地支宮位[i].星曜架構.對星.紅鸞天喜;
        命盤.人事宮[地支人事宮].星曜.台輔封誥 = 命盤.地支宮位[i].星曜架構.對星.台輔封誥;
        命盤.人事宮[地支人事宮].星曜.龍池鳳閣 = 命盤.地支宮位[i].星曜架構.對星.龍池鳳閣;
        命盤.人事宮[地支人事宮].星曜.太陽太陰 = 命盤.地支宮位[i].星曜架構.對星.太陽太陰;
        命盤.人事宮[地支人事宮].星曜.天殤天使 = 命盤.地支宮位[i].星曜架構.對星.天殤天使;
        命盤.人事宮[地支人事宮].星曜.天虛天哭 = 命盤.地支宮位[i].星曜架構.對星.天虛天哭;
        命盤.人事宮[地支人事宮].星曜.孤辰寡宿 = 命盤.地支宮位[i].星曜架構.對星.孤辰寡宿;
        
        命盤.人事宮[地支人事宮].星曜分析 = 命盤.地支宮位[i].星曜架構.諸星群;
        //命盤.人事宮[地支人事宮].格局 = 命盤.地支宮位[i].星曜架構.格局;
        
        // ****************** 吉化、煞重 ******************
        命盤.人事宮[地支人事宮].吉化星曜 = 命盤.地支宮位[i].星曜架構.諸星群.吉曜.吉化;
        命盤.人事宮[地支人事宮].吉化四化 = 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化;
        命盤.人事宮[地支人事宮].吉化 =(命盤.人事宮[地支人事宮].吉化星曜 || 命盤.人事宮[地支人事宮].吉化四化);
        
        命盤.人事宮[地支人事宮].得祿 = 命盤.地支宮位[i].星曜架構.對星.雙祿.會;  //得到其中一個祿
        
        命盤.人事宮[地支人事宮].坐煞 = 星曜矩陣所含星曜(命盤.地支宮位[i].星曜本宮.煞星, ["火星", "鈴星", "擎羊", "陀羅"], "||");
        命盤.人事宮[地支人事宮].無煞 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.不見;
        命盤.人事宮[地支人事宮].煞重 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞重;
        命盤.人事宮[地支人事宮].煞忌 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞忌;
        命盤.人事宮[地支人事宮].刑忌 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌;
        命盤.人事宮[地支人事宮].刑忌煞耗 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌煞耗;
        命盤.人事宮[地支人事宮].四煞併臨 = 命盤.地支宮位[i].星曜架構.諸星群.煞曜.四煞併臨;
        
        命盤.人事宮[地支人事宮].桃花 = 命盤.地支宮位[i].星曜架構.諸星群.桃花.桃花重;
        命盤.人事宮[地支人事宮].單見天馬 = 命盤.地支宮位[i].星曜架構.對星.祿馬.單見天馬;
        
        // ****************** 四化 ******************
        命盤.人事宮[地支人事宮].會祿 = 命盤.地支宮位[i].星曜架構.諸星群.四化.會祿;
        命盤.人事宮[地支人事宮].坐祿 = 命盤.地支宮位[i].星曜架構.諸星群.四化.坐祿;
        命盤.人事宮[地支人事宮].會權 = 命盤.地支宮位[i].星曜架構.諸星群.四化.會權;
        命盤.人事宮[地支人事宮].坐權 = 命盤.地支宮位[i].星曜架構.諸星群.四化.坐權;
        命盤.人事宮[地支人事宮].會忌 = 命盤.地支宮位[i].星曜架構.諸星群.四化.會忌;
        命盤.人事宮[地支人事宮].坐忌 = 命盤.地支宮位[i].星曜架構.諸星群.四化.坐祿;
        命盤.人事宮[地支人事宮].祿權 = 命盤.地支宮位[i].星曜架構.諸星群.四化.祿權;
        命盤.人事宮[地支人事宮].祿忌 = 命盤.地支宮位[i].星曜架構.諸星群.四化.祿忌;
        命盤.人事宮[地支人事宮].刑忌 = 命盤.地支宮位[i].星曜架構.諸星群.四化.祿忌;
        命盤.人事宮[地支人事宮].祿權科 = 命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科;
        
        
        var 格局矩陣=[]; var 格局名稱;
        for(var j=0; j<命盤.地支宮位[i].星曜架構.格局.length; j++){
            格局名稱 = 命盤.地支宮位[i].星曜架構.格局[j];
            格局名稱 = 格局名稱.replace("[破格]", ""); 格局名稱 = 格局名稱.replace("[吉化]", ""); 格局名稱 = 格局名稱.replace("*", "");
            格局矩陣.push(格局名稱);
        }  // end for j
        命盤.人事宮[地支人事宮].格局 = 格局矩陣;
        
    } // end for i
    
} // end function 導入地支元件入人事宮




// ******************************************************************


function 宮位分析中宮小結 (命盤) {
    var 星曜群, 吉曜對星曜, 煞曜對星曜;
    var 星曜類別 = ["吉曜", "煞曜", "四化", "桃花", "空曜", "文曜", "刑耗"];  //"科曜", 不納入科曜，太多
    var 吉曜對星  = ["昌曲", "輔弼", "魁鉞", "祿馬", "雙祿", "三台八座", "恩光天貴", "台輔封誥", "紅鸞天喜", "龍池鳳閣"];
    var 煞曜對星  = ["火鈴", "羊陀", "空劫", "天虛天哭", "孤辰寡宿", "天殤天使"];
                 
    for(var i=0; i < 12; i++){
        var 星曜矩陣 = [], 吉曜矩陣 = [], 煞曜矩陣 = [];
        
        // ---------------- 導入宮位主星 ----------------
        命盤.地支宮位[i].星曜架構.中宮分析總結.主星 = 命盤.地支宮位[i].星曜.主星.join(" ");
        
        // ---------------- 導入各類星曜 ----------------
        for(var j=0; j < 星曜類別.length; j++){
            星曜群 = 星曜類別[j]; //console.log(i + " - " + 星曜群);
            
            if(!命盤.地支宮位[i].星曜架構.諸星群[星曜群].不見) {
                星曜矩陣.push(星曜群 + "：" + 命盤.地支宮位[i].星曜架構.諸星群[星曜群].星曜);
            } // end if
            
        }  // end for j，導入各類星曜 
        
        
        // ---------------- 導入吉曜對星 ----------------
        for(var k=0; k < 吉曜對星.length; k++){
            吉曜對星曜 = 吉曜對星[k];
            var 對星組合 = 命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].星曜1 + "、" + 命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].星曜2;
            
            if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].三方四正) {
                if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].三方) {
                    if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].同宮) 吉曜矩陣.push(對星組合 + "同宮");
                    if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].三方蝴蝶式) 吉曜矩陣.push(對星組合 + "雙飛於三方");
                    if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].三方斜飛式) 吉曜矩陣.push(對星組合 + "斜飛於三方");
                } // end if 三方
                
                if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].對宮) 吉曜矩陣.push(對星組合 + "在對宮");
                if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].相對) 吉曜矩陣.push(對星組合 + "相對");
                if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].四正斜飛式) 吉曜矩陣.push(對星組合 + "斜飛於四正");
            } // end if 三方四正
            
            if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].相夾) {
                if(吉曜對星曜 == "昌曲" || 吉曜對星曜 == "輔弼" || 吉曜對星曜 == "魁鉞") 吉曜矩陣.push(對星組合 + "夾");
            } // end if 相夾
            
            if(命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].單見) {
                //console.log(i + " - " + 吉曜對星曜);
                if(吉曜對星曜 == "昌曲" || 吉曜對星曜 == "輔弼" || 吉曜對星曜 == "魁鉞") 吉曜矩陣.push("單見" + 命盤.地支宮位[i].星曜架構.對星[吉曜對星曜].單見星);
            } // end if 單見
        }  // end for k，導入吉曜對星
        
        
        // ---------------- 導入四化星 ----------------
        if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科忌) 吉曜矩陣.push("見祿權科忌");
        //if(!命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科忌 && 命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科) 吉曜矩陣.push("見祿權科");
        //if(!命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科忌 && 命盤.地支宮位[i].星曜架構.諸星群.四化.祿權忌) 吉曜矩陣.push("見祿權忌");
        var 不得祿權科 = !命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科忌 && !命盤.地支宮位[i].星曜架構.諸星群.四化.祿權科 && !命盤.地支宮位[i].星曜架構.諸星群.四化.祿權忌;
        //if(不得祿權科 && 命盤.地支宮位[i].星曜架構.諸星群.四化.祿權) 吉曜矩陣.push("見祿權");
        //if(不得祿權科 && 命盤.地支宮位[i].星曜架構.諸星群.四化.祿忌) 吉曜矩陣.push("見祿忌");
        //if(不得祿權科 && 命盤.地支宮位[i].星曜架構.諸星群.四化.科忌) 吉曜矩陣.push("見科忌");
        //if(不得祿權科 && 命盤.地支宮位[i].星曜架構.諸星群.四化.祿科) 吉曜矩陣.push("見祿科");
        
        if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿權夾) 吉曜矩陣.push("祿權夾");
        if(命盤.地支宮位[i].星曜架構.諸星群.四化.祿科夾) 吉曜矩陣.push("祿科夾");
        
        // ---------------- 導入吉化 ----------------
        if(命盤.地支宮位[i].星曜架構.諸星群.吉曜.吉化) 吉曜矩陣.push("諸吉曜吉化");
        if(命盤.地支宮位[i].星曜架構.諸星群.四化.吉化) 吉曜矩陣.push("四化吉化，" + 命盤.地支宮位[i].星曜架構.諸星群.四化.吉化條件);
        
        
        // ---------------- 導入煞曜對星 ----------------
        for(var m=0; m < 煞曜對星.length; m++){
            煞曜對星曜 = 煞曜對星[m];
            var 對星組合 = 命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].星曜1 + "、" + 命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].星曜2;
            
            if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].三方四正) {
                if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].三方) {
                    if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].同宮) 煞曜矩陣.push(對星組合 + "同宮");
                    if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].三方蝴蝶式) 煞曜矩陣.push(對星組合 + "雙飛於三方");
                    if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].三方斜飛式) 煞曜矩陣.push(對星組合 + "斜飛於三方");
                } // end if 三方
                
                if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].對宮) 煞曜矩陣.push(對星組合 + "在對宮");
                if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].相對) 煞曜矩陣.push(對星組合 + "相對");
                if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].四正斜飛式) 煞曜矩陣.push(對星組合 + "斜飛於四正");
            } // end if 三方四正
            
            if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].相夾) {
                var 夾字 = "夾";
                if(命盤.地支宮位[i].星曜架構.對星[煞曜對星曜].夾忌) 夾字 = "夾忌";
                if(煞曜對星曜 == "火鈴" || 煞曜對星曜 == "羊陀" || 煞曜對星曜 == "空劫" || 煞曜對星曜 == "天殤天使") 煞曜矩陣.push(對星組合 + 夾字);
            } // end if 相夾
            
        }  // end for m，導入煞曜對星
        
        if(命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌煞耗) 煞曜矩陣.push("見刑忌煞耗");
        if(!命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌煞耗 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌煞) 煞曜矩陣.push("見刑忌煞");
        if(!命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑忌煞 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.刑煞 && 命盤.地支宮位[i].星曜架構.諸星群.煞曜.忌) 煞曜矩陣.push("見刑忌");
        
        if(命盤.地支宮位[i].星曜架構.諸星群.煞曜.四煞併臨) 煞曜矩陣.push("四煞併臨");
        if(命盤.地支宮位[i].星曜架構.諸星群.煞曜.煞重) 煞曜矩陣.push("煞重");
        if(命盤.地支宮位[i].星曜架構.諸星群.桃花.桃花重) 煞曜矩陣.push("桃花重");
        if(命盤.地支宮位[i].星曜架構.諸星群.空曜.空曜重) 煞曜矩陣.push("空曜重");
        
        // ****************** 導入結論 ******************
        命盤.地支宮位[i].星曜架構.中宮分析總結.宮位星曜 = 星曜矩陣.join("<br>");
        命盤.地支宮位[i].星曜架構.中宮分析總結.宮位吉曜 = 吉曜矩陣.join("<br>");
        命盤.地支宮位[i].星曜架構.中宮分析總結.宮位煞曜 = 煞曜矩陣.join("<br>");
        
        
        var 格局格式化 = [];
        for(var q=0; q<命盤.地支宮位[i].星曜架構.格局.length; q++){  // add HTML class to each of the 格局
            格局格式化.push('<span class="shhp-中宮格局名稱">' + 命盤.地支宮位[i].星曜架構.格局[q] + '</span>');
            //命盤.地支宮位[i].星曜架構.格局[q]= '<span class="shhp-中宮格局名稱">' + 命盤.地支宮位[i].星曜架構.格局[q] + '</span>';
        } // end q
        命盤.地支宮位[i].星曜架構.中宮分析總結.格局 = 格局格式化.join("<br>"); //命盤.地支宮位[i].星曜架構.格局.join("<br>");
        
    } // end for i
    
} // end function 宮位分析中宮小結