function 三合人事宮位(){
	this.命宮 = new 三合人事宮位元件(1);
	this.兄弟宮 = new 三合人事宮位元件(2);
	this.夫妻宮 = new 三合人事宮位元件(3);
	this.子女宮 = new 三合人事宮位元件(4);
	this.財帛宮 = new 三合人事宮位元件(5);
	this.疾厄宮 = new 三合人事宮位元件(6);
	this.遷移宮 = new 三合人事宮位元件(7);
	this.交友宮 = new 三合人事宮位元件(8);
	this.官祿宮 = new 三合人事宮位元件(9);
	this.田宅宮 = new 三合人事宮位元件(10);
	this.福德宮 = new 三合人事宮位元件(11);
	this.父母宮 = new 三合人事宮位元件(0);
}  // end function 三合人事宮位

function 三合人事宮位元件(宮位數) {
	this.天干數 = -1;
	this.天干 = "";
	this.地支數 = -1;
	this.地支 = "";
	this.宮位數 = 宮位數; //命宮：1，兄弟：2 ...... 父母官：0
    //this.無主星 = false;
    //this.空宮 = false;
	this.分析 = new 宮位分析內容組件;
    this.星曜 = {}; // to be imported from [function 導入地支元件入人事宮]
    this.相對宮 = {}; // to be imported from [function 導入地支元件入人事宮]
}  //end function 宮位元件


function 宮位分析內容組件(){
    this.分析總論表 = "";
    this.中洲派 = "";
    this.中洲派宮垣論 = "";
    this.雜曜 = "";
    this.補充 = "";
    this.備註 = "";
} // end function 宮位分析內容組件


function 三合地支宮位元件(地支數) {
	this.宮位數 = -1; //1： 命宮 2： 兄弟宮 。。。
	this.宮位 = ""; //命宮、兄弟宮 。。。
	this.星曜 = new 三合地支星曜元件();
    this.星曜借宮 = new 三合地支星曜元件();  //借宫得到对的星曜
    this.星曜架構 = new 三合星曜架構分析元件();
	this.地支數 = 地支數; //  ......................... 填寫地支數
	this.地支 = 地支字數轉換(地支數);  //  ......................... 填寫地支
	this.宮干數 = -1;  //0：癸，1：甲， 2：乙
	this.宮干 = "";
    this.無主星 = false;

	this.大限歲數段 = "";
	this.大限數 = -1;
	this.大限宮位 = "";

	this.流年歲數 = -1; //歲數
	this.流年宮位數 = -1; //1： 流年命宮 2： 流年兄弟宮 。。。
	this.流年宮位 = "";
}  //end function 宮位元件


function 三合星曜架構分析元件() {
    this.對星 = {};
    this.諸星群 = {};
    this.格局 = []; // array of object, 把成立的格局 object push 進來
    this.中宮分析總結 = {};
} // end function 三合星曜架構分析元件


function 三合地支星曜元件(){
	this.主星 = [];
	this.六吉星 = [];
	this.六凶星 = [];
    this.祿馬星 = [];
    this.四化星 = [];
    this.空曜 = [];
	this.雜曜 = [];
    this.十二長生 = "";
	this.歲前星 = "";
    this.將前星 = "";
    this.博士星 = "";
    
    //this.大曜 = [];  //大限流曜
    //this.流曜 = [];  //流年流曜
} // end function 三合地支星曜元件



function 三合大限元件(大限數) {
	this.大限數 = 大限數; // 0 reserved for 童限
	this.歲數段 = ""; // 13 - 22
	this.限始歲 = -1;
	this.限終歲 = -1;
	this.地支數 = -1;
	this.宮位干支 = "";  //比方 壬辰大限，以該大限宮的宮位干支判斷
	this.大限名 = ""; //比方 第5大限
	this.流年 = [];
	this.地支 = [];
	this.人事宮 = new 初始大限人事宮位();
    this.宮位 = new 初始大限宮位();
    
	for(var j=0; j< 10; j++){
		this.流年[j] = new 三合大限流年元件();
	} // end for j
	
	
	for(var j=0; j< 12; j++){
		this.地支[j] = new 大限地支元件();
	} // end for j
}  //end function 大限元件


function 三合大限流年元件() {
	this.西曆年 = -1;
	this.大限流年數 = -1; // 該大限的第幾個流年
	this.歲數 = -1;
    this.天干 = "";
	this.地支數 = -1;
	this.地支 = "";
	this.流年干支 = "";
}  //end function 三合大限流年元件


// --------------------------------------------

function 三合星曜初始(){
    var 星曜矩陣 = 星曜含義();

    var 星曜名稱;
    var 星曜內容;
    
    for(var i=0; i<星曜矩陣.length; i++){
        星曜名稱 = 星曜矩陣[i]["星曜"];
        星曜內容 = 星曜矩陣[i];
        this[星曜名稱] = 星曜內容;
        //this[星曜名稱].化祿權科 = false;
        this[星曜名稱].橫盤位置 = "";
        this[星曜名稱].橫盤廟陷位置 = "";
        this[星曜名稱].橫盤四化位置 = "";
        this[星曜名稱].直盤位置 = "";
        this[星曜名稱].四地 = "";
        this[星曜名稱].廟旺 = false;
        this[星曜名稱].落陷 = false;
        
        var 十八飛星 = ["紫微", "天機", "太陽", "武曲", "天同", "廉貞", "天府", "太陰", "貪狼", "巨門", "天相", "天梁", "七殺", "破軍", "文昌", "文曲", "左輔", "右弼"];
        delete this[星曜名稱].星曜;
        
        if(_.contains(十八飛星, 星曜名稱)) this[星曜名稱].化祿權科 = false;  // 如果是十八飛星，就預設星曜化祿權科=false
        if(_.contains(十八飛星, 星曜名稱)) this[星曜名稱].獨坐 = false;  // 如果是十八飛星，就預設獨坐=false
            
        if(this[星曜名稱].分類 != "正曜" && this[星曜名稱].分類 != "輔佐八曜" && this[星曜名稱].分類 != "煞曜" && this[星曜名稱].分類 != "四化") {
            delete this[星曜名稱].化氣;
            delete this[星曜名稱].主司;
            delete this[星曜名稱].四化;
            delete this[星曜名稱].後天卦;
        }  // end if 非正曜、輔佐八曜、煞曜、四化
        
        if(this[星曜名稱].分類 == "四化") {
            delete this[星曜名稱].四化;
            delete this[星曜名稱].後天卦;
            delete this[星曜名稱].主司;
        }  // end if 四化
    }  // end for
    
    
    // ---------- clean up unwanted key in the 星曜 object ----------
    var 四化星群 = ["化祿", "化權", "化科", "化忌"];
    var 長生十二神星群 = ["長生", "沐浴", "冠帶", "臨官", "帝旺", "衰", "病", "死", "墓", "絕", "胎", "養"];
    var 博士十二神星群 = ["博士", "力士", "青龍", "小耗博士", "將軍", "奏書", "飛廉", "喜神", "病符博士", "大耗", "伏兵", "官府"];
    var 將前十二神星群 = ["將星", "攀鞍", "歲驛", "息神", "華蓋", "劫煞", "災煞", "天煞", "指背", "咸池", "月煞", "亡神"];
    var 歲前十二神星群 = ["歲建", "晦氣", "喪門", "貫索", "官符", "小耗", "歲破", "龍德", "白虎", "天德", "弔客", "病符"];
    var 十二神星群 = 四化星群.concat(長生十二神星群, 博士十二神星群, 將前十二神星群, 歲前十二神星群);
    
    for(var i=0; i < 十二神星群.length; i++){
        delete this[十二神星群[i]].廟陷;
        //delete this[十二神星群[i]].四化;
        delete this[十二神星群[i]].星斗;
        //delete this[十二神星群[i]].後天卦;
    } // end for i
    
    
} // end function 三合星曜初始



function 安三合星曜(安星元件, 地支矩陣, 星曜矩陣) {
    //console.log(安星元件);
    var 資料索引;
    
    // ---------------- 安 十四主星 ----------------
    var 主星矩陣 = [
        { "紫微": "子", "天機": "亥", "太陽": "酉", "武曲": "申", "天同": "未", "廉貞": "辰", "天府": "辰", "太陰": "巳", "貪狼": "午", "巨門": "未", "天相": "申", "天梁": "酉", "七殺": "戌", "破軍": "寅"},
        { "紫微": "丑", "天機": "子", "太陽": "戌", "武曲": "酉", "天同": "申", "廉貞": "巳", "天府": "卯", "太陰": "辰", "貪狼": "巳", "巨門": "午", "天相": "未", "天梁": "申", "七殺": "酉", "破軍": "丑"},
        { "紫微": "寅", "天機": "丑", "太陽": "亥", "武曲": "戌", "天同": "酉", "廉貞": "午", "天府": "寅", "太陰": "卯", "貪狼": "辰", "巨門": "巳", "天相": "午", "天梁": "未", "七殺": "申", "破軍": "子"},
        { "紫微": "卯", "天機": "寅", "太陽": "子", "武曲": "亥", "天同": "戌", "廉貞": "未", "天府": "丑", "太陰": "寅", "貪狼": "卯", "巨門": "辰", "天相": "巳", "天梁": "午", "七殺": "未", "破軍": "亥"},
        { "紫微": "辰", "天機": "卯", "太陽": "丑", "武曲": "子", "天同": "亥", "廉貞": "申", "天府": "子", "太陰": "丑", "貪狼": "寅", "巨門": "卯", "天相": "辰", "天梁": "巳", "七殺": "午", "破軍": "戌"},
        { "紫微": "巳", "天機": "辰", "太陽": "寅", "武曲": "丑", "天同": "子", "廉貞": "酉", "天府": "亥", "太陰": "子", "貪狼": "丑", "巨門": "寅", "天相": "卯", "天梁": "辰", "七殺": "巳", "破軍": "酉"},
        { "紫微": "午", "天機": "巳", "太陽": "卯", "武曲": "寅", "天同": "丑", "廉貞": "戌", "天府": "戌", "太陰": "亥", "貪狼": "子", "巨門": "丑", "天相": "寅", "天梁": "卯", "七殺": "辰", "破軍": "申"},
        { "紫微": "未", "天機": "午", "太陽": "辰", "武曲": "卯", "天同": "寅", "廉貞": "亥", "天府": "酉", "太陰": "戌", "貪狼": "亥", "巨門": "子", "天相": "丑", "天梁": "寅", "七殺": "卯", "破軍": "未"},
        { "紫微": "申", "天機": "未", "太陽": "巳", "武曲": "辰", "天同": "卯", "廉貞": "子", "天府": "申", "太陰": "酉", "貪狼": "戌", "巨門": "亥", "天相": "子", "天梁": "丑", "七殺": "寅", "破軍": "午"},
        { "紫微": "酉", "天機": "申", "太陽": "午", "武曲": "巳", "天同": "辰", "廉貞": "丑", "天府": "未", "太陰": "申", "貪狼": "酉", "巨門": "戌", "天相": "亥", "天梁": "子", "七殺": "丑", "破軍": "巳"},
        { "紫微": "戌", "天機": "酉", "太陽": "未", "武曲": "午", "天同": "巳", "廉貞": "寅", "天府": "午", "太陰": "未", "貪狼": "申", "巨門": "酉", "天相": "戌", "天梁": "亥", "七殺": "子", "破軍": "辰"},
        { "紫微": "亥", "天機": "戌", "太陽": "申", "武曲": "未", "天同": "午", "廉貞": "卯", "天府": "巳", "太陰": "午", "貪狼": "未", "巨門": "申", "天相": "酉", "天梁": "戌", "七殺": "亥", "破軍": "卯"}
    ];
    
    var 主星群 = ["紫微", "天機", "太陽", "武曲", "天同", "廉貞", "天府", "太陰", "貪狼", "巨門", "天相", "天梁", "七殺", "破軍"];
    var 主星名稱;
    
    資料索引=_.findIndex(主星矩陣, {紫微: 安星元件.紫微地支.地支});
    for(var i=0; i<主星群.length; i++){
        主星名稱 = 主星群[i];
        星曜矩陣[主星名稱].地支 = 主星矩陣[資料索引][主星名稱];
        星曜矩陣[主星名稱].地支數 = 地支字數轉換(星曜矩陣[主星名稱].地支);
        星曜矩陣[主星名稱].宮位 = 地支矩陣[星曜矩陣[主星名稱].地支數].宮位;
        地支矩陣[星曜矩陣[主星名稱].地支數].星曜.主星.push(主星名稱);
    } // end for i, fill in 主星
    
    
    for(var j=0; j<12; j++){
        if(地支矩陣[j].星曜.主星.length == 0) 地支矩陣[j].無主星 = true;
    }; // end for j, check 無主星
    
    
    // *********** 檢查主星是否是獨坐 ***********
    var 主星地支數;
    for(var j=0; j<主星群.length; j++){
        主星名稱 = 主星群[j];
        主星地支數 = 星曜矩陣[主星名稱].地支數
        if(地支矩陣[主星地支數].星曜.主星.length == 1) 星曜矩陣[主星名稱].獨坐 = true;
    }; // end for j, check 主星獨坐

    
    // ---------------- 安 年干星 ----------------：祿存，擎羊，陀羅，天魁，天鉞，天官，天福，截空
    var 年干星矩陣 = [
        { "年干": "甲", "祿存": "寅", "擎羊": "卯", "陀羅": "丑", "天魁": "丑", "天鉞": "未", "天官": "未", "天福": "酉", "截空": "申", "天廚": "巳"},
        { "年干": "乙", "祿存": "卯", "擎羊": "辰", "陀羅": "寅", "天魁": "子", "天鉞": "申", "天官": "辰", "天福": "申", "截空": "酉", "天廚": "午"},
        { "年干": "丙", "祿存": "巳", "擎羊": "午", "陀羅": "辰", "天魁": "亥", "天鉞": "酉", "天官": "巳", "天福": "子", "截空": "午", "天廚": "子"},
        { "年干": "丁", "祿存": "午", "擎羊": "未", "陀羅": "巳", "天魁": "亥", "天鉞": "酉", "天官": "寅", "天福": "亥", "截空": "未", "天廚": "巳"},
        { "年干": "戊", "祿存": "巳", "擎羊": "午", "陀羅": "辰", "天魁": "丑", "天鉞": "未", "天官": "卯", "天福": "卯", "截空": "辰", "天廚": "午"},
        { "年干": "己", "祿存": "午", "擎羊": "未", "陀羅": "巳", "天魁": "子", "天鉞": "申", "天官": "酉", "天福": "寅", "截空": "巳", "天廚": "申"},
        { "年干": "庚", "祿存": "申", "擎羊": "酉", "陀羅": "未", "天魁": "丑", "天鉞": "未", "天官": "亥", "天福": "午", "截空": "寅", "天廚": "寅"},
        { "年干": "辛", "祿存": "酉", "擎羊": "戌", "陀羅": "申", "天魁": "午", "天鉞": "寅", "天官": "酉", "天福": "巳", "截空": "卯", "天廚": "午"},
        { "年干": "壬", "祿存": "亥", "擎羊": "子", "陀羅": "戌", "天魁": "卯", "天鉞": "巳", "天官": "戌", "天福": "午", "截空": "子", "天廚": "酉"},
        { "年干": "癸", "祿存": "子", "擎羊": "丑", "陀羅": "亥", "天魁": "卯", "天鉞": "巳", "天官": "午", "天福": "巳", "截空": "丑", "天廚": "亥"}
    ];
    
    var 年干星群 = ["祿存", "擎羊", "陀羅", "天魁", "天鉞", "天官", "天福", "截空", "天廚"];
    var 年干星名稱;
    
    資料索引=_.findIndex(年干星矩陣, {年干: 安星元件.生年天干});
    for(var i=0; i<年干星群.length; i++){
        年干星名稱 = 年干星群[i];
        星曜矩陣[年干星名稱].地支 = 年干星矩陣[資料索引][年干星名稱];
        星曜矩陣[年干星名稱].地支數 = 地支字數轉換(星曜矩陣[年干星名稱].地支);
        星曜矩陣[年干星名稱].宮位 = 地支矩陣[星曜矩陣[年干星名稱].地支數].宮位;
        
        if(年干星名稱=="祿存") 地支矩陣[星曜矩陣[年干星名稱].地支數].星曜.祿馬星.push(年干星名稱);
        if(年干星名稱=="天魁" || 年干星名稱=="天鉞") 地支矩陣[星曜矩陣[年干星名稱].地支數].星曜.六吉星.push(年干星名稱);
        if(年干星名稱=="擎羊" || 年干星名稱=="陀羅") 地支矩陣[星曜矩陣[年干星名稱].地支數].星曜.六凶星.push(年干星名稱);
        if(年干星名稱=="天官" || 年干星名稱=="天福" || 年干星名稱=="天廚") 地支矩陣[星曜矩陣[年干星名稱].地支數].星曜.雜曜.push(年干星名稱);
        //if(年干星名稱=="截空") 地支矩陣[星曜矩陣[年干星名稱].地支數].星曜.空曜.push(年干星名稱);
    } // end for i, fill in 年干星群
    
    
    
    // ---------------- 安 截路、空亡 ----------------
    // 截路、空亡：甲己之年申酉, 乙庚之年午未, 丙辛之年辰巳, 丁壬之年寅卯, 戊癸之年子丑
    
    var 截路地支, 空亡地支;
    
    switch(安星元件.生年天干){
        case "甲": case "己": 截路地支 = "申"; 空亡地支 = "酉"; break;
        case "乙": case "庚": 截路地支 = "午"; 空亡地支 = "未"; break;
        case "丙": case "辛": 截路地支 = "辰"; 空亡地支 = "巳"; break;
        case "丁": case "壬": 截路地支 = "寅"; 空亡地支 = "卯"; break;
        case "戊": case "癸": 截路地支 = "子"; 空亡地支 = "丑"; break;
    } // end switch 安星元件.生年天干
    
    星曜矩陣["截路"].地支 = 截路地支;
    星曜矩陣["截路"].地支數 = 地支字數轉換(截路地支);
    星曜矩陣["截路"].宮位 = 地支矩陣[星曜矩陣["截路"].地支數].宮位;
    地支矩陣[星曜矩陣["截路"].地支數].星曜.空曜.push("截路");
    
    星曜矩陣["空亡"].地支 = 空亡地支;
    星曜矩陣["空亡"].地支數 = 地支字數轉換(空亡地支);
    星曜矩陣["空亡"].宮位 = 地支矩陣[星曜矩陣["空亡"].地支數].宮位;
    地支矩陣[星曜矩陣["空亡"].地支數].星曜.空曜.push("空亡");
    
    
    // ---------------- 安 年支星 ----------------：天哭,天虛,龍池,鳳閣,紅鑾,天喜,孤辰,寡宿,蜚廉,破碎,天空
    var 年支星矩陣 = [
        { "年支": "子", "天哭": "午", "天虛": "午", "龍池": "辰", "鳳閣": "戌", "紅鸞": "卯", "天喜": "酉", "孤辰": "寅", "寡宿": "戌", "蜚廉": "申", "破碎": "巳", "天空": "丑", "月德": "巳", "年解": "戌", "天馬": "寅"},
        { "年支": "丑", "天哭": "巳", "天虛": "未", "龍池": "巳", "鳳閣": "酉", "紅鸞": "寅", "天喜": "申", "孤辰": "寅", "寡宿": "戌", "蜚廉": "酉", "破碎": "丑", "天空": "寅", "月德": "午", "年解": "酉", "天馬": "亥"},
        { "年支": "寅", "天哭": "辰", "天虛": "申", "龍池": "午", "鳳閣": "申", "紅鸞": "丑", "天喜": "未", "孤辰": "巳", "寡宿": "丑", "蜚廉": "戌", "破碎": "酉", "天空": "卯", "月德": "未", "年解": "申", "天馬": "申"},
        { "年支": "卯", "天哭": "卯", "天虛": "酉", "龍池": "未", "鳳閣": "未", "紅鸞": "子", "天喜": "午", "孤辰": "巳", "寡宿": "丑", "蜚廉": "巳", "破碎": "巳", "天空": "辰", "月德": "申", "年解": "未", "天馬": "巳"},
        { "年支": "辰", "天哭": "寅", "天虛": "戌", "龍池": "申", "鳳閣": "午", "紅鸞": "亥", "天喜": "巳", "孤辰": "巳", "寡宿": "丑", "蜚廉": "午", "破碎": "丑", "天空": "巳", "月德": "酉", "年解": "午", "天馬": "寅"},
        { "年支": "巳", "天哭": "丑", "天虛": "亥", "龍池": "酉", "鳳閣": "巳", "紅鸞": "戌", "天喜": "辰", "孤辰": "申", "寡宿": "辰", "蜚廉": "未", "破碎": "酉", "天空": "午", "月德": "戌", "年解": "巳", "天馬": "亥"},
        { "年支": "午", "天哭": "子", "天虛": "子", "龍池": "戌", "鳳閣": "辰", "紅鸞": "酉", "天喜": "卯", "孤辰": "申", "寡宿": "辰", "蜚廉": "寅", "破碎": "巳", "天空": "未", "月德": "亥", "年解": "辰", "天馬": "申"},
        { "年支": "未", "天哭": "亥", "天虛": "丑", "龍池": "亥", "鳳閣": "卯", "紅鸞": "申", "天喜": "寅", "孤辰": "申", "寡宿": "辰", "蜚廉": "卯", "破碎": "丑", "天空": "申", "月德": "子", "年解": "卯", "天馬": "巳"},
        { "年支": "申", "天哭": "戌", "天虛": "寅", "龍池": "子", "鳳閣": "寅", "紅鸞": "未", "天喜": "丑", "孤辰": "亥", "寡宿": "未", "蜚廉": "辰", "破碎": "酉", "天空": "酉", "月德": "丑", "年解": "寅", "天馬": "寅"},
        { "年支": "酉", "天哭": "酉", "天虛": "卯", "龍池": "丑", "鳳閣": "丑", "紅鸞": "午", "天喜": "子", "孤辰": "亥", "寡宿": "未", "蜚廉": "亥", "破碎": "巳", "天空": "戌", "月德": "寅", "年解": "丑", "天馬": "亥"},
        { "年支": "戌", "天哭": "申", "天虛": "辰", "龍池": "寅", "鳳閣": "子", "紅鸞": "巳", "天喜": "亥", "孤辰": "亥", "寡宿": "未", "蜚廉": "子", "破碎": "丑", "天空": "亥", "月德": "卯", "年解": "子", "天馬": "申"},
        { "年支": "亥", "天哭": "未", "天虛": "巳", "龍池": "卯", "鳳閣": "亥", "紅鸞": "辰", "天喜": "戌", "孤辰": "寅", "寡宿": "戌", "蜚廉": "丑", "破碎": "酉", "天空": "子", "月德": "辰", "年解": "亥", "天馬": "巳"}
    ];
    
    var 年支星群 = ["天哭", "天虛", "龍池", "鳳閣", "紅鸞", "天喜", "孤辰", "寡宿", "蜚廉", "破碎", "天空", "月德", "年解", "天馬"];
    var 年支星名稱;
    
    資料索引=_.findIndex(年支星矩陣, {年支: 安星元件.生年地支});
    
    for(var i=0; i < 年支星群.length; i++){
        年支星名稱 = 年支星群[i];
        星曜矩陣[年支星名稱].地支 = 年支星矩陣[資料索引][年支星名稱];
        星曜矩陣[年支星名稱].地支數 = 地支字數轉換(星曜矩陣[年支星名稱].地支);
        星曜矩陣[年支星名稱].宮位 = 地支矩陣[星曜矩陣[年支星名稱].地支數].宮位;
        
        if(年支星名稱 == "天馬") 地支矩陣[星曜矩陣[年支星名稱].地支數].星曜.祿馬星.push(年支星名稱); else 地支矩陣[星曜矩陣[年支星名稱].地支數].星曜.雜曜.push(年支星名稱);
    } // end for i, fill in 年支星群
    
    // ---------------- 安 火鈴 ----------------
    var 火星地支起始數, 鈴星地支起始數;
    //var 生時數減一 = 地支滾動(地支字數轉換(安星元件.生時), -1);
    
    switch(安星元件.生年地支) {
        case "寅": case "午": case "戌": 火星地支起始數 = 2; 鈴星地支起始數 = 4; break;
        case "申": case "子": case "辰": 火星地支起始數 = 3; 鈴星地支起始數 = 11; break;
        case "巳": case "酉": case "丑": 火星地支起始數 = 4; 鈴星地支起始數 = 11; break;
        case "亥": case "卯": case "未": 火星地支起始數 = 10; 鈴星地支起始數 = 11; break;  
    } // end switch(安星元件.生年地支)
    
    var 火星地支數 = 地支滾動(火星地支起始數, 地支滾動(地支字數轉換(安星元件.生時), -1));
    var 鈴星地支數 = 地支滾動(鈴星地支起始數, 地支滾動(地支字數轉換(安星元件.生時), -1));
    
    星曜矩陣["火星"].地支數 = 火星地支數;
    星曜矩陣["火星"].地支 = 地支字數轉換(火星地支數);
    星曜矩陣["火星"].宮位 = 地支矩陣[火星地支數].宮位;
    地支矩陣[火星地支數].星曜.六凶星.push("火星");
    
    星曜矩陣["鈴星"].地支數 = 鈴星地支數;
    星曜矩陣["鈴星"].地支 = 地支字數轉換(鈴星地支數);
    星曜矩陣["鈴星"].宮位 = 地支矩陣[鈴星地支數].宮位;
    地支矩陣[鈴星地支數].星曜.六凶星.push("鈴星");

    
    // ---------------- 安 天才 ----------------
    var 天才宮位矩陣 = ["命宮", "父母宮", "福德宮", "田宅宮", "官祿宮", "交友宮", "遷移宮", "疾厄宮", "財帛宮", "子女宮", "夫妻宮", "兄弟宮"];
    var 天才宮位數 = 地支滾動(地支字數轉換(安星元件.生年地支), -1);
    var 天才宮位 = 天才宮位矩陣[天才宮位數]
    var 天才地支數 = -1;
    var 天才地支元件 = 宮位地支轉換(天才宮位, 地支矩陣);
    
    星曜矩陣["天才"].地支 = 天才地支元件.地支;
    星曜矩陣["天才"].地支數 = 天才地支元件.地支數;
    星曜矩陣["天才"].宮位 = 天才宮位;
    地支矩陣[天才地支元件.地支數].星曜.雜曜.push("天才");
    
    // ---------------- 安 天壽 ----------------
    var 天壽地支數 = 地支滾動(安星元件.身宮地支數, 地支滾動(地支字數轉換(安星元件.生年地支), -1));
    星曜矩陣["天壽"].地支 = 地支字數轉換(天壽地支數);
    星曜矩陣["天壽"].地支數 = 天壽地支數;
    星曜矩陣["天壽"].宮位 = 地支矩陣[天壽地支數].宮位;
    地支矩陣[天壽地支數].星曜.雜曜.push("天壽");
    
    // ---------------- 安 月系星 ----------------：左輔，右弼，天刑，天姚，天馬，解神，天巫，天月，陰煞
    var 月系星矩陣 = [
        { "生月": 1, "左輔": "辰", "右弼": "戌", "天刑": "酉", "天姚": "丑", "解神": "申", "天巫": "巳", "天月": "戌", "陰煞": "寅"},
        { "生月": 2, "左輔": "巳", "右弼": "酉", "天刑": "戌", "天姚": "寅", "解神": "申", "天巫": "申", "天月": "巳", "陰煞": "子"},
        { "生月": 3, "左輔": "午", "右弼": "申", "天刑": "亥", "天姚": "卯", "解神": "戌", "天巫": "寅", "天月": "辰", "陰煞": "戌"},
        { "生月": 4, "左輔": "未", "右弼": "未", "天刑": "子", "天姚": "辰", "解神": "戌", "天巫": "亥", "天月": "寅", "陰煞": "申"},
        { "生月": 5, "左輔": "申", "右弼": "午", "天刑": "丑", "天姚": "巳", "解神": "子", "天巫": "巳", "天月": "未", "陰煞": "午"},
        { "生月": 6, "左輔": "酉", "右弼": "巳", "天刑": "寅", "天姚": "午", "解神": "子", "天巫": "申", "天月": "卯", "陰煞": "辰"},
        { "生月": 7, "左輔": "戌", "右弼": "辰", "天刑": "卯", "天姚": "未", "解神": "寅", "天巫": "寅", "天月": "亥", "陰煞": "寅"},
        { "生月": 8, "左輔": "亥", "右弼": "卯", "天刑": "辰", "天姚": "申", "解神": "寅", "天巫": "亥", "天月": "未", "陰煞": "子"},
        { "生月": 9, "左輔": "子", "右弼": "寅", "天刑": "巳", "天姚": "酉", "解神": "辰", "天巫": "巳", "天月": "寅", "陰煞": "戌"},
        { "生月": 10, "左輔": "丑", "右弼": "丑", "天刑": "午", "天姚": "戌", "解神": "辰", "天巫": "申", "天月": "午", "陰煞": "申"},
        { "生月": 11, "左輔": "寅", "右弼": "子", "天刑": "未", "天姚": "亥", "解神": "午", "天巫": "寅", "天月": "戌", "陰煞": "午"},
        { "生月": 12, "左輔": "卯", "右弼": "亥", "天刑": "申", "天姚": "子", "解神": "午", "天巫": "亥", "天月": "寅", "陰煞": "辰"}
    ];
    
    var 月系星群 = ["左輔", "右弼", "天刑", "天姚", "解神", "天巫", "天月", "陰煞"];
    var 月系星名稱;
    
    資料索引=_.findIndex(月系星矩陣, {生月: 安星元件.生月});
    
    for(var i=0; i<月系星群.length; i++){
        月系星名稱 = 月系星群[i];
        星曜矩陣[月系星名稱].地支 = 月系星矩陣[資料索引][月系星名稱];
        星曜矩陣[月系星名稱].地支數 = 地支字數轉換(星曜矩陣[月系星名稱].地支);
        星曜矩陣[月系星名稱].宮位 = 地支矩陣[星曜矩陣[月系星名稱].地支數].宮位;
        
        if(月系星名稱=="左輔" || 月系星名稱=="右弼") 地支矩陣[星曜矩陣[月系星名稱].地支數].星曜.六吉星.push(月系星名稱); 
        if(月系星名稱=="天馬") 地支矩陣[星曜矩陣[月系星名稱].地支數].星曜.祿馬星.push(月系星名稱); 
        if(月系星名稱!="左輔" && 月系星名稱!="右弼" && 月系星名稱!="天馬") 地支矩陣[星曜矩陣[月系星名稱].地支數].星曜.雜曜.push(月系星名稱);
    } // end for i, fill in 月系星群
    
    
    // ---------------- 安 時系星 ----------------：文昌，文曲，地劫，地空，台輔，封誥
    var 時系星矩陣 = [
        { "時支": "子", "文昌": "戌", "文曲": "辰", "地劫": "亥", "地空": "亥", "台輔": "午", "封誥": "寅"},
        { "時支": "丑", "文昌": "酉", "文曲": "巳", "地劫": "子", "地空": "戌", "台輔": "未", "封誥": "卯"},
        { "時支": "寅", "文昌": "申", "文曲": "午", "地劫": "丑", "地空": "酉", "台輔": "申", "封誥": "辰"},
        { "時支": "卯", "文昌": "未", "文曲": "未", "地劫": "寅", "地空": "申", "台輔": "酉", "封誥": "巳"},
        { "時支": "辰", "文昌": "午", "文曲": "申", "地劫": "卯", "地空": "未", "台輔": "戌", "封誥": "午"},
        { "時支": "巳", "文昌": "巳", "文曲": "酉", "地劫": "辰", "地空": "午", "台輔": "亥", "封誥": "未"},
        { "時支": "午", "文昌": "辰", "文曲": "戌", "地劫": "巳", "地空": "巳", "台輔": "子", "封誥": "申"},
        { "時支": "未", "文昌": "卯", "文曲": "亥", "地劫": "午", "地空": "辰", "台輔": "丑", "封誥": "酉"},
        { "時支": "申", "文昌": "寅", "文曲": "子", "地劫": "未", "地空": "卯", "台輔": "寅", "封誥": "戌"},
        { "時支": "酉", "文昌": "丑", "文曲": "丑", "地劫": "申", "地空": "寅", "台輔": "卯", "封誥": "亥"},
        { "時支": "戌", "文昌": "子", "文曲": "寅", "地劫": "酉", "地空": "丑", "台輔": "辰", "封誥": "子"},
        { "時支": "亥", "文昌": "亥", "文曲": "卯", "地劫": "戌", "地空": "子", "台輔": "巳", "封誥": "丑"}
    ];
    
    var 時系星群 = ["文昌", "文曲", "地劫", "地空", "台輔", "封誥"];
    var 時系星名稱;
    
    資料索引=_.findIndex(時系星矩陣, {時支: 安星元件.生時});
    
    for(var i=0; i<時系星群.length; i++){
        時系星名稱 = 時系星群[i];
        星曜矩陣[時系星名稱].地支 = 時系星矩陣[資料索引][時系星名稱];
        星曜矩陣[時系星名稱].地支數 = 地支字數轉換(星曜矩陣[時系星名稱].地支);
        星曜矩陣[時系星名稱].宮位 = 地支矩陣[星曜矩陣[時系星名稱].地支數].宮位;
        
        if(時系星名稱=="文昌" || 時系星名稱=="文曲") 地支矩陣[星曜矩陣[時系星名稱].地支數].星曜.六吉星.push(時系星名稱);
        if(時系星名稱=="地劫" || 時系星名稱=="地空") 地支矩陣[星曜矩陣[時系星名稱].地支數].星曜.六凶星.push(時系星名稱);
        if(時系星名稱=="台輔" || 時系星名稱=="封誥") 地支矩陣[星曜矩陣[時系星名稱].地支數].星曜.雜曜.push(時系星名稱);
    } // end for i, fill in 時系星群
    
    
    var 三台地支數 = 地支滾動(星曜矩陣["左輔"].地支數, 安星元件.生日 -1);
    var 八座地支數 = 地支滾動(星曜矩陣["右弼"].地支數, -1*(安星元件.生日 -1));
    var 恩光地支數 = 地支滾動(地支滾動(星曜矩陣["文昌"].地支數, 安星元件.生日 -1),-1);
    var 天貴地支數 = 地支滾動(地支滾動(星曜矩陣["文曲"].地支數, 安星元件.生日 -1),-1);
    
    星曜矩陣["三台"].地支數 = 三台地支數;
    星曜矩陣["三台"].地支 = 地支字數轉換(三台地支數);
    星曜矩陣["三台"].宮位 = 地支矩陣[三台地支數].宮位;
    地支矩陣[三台地支數].星曜.雜曜.push("三台");
    
    星曜矩陣["八座"].地支數 = 八座地支數;
    星曜矩陣["八座"].地支 = 地支字數轉換(八座地支數);
    星曜矩陣["八座"].宮位 = 地支矩陣[八座地支數].宮位;
    地支矩陣[八座地支數].星曜.雜曜.push("八座");
    
    星曜矩陣["恩光"].地支數 = 恩光地支數;
    星曜矩陣["恩光"].地支 = 地支字數轉換(恩光地支數);
    星曜矩陣["恩光"].宮位 = 地支矩陣[恩光地支數].宮位;
    地支矩陣[恩光地支數].星曜.雜曜.push("恩光");
    
    星曜矩陣["天貴"].地支數 = 天貴地支數;
    星曜矩陣["天貴"].地支 = 地支字數轉換(天貴地支數);
    星曜矩陣["天貴"].宮位 = 地支矩陣[天貴地支數].宮位;
    地支矩陣[天貴地支數].星曜.雜曜.push("天貴");
    
    
    // ---------------- 安 天殤（在疾厄宮），天使（在朋友宮） ----------------
    var 天殤地支數 = 宮位地支轉換("疾厄宮", 地支矩陣).地支數;
    星曜矩陣["天殤"].地支數 = 天殤地支數
    星曜矩陣["天殤"].地支 = 地支字數轉換(天殤地支數);
    星曜矩陣["天殤"].宮位 = 地支矩陣[天殤地支數].宮位;
    地支矩陣[天殤地支數].星曜.雜曜.push("天殤");
    
    var 天使地支數 = 宮位地支轉換("交友宮", 地支矩陣).地支數;
    星曜矩陣["天使"].地支數 = 天使地支數
    星曜矩陣["天使"].地支 = 地支字數轉換(天使地支數);
    星曜矩陣["天使"].宮位 = 地支矩陣[天使地支數].宮位;
    地支矩陣[天使地支數].星曜.雜曜.push("天使");
    
    
    // ---------------- 安 旬空 ----------------
    var 生年干支 = 安星元件.生年天干 + 安星元件.生年地支;
    var 旬别 = 六十干支屬性(六十干支字轉值(生年干支), "元件").旬别;
    var 旬空地支, 陽支, 陰支;
    
    switch(旬别){
        case "甲子": 陽支 = "戌"; 陰支 = "亥"; break;
        case "甲戌": 陽支 = "申"; 陰支 = "酉"; break;
        case "甲申": 陽支 = "午"; 陰支 = "未"; break;
        case "甲午": 陽支 = "辰"; 陰支 = "巳"; break;
        case "甲辰": 陽支 = "寅"; 陰支 = "卯"; break;
        case "甲寅": 陽支 = "子"; 陰支 = "丑"; break;
    } // end switch 旬别
    
    var 生年支陰陽 = 地支屬性(安星元件.生年地支, "陰陽");
    
    旬空地支 = (生年支陰陽 == "陽") ? 陽支 : 陰支;  //console.log(生年支陰陽 + " / " + 旬空地支);
    
    星曜矩陣["旬空"].地支 = 旬空地支;
    星曜矩陣["旬空"].地支數 = 地支字數轉換(旬空地支);
    星曜矩陣["旬空"].宮位 = 地支矩陣[星曜矩陣["旬空"].地支數].宮位;
    地支矩陣[星曜矩陣["旬空"].地支數].星曜.空曜.push("旬空");
    
    
    // ---------------- 安 長生十二神 ----------------
    var 長生十二神矩陣 = [
        { "長生十二神": "長生", "水二局陽男陰女": "申", "水二局陽女陰男": "申", "木三局陽男陰女": "亥", "木三局陽女陰男": "亥", "金四局陽男陰女": "巳", "金四局陽女陰男": "巳", "土五局陽男陰女": "申", "土五局陽女陰男": "申", "火六局陽男陰女": "寅", "火六局陽女陰男": "寅"},
        { "長生十二神": "沐浴", "水二局陽男陰女": "酉", "水二局陽女陰男": "未", "木三局陽男陰女": "子", "木三局陽女陰男": "戌", "金四局陽男陰女": "午", "金四局陽女陰男": "辰", "土五局陽男陰女": "酉", "土五局陽女陰男": "未", "火六局陽男陰女": "卯", "火六局陽女陰男": "丑"},
        { "長生十二神": "冠帶", "水二局陽男陰女": "戌", "水二局陽女陰男": "午", "木三局陽男陰女": "丑", "木三局陽女陰男": "酉", "金四局陽男陰女": "未", "金四局陽女陰男": "巳", "土五局陽男陰女": "戌", "土五局陽女陰男": "午", "火六局陽男陰女": "辰", "火六局陽女陰男": "子"},
        { "長生十二神": "臨官", "水二局陽男陰女": "亥", "水二局陽女陰男": "巳", "木三局陽男陰女": "寅", "木三局陽女陰男": "申", "金四局陽男陰女": "申", "金四局陽女陰男": "午", "土五局陽男陰女": "亥", "土五局陽女陰男": "巳", "火六局陽男陰女": "巳", "火六局陽女陰男": "亥"},
        { "長生十二神": "帝旺", "水二局陽男陰女": "子", "水二局陽女陰男": "辰", "木三局陽男陰女": "卯", "木三局陽女陰男": "未", "金四局陽男陰女": "酉", "金四局陽女陰男": "未", "土五局陽男陰女": "子", "土五局陽女陰男": "辰", "火六局陽男陰女": "午", "火六局陽女陰男": "戌"},
        { "長生十二神": "衰", "水二局陽男陰女": "丑", "水二局陽女陰男": "卯", "木三局陽男陰女": "辰", "木三局陽女陰男": "午", "金四局陽男陰女": "戌", "金四局陽女陰男": "申", "土五局陽男陰女": "丑", "土五局陽女陰男": "卯", "火六局陽男陰女": "未", "火六局陽女陰男": "酉"},
        { "長生十二神": "病", "水二局陽男陰女": "寅", "水二局陽女陰男": "寅", "木三局陽男陰女": "巳", "木三局陽女陰男": "巳", "金四局陽男陰女": "亥", "金四局陽女陰男": "酉", "土五局陽男陰女": "寅", "土五局陽女陰男": "寅", "火六局陽男陰女": "申", "火六局陽女陰男": "申"},
        { "長生十二神": "死", "水二局陽男陰女": "卯", "水二局陽女陰男": "丑", "木三局陽男陰女": "午", "木三局陽女陰男": "辰", "金四局陽男陰女": "子", "金四局陽女陰男": "戌", "土五局陽男陰女": "卯", "土五局陽女陰男": "丑", "火六局陽男陰女": "酉", "火六局陽女陰男": "未"},
        { "長生十二神": "墓", "水二局陽男陰女": "辰", "水二局陽女陰男": "子", "木三局陽男陰女": "未", "木三局陽女陰男": "卯", "金四局陽男陰女": "丑", "金四局陽女陰男": "亥", "土五局陽男陰女": "辰", "土五局陽女陰男": "子", "火六局陽男陰女": "戌", "火六局陽女陰男": "午"},
        { "長生十二神": "絕", "水二局陽男陰女": "巳", "水二局陽女陰男": "亥", "木三局陽男陰女": "申", "木三局陽女陰男": "寅", "金四局陽男陰女": "寅", "金四局陽女陰男": "子", "土五局陽男陰女": "巳", "土五局陽女陰男": "亥", "火六局陽男陰女": "亥", "火六局陽女陰男": "巳"},
        { "長生十二神": "胎", "水二局陽男陰女": "午", "水二局陽女陰男": "戌", "木三局陽男陰女": "酉", "木三局陽女陰男": "丑", "金四局陽男陰女": "卯", "金四局陽女陰男": "丑", "土五局陽男陰女": "午", "土五局陽女陰男": "戌", "火六局陽男陰女": "子", "火六局陽女陰男": "辰"},
        { "長生十二神": "養", "水二局陽男陰女": "未", "水二局陽女陰男": "酉", "木三局陽男陰女": "戌", "木三局陽女陰男": "子", "金四局陽男陰女": "辰", "金四局陽女陰男": "寅", "土五局陽男陰女": "未", "土五局陽女陰男": "酉", "火六局陽男陰女": "丑", "火六局陽女陰男": "卯"}
    ];
    var 長生十二神星群 = ["長生", "沐浴", "冠帶", "臨官", "帝旺", "衰", "病", "死", "墓", "絕", "胎", "養"];
    var 長生十二神名稱;
    var 陰陽男女 = (安星元件.男女 == "陽男" || 安星元件.男女 == "陰女") ? "陽男陰女" : "陽女陰男";
    
    for(var i=0; i < 12; i++){
        長生十二神名稱 = 長生十二神星群[i];
        資料索引=_.findIndex(長生十二神矩陣, {長生十二神: 長生十二神名稱});
        星曜矩陣[長生十二神名稱].地支 = 長生十二神矩陣[資料索引][安星元件.五行局+陰陽男女];
        星曜矩陣[長生十二神名稱].地支數 = 地支字數轉換(星曜矩陣[長生十二神名稱].地支);
        星曜矩陣[長生十二神名稱].宮位 = 地支矩陣[星曜矩陣[長生十二神名稱].地支數].宮位;
        
        地支矩陣[星曜矩陣[長生十二神名稱].地支數].星曜.十二長生 = 長生十二神名稱;
    } // end for i 長生十二神

 
    // ---------------- 安 博士十二神 ----------------
    //祿存地支
    var 博士十二神矩陣 = [
        { "博士十二神": "博士", "子陽男陰女": "子", "子陽女陰男": "子", "寅陽男陰女": "寅", "寅陽女陰男": "寅", "卯陽男陰女": "卯", "卯陽女陰男": "卯", "巳陽男陰女": "巳", "巳陽女陰男": "巳", "午陽男陰女": "午", "午陽女陰男": "午", "申陽男陰女": "申", "申陽女陰男": "申", "酉陽男陰女": "酉", "酉陽女陰男": "酉", "亥陽男陰女": "亥", "亥陽女陰男": "亥"},
        { "博士十二神": "力士", "子陽男陰女": "丑", "子陽女陰男": "亥", "寅陽男陰女": "卯", "寅陽女陰男": "丑", "卯陽男陰女": "辰", "卯陽女陰男": "寅", "巳陽男陰女": "午", "巳陽女陰男": "辰", "午陽男陰女": "未", "午陽女陰男": "巳", "申陽男陰女": "酉", "申陽女陰男": "未", "酉陽男陰女": "戌", "酉陽女陰男": "申", "亥陽男陰女": "子", "亥陽女陰男": "戌"},
        { "博士十二神": "青龍", "子陽男陰女": "寅", "子陽女陰男": "戌", "寅陽男陰女": "辰", "寅陽女陰男": "子", "卯陽男陰女": "巳", "卯陽女陰男": "丑", "巳陽男陰女": "未", "巳陽女陰男": "巳", "午陽男陰女": "申", "午陽女陰男": "辰", "申陽男陰女": "戌", "申陽女陰男": "午", "酉陽男陰女": "亥", "酉陽女陰男": "未", "亥陽男陰女": "丑", "亥陽女陰男": "酉"},
        { "博士十二神": "小耗博士", "子陽男陰女": "卯", "子陽女陰男": "酉", "寅陽男陰女": "巳", "寅陽女陰男": "亥", "卯陽男陰女": "午", "卯陽女陰男": "子", "巳陽男陰女": "申", "巳陽女陰男": "午", "午陽男陰女": "酉", "午陽女陰男": "卯", "申陽男陰女": "亥", "申陽女陰男": "巳", "酉陽男陰女": "子", "酉陽女陰男": "午", "亥陽男陰女": "寅", "亥陽女陰男": "申"},
        { "博士十二神": "將軍", "子陽男陰女": "辰", "子陽女陰男": "申", "寅陽男陰女": "午", "寅陽女陰男": "戌", "卯陽男陰女": "未", "卯陽女陰男": "亥", "巳陽男陰女": "酉", "巳陽女陰男": "未", "午陽男陰女": "戌", "午陽女陰男": "寅", "申陽男陰女": "子", "申陽女陰男": "辰", "酉陽男陰女": "丑", "酉陽女陰男": "巳", "亥陽男陰女": "卯", "亥陽女陰男": "未"},
        { "博士十二神": "奏書", "子陽男陰女": "巳", "子陽女陰男": "未", "寅陽男陰女": "未", "寅陽女陰男": "酉", "卯陽男陰女": "申", "卯陽女陰男": "戌", "巳陽男陰女": "戌", "巳陽女陰男": "申", "午陽男陰女": "亥", "午陽女陰男": "丑", "申陽男陰女": "丑", "申陽女陰男": "卯", "酉陽男陰女": "寅", "酉陽女陰男": "辰", "亥陽男陰女": "辰", "亥陽女陰男": "午"},
        { "博士十二神": "飛廉", "子陽男陰女": "午", "子陽女陰男": "午", "寅陽男陰女": "申", "寅陽女陰男": "申", "卯陽男陰女": "酉", "卯陽女陰男": "酉", "巳陽男陰女": "亥", "巳陽女陰男": "酉", "午陽男陰女": "子", "午陽女陰男": "子", "申陽男陰女": "寅", "申陽女陰男": "寅", "酉陽男陰女": "卯", "酉陽女陰男": "卯", "亥陽男陰女": "巳", "亥陽女陰男": "巳"},
        { "博士十二神": "喜神", "子陽男陰女": "未", "子陽女陰男": "巳", "寅陽男陰女": "酉", "寅陽女陰男": "未", "卯陽男陰女": "戌", "卯陽女陰男": "申", "巳陽男陰女": "子", "巳陽女陰男": "戌", "午陽男陰女": "丑", "午陽女陰男": "亥", "申陽男陰女": "卯", "申陽女陰男": "丑", "酉陽男陰女": "辰", "酉陽女陰男": "寅", "亥陽男陰女": "午", "亥陽女陰男": "辰"},
        { "博士十二神": "病符博士", "子陽男陰女": "申", "子陽女陰男": "辰", "寅陽男陰女": "戌", "寅陽女陰男": "午", "卯陽男陰女": "亥", "卯陽女陰男": "未", "巳陽男陰女": "丑", "巳陽女陰男": "亥", "午陽男陰女": "寅", "午陽女陰男": "戌", "申陽男陰女": "辰", "申陽女陰男": "子", "酉陽男陰女": "巳", "酉陽女陰男": "丑", "亥陽男陰女": "未", "亥陽女陰男": "卯"},
        { "博士十二神": "大耗", "子陽男陰女": "酉", "子陽女陰男": "卯", "寅陽男陰女": "亥", "寅陽女陰男": "巳", "卯陽男陰女": "丑", "卯陽女陰男": "午", "巳陽男陰女": "寅", "巳陽女陰男": "子", "午陽男陰女": "卯", "午陽女陰男": "酉", "申陽男陰女": "巳", "申陽女陰男": "亥", "酉陽男陰女": "午", "酉陽女陰男": "子", "亥陽男陰女": "申", "亥陽女陰男": "寅"},
        { "博士十二神": "伏兵", "子陽男陰女": "戌", "子陽女陰男": "寅", "寅陽男陰女": "丑", "寅陽女陰男": "辰", "卯陽男陰女": "子", "卯陽女陰男": "巳", "巳陽男陰女": "卯", "巳陽女陰男": "丑", "午陽男陰女": "辰", "午陽女陰男": "申", "申陽男陰女": "午", "申陽女陰男": "戌", "酉陽男陰女": "未", "酉陽女陰男": "亥", "亥陽男陰女": "酉", "亥陽女陰男": "丑"},
        { "博士十二神": "官府", "子陽男陰女": "亥", "子陽女陰男": "丑", "寅陽男陰女": "子", "寅陽女陰男": "卯", "卯陽男陰女": "丑", "卯陽女陰男": "辰", "巳陽男陰女": "辰", "巳陽女陰男": "寅", "午陽男陰女": "巳", "午陽女陰男": "未", "申陽男陰女": "未", "申陽女陰男": "酉", "酉陽男陰女": "申", "酉陽女陰男": "戌", "亥陽男陰女": "戌", "亥陽女陰男": "子"}
    ];
    
    var 博士十二神星群 = ["博士", "力士", "青龍", "小耗博士", "將軍", "奏書", "飛廉", "喜神", "病符博士", "大耗", "伏兵", "官府"];
    var 博士十二神名稱;
    var 陰陽男女 = (安星元件.男女 == "陽男" || 安星元件.男女 == "陰女") ? "陽男陰女" : "陽女陰男";
    var 祿存地支 = 星曜矩陣["祿存"].地支;
    
    for(var i=0; i < 博士十二神星群.length; i++){
        博士十二神名稱 = 博士十二神星群[i];
        資料索引=_.findIndex(博士十二神矩陣, {博士十二神: 博士十二神名稱});
        星曜矩陣[博士十二神名稱].地支 = 博士十二神矩陣[資料索引][祿存地支+陰陽男女];
        星曜矩陣[博士十二神名稱].地支數 = 地支字數轉換(星曜矩陣[博士十二神名稱].地支);
        星曜矩陣[博士十二神名稱].宮位 = 地支矩陣[星曜矩陣[博士十二神名稱].地支數].宮位;
        
        地支矩陣[星曜矩陣[博士十二神名稱].地支數].星曜.博士星 = 博士十二神名稱;
    } // end for i 博士十二神
    
    
    // ---------------- 安 將前十二星 ----------------
    var 年支三合;
    
    switch(安星元件.生年地支){
        case "申": case "子": case "辰": 年支三合 = "申子辰"; break;
        case "巳": case "酉": case "丑": 年支三合 = "巳酉丑"; break;
        case "寅": case "午": case "戌": 年支三合 = "寅午戌"; break;
        case "亥": case "卯": case "未": 年支三合 = "亥卯未"; break;
    }
    
    var 將前十二神矩陣 = [
        { "年支": "申子辰", "將星": "子", "攀鞍": "丑", "歲驛": "寅", "息神": "卯", "華蓋": "辰", "劫煞": "巳", "災煞": "午", "天煞": "未", "指背": "申", "咸池": "酉", "月煞": "戌", "亡神": "亥"},
        { "年支": "巳酉丑", "將星": "酉", "攀鞍": "戌", "歲驛": "亥", "息神": "子", "華蓋": "丑", "劫煞": "寅", "災煞": "卯", "天煞": "辰", "指背": "巳", "咸池": "午", "月煞": "未", "亡神": "申"},
        { "年支": "寅午戌", "將星": "午", "攀鞍": "未", "歲驛": "申", "息神": "酉", "華蓋": "戌", "劫煞": "亥", "災煞": "子", "天煞": "丑", "指背": "寅", "咸池": "卯", "月煞": "辰", "亡神": "巳"},
        { "年支": "亥卯未", "將星": "卯", "攀鞍": "辰", "歲驛": "巳", "息神": "午", "華蓋": "未", "劫煞": "申", "災煞": "酉", "天煞": "戌", "指背": "亥", "咸池": "子", "月煞": "丑", "亡神": "寅"}
    ];
    
    var 將前十二神星群 = ["將星", "攀鞍", "歲驛", "息神", "華蓋", "劫煞", "災煞", "天煞", "指背", "咸池", "月煞", "亡神"];
    var 將前十二神名稱;

    
    資料索引=_.findIndex(將前十二神矩陣, {年支: 年支三合});

    for(var i=0; i < 將前十二神星群.length; i++){
        將前十二神名稱 = 將前十二神星群[i];
        星曜矩陣[將前十二神名稱].地支 = 將前十二神矩陣[資料索引][將前十二神名稱];
        星曜矩陣[將前十二神名稱].地支數 = 地支字數轉換(星曜矩陣[將前十二神名稱].地支);
        星曜矩陣[將前十二神名稱].宮位 = 地支矩陣[星曜矩陣[將前十二神名稱].地支數].宮位;
        
        地支矩陣[星曜矩陣[將前十二神名稱].地支數].星曜.將前星 = 將前十二神名稱;
    } // end for i 將前十二神
    
    
    // ---------------- 安 歲前十二星 ----------------
    var 生年地支數 = 地支字數轉換(安星元件.生年地支);
    var 歲前十二神星群 =["歲建", "晦氣", "喪門", "貫索", "官符", "小耗", "歲破", "龍德", "白虎", "天德", "弔客", "病符"];
    
    for(var i=0; i < 12; i++){
        星曜矩陣[歲前十二神星群[i]].地支數 = 地支滾動(生年地支數, i);
        星曜矩陣[歲前十二神星群[i]].地支 = 地支字數轉換(星曜矩陣[歲前十二神星群[i]].地支數);
        星曜矩陣[歲前十二神星群[i]].宮位 = 地支矩陣[星曜矩陣[歲前十二神星群[i]].地支數].宮位;
        
        地支矩陣[地支滾動(生年地支數, i)].星曜.歲前星 = 歲前十二神星群[i];
    }  // end for
    
    
    // ************************** 更新 星曜 廟陷 四地**************************
    Object.keys(星曜矩陣).forEach(function (key) {
        星曜矩陣[key]['廟陷'] = 尋三合星曜廟陷(key, 星曜矩陣[key]['地支']);
        if(星曜矩陣[key]['廟陷'].數 >=4) 星曜矩陣[key].廟旺 = true;
        if(星曜矩陣[key]['廟陷'].數 <3) 星曜矩陣[key].落陷 = true;
        星曜矩陣[key]['四地'] = 地支轉換四地(星曜矩陣[key]['地支']);
    });
    
    //console.log(星曜矩陣);
    
    //for(var i=0; i<12; i++) 地支矩陣[i].主星 = 地支矩陣[i].星曜.slice(0);  //duplicate into 主星
} //end function 安三合星曜


// -------------------- 三合流曜 --------------------
function 三合流曜 (輸入天干, 輸入地支, 流運){
    //流運：大限 / 流年
    
    if(流運 !="大限" && 流運 !="流年") return;
    
    var 流曜 = {
        文昌 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大昌" : "流昌" },
        文曲 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大曲" : "流曲" },
        擎羊 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大羊" : "流羊" },
        陀羅 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大陀" : "流陀" },
        天魁 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大魁" : "流魁" },
        天鉞 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大鉞" : "流鉞" },
        祿存 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大祿" : "流祿" },
        天馬 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大馬" : "流馬" },
        紅鸞 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大鸞" : "流鸞" },
        天喜 : {"地支": "", "地支數": -1, "名": (流運 == "大限") ? "大喜" : "流喜" }
    };
    
    var 天干流曜 = [
        { "天干": "甲", "祿存": "寅", "擎羊": "卯", "陀羅": "丑", "天魁": "丑", "天鉞": "未", "文昌": "巳", "文曲": "酉"},
        { "天干": "乙", "祿存": "卯", "擎羊": "辰", "陀羅": "寅", "天魁": "子", "天鉞": "申", "文昌": "午", "文曲": "申"},
        { "天干": "丙", "祿存": "巳", "擎羊": "午", "陀羅": "辰", "天魁": "亥", "天鉞": "酉", "文昌": "申", "文曲": "午"},
        { "天干": "丁", "祿存": "午", "擎羊": "未", "陀羅": "巳", "天魁": "亥", "天鉞": "酉", "文昌": "酉", "文曲": "巳"},
        { "天干": "戊", "祿存": "巳", "擎羊": "午", "陀羅": "辰", "天魁": "丑", "天鉞": "未", "文昌": "申", "文曲": "午"},
        { "天干": "己", "祿存": "午", "擎羊": "未", "陀羅": "巳", "天魁": "子", "天鉞": "申", "文昌": "酉", "文曲": "巳"},
        { "天干": "庚", "祿存": "申", "擎羊": "酉", "陀羅": "未", "天魁": "丑", "天鉞": "未", "文昌": "亥", "文曲": "卯"},
        { "天干": "辛", "祿存": "酉", "擎羊": "戌", "陀羅": "申", "天魁": "午", "天鉞": "寅", "文昌": "子", "文曲": "寅"},
        { "天干": "壬", "祿存": "亥", "擎羊": "子", "陀羅": "戌", "天魁": "卯", "天鉞": "巳", "文昌": "寅", "文曲": "子"},
        { "天干": "癸", "祿存": "子", "擎羊": "丑", "陀羅": "亥", "天魁": "卯", "天鉞": "巳", "文昌": "卯", "文曲": "亥"}
    ];
    
    var 天干星群 = ["祿存", "擎羊", "陀羅", "天魁", "天鉞", "文昌", "文曲"];
    var 天干流曜名稱;
    
    資料索引=_.findIndex(天干流曜, {天干: 輸入天干});

    for(var i=0; i < 天干星群.length; i++){
        天干流曜名稱 = 天干星群[i];
        流曜[天干流曜名稱].地支 = 天干流曜[資料索引][天干流曜名稱];
        流曜[天干流曜名稱].地支數 = 地支字數轉換(流曜[天干流曜名稱].地支);
    } // end for i 天干星群

    
    var 地支流曜 = [
        { "地支": "子", "天馬": "寅", "紅鸞": "卯", "天喜": "酉"},
        { "地支": "丑", "天馬": "亥", "紅鸞": "寅", "天喜": "申"},
        { "地支": "寅", "天馬": "申", "紅鸞": "丑", "天喜": "未"},
        { "地支": "卯", "天馬": "巳", "紅鸞": "子", "天喜": "午"},
        { "地支": "辰", "天馬": "寅", "紅鸞": "亥", "天喜": "巳"},
        { "地支": "巳", "天馬": "亥", "紅鸞": "戌", "天喜": "辰"},
        { "地支": "午", "天馬": "申", "紅鸞": "酉", "天喜": "卯"},
        { "地支": "未", "天馬": "巳", "紅鸞": "申", "天喜": "寅"},
        { "地支": "申", "天馬": "寅", "紅鸞": "未", "天喜": "丑"},
        { "地支": "酉", "天馬": "亥", "紅鸞": "午", "天喜": "子"},
        { "地支": "戌", "天馬": "申", "紅鸞": "巳", "天喜": "亥"},
        { "地支": "亥", "天馬": "巳", "紅鸞": "辰", "天喜": "戌"}
    ];

    var 地支星群 = ["天馬", "紅鸞", "天喜"];
    var 地支流曜名稱;
    
    資料索引=_.findIndex(地支流曜, {地支: 輸入地支});

    for(var i=0; i < 地支星群.length; i++){
        地支流曜名稱 = 地支星群[i];
        流曜[地支流曜名稱].地支 = 地支流曜[資料索引][地支流曜名稱];
        流曜[地支流曜名稱].地支數 = 地支字數轉換(流曜[地支流曜名稱].地支);
    } // end for i 地支星群
    
    delete 流曜.紅鸞; delete 流曜.天喜;  // exclude these 2
    return 流曜;
}  //end function 三合流曜


// -------------------- 三合四化 --------------------

function 三合四化(生年干, 地支矩陣, 星曜元件, 派別){
    if(派別===undefined) 派別 = "全集";
    //if(派別!="全集" && 派別!="全書" && 派別!="中洲派" && 派別!="北派") 派別 = "全集";
    
    var 四化星 = {
        "年干": 生年干,
        "派別": Number(派別),
        "化祿星": "", "化權星": "", "化科星": "", "化忌星": "", 
        "化祿星地支": "", "化權星地支": "", "化科星地支": "", "化忌星地支": "",
        "化祿星位置": "", "化權星位置": "", "化科星位置": "", "化忌星位置": ""
    } // end 四化星
    //四化星

    switch(生年干){  //default use 全集 1st
        case "甲": 四化星.化祿星 = "廉貞"; 四化星.化權星 = "破軍"; 四化星.化科星 = "武曲"; 四化星.化忌星 = "太陽"; break;
        case "乙": 四化星.化祿星 = "天機"; 四化星.化權星 = "天梁"; 四化星.化科星 = "紫微"; 四化星.化忌星 = "太陰"; break;
        case "丙": 四化星.化祿星 = "天同"; 四化星.化權星 = "天機"; 四化星.化科星 = "文昌"; 四化星.化忌星 = "廉貞"; break;
        case "丁": 四化星.化祿星 = "太陰"; 四化星.化權星 = "天同"; 四化星.化科星 = "天機"; 四化星.化忌星 = "巨門"; break;
        case "戊": 四化星.化祿星 = "貪狼"; 四化星.化權星 = "太陰"; 四化星.化科星 = "右弼"; 四化星.化忌星 = "天機"; break;
        case "己": 四化星.化祿星 = "武曲"; 四化星.化權星 = "貪狼"; 四化星.化科星 = "天梁"; 四化星.化忌星 = "文曲"; break;
        case "庚": 四化星.化祿星 = "太陽"; 四化星.化權星 = "武曲"; 四化星.化科星 = "太陰"; 四化星.化忌星 = "天同"; break;
        case "辛": 四化星.化祿星 = "巨門"; 四化星.化權星 = "太陽"; 四化星.化科星 = "文曲"; 四化星.化忌星 = "文昌"; break;
        case "壬": 四化星.化祿星 = "天梁"; 四化星.化權星 = "紫微"; 四化星.化科星 = "左輔"; 四化星.化忌星 = "武曲"; break;
        case "癸": 四化星.化祿星 = "破軍"; 四化星.化權星 = "巨門"; 四化星.化科星 = "太陰"; 四化星.化忌星 = "貪狼"; break;
    } // end switch 生年干
    
    switch(Number(派別)){
        case 1:  //"全書"
            //if(生年干 == "戊") {}
            if(生年干 == "庚") { 四化星.化科星 = "天同"; 四化星.化忌星 = "太陰"; }
            if(生年干 == "壬") { 四化星.化科星 = "天府"; }
            break;
        case 2: // "中洲派":
            if(生年干 == "戊") { 四化星.化科星 = "太陽"; }
            if(生年干 == "庚") { 四化星.化科星 = "天府"; }
            if(生年干 == "壬") { 四化星.化科星 = "天府"; }
            break;
        case 3: //"北派":
            if(生年干 == "庚") { 四化星.化科星 = "天同"; 四化星.化忌星 = "天相"; }
            break;
        case 4: //"占驗派":
            if(生年干 == "甲") { 四化星.化科星 = "文曲"; }
            if(生年干 == "庚") { 四化星.化科星 = "天同"; 四化星.化忌星 = "天相"; }
            if(生年干 == "辛") { 四化星.化科星 = "武曲"; }
            if(生年干 == "壬") { 四化星.化科星 = "天府"; }
            break;   
    } // end switch 派別
    
    四化星.化祿星地支 = 星曜元件[四化星.化祿星].地支;
    四化星.化權星地支 = 星曜元件[四化星.化權星].地支;
    四化星.化科星地支 = 星曜元件[四化星.化科星].地支;
    四化星.化忌星地支 = 星曜元件[四化星.化忌星].地支;

    return 四化星;
    //console.log(四化星);
    
}  // end function 三合四化



// --------------------------------------------

function 星曜含義(){
    var 星曜矩陣 = [
        {"星曜":"紫微","內值":0,"星斗":"北斗","拼音":"zǐwēi","五行":"己土","分類":"正曜","主司":"官祿主","化氣":"化氣為尊，掌爵祿。","註解":"","基本含義":"紫微屬陰土，為北斗主星，亦為領導群倫的星曜，所以古人稱之為「帝曜」，比喻為從前的皇帝。<br><br>有氣派，有領導力，愛發號施令。至於領導才能是否完美，命令是否正確，則要視乎紫微所落的宮位，以及三方四正所會合的星曜吉凶而定。<br><br>有調解力，即是所謂善於制化。所以紫微能制火、鈴、羊、陀、空、劫、化忌等星曜的凶焰，但卻不能避免巨門暗曜的影響。因為帝曜所在，雖群小懾服，可是皇帝卻不能避免進讒。巨門即有如讒臣，可以影響紫微的表現。<br><br>有克制力。這是指對七殺、破軍二曜而言。比較上破軍雖如將帥在外，不受君王的命令，沒有七殺那麼對紫微貼服，但紫微破軍同宮，亦可將破軍的破壞力變成開創力。<br><br>有競爭力。特別是對手愈強的時候，斗志愈強。倘若會合其他對競爭力有幫助的星曜，如天府、天相、化權、化科之類，則更不輕言讓步。<br><br>有自尊心，而且性格強烈，會維持自己的尊嚴，所以性格上便容易表現得自高自大，好惡隨心。倘若所會照的是煞曜而非吉曜，則有愛之欲其生，惡之欲其死的偏激。但處於逆境之時，卻能忍受內心的痛苦，不肯表露。<br><br>由於紫微是帝曜的緣故，所以最喜百官朝拱，最忌群臣遠離。百官及群臣，是指左輔、右弼﹔文昌、文曲﹔三台、八座﹔恩光、天貴﹔祿存、天馬﹔天魁、天鉞等曜。雖亦喜天府、天相朝拱，但仍不如百官朝拱的格局。所以紫微坐命得百官朝拱，可以大富大貴。得「府相朝垣」者只是格局不低，能將紫微的特性一一發揮而已，未必能富貴。<br><br>如果沒有百官朝拱，便是群臣遠離。假如連「府相朝垣」都沒有，那便如一位在野的孤君，表現得落落寡合。但由於究竟是帝皇之尊，所以仍然有不同於俗流的思想。<br><br>在野孤君再逢空、劫、四煞，則只宜於發揮其超脫的思想，所以古人認為適宜僧道。但在現代，則可發展成為思想獨特的人物。倘能見貪狼、天才，或會廉貞，則可能是位藝術家或設計師。<br><br>但在野孤君若見煞空諸曜，卻與太陰相會，則其超脫的思想反而不發揮。由於太陰的影響，會變成喜弄權術，好耍手段的人。<br><br>除了「三方四正」之外，紫微易受左右兩宮的影響。最喜左輔、右弼相夾，其次為文曲、文昌相夾。如果碰到火星、鈴星夾，或者擎羊、陀羅夾，那麼就會有化為暴君的可能，亦即盡量發揮紫微壞性質的一面。","後天卦":"坤","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天機","內值":1,"星斗":"南斗","拼音":"tiānjī","五行":"乙木","分類":"正曜","主司":"兄弟主","化氣":"化氣為善，益壽之星。","註解":"","基本含義":"天機為南斗第一星，五行屬陰木，化氣為善。<br><br>天機的基本性質是機變靈活，可以譬喻為謀士或軍師。<br><br>從好的一方面來說，天機主聰明敏睿，處事有條理，所以善於學習，可成為多才多藝的人。而且由於敏睿的特性，其人對事則反應敏捷，對人則八面玲瓏。<br><br>天機便有好動腦筋成為智囊的品格，而且也擅長分析與策劃，兼且有專門技能——這都是謀臣與軍師的特性。<br><br>從缺點方面來說，天機卻有過份思慮、好操心的特質。所以便表現得不能堅持一己的計劃，因為計劃進行到一個階段，他於過慮的緣故，已經想到要變動計劃。具體來說，天機坐命的人容易見異思遷，多學不實，欲望過高。<br><br>天機守命不宜經商，特別是不宜創業，只宜從事策劃性的僚幕工作。否則經營開創之時，容易因腦筋動得太快，思慮走入牛角尖而患得患失，不能堅持方針招致失敗。<br><br>天機抵抗以及化解煞、忌、刑諸凶曜的力量甚為薄弱。天機本身且甚嫌化忌，使本身優點不能發揮，而缺點則完全暴露。可是亦恰與紫微相反，天機不忌巨門。巨門對天機的影響，只是易生背后的是非，尤其是語言上的誤會。","後天卦":"巽","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"太陽","內值":2,"星斗":"中天","拼音":"tàiyáng","五行":"丙火","分類":"正曜","主司":"官祿主","化氣":"化氣為貴，掌貴祿。為官祿宮主星，動態、競爭行業。也是父、子、夫星。","註解":"","基本含義":"太陽屬中天星系主星，不屬南北斗，五行屬陽火，化氣為貴。<br><br>太陽的光芒與威力，有時甚至比紫微還要普照得廣遠，可是太陽的光與熱卻只施而不受，所以太陽的最主要特質，便是主貴而不主富，主名而不主利。<br><br>由於這種性質，太陽最宜守事業宮，其中又以居於巳、午二宮最有氣勢。因為在巳宮是太陽即將走至中天，在午宮則如日方中，所以氣勢無倫。若居於落陷的宮位，則主為事業而操心勞碌。<br><br>太陽既屬中天星系的主星，喜歡百官朝拱，喜得左輔、右弼、天魁、天鉞、文昌、文曲、三台、八座、恩光、天貴等貴吉之星會照。若不得百官朝拱，反會四煞，或煞多吉少，則主橫發橫破，富貴不能耐久。倘吉多煞少，則主心高氣傲。<br><br>太陽所忌，除火、鈴、羊、陀四煞之外，尤忌巨門。因巨門為暗曜可以掩蓋陽光。亦不喜本身化忌，主對眼目不利。<br><br>太陽於戌、亥、子、丑四宮落陷。在戌宮，主有近視散光眼疾﹔在亥宮為日月反背的格局，若會祿存、化祿、天馬諸曜，稱為得「祿馬交馳」，反能既富且貴。太陽於卯、午二宮入廟，在卯宮為「旭日東升」，主人有朝氣﹔在午宮為「日麗中天」，權祿雖重，但陽光過份猛烈，亦易患目疾。<br><br>在男命，太陽為父星及子星﹔在女命，太陽為父星、夫星及子星。凡太陽在命宮，總對六親中的男性帶點刑剋的性質。刑剋的程度則須依其所處的宮位，以及同宮或會照的星曜吉凶而定。太陽在午宮，陽光猛烈，所以對男性六親的刑剋程度，一般來說亦較其他宮位為大。<br><br>此外，凡太陽在命者，宜日生人，不宜夜生人。夜生人而居於陷宮，即使不會刑煞諸曜，刑剋男性六親的程度亦大。若日生人，則程度一般減輕。<br><br>太陽普照萬物，所以主慷慨、慈和、氣量寬宏。但於陷宮則易華而不實。女命太陽，則主有丈夫之志，既賢淑且有主見，不易發生感情上的困擾。唯若與火星同宮，則反易感情用事。","後天卦":"離","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"武曲","內值":3,"星斗":"北斗","拼音":"wǔqū","五行":"辛金","分類":"正曜","主司":"財帛主","化氣":"化氣為財，掌財帛，但必需挖掘，冶煉才能發揮功用，所以武曲必須先有事業才能進財。財多人散，故武曲星主孤寡。","註解":"","基本含義":"武曲為北斗第六星，屬陰金，化氣為財。<br><br>在性格方面，武曲主決斷明快，其缺點則為短慮。於人命中能發亦能敗。<br><br>武曲性剛，所以不宜再見火鈴同度。若見，必易因一時沖動而生災厄，於化解災難之時，要付很大的代價。由於性剛的緣故，武曲亦不宜見文曜（文昌、文曲、化科），否則反主人優柔寡斷，但外表卻似很有主見，以致進退之間失去分寸。這有如讓有文才的人去管理軍事，自然不覺得適合。<br><br>武曲雖然不是戰將，像七殺和破軍那樣馳騁沙場，但從性剛一點來說，卻亦有如位列朝班的武臣，所以總帶點孤剋，不似文曜那麼柔和。武剛文柔，是基本特性。<br><br>因此武曲比文曜更嫌化忌。若化忌星，主事業失敗，錢財耗散。倘更會煞星，則必須寧靜忍耐，否則易見崩散。但武曲卻最喜化祿，主財源泉涌，若再見祿存、天馬，則主發跡他鄉。<br><br>由於性剛孤剋，所以亦不利婚姻，主遲婚或生離死別。輕則夫妻聚少離多，或夫妻不睦﹔重則夫妻離散。若見化忌、火星、孤辰、寡宿，則須由凶曜多寡，以及武曲所在的宮位，來判斷其婚姻不利的程度。<br><br>女命武曲，主婦奪夫權，但亦主女子有丈夫氣概。倘會照左輔、右弼、三台、八座諸曜，則為女中強人，更逢科、祿、權及天刑，則權祿名譽均重，必為社會名媛，但不利婚姻。<br><br>但倘武曲臨陷地的女命，逢四煞，則主刑剋孤獨，更逢化忌，有凶亡的危險。<br><br>無論男女，武曲守命得天魁、天鉞，而無羊、陀、火、鈴、空、劫沖會或同度，皆主可握經濟大權，宜從事財經界工作。","後天卦":"乾","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天同","內值":4,"星斗":"南斗","拼音":"tiāntóng","五行":"壬水","分類":"正曜","主司":"福德主","化氣":"化氣為福，為福德宮主星，掌生命，少積極。","註解":"","基本含義":"天同為南斗第四星，屬陽水，化氣為福。<br><br>在斗數中，天同比喻為照顧帝皇起居飲食，安排其宴樂享受的侍臣。所以他的特質是享受，缺點則為浪費及軟弱。<br><br>天同入命，吉則主人謙遜聰敏，格調高雅，但凶則主人耽於欲樂，優柔寡斷，或只好計劃而不務實。<br><br>天同畏火星、鈴星的剛剋，但卻不畏擎羊。在午宮與擎羊同度或會合，稱為「馬頭帶箭」。反主可握軍警大權。<br><br>天同僅於亥宮不喜化忌。若於亥宮化忌，再會四煞空劫及天刑，主刑剋孤單，或災病侵壽。<br><br>最喜坐戌宮，於對宮（即辰宮）見巨門化忌，稱為「反背」。得祿存或化祿會合，為否極泰來反成大貴之命。<br><br>女命天同，衣祿豐足，唯易覺精神空虛。故古人稱女命天同居巳亥入廟，雖美而淫，精神空虛。若能充實精神生活，找點事業上或嗜好方面的寄托，則可以避免，仍主婚姻生活愉快。<br><br>凡天同坐命，或居福德宮，只要不化忌星，多主有音樂方面的才能，或喜愛優美的事物。<br><br>無論男女，若天同守命，遇煞曜刑曜反而能有開創力，不致產生精神方面的苦悶。若只遇吉曜而不逢煞刑諸曜，則反易因耽於樂逸，流為放蕩。","後天卦":"坎","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"廉貞","內值":5,"星斗":"北斗","拼音":"liánzhēn","五行":"丁火","分類":"正曜","主司":"官祿主","化氣":"化氣為囚，為官祿主，掌品秩，靜態、非競爭行業，次桃花。","註解":"","基本含義":"廉貞為北斗第五星，於五行屬陰火。為斗數中的「次桃花」，化氣為囚。於性格主聰敏，敗則為邪惡。<br><br>在性格方面，廉貞守命的人大多數重感情，欠理智，所以為人有風度，但是卻可能任情放縱。這即是所謂「次桃花」的基本性質。<br><br>由於「桃花」性質，所以廉貞最喜文昌、文曲。因為當文星與桃花相會之時，桃花的性質即變得閑雅，不會淪為肉欲。便可能化解作詩酒風流，或轉化為藝術的創造力。文學藝術多帶愛情的色彩。凡廉貞守命宮的人，亦多有美術的愛好，特別傾向於書畫。否則對色彩便有特殊的欣賞力，當與貪狼會合時尤為確切。<br><br>如果不見文星，只與天魁、天鉞、左輔、右弼會合，這類斗數中的輔曜，反易增加廉貞的困擾，以致進退不安。<br><br>對於火、鈴、羊、陀四煞，廉貞的抵抗力非常之弱。所以凡廉貞坐命，必不見四煞然后才能有所建樹。尤其是巳亥兩宮，見四煞則主四海奔波，若再見天刑、大耗、化忌，更主客死他鄉。<br><br>廉貞是一顆性質變化非常復雜的星曜，雖有「次桃花」的說法，但卻未必代表廉貞守命的人即命帶桃花，或性格淫蕩。其人必然帶點輕佻與幽默，可是內心卻主觀極強，不易對人遷就。<br><br>廉貞雖然輕鬆幽默，在交際場合中略帶點小丑的味道，但由於同時有主觀強的性質，所以不可見他輕鬆幽默就以為在公事上好說話。實際上他很可能有一派公事公辦的脾氣。當會合地空、地劫之時，這性質尤其顯著。所以適合從事理工，作科技方面的研究。因為科技工程最宜一板一眼。<br><br>廉貞坐命亦宜從事建築，因為建築既是工程，又帶藝術的意味。<br><br>廉貞最嫌化忌，主膿血之災。居於命宮、疾厄宮及遷移宮，對人的運程都有影響。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天府","內值":6,"星斗":"南斗","拼音":"tiānfǔ","五行":"戊土","分類":"正曜","主司":"田宅主","化氣":"化氣為令，為財帛、田宅主，祿庫之星，掌福權。","基本含義":"天府為南斗主星，屬陽土，主賢能，為財帛的府庫。<br><br>天府亦具有領導能力。可是這種領導力卻傾向於守成，缺乏開創性。這有如中央銀行的行長，他的職責在於「理財」而不在於「生財」，所以便難免小心翼翼。辦起事來，表現得有點「細眉細眼」，不如紫微的大方，亦不如太陽的豪邁。<br><br>因此天府坐命的人，只宜就原有的局面發展，欠缺卓爾不群的表現，亦無獨特的見解，較為隨波逐流。其領導力只表現為一個稱職的主管。由於具有府庫的性質，所以天府坐命的人便比較愛惜金錢。謹慎、穩重，極力尋求安定。府庫無生財之力，只能守財以及運用錢財，因此天府最喜見祿。無論與祿存或化祿會合，都可以增加格局的吉利，能成富格。<br><br>天府亦喜魁、鉞、輔、弼、昌、曲會合，可以使其人有特殊的見解。同時亦增加了領導群倫的氣勢。亦喜左輔、右弼夾，龍池、鳳閣夾。主人厚重干練，謹慎善謀，足當大任。<br><br>天府入命不喜見四煞。如果不見祿而只見四煞，很不適合「財庫」的性質。難免諸般奸巧以求財。假如天府與四煞會合，同時又會文昌文曲，卻可能是豪門的清客，亦即是所謂「傍友」。因為昌曲主其人頗能文墨，兼且能言善辯，雖嫌刁巧，亦不失為儒流文士。但倘若文昌或文曲化忌，則這種「天府見煞會昌曲」的星系結構便大為減色，其人容易流為三家村的寒儒，滿腹牢騷，自以為懷才不遇。<br><br>一般來說，天府不宜獨坐。因為守財庫的官吏不宜孤單，孤單即易對財帛「眼見心謀」。若獨坐無吉曜，會四煞，則變得凡事取巧，善謀好詐。亦不宜見空曜，主孤立無援。若天府獨坐，見空曜及天姚，主其人權術陰謀。<br><br>天府與天相，是斗數中一對重要的「對星」，所以古人有「逢府尋相」、「逢相尋府」的說法。由於是「對星」的關系，所以「府相朝垣」可以成為格局。<br><br>女命天府，一般均主忠厚慈祥，聰明機巧，樂於助人。若會吉曜，特別是與左輔右弼會合，有男子之威儀，亦能富貴。見四煞刑劫諸曜，則夫子不全，或須再婚。","後天卦":"坤","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"太陰","內值":7,"星斗":"中天","拼音":"tàiyīn","五行":"癸水","分類":"正曜","主司":"田宅主","化氣":"化氣為富，為田宅主，掌母、妻、女。","基本含義":"太陰為中天星曜，於五行屬陰水，化氣為富。<br><br>太陰與太陽為斗數中重要的「對星」，因此彼此有相同的性質，亦有相異的性質：太陰主富，太陽主貴﹔太陰主女，太陽主男﹔太陰主柔，太陽主剛﹔太陰屬水，太陽屬火﹔太陰為母，太陽為父﹔太陰為女，太陽為子。<br><br>一般來說，無論男女命見太陰，都對女性的六親不利。可據太陰所在的宮位，以及三方四正的星系組合，來推斷女親的命運。大致上主幼年母親不利。若為女命，則幼年自身不利﹔若為男命，則太陰落陷是不利妻女。<br><br>男命身宮見太陰，容易與異性接近，亦主其人帶女性化的溫柔。倘若福德宮及夫妻宮不佳，便可能有同性戀的傾向。女命身宮見太陰，不會煞曜，主為人端庄、聰明。若見煞刑諸曜，則有剋夫傷子的傾向。若見桃花諸曜，而福德宮夫妻宮不佳者，亦可能發展成為同性戀。<br><br>太陰會合文昌文曲，主有才能且博學，可文章秀發。最喜與祿存、化祿會合，因為太陰主藏、主富、主靜，與祿存及化祿氣味相投。與化權、化科會合，則可剛柔相濟。<br><br>太陰與太陽會合，倘二曜均入廟旺之地，亦主剛柔相濟。其人既有內才，且泱泱大度，豪邁不凡。<br><br>太陰於陷宮不嫌化忌，因陷宮的太陰本來無光，自然不忌雲遮霧掩。於廟旺的宮位反怕化忌，以雲霧掩蓋月華之故。但在亥宮化忌，則稱為「變景」，除非煞刑諸曜並照，否則「變景」只反增加月色的光彩。<br><br>凡太陰守命，於論斷時最宜兼視福德宮。因為太陰主富，古代社會單純，雖有競爭卻不激烈，因此主精神享受的福德宮便影響不大。現代社會競爭激烈，競爭手段亦陰謀百出，倘如福德宮不好的話，由於太陰主富的關系，往往反而容易招惹精神上的痛苦。","後天卦":"坎","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"貪狼","內值":8,"星斗":"北斗","拼音":"tānláng","五行":"甲木","分類":"正曜","主司":"禍福主","化氣":"化氣為桃花，解災排難，為禍福主，掌游樂。","基本含義":"貪狼為北斗第一星，屬陽木，其體則屬水，化氣為桃花。<br><br>貪狼在命身宮，主人擅長交際，且有多方面的才藝。好動圓滑，手腕八面玲瓏，但卻常易沉溺於嗜好。<br><br>如果與文昌文曲會合，其嗜好為詩酒琴棋。從物欲方面來說，則為酒色財氣。倘會華蓋，則主其人愛好神秘的哲學。從物欲方面來說，則是喜歡神秘的事物。<br><br>不過，倘如貪狼會合火、鈴、羊、陀、化忌諸曜，則物欲的性質很深，容易流為貪花好酒，服藥賭博。<br><br>古人對於貪狼，有「貪居旺宮，終身鼠竊」的說法。古人的說法，是由於「貪居旺宮」的人，心理上容易執著，因此容易發展成為佔有欲過深，由是便有「終生鼠竊」的推斷，因此宜減輕佔有欲。但還得視福德宮所會合星曜而定。<br><br>貪狼會合吉曜，主榮華富貴，甚至可掌握軍警大權。<br><br>遇火、鈴，是為「火貪格」或「鈴貪格」，皆主財祿豐厚有突破性的發展。以「火貪格」為上格，「鈴貪」次之。又以見於辰戌宮者為上格，丑未宮次之，其他宮位更次。但若同時見擎羊或陀羅則不合格。合格者見祿存或化祿，尤其有意外的財源，可成暴富。<br><br>貪狼最不喜擎羊、陀羅，亦畏化忌，但見空劫反可使人踏實。所以見空劫者，多主人有專門技藝。若不見化忌，可從事理工科技研究﹔若見化忌，則宜為工匠。<br><br>貪狼遇羊陀，會增加人生的坎坷與辛勞。在亥子二宮，更稱為「泛水桃花」，主人自命風流，因色招禍，有吉曜則可轉化為風騷儒雅。在寅宮，貪狼遇陀羅，稱為「風流採杖」，亦主因色遭災。<br><br>女命貪狼，最大特點是容易染上嗜好，同時性喜神秘，易有宗教信仰。在現代，則可能成為公關、交際的人才。尤其是當有左輔、右弼、天魁、天鉞、天官、天福、恩光、天貴會合時，女命亦能貴，或有相當高的社會地位﹔若會祿曜，且得火鈴拱照者，皆主富厚。是為性情剛毅，旺夫益子的命造。<br><br>命宮或福德宮見貪狼廉貞會合，主其人有色彩感，亦主愛好藝術，尤喜運動或跳舞。若貪狼獨坐，則有愛好運動的傾向。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"巨門","內值":9,"星斗":"北斗","拼音":"jùmén","五行":"癸水","分類":"正曜","主司":"品物主","化氣":"化氣為暗，為品物主，掌是非。","基本含義":"巨門為北斗第二星，屬陰土，又屬陰金。<br><br>古人有「土多金埋」之故，所以將巨門作為暗曜，主是非口舌及明爭暗斗。<br><br>但巨門於是非口舌之外，亦主口才。最喜化權，格局高固能富貴，否則亦可為人師表。與太陽會照，則光明磊落，能富能貴。<br><br>古代受社會條件限制，巨門守命的人，其發展行業有限。現時社會背景不同，則可為公關、播音人才，甚至可從事外交或律師。若見廉貞、貪狼、龍池、鳳閣、天才等曜，更可從事表演藝術。<br><br>巨門能以言辭取信於他人，所以當化權的時候，其言談即具有權威性。若巨門化祿，則宜於表演人員，尤其是可成為優秀的司儀。見文昌文曲、紅鸞天喜、天姚、咸池更佳。<br><br>若巨門化權或化祿，更與化科的正曜會合，主聲名遠播，必為社會聞人，不時公開發表言論。<br><br>巨門的最大特點是好表現自己，但如果學不精湛，其才不足以濟其用，就變成不容易服人，因此招惹嫌忌。所以巨門最喜會昌曲、化科等文曜。命宮即使不見文曜，福德宮若文星畢集亦可補救。<br><br>巨門居子午二宮，稱為「石中隱玉」。這個格局的好處，是令人減少了自我表現的欲望。其才華藏而不露，是為美格。以見化祿、化權、化科者為上格。見祿存者為次格。皆主人社會地位崇高，且易致富。但此格局的人若一旦登上高峰，成為頭號人物，則反易招嫌忌以致身敗名裂。從這個格局，即可見巨門的表現欲應加節制，同時需要注意才學修養。<br><br>太陽與巨門會合，可解巨門之暗。從性質來說，是因為「日巨守命」的人，做事多光明磊落，容易為人理解。<br><br>太陽巨門的星系組合，又有「異族」的性質。所以當這星系會合吉曜的時候，視其所落宮位而定，有與異族通婚，受異族人推崇的性質。<br><br>巨門對火、鈴、羊、陀、空、劫、刑、忌都有所畏。大致上來說，羊陀令人感情易起波瀾﹔火鈴令人生平添許多風波﹔空劫令人坎坷挫折，而且照古人的說法，可能幼年即遭父母棄擲﹔刑忌則生口舌是非。倘若四煞並照，又見天刑，逢疾厄宮不佳，則易夭折。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天相","內值":10,"星斗":"南斗","拼音":"tiānxiāng","五行":"壬水","分類":"正曜","主司":"官祿主","化氣":"化氣為印，為官祿主，掌爵福，司衣食。","基本含義":"天相為南斗第二星，屬陽水，化氣為印。<br><br>印星的特點為公正、謹慎。多終身從事一行職業，不易見異思遷，為最佳僚幕人才。<br><br>印的本身能善能惡，但善惡均由掌印者左右。譬如法堂上的印，斷人富貴，骨肉團聚，亦能使人受刑罰，家破人散。所以天相在命宮的人，雖多正義感，但亦可流為軟弱。<br><br>天相在天星為宰相或軍師之意。故忠於主人，為主人度計設謀，以主人之利害為自己之利害，所以逢吉則吉，逢凶則凶。故於十二宮中，天相僅隨其所會合的星曜而分吉凶善惡。<br><br>天相守命的人，亦甚受社會環境的影響。凡社會文化背景不同，而命盤結構相同的人，命運的遭遇相差很大。<br><br>天相在命宮或身宮，見化祿及天梁夾持，為「財蔭夾印」，主富貴榮華，快樂享受﹔天相在命宮或身宮，見化忌及擎羊夾持，為「刑忌夾印」，主有牢獄之災，並有刑傷。<br><br>天相守命，無得力主星拱照，更見火鈴沖破，易見殘疾。<br><br>女命天相，忌昌曲同會，主情感波瀾。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天梁","內值":11,"星斗":"南斗","拼音":"tiānliáng","五行":"戊土","分類":"正曜","主司":"父母主","化氣":"化氣為蔭，亦為刑法紀律之星，掌壽命。","基本含義":"天梁屬陽土，為南斗第三星，司壽，化氣力蔭，有解厄制化之力，然宜會照不宜守命。即對照命宮亦有不宜，總多少帶點孤剋的意味。若守命宮，女命六親均有缺點，其福不齊。<br><br>天梁在命身宮，主有名士風致：懶散、隨便、拖延、人生欠積極。少年大限過宮，逢災能解，然必逢災病﹔老年大限照坐，雖有病災厄症，亦主帶病延年。<br><br>天梁在福德宮者，思想清高，有名士風味而不得閑。蓋必有待其排解之事發生，而致其人為虛名而奔忙。若大限福德宮見天梁，而大限命宮不吉，疾厄宮又凶者，多為死限。<br><br>天梁於人身命宮，主逢凶化吉，遇難呈祥。唯亦因之一生每多災險，或非常之遭遇。故天梁臨命者，必多災多難、多是非、多病痛，唯亦能化災化凶，延壽延年。<br><br>天梁臨巳宮，最見多災多難、消災解難的情形。<br><br>凡天梁臨命宮、身宮，或福德宮，都可有甚深之佛道信仰，謂之有善根。宜從事哲學方面的研究。若與天機同度，多出塵之想，可為看破紅塵的僧道。若天梁、太陽、文昌，會祿存或化祿則為「陽梁昌祿」格，大利考試，尤利重要典試，或在選拔性的競爭中得勝。<br><br>天梁為清官御史，可直諫皇帝，所以最不宜見祿存或化祿。倘有祿星同躔，則不易為人敬服，多招怨恨是非。因此「梁祿同躔」雖能發財，卻多困難憂慮。天梁亦不喜見擎羊單星及天刑，主官司或是非，或主因病動手術。<br><br>但天梁到底有逢凶化吉的力量，所以雖見四煞刑忌，仍然能憑本身的力量去加以化解。不過難免危險重重，人生多不平凡的際遇。","後天卦":"坤","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"七殺","內值":12,"星斗":"南斗","拼音":"qīshā","五行":"庚金","分類":"正曜","主司":"成敗主","化氣":"化氣為將星，為成敗主星，掌風寧，主刑孤。","基本含義":"七殺為南斗第五星，屬陰金，化氣為權。亦為帝皇身邊的將星，主肅殺。故人生寂寞，多無知己。不過亦可利用這個特點，發展「掉臂獨行」的性格，成為出奇制勝的創業人才。<br><br>紫微與七殺相會，可藉帝星對七殺的駕馭，轉化為權力。而肅殺之氣因之亦可祥和。<br><br>七殺因為是大將星曜，所以最喜佐輔紫微、天府，主能得貴人提拔而平步青雲。 即使遇到煞曜,亦可從商致富。若從商，僅宜從事實業，且能善任手下工作人員，不可投機，易生破敗。且一蹶不振，無東山復起的機會。<br><br>凡七殺坐命的人，一生必有一次重大的挫折。命宮見空、劫、大耗者尤甚。倘從事實業，雖有挫折仍能得人信任，極易恢復元氣，是故絕對不宜投機。<br><br>七殺與廉貞同度於未宮，或七殺在午宮守命，廉貞在申宮守福德，皆稱為「雄宿乾元格」，主其人魄力雄厚。此乃七殺陰金為廉貞陰火鍛煉，相制為用，若火煉礦苗，成為有用之才。若七殺在子宮守命者次之。<br><br>七殺居丑宮，雖亦有廉貞同度，但格局普通。若會照火、鈴、羊、陀四煞，反主刑剋顛沛傷害，重則終生殘疾。<br><br>七殺最嫌落陷、化忌，亦不喜四煞、空劫、天虛、陰煞諸曜，主為人孤獨，其福不全。每多解脫塵世的宗教人士。又主其人多幻想，時覺心靈空虛。<br><br>七殺居丑未二宮，遷移宮必為天府，主為人外剛強而內富情感，每易生出世之想，多悲天憫人之念，且對婚姻不利。<br><br>七殺會太陽巨門於帝旺之鄉，謂之吉處藏凶。主人於順境中忽生劇變，宜韜光養晦。<br><br>七殺既是將星，魁鉞、昌曲等曜，以及化祿、化權、化科對它來說都不重要，僅能增加其人的聲勢。倒不如將吉曜分配於命宮之外的其他宮位，命盤配置反覺均衡。<br><br>男命七殺，宜福德宮見諸吉﹔女命七殺，則宜夫妻宮見諸吉曜。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"破軍","內值":13,"星斗":"北斗","拼音":"pòjūn","五行":"癸水","分類":"正曜","主司":"子女主","化氣":"化氣為耗，為子女主，掌統帥，先敗後成。","基本含義":"破軍為北斗第七星，五行屬陰水，化氣為耗。<br><br>破軍為開路先鋒，逢山開路，遇水搭橋，且率先沖鋒陷陣。所以他的基本性質便是能攻而不能守。這種性質，便令到破軍守命的人，容易脾氣暴燥，但卻正直剛烈，於困難的局面中，反易表現出領導才能與開創的魄力。<br><br>由於擅開創而不擅守成的性格，倘福德宮見紫微天府，變得多能多勞而主觀甚強，更不耐煩於既成的局面下發展。甚至於創業安定之際，亦時生改變局面之心。<br><br>破軍沖鋒陷陣，爭城奪寨，先有破壞而后建設，所以自身的危難亦多，每易尾大不掉，陷於困境而不能自拔。於處事時，常易在轉折點受到挫折。<br><br>破軍最喜見祿，則有后援源源不絕補充，名為「有根」。與祿存或化祿同宮者最吉，會合其他正曜化祿者次之，會合祿存更次。<br><br>化權、魁鉞、輔弼與破軍會照或同度，可以增加創業的氣勢。若見空劫，則一生多障礙﹔見火、鈴、羊、陀四煞，凡有變動，均先見不利﹔見天哭天虛，則主人心靈空虛。<br><br>由於破軍有先破壞、后建設的意味，所以一生事業變動必大。唯所有變動，皆有「去舊更新」的性質，所以經商者多由舊事業翻出新的局面。亦主多雙重事業。見耗星則主兼差兼職，或經常負擔額外的工作。「能者多勞」正是破軍坐命的寫照。<br><br>女命破軍，一般均以遲婚為宜。遇羊陀者更甚。若破軍化祿，則有整容的傾向。這時須留意是否與煞忌刑曜相會。如是，則小心會留下疤痕。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"左輔","內值":14,"星斗":"","拼音":"zuǒfǔ","五行":"戊土","分類":"輔佐八曜","主司":"","化氣":"化氣為令，為佐助之星，掌善令。","基本含義":"北斗助星，五行屬土，是代表助力，是輔佐之星，其助力之性質來自平輩，如同事或部屬，或是合作的事業伙伴。<br>左輔代表忠厚，為人作事盡職，人緣佳。<br>左輔加會右弼，有管理能力。<br>左輔加會文昌，文曲，感情豐富，有才藝。<br>左輔加會天魁、天鉞，機運多。<br>左輔化科：有才華，有助力。<br>左輔加會科、權、祿，得財利，企業管理人才。<br>左輔加會火星或鈴星多變動，勇於面對問題來解決。<br>左輔加會擎羊、陀羅，感情多波折，勇於面對問題來解決。<br>左輔加會火星、鈴星、擎羊、陀羅、地空、地劫、化忌多感情多波折，勇於面對問題來解決。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"右弼","內值":15,"星斗":"","拼音":"yòubì","五行":"癸水","分類":"輔佐八曜","主司":"","化氣":"化氣為令，為佐助之星，掌制令。","基本含義":"北斗助星，五行屬水，亦是代表助力之輔佐之星，其助力亦來自平輩或晚輩，與左輔相同。<br>右弼代表豁達，為人樂觀，好文學。<br>右弼加會左輔，有管理能力。<br>右弼加會文昌，文曲，感情豐富，有才藝。<br>右弼加會天魁、天鉞，機運多。<br>右弼化科：善思考，有助力。<br>右弼加會科、權、祿，得財利，企業管理人才。<br>右弼加會火星或鈴星，多變動，勇於面對問題來解決。<br>右弼加會擎羊、陀羅，感情多困擾，勇於面對問題來解決。<br>右弼加會火星、鈴星、擎羊、陀羅、地空、地劫、化忌多　感情多困擾，多變動，勇於面對問題來解決。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天魁","內值":16,"星斗":"南北斗","拼音":"tiānkuí","五行":"丙火","分類":"輔佐八曜","主司":"","化氣":"化氣為陽貴，天乙貴人，為才名之星，掌科甲。","基本含義":"天魁星是南斗助星，五行屬火，是一顆貴人星，專門職掌科甲、功名，是顯而易見的貴助，也代著貴助來自長輩、長官或上層機構。<br>天魁代表正直，善良，積極，機敏。<br>天魁加會左輔，右弼有管理能力。<br>天魁加會文昌，文曲，感情豐富，有才采。<br>天魁加會科、權、祿，得財利，企業管理人才。<br>天魁加會火星或鈴星錢財不聚，感情多困擾。<br>天魁加會擎羊、陀羅，錢財不聚，感情多困擾。<br>天魁加會火星、鈴星、擎羊、陀羅、地空、地劫、化忌，錢財不聚，感情多困擾。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天鉞","內值":17,"星斗":"南北斗","拼音":"tiānyuè","五行":"丁火","分類":"輔佐八曜","主司":"","化氣":"化氣為陰貴，玉堂貴人，為才名之星，掌科甲。","基本含義":"天鉞星是南斗助星，五行屬火，是一顆貴人星，專門職掌科甲、功名，其貴助並非顯而易見，但卻在暗中有很大的助益，其貴助也是來自長輩、長官或上層機構。<br>天鉞代表自重，好義，積極，上進。<br>天鉞加會左輔，右弼有管理能力。<br>天鉞加會文昌，文曲，感情豐富，有才采。<br>天鉞加會科、權、祿，得財利，企業管理人才。<br>天鉞加會火星或鈴星錢財不聚，感情多困擾。<br>天鉞加會擎羊、陀羅，錢財不聚，感情多困擾。<br>天鉞加會火星、鈴星、擎羊、陀羅、地空、地劫、化忌，錢財不聚，感情多困擾。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"文昌","內值":18,"星斗":"","拼音":"wénchāng","五行":"庚金","分類":"輔佐八曜","主司":"","化氣":"化氣為文星，為科甲主星，掌文墨。","基本含義":"南斗第六星，五行屬陽金，化氣為文魁，司科甲之名。入命為人眉清目秀，多才多藝，學識賅博，性耿縱貫情理。<br>逢火鈴較為孤癖，逢羊陀心機重。此星喜加會太陽、天梁、祿存等星，有專技在身。<br>女命文昌獨座命宮無主星，福不全美，加會羊、火易落風塵。<br>文昌立命之人，行事多先難后易，陷地加煞，多為帶疾延年之人。<br>有表達自己的強烈意念，會努力學習，藉由在學術、讀書、考試、研究等方面的表現，讓人了解自己，故而強化了學習能力，讓人覺得聰明。為了能有好的表達，當然也需要好好的了解自己及他人，所以也加強了觀察和分析的能力。由于具有濃厚的文藝氣味，氣質優雅，令人有好感，也常能吸引異性的留意。<br>文昌主人秀氣端，見多識廣，頭腦反就靈敏，福壽并臻。入廟旺之宮，身有暗痣，大多為紅痣，黑痣亦不忌，于午戌宮陷地，身有斑痕，體瘦。<br>文昌守命，廟旺見諸吉，文章蓋世，功名顯赫，尤喜與文曲同宮。<br>文昌喜金四局生人，富貴雙全，先難后易，中晚年有聲名。<br>文昌守命，陷見諸兇，亦主舌辨，巧藝，本事高人。<br>文昌會太陽、天梁、天同、祿存，可發揮文化、學術、藝術、治理方面的才華，主富貴。<br>文昌武曲守身命宮，文武兼備，有卓越才干，從事文化、政治、貿易均能出人頭地。<br>文昌與擎羊同守，又有廉貞、七殺同守，主人詐偽。<br>文昌貪狼同宮，政事顛倒。<br>文昌貪狼于巳亥宮守命，加煞化忌，主粉骨碎裂尸，夭亡。<br>文昌巨門同宮，喪志，遇挫折限頹廢，或有時善于見風使舵。<br>文昌破軍同宮，主有水災，如被淹死，或患泌尿、生殖系統及腎臟方面的疾病。<br>文昌、左輔會吉星，可做高官。<br>文昌化科在命，主人學習優秀，有才華及學識，考試能金榜題名。<br>文昌可與化科拱照，利于考學，能金榜題名。或文昌在官祿宮化科亦是。<br>文昌陷于天傷，顏回夭折。（命有劫空羊陀，限至七殺，羊陀迭并方論）。<br>文昌化忌在命，亦主其人好學，但學業恐有阻，廟旺化忌災小，陷在化忌災重。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"文曲","內值":19,"星斗":"","拼音":"wénqū","五行":"癸水","分類":"輔佐八曜","主司":"","化氣":"化氣為文華，為科甲主星，掌文墨。","基本含義":"文曲星是北斗星系，五行屬水，是專司科甲、功名的星曜，是文華之星，也是桃花星，有口才也代表異路功名。在封神榜中協助姜子牙的女將龍吉即被封為文曲星，有著口舌伶俐，博學多才及修飾美化的功能。<br>文曲代表柔和、口才。<br>文昌為南斗星為人多文雅，口才佳，有文章佳。<br>文曲加會左輔、右弼，有管理能力。<br>文曲加會文昌，感情豐富，有才藝。<br>文曲加會天魁、天鉞，機運多。<br>文曲化科：有才華，口才佳。<br>文曲化忌：專研某事物或無法專心，口才差。<br>文曲加會科、權、祿，得文財，企業管理人才。<br>文曲加會火星或鈴星錢財不聚，感情不順。<br>文曲加會擎羊、陀羅，錢財不聚，有名無實。<br>文曲加會火星、鈴星、擎羊、陀羅、地空、地劫、化忌多感情不佳。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"擎羊","內值":20,"星斗":"北斗","拼音":"qíngyáng","五行":"庚金","分類":"煞曜","主司":"","化氣":"化氣為刑，為護衛之星，主凶禍。","基本含義":"擎羊星是北斗助星，五星屬金，主凶厄刑傷，其傷害是顯而易見的。在封神榜中，周朝的大將楊戩被封於擎羊星，職司殘忍、粗暴，是明槍。<br>擎羊代表權威，果決。<br>擎羊為北斗助星為人事業心強，頗有個性。<br>擎羊加會左輔、右弼，有管理能力。<br>擎羊加會文昌、文曲，感情豐富，有才藝。<br>擎羊加會天魁、天鉞，機運多。<br>擎羊加會科、權、祿，得財利，企業管理人才。<br>擎羊加會火星或鈴星主有權威。<br>擎羊加會火星、鈴星、地空、地劫、化忌主破財，衝動。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"陀羅","內值":21,"星斗":"北斗","拼音":"tuóluó","五行":"辛金","分類":"煞曜","主司":"","化氣":"化氣為忌，為護衛之星，主凶禍。","基本含義":"五行屬金，為北斗浮星，化氣為忌。陀羅入命宮者，身形雄壯，臉呈方圓形，兩頰略寬，入廟多肥胖，落陷顏面有傷痕，齒弱。陀羅坐命之人大多心術不正，東奔西走，好行奸弄巧，有反抗心，言語虛夸，具有哄騙別人的習慣。<br>女命陀羅，內狠外虛，凌夫克子，不守婦道，又無廉恥。<br>陀羅喜西、北及四墓年生人，安命辰戌丑未，武人橫發高遷，文人則不耐久。陀羅守命寅申巳亥為失陷，主幼時難養，成人則易遭刑傷，遇有吉星扶救則災輕，惟破相不免。（注：亦主少年背井離鄉、棄祖出外亦可得吉，惟值于四生者刑克不免，與其它煞星或廉破殺同守或三合交會，則必妻離子散，父母失養，自身亦必天涯飄泊，孤苦無依。）<br>陀星獨守命宮，主孤寡棄祖，多為巧藝之人，逢遇刑囚諸惡二姓延生。陀羅守命身交會日月忌煞，男女刑克且主目疾。<br>此星守命會輔弼昌曲多有暗痣，逢巨門或七殺傷殘帶疾，刑克妻、子及悖六親。<br>與貪狼同守命身，廟旺者好酒色，更會惡星因此成疾；值于陷地不惟嗜酒戀色而招疾，亦主浪蕩飄流與刑夭。<br>陀羅與火星或鈴星守命于廟旺，且得諸吉星拱照，可主吉利，失于陷地則主孤寡貧窮。陀羅陷地入命，三方會火鈴，必有牢獄之災；或陷地與七殺、破軍、貪狼、巨門、廉貞、武曲同宮，亦為犯罪入獄之命。<br>陀羅在巳亥宮坐命，不論同宮之正星是廟旺或是陷失，坐牢的比例很高，若三方又有火星或鈴星，幾乎為入獄的絕對符。<br>或命宮正星落陷見天空地劫，三方會羊陀火鈴，亦為牢獄資訊。<br>或化忌星在命，與羊陀同宮、加會，亦招官非刑責，囚獄難免。或遷移宮有當生之官府并七殺、擎羊，主離鄉遭配，入獄服刑。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"火星","內值":22,"星斗":"","拼音":"huǒxīng","五行":"丙火","分類":"煞曜","主司":"","化氣":"化氣為暴，為殺神，主刑災。","基本含義":"火星是南斗助星，五行屬火，是為殺神，主凶厄之事，行為作風剛猛。在封神榜的故事中，紂王之子殷郊，封於火星，職司暴躁、火速。<br>火星代表有膽識，為人外向，不耐靜。<br>火星加會左輔、右弼，有管理能力。<br>火星加會文曲，感情豐富，有才藝。<br>火星加會天魁、天鉞，機運多。<br>火星加會科、權、祿，得財利，企業管理人才。<br>火星加會擎羊、陀羅，是非多，權威出眾。<br>火星加會鈴星、擎羊、陀羅、地空、地劫、化忌是非多。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"鈴星","內值":23,"星斗":"","拼音":"língxīng","五行":"丁火","分類":"煞曜","主司":"","化氣":"化氣為暴，為從神，主威名。","基本含義":"南斗助星，五行屬火，是為殺神，主凶厄，心性暴烈。在封神榜的故事中，紂王之子殷洪，封於鈴星。<br>鈴星為南斗浮星為人性急，果斷，不耐靜，愛表現。<br>鈴星加會左輔、右弼，有管理能力。<br>鈴星加會文曲，感情豐富，有才藝。<br>鈴星加會天魁、天鉞，機運多。<br>鈴星加會科、權、祿，得財利，企業管理人才。<br>鈴星加會擎羊、陀羅，親緣薄。<br>鈴星加會火星、擎羊、陀羅、地空、地劫、化忌親緣薄。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"地空","內值":24,"星斗":"","拼音":"dìkōng","五行":"丙火","分類":"煞曜","主司":"","化氣":"化氣為多災，空亡之神，主災禍。","基本含義":"地空代表不畏挫折，揮霍，靈感佳。<br>地空加會左輔，右弼有管理能力。<br>地空加會文昌，文曲，感情豐富，有文采和才學。<br>地空加會科、權、祿，得財順利，是很好的企業管理人才。<br>地空加會火星或鈴星有賺錢機會，懂得賺錢也懂得享受，財進財出頻繁。<br>地空加會擎羊、陀羅，有賺錢頭腦，敢於投資，不易守財。<br>地空加會火星、鈴星、擎羊、陀羅、地劫、化忌，賺錢機會多，財進財出頻繁，當科學家，詩人的機率高。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"地劫","內值":25,"星斗":"","拼音":"dìjié","五行":"丙火","分類":"煞曜","主司":"","化氣":"化氣為破失，劫殺之神，主破敗。","基本含義":"地劫代表努力不懈，獨立，靈感佳。<br>地劫加會左輔，右弼有管理能力。<br>地劫加會文昌，文曲，感情豐富，有文采和才學。<br>地劫加會科、權、祿，得財順利，是很好的企業管理人才。<br>地劫加會火星或鈴星，投資慾望強烈，易因太過冒險而損財。<br>地劫加會擎羊、陀羅，賺錢能力強，花錢也大方，不易守財。<br>地劫加會火星、鈴星、擎羊、陀羅、地空、化忌，有經濟頭腦，敢於投資，成為科學家，詩人的機會大。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"化祿","內值":26,"星斗":"","拼音":"huàlù","五行":"金","分類":"四化","主司":"","化氣":"為福德之神，主財祿。","基本含義":"名位、富裕、榮華。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"化權","內值":27,"星斗":"","拼音":"huàquán","五行":"火","分類":"四化","主司":"","化氣":"為掌判之神，主權勢。","基本含義":"統御、功業、判決。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"化科","內值":28,"星斗":"","拼音":"huàkē","五行":"木","分類":"四化","主司":"","化氣":"為文墨之神，主考試。","基本含義":"考選、師范、獎譽。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"化忌","內值":29,"星斗":"","拼音":"huàjì","五行":"水","分類":"四化","主司":"","化氣":"為多管之神，主災咎。","基本含義":"阻礙、是非、打擊。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"祿存","內值":30,"星斗":"","拼音":"lùcún","五行":"己土","分類":"輔佐八曜","主司":"","化氣":"化氣為爵貴，司貴壽；解凶厄，有解厄制化之功，掌壽基。","基本含義":"祿存屬土，北斗第三星，真人之宿，主人貴爵，掌人壽基，並有解厄制化之功。<br>祿存入命，為人多仁慈，穩重，主人有肥胖的體態。若獨守命宮，臉呈圓形或方圓形，身材稍高，略胖或肥胖，面色黃白。<br>祿存加會左輔、右弼，有管理能力，財運多。<br>祿存加會文曲，感情豐富，有才藝，為人秀麗。<br>祿存加會天魁、天鉞，財運多。<br>祿存加會科、權、祿，得財，企業管理人才。<br>祿存加會地空、地劫，錢財會賺會花。<br>祿存加會擎羊、陀羅，錢財不聚，有才藝之人。<br>祿存加會火星、鈴星、擎羊、陀羅、地空、地劫、化忌感情不順，易被人欺侮，有才藝之人。<br>祿存為羊陀所夾，亦代表要賺取錢財，必同時帶有是非與勞累。天下間無唾手可得的正財。<br>祿存與紫微、天相同度，主權力﹔與太陽、太陰同度，主光輝﹔天府、武曲主財，天梁主蔭，天同主福，亦喜祿存同度增加福祿蔭庇之力。<br>祿存與天壽同在命宮，往往長壽。<br>命無正曜得祿存獨守，乃看財奴。<br>祿馬交馳格喜與昌曲同度，可減少辛勞。若天馬與火鈴同度，主奔波﹔與陀羅同度，為折足﹔與空曜同度，則動而不實，卻又不能不動。<br>除了命宮、遷移宮之外，財帛宮見祿馬亦主得遠方之財或動財，田宅宮見祿馬主在遠方可置產業，但夫妻宮祿馬則為重離輕別之兆。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天馬","內值":31,"星斗":"","拼音":"tiānmǎ","五行":"丙火","分類":"輔佐八曜","主司":"","化氣":"司財祿主遷動","基本含義":"主驛馬，變動，趕時髦，潛力、勞動，旅行，貴人，調整，異鄉，肢體，傳染。<br>天馬+空劫，勞而無功。<br>天馬+火鈴，性暴易怒。<br>天馬+羊陀，身體刑傷。<br>女命宮，太陰、天梁、天相、巨門+天馬，婚姻不美。<br>女夫妻，七殺、武曲、破軍+天馬，兩地相思。<br>天馬+祿存，化祿，勞碌生財。<br>天馬+左輔右弼，朋友有助。<br>天馬+天魁、天鉞，長輩有緣。<br>天馬+文昌、文曲，外緣廣泛。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天官","內值":32,"星斗":"","拼音":"tiānguān","五行":"戊土","分類":"雜曜","主司":"","化氣":"","基本含義":"主顯貴、散慢、清閑、氣質、思想、身份。宜入命身財官遷。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天福","內值":33,"星斗":"","拼音":"tiānfú","五行":"戊土","分類":"雜曜","主司":"","化氣":"","基本含義":"主爵祿，性急，管事，誠實，人緣，地位，掌文翰。宜入命身財官遷。為福德之星，天賜之福。主增加人的通達和地位，且一生很會享樂。又主福壽、名利，主福份為天賜自得。<br>為天同的輔星，與天同同度最吉，主福壽雙全﹔與天同同守於福德宮，亦主有福享。<br>與天壽星同宮可增吉，主有福壽。<br>為命宮主星時，面黃白色，方圓臉，中矮身材，微胖，有福相。<br>女命清秀端庄，但不艷麗，與天同同宮，旺夫益子。<br>性情急躁，樂觀直爽，誠實，溫和善良，喜旅游，樂於助人，好布施，好交友，待人處事恰到好處，多管閑事，但管得恰到好處，令人口服心服﹔喜歡運動，但較懶散，講夠享受，家中喜裝璜擺飾。<br>入身命，有僥幸的運氣，喜會吉星，主福厚富貴高壽，衣食無缺，一生無安逸，出身富貴之家，一生得貴人助，逢凶化吉﹔早婚，夫妻諧老，父母兄弟皆全，一生名利雙收。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"截空","內值":34,"星斗":"","拼音":"jiékōng","五行":"","分類":"空曜","主司":"","化氣":"","基本含義":"主障礙、凡事節外生枝﹔表落空、虧空、阻截、中途截斷，截斷一部分，事因多為外力作用引起。逢凶聚為喪亡，主半途夭折、斷魂、立即死亡、喪命。<br>陽年空陽，陰年空陰，為正截空。忌入身命財田遷，喜入疾厄，命限逢此星，意志消沉，萬事宜保守，以退為進，以靜為寶，宜信奉宗教，研習命理。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天廚","內值":35,"星斗":"","拼音":"tiānchú","五行":"己土","分類":"雜曜","主司":"","化氣":"","基本含義":"為俸祿之星，主吉。天廚入命、官等宮，主有終身公職﹔加會廉、貪、巨、陽等星，主多應酬、能研究廚藝﹔若遇天才星，更顯烹飪之資。<br>優點：聰慧機敏而學習力強，負責敬業能吃苦耐勞，親切和睦、人緣極佳，有口福且能嚐美食。<br>缺點：操心操勞且顧慮繁多，思緒難安而容易分心，對人無防致使容易吃虧，食慾旺盛、易造成身體負擔。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"截路","內值":36,"星斗":"","拼音":"jiélù","五行":"","分類":"空曜","主司":"","化氣":"","基本含義":"主障礙、凡事節外生枝﹔表落空、虧空、阻截、中途截斷，截斷一部分，事因多為外力作用引起。逢凶聚為喪亡，主半途夭折、斷魂、立即死亡、喪命。<br>陽年空陽，陰年空陰，為正截空。忌入身命財田遷，喜入疾厄，命限逢此星，意志消沉，萬事宜保守，以退為進，以靜為寶，宜信奉宗教，研習命理。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"空亡","內值":37,"星斗":"","拼音":"kōngwáng","五行":"","分類":"空曜","主司":"","化氣":"","基本含義":"主障礙、凡事節外生枝﹔表落空、虧空、阻截、中途截斷，截斷一部分，事因多為外力作用引起。逢凶聚為喪亡，主半途夭折、斷魂、立即死亡、喪命。<br>陽年空陽，陰年空陰，為正截空。忌入身命財田遷，喜入疾厄，命限逢此星，意志消沉，萬事宜保守，以退為進，以靜為寶，宜信奉宗教，研習命理。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天哭","內值":38,"星斗":"","拼音":"tiānkū","五行":"庚金","分類":"雜曜","主司":"","化氣":"","基本含義":"主刑剋、喪服、哭泣、孤獨、憂愁、孤僻、憂傷、賠償、後悔、無助、離鄉、敗名。<br>哭虛與巨門廟旺，地方名聲。<br>哭虛與巨門弱陷，喪事破敗。<br>哭虛丑卯申宮+祿存，名聲顯揚。<br>哭虛不宜福德父母六親宮。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天虛","內值":39,"星斗":"","拼音":"tiānxū","五行":"己土","分類":"雜曜","主司":"","化氣":"","基本含義":"主虛耗，不安，茫然，無靠，失落，不實，傷心，離家。<br>哭虛與巨門廟旺，地方名聲。<br>哭虛與巨門弱陷，喪事破敗。<br>哭虛丑卯申宮+祿存，名聲顯揚。<br>哭虛不宜福德父母六親宮。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"龍池","內值":40,"星斗":"","拼音":"lóngchí","五行":"壬水","分類":"雜曜","主司":"","化氣":"","基本含義":"科甲之星，學問淵博，相貌出眾，有作為，人傲氣，品飲食，有煞耳朵問題。宜入命官。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"鳳閣","內值":41,"星斗":"","拼音":"fèng gé","五行":"戊土","分類":"雜曜","主司":"","化氣":"","基本含義":"婚姻之星，反應快，好講究，喜服飾，文學考試，華麗、明朗，宜少年、不宜老年，有煞牙齒問題。宜入命官。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"紅鸞","內值":42,"星斗":"","拼音":"hóngluán","五行":"癸水","分類":"雜曜","主司":"","化氣":"","基本含義":"主福喜、喜慶、秀麗，桃花，婚姻，女孩，及格，得到，奢侈。<br>40歲晚年主血光、失去、開刀、喪偶。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天喜","內值":43,"星斗":"","拼音":"tiānxǐ","五行":"壬水","分類":"雜曜","主司":"","化氣":"","基本含義":"主吉慶、訂約、熱鬧、深緣、短期、投機、買賣、音樂、婚姻、生子、進財。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"孤辰","內值":44,"星斗":"","拼音":"gūchén","五行":"丙火","分類":"雜曜","主司":"","化氣":"","基本含義":"孤寡乃財、印墓絕之位，主孤獨，固執、破相、離開、挑剔、怨天尤人，男命忌之。忌入命身父母。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"寡宿","內值":45,"星斗":"","拼音":"guǎsù","五行":"丁火","分類":"雜曜","主司":"","化氣":"","基本含義":"主孤寡、減少、流蕩、不得、刁難、自以為是，女命忌之。忌入命身夫妻。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"蜚廉","內值":46,"星斗":"","拼音":"fěilián","五行":"丙火","分類":"雜曜","主司":"","化氣":"","基本含義":"主孤寡、不和。忌入命身父母。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"破碎","內值":47,"星斗":"","拼音":"pòsuì","五行":"丁火","分類":"雜曜","主司":"","化氣":"","基本含義":"主耗散、勞碌，低賤，反覆，不全，遇煞頭面有傷痕，刑罰、受傷、流血、癱瘓、破財、哭泣。忌入命身。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天空","內值":48,"星斗":"","拼音":"tiānkōng","五行":"","分類":"雜曜","主司":"","化氣":"","基本含義":"為中天兇星，劫殺之神，又名斷橋煞。天空為空亡星，為空出，主多災多風險，不聚財，先成后敗，在人生的運程中打擊很嚴重，尤其精神感情方面。<br>有正星吉星廟旺同度，則為禍較輕，加煞沖則孤寒貧賤，重則夭亡；若同宮正星不好，主多學少成，淡泊名利，六親緣薄。<br>入身宮，行動無目標，到處亂闖，常遇欺騙之事，做事易說謊言，好大喜功，謊報軍情，喜投機取巧而獲財名；若無得力主星，顛三倒四，一生不順；與佛道五術有緣。<br>入命身，亦主孤獨晚婚，加華蓋孤寡，很晚才結婚，甚至不婚，遁入空門。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天才","內值":49,"星斗":"","拼音":"tiāncái","五行":"乙木","分類":"雜曜","主司":"","化氣":"","基本含義":"學習快，才藝類，智慧，才藝、正直、優秀，神經問題。宜入命身。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天壽","內值":50,"星斗":"","拼音":"tiānshòu","五行":"戊土","分類":"雜曜","主司":"","化氣":"","基本含義":"健康、長壽、勤奮性、正規類、脾胃問題、平和。在六親宮表年紀差距大。宜入命身財官。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天刑","內值":51,"星斗":"","拼音":"tiānxíng","五行":"丙火","分類":"雜曜","主司":"","化氣":"","基本含義":"主孤剋、威嚴、凶器、宗教、法律、中醫、藥丸、膀胱、好面子、不服輸。<br>天刑+太陽貪狼巨門天梁，司律法務。<br>天刑+七殺武曲破軍天梁，軍警黑道。<br>天刑+太陽太陰天梁巨門，宗教醫療。<br>主星弱陷+天刑、羊陀、破碎，傷殘。<br>主星弱陷+天刑、傷使、陰煞，陰靈。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天姚","內值":52,"星斗":"","拼音":"tiānyáo","五行":"癸水","分類":"雜曜","主司":"","化氣":"","基本含義":"主風流、束縛、禁錮、善變、多疑、虛榮、桃花、文彩、賭博、投機、物慾、貴人、女人、不穩、夭折。<br>入廟雅逸，落陷淫佚。卯酉戌亥廟旺文彩聰明。<br>天姚+廉貞、貪狼，多病。<br>天姚不宜財帛宮與夫妻宮位。<br>天姚不宜福德宮易感情困擾與沉迷事物。<br>天姚+羊陀火鈴，失敗，酒色。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"解神","內值":53,"星斗":"","拼音":"jiěshén","五行":"","分類":"雜曜","主司":"","化氣":"","基本含義":"主消解災害、糾紛、是非、煩惱。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天巫","內值":54,"星斗":"","拼音":"tiānwū","五行":"","分類":"雜曜","主司":"","化氣":"","基本含義":"積善修德，宗教，神明，靈異，責任，陰暗面，能負責，有信心，白手成家。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天月","內值":55,"星斗":"","拼音":"tiānyuè","五行":"","分類":"雜曜","主司":"","化氣":"","基本含義":"病痛，腰酸，經期，麻木，慢性長期問題，主橫禍。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"陰煞","內值":56,"星斗":"","拼音":"yīnshā","五行":"","分類":"雜曜","主司":"","化氣":"","基本含義":"防害，小人，妒嫉，陰靈，敏感，精神面，產難，冤枉、怪病、謀害。陰、為女性、暗、不明。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"三台","內值":57,"星斗":"北斗","拼音":"sāntái","五行":"戊土","分類":"雜曜","主司":"","化氣":"","基本含義":"主福貴，正義、防禦心、文職、穩重、正直、輔助、升等。宜入命身宮。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"八座","內值":58,"星斗":"北斗","拼音":"bāzuò","五行":"己土","分類":"雜曜","主司":"","化氣":"","基本含義":"主貴，武職。高尚、口快、熱情、權勢、領導、升等、好辯論。 宜入命身宮。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"恩光","內值":59,"星斗":"南斗","拼音":"ēnguāng","五行":"丙火","分類":"雜曜","主司":"","化氣":"","基本含義":"主恩遇，謹慎，守信，朋友助力，賞識、提拔、贊美。宜入命身財官遷。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天貴","內值":60,"星斗":"北斗","拼音":"tiānguì","五行":"戊土","分類":"雜曜","主司":"","化氣":"","基本含義":"主貴、明快、果斷、長輩助力、信譽、名望、成功、正義。宜入命身財官遷。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"台輔","內值":61,"星斗":"","拼音":"táifǔ","五行":"戊土","分類":"雜曜","主司":"","化氣":"","基本含義":"台閣之星，主顯貴，性剛強，文學興趣，耿直、參謀、助力，命身疾易皮膚過敏。宜入命身財官遷。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"封誥","內值":62,"星斗":"","拼音":"fēnggào","五行":"己土","分類":"雜曜","主司":"","化氣":"","基本含義":"封章之星，主榮譽，性精明，藝術創作，模范、完美、特長，命身疾易皮膚濕疹。宜入命身財官遷。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"長生","內值":63,"星斗":"","拼音":"chángshēng","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"年少／開始，成長，順利，貴人。老運則相反。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"沐浴","內值":64,"星斗":"","拼音":"mùyù","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"桃花，苦惱，感情，錢財，新鮮。子午卯酉為桃花地，有煞為桃花劫。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"冠帶","內值":65,"星斗":"","拼音":"guàndài","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"順利，吉祥，成就，虛名。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"臨官","內值":66,"星斗":"","拼音":"línguān","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"順暢，結果，得到，滿意，幸福，擁有。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"帝旺","內值":67,"星斗":"","拼音":"dìwàng","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"壯大，發展，延伸，暴露，高處。年老／後悔，不及。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"衰","內值":68,"星斗":"","拼音":"shuāi","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"墜落，頹廢，沒力，隨便，敷衍。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"病","內值":69,"星斗":"","拼音":"bìng","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"停滯，延遲，晚到，不敢，害怕，驚嚇。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"死","內值":70,"星斗":"","拼音":"sǐ","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"結束，放棄，消極，陰暗，等待，舊物，落後。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"墓","內值":71,"星斗":"","拼音":"mù","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"重新，準備，計畫，改進，裝修。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"絕","內值":72,"星斗":"","拼音":"jué","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"孤獨，消滅，低窪，無助，沒心，相反。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"胎","內值":73,"星斗":"","拼音":"tāi","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"希望，期待，新的，細微，冷藏。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"養","內值":74,"星斗":"","拼音":"yǎng","五行":"","分類":"長生十二神","主司":"","化氣":"","基本含義":"幼小，正面，收藏，吸收，複合，多次。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"歲建","內值":75,"星斗":"","拼音":"suìjiàn","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"男意外，女難產，麻煩，停滯，糾纏。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"晦氣","內值":76,"星斗":"","拼音":"huìqì","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"後悔，無助，消沉，無力感。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"喪門","內值":77,"星斗":"","拼音":"sàngmén","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"原本有的~失去，消失，不見，身體酸痛，淤青。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"貫索","內值":78,"星斗":"","拼音":"guànsuǒ","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"約束，被迫，流言，醫院診療。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"官符","內值":79,"星斗":"","拼音":"guānfú","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"法律，糾紛，破財，罰則，規避。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"小耗","內值":80,"星斗":"","拼音":"xiǎohào","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"自己／金錢損失，物件損害。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"歲破","內值":81,"星斗":"","拼音":"suìpò","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"家人／金錢，精神，損失，錯誤。×","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"龍德","內值":82,"星斗":"","拼音":"lóngdé","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"化凶，平安，轉讓。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"白虎","內值":83,"星斗":"","拼音":"báihǔ","五行":"金","分類":"歲前十二神","主司":"","化氣":"","基本含義":"主刑傷，血光，傷害，意外，不喜入命身及少中運。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天德","內值":84,"星斗":"","拼音":"tiāndé","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"保護，阻擋，化桃花煞，解咸池，沐浴。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"弔客","內值":85,"星斗":"","拼音":"diàokè","五行":"火","分類":"歲前十二神","主司":"","化氣":"","基本含義":"主孝服，開刀，困擾，心情低落，不喜入命身及少中運。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"病符","內值":86,"星斗":"","拼音":"bìngfú","五行":"","分類":"歲前十二神","主司":"","化氣":"","基本含義":"小傷，外傷，感染。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"將星","內值":87,"星斗":"","拼音":"jiāngxīng","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"武貴，文升，化凶。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"攀鞍","內值":88,"星斗":"","拼音":"pānān","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"就職，考試，名次。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"歲驛","內值":89,"星斗":"","拼音":"suìyì","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"變動，外出，忙碌。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"息神","內值":90,"星斗":"","拼音":"xīshén","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"沉默，停止，中斷，解約。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"華蓋","內值":91,"星斗":"","拼音":"huágài","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"才藝，學習，孤獨，不被理解。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"劫煞","內值":92,"星斗":"","拼音":"jiéshā","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"不順，阻礙，小人，流言。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"災煞","內值":93,"星斗":"","拼音":"zāishā","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"損失，被騙，隱藏，暗疾。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天煞","內值":94,"星斗":"","拼音":"tiānshā","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"主剋，分離，無緣，男剋女，女剋男。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"指背","內值":95,"星斗":"","拼音":"zhǐbèi","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"流言，不實，怨恨，騷擾。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"咸池","內值":96,"星斗":"","拼音":"xiánchí","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"感情，肉慾。沉迷。遇凶則凶，遇吉則吉。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"月煞","內值":97,"星斗":"","拼音":"yuèshā","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"爭執，吵架，意氣，不爽，男不利女，女不利男。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"亡神","內值":98,"星斗":"","拼音":"wángshén","五行":"","分類":"將前十二神","主司":"","化氣":"","基本含義":"消耗，退出，損失，藥品。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"博士","內值":99,"星斗":"","拼音":"bóshì","五行":"水","分類":"博士十二神","主司":"","化氣":"","基本含義":"主聰明、才能、有壽、好學、聰明，修飾、改建、廣場、有權。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"力士","內值":100,"星斗":"","拼音":"lìshì","五行":"火","分類":"博士十二神","主司":"","化氣":"","基本含義":"主權勢、操守、幫助、權力、保護、盒子、穩固。喜入命身財官遷福。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"青龍","內值":101,"星斗":"","拼音":"qīnglóng","五行":"水","分類":"博士十二神","主司":"","化氣":"","基本含義":"主喜氣、進財、機變、開心、得獎、虛名。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"小耗博士","內值":102,"星斗":"","拼音":"xiǎohào","五行":"火","分類":"博士十二神","主司":"","化氣":"","基本含義":"主破損，失財，不聚積、不全、流動、遺失。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"將軍","內值":103,"星斗":"","拼音":"jiāngjūn","五行":"木","分類":"博士十二神","主司":"","化氣":"","基本含義":"主威猛、性暴、欠和、暴躁易怒、不耐煩、不安、突然出現、增加，亦主掌權。喜武不喜文。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"奏書","內值":104,"星斗":"","拼音":"zòushū","五行":"金","分類":"博士十二神","主司":"","化氣":"","基本含義":"主福祿，喜訊、文書、登錄、名次、就職、證照、考試、文書之喜。宜入財官遷。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"飛廉","內值":105,"星斗":"","拼音":"fēilián","五行":"火","分類":"博士十二神","主司":"","化氣":"","基本含義":"主孤剋刑傷、口角、生氣、造謠、不實、中傷、詆毀、損六畜。忌入命身父母。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"喜神","內值":106,"星斗":"","拼音":"xǐshén","五行":"火","分類":"博士十二神","主司":"","化氣":"","基本含義":"喜事、開心、滿足、美麗、表面、修正、吉慶、延續、生子。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"病符博士","內值":107,"星斗":"","拼音":"bìngfú","五行":"水","分類":"博士十二神","主司":"","化氣":"","基本含義":"鬱悶、燥熱、發燒、小病、探望、等待、主病、災疾。不喜入命身宮。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"大耗","內值":108,"星斗":"","拼音":"dàhào","五行":"火","分類":"博士十二神","主司":"","化氣":"","基本含義":"主破耗、金錢／精神、損財、敗壞、退祖、錯誤、竊盜、賠償。不喜入命身宮。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"伏兵","內值":109,"星斗":"","拼音":"fúbīng","五行":"火","分類":"博士十二神","主司":"","化氣":"","基本含義":"主口舌是非、是非、強出頭、災厄、惹事、不安。不喜入命身財福宮。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"官府","內值":110,"星斗":"","拼音":"guānfǔ","五行":"火","分類":"博士十二神","主司":"","化氣":"","基本含義":"主管非訴訟、法院、官司、糾纏、難解、第三方。歲限凶主牢獄之災。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天使","內值":111,"星斗":"","拼音":"tiānshǐ","五行":"癸水","分類":"雜曜","主司":"","化氣":"","基本含義":"主災禍、意外、勞累、損失、虐待、誣陷，逢歲限主驚險。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"天殤","內值":112,"星斗":"","拼音":"tiānshāng","五行":"壬水","分類":"雜曜","主司":"","化氣":"","基本含義":"主虛虛弱、消耗、不合、沉苛、盜賊，逢歲限主災厄。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"旬空","內值":113,"星斗":"","拼音":"xúnkōng","五行":"","分類":"空曜","主司":"","化氣":"","基本含義":"主空虚、化空、消失、耽擱。忌入身命宮，喜入疾厄宮。<br>吉星逢空主虛名虛利，命主的實際狀況往往不如外表所見的現象好 ; 煞星逢空亦會減其凶性 。<br>於疾厄 宮中則少病痛；見於田宅，主聚財不易。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"年解","內值":114,"星斗":"","拼音":"niánjiě","五行":"","分類":"雜曜","主司":"","化氣":"","基本含義":"為醫藥星，稱天醫貴人，主化兇為吉，逢災有救，可解兇厄。亦有解除、解散、和解、化解、分離、終止、瀉的意思。<br>吉兇都能瓦解，逢吉不吉，逢兇不兇，合而分，分而合。<br>吉聚則化解兇厄，兇聚則為支解、解體、失意、解散、分解、分別、分離、終止、失魂落魄。<br>優點是樂善好施而善解人意，靈敏聰慧又沉穩持重，進取心旺盛且喜向上深造，具宗教緣可得上天庇佑。<br>缺點是思緒過多易使決策難行，略嫌守舊而缺乏沖勁，開創性差不易與時代接軌。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""},
        {"星曜":"月德","內值":116,"星斗":"","拼音":"yuèdé","五行":"","分類":"雜曜","主司":"","化氣":"","基本含義":"月德亦稱月德貴人，月德為人具包容性，心地善良。<br>月德加會左輔、右弼，樂於助人。<br>月德加會文昌、文曲，彬彬有禮。<br>月德加會天魁、天鉞，易結交有地位的人士。<br>月德加會祿、權，科，名利雙收。<br>月德加會火星或鈴星，開創力不足，遇凶可化解災難。<br>月德加會擎羊、陀羅，缺乏魄力，遇凶可化解災難。<br>月德加會火星、鈴星、擎羊、陀羅、地空、地劫，開創力不足，缺乏魄力，遇凶可化解災難。","後天卦":"","廟陷":"","地支數":-1,"地支":"","宮位":"","四化":"","備註":""}
    ];
    
    return 星曜矩陣;
}  // end function 星曜含義


function 尋三合星曜廟陷(星曜名稱, 星曜地支){
    //console.log(星曜名稱 + " / " + 星曜地支);
    var 星曜廟陷矩陣 = [
        { "星曜": "紫微", "子": "平", "丑": "廟", "寅": "旺", "卯": "旺", "辰": "得", "巳": "旺", "午": "廟", "未": "廟", "申": "旺", "酉": "旺", "戌": "得", "亥": "旺"},
        { "星曜": "天機", "子": "廟", "丑": "陷", "寅": "得", "卯": "旺", "辰": "平", "巳": "平", "午": "廟", "未": "陷", "申": "得", "酉": "旺", "戌": "平", "亥": "平"},
        { "星曜": "太陽", "子": "陷", "丑": "陷", "寅": "旺", "卯": "廟", "辰": "旺", "巳": "旺", "午": "旺", "未": "得", "申": "得", "酉": "平", "戌": "陷", "亥": "陷"},
        { "星曜": "武曲", "子": "旺", "丑": "廟", "寅": "得", "卯": "平", "辰": "廟", "巳": "平", "午": "旺", "未": "廟", "申": "得", "酉": "平", "戌": "廟", "亥": "平"},
        { "星曜": "天同", "子": "旺", "丑": "陷", "寅": "平", "卯": "平", "辰": "平", "巳": "廟", "午": "陷", "未": "陷", "申": "旺", "酉": "平", "戌": "平", "亥": "廟"},
        { "星曜": "廉貞", "子": "平", "丑": "平", "寅": "廟", "卯": "平", "辰": "平", "巳": "陷", "午": "平", "未": "平", "申": "廟", "酉": "平", "戌": "平", "亥": "陷"},
        { "星曜": "天府", "子": "廟", "丑": "廟", "寅": "廟", "卯": "得", "辰": "廟", "巳": "得", "午": "旺", "未": "廟", "申": "得", "酉": "旺", "戌": "廟", "亥": "得"},
        { "星曜": "太陰", "子": "廟", "丑": "廟", "寅": "旺", "卯": "陷", "辰": "陷", "巳": "陷", "午": "平", "未": "陷", "申": "平", "酉": "旺", "戌": "旺", "亥": "廟"},
        { "星曜": "貪狼", "子": "旺", "丑": "廟", "寅": "平", "卯": "平", "辰": "廟", "巳": "陷", "午": "旺", "未": "廟", "申": "平", "酉": "平", "戌": "廟", "亥": "陷"},
        { "星曜": "巨門", "子": "旺", "丑": "陷", "寅": "廟", "卯": "廟", "辰": "陷", "巳": "旺", "午": "旺", "未": "陷", "申": "廟", "酉": "廟", "戌": "陷", "亥": "旺"},
        { "星曜": "天相", "子": "廟", "丑": "廟", "寅": "廟", "卯": "陷", "辰": "得", "巳": "得", "午": "廟", "未": "得", "申": "廟", "酉": "陷", "戌": "得", "亥": "得"},
        { "星曜": "天梁", "子": "廟", "丑": "旺", "寅": "廟", "卯": "廟", "辰": "廟", "巳": "陷", "午": "廟", "未": "旺", "申": "陷", "酉": "得", "戌": "廟", "亥": "陷"},
        { "星曜": "七殺", "子": "旺", "丑": "廟", "寅": "廟", "卯": "旺", "辰": "廟", "巳": "平", "午": "旺", "未": "廟", "申": "廟", "酉": "旺", "戌": "廟", "亥": "平"},
        { "星曜": "破軍", "子": "廟", "丑": "旺", "寅": "得", "卯": "陷", "辰": "旺", "巳": "平", "午": "廟", "未": "旺", "申": "得", "酉": "陷", "戌": "旺", "亥": "平"},
        { "星曜": "祿存", "子": "廟", "丑": "", "寅": "廟", "卯": "廟", "辰": "", "巳": "廟", "午": "廟", "未": "", "申": "廟", "酉": "廟", "戌": "", "亥": "廟"},
        { "星曜": "文昌", "子": "得", "丑": "廟", "寅": "陷", "卯": "平", "辰": "得", "巳": "廟", "午": "陷", "未": "平", "申": "得", "酉": "廟", "戌": "陷", "亥": "平"},
        { "星曜": "文曲", "子": "得", "丑": "廟", "寅": "平", "卯": "旺", "辰": "得", "巳": "廟", "午": "陷", "未": "旺", "申": "得", "酉": "廟", "戌": "陷", "亥": "旺"},
        { "星曜": "火星", "子": "陷", "丑": "得", "寅": "廟", "卯": "平", "辰": "陷", "巳": "", "午": "廟", "未": "平", "申": "陷", "酉": "得", "戌": "廟", "亥": "平"},
        { "星曜": "鈴星", "子": "陷", "丑": "得", "寅": "廟", "卯": "平", "辰": "陷", "巳": "", "午": "廟", "未": "平", "申": "陷", "酉": "得", "戌": "廟", "亥": "平"},
        { "星曜": "擎羊", "子": "陷", "丑": "廟", "寅": "", "卯": "陷", "辰": "廟", "巳": "", "午": "陷", "未": "廟", "申": "", "酉": "陷", "戌": "廟", "亥": ""},
        { "星曜": "陀羅", "子": "", "丑": "廟", "寅": "陷", "卯": "", "辰": "廟", "巳": "陷", "午": "", "未": "廟", "申": "陷", "酉": "", "戌": "廟", "亥": "陷"},
        { "星曜": "天馬", "子": "", "丑": "", "寅": "旺", "卯": "", "辰": "", "巳": "平", "午": "", "未": "", "申": "旺", "酉": "", "戌": "", "亥": "平"},
        { "星曜": "天魁", "子": "旺", "丑": "旺", "寅": "", "卯": "廟", "辰": "", "巳": "", "午": "廟", "未": "", "申": "", "酉": "", "戌": "", "亥": "旺"},
        { "星曜": "天鉞", "子": "", "丑": "", "寅": "旺", "卯": "", "辰": "", "巳": "旺", "午": "", "未": "旺", "申": "廟", "酉": "廟", "戌": "", "亥": ""},
        { "星曜": "地空", "子": "平", "丑": "陷", "寅": "陷", "卯": "平", "辰": "陷", "巳": "廟", "午": "廟", "未": "平", "申": "廟", "酉": "廟", "戌": "陷", "亥": "陷"},
        { "星曜": "地劫", "子": "陷", "丑": "陷", "寅": "平", "卯": "平", "辰": "陷", "巳": "得", "午": "廟", "未": "平", "申": "廟", "酉": "平", "戌": "平", "亥": "旺"}
    ];
    
    var 廟陷 = {"度": "", "數": 0, "符號": "", "符號數": "", "備註": ""};
    var 資料索引= _.findIndex(星曜廟陷矩陣, {星曜: 星曜名稱});
    
    if(資料索引 != -1) 廟陷.度 = 星曜廟陷矩陣[資料索引][星曜地支];
    
    switch(廟陷.度){
        case "旺": 廟陷.數 = 5; 廟陷.符號 = "☆"; 廟陷.符號數 = "➄"; break;
        case "廟": 廟陷.數 = 4; 廟陷.符號 = "◎"; 廟陷.符號數 = "➃"; break;
        case "得": 廟陷.數 = 3; 廟陷.符號 = "○"; 廟陷.符號數 = "➂"; break;
        case "平": 廟陷.數 = 2; 廟陷.符號 = "△"; 廟陷.符號數 = "➁"; break;
        case "陷": 廟陷.數 = 1; 廟陷.符號 = "Ｘ"; 廟陷.符號數 = "➀"; break;
    } // end switch 廟陷.度
    
    return 廟陷;
} // end function 星曜廟陷


// ***************************************

function 宮位轉換地支數(命盤, 宮位, 大限數) {
    //input 宮位, could be 地支，十二人事，或大限十二人事宮, convert to 地支數
    var 宮位類型, 地支數=-1;
    if(大限數===undefined) 大限數 = 1;
    
    if(命盤.定義.地支數.indexOf(宮位) >= 0) { 宮位類型 = "地支數"; 地支數 = 宮位; }
    if(命盤.定義.地支.indexOf(宮位) >= 0) { 宮位類型 = "地支"; 地支數 = 地支字數轉換(宮位); }
    if(命盤.定義.宮位.indexOf(宮位) >= 0) { 宮位類型 = "宮位"; 地支數 = 命盤.人事宮[宮位].地支數; }
    if(命盤.定義.大限宮位.indexOf(宮位) >= 0) { 宮位類型 = "大限宮位"; 地支數 = 命盤.大限[大限數].人事宮[宮位.substr(2,3)]; }
    
    if(地支數 >=0) return 地支數;
} // end fuction 宮位轉換地支數


function 宮位相應方位(命盤, 宮位, 方位) {
    // 方位：對宮，左方，右方
    var 宮位地支數 = 宮位轉換地支數(命盤, 宮位);
    var 相應方位數 = 0;
    var 相應方地支數 = -1;
    
    switch(方位) {
        case "對宮":
            相應方位數 = 6;
            break;
        case "左方":
            相應方位數 = 4;
            break;
        case "右方":
            相應方位數 = 8;
            break;
        case "左鄰":
            相應方位數 = 1;
            break;
        case "右鄰":
            相應方位數 = -1;
            break;
        case "六合":
            //console.log(地支六合冲害破(地支字數轉換(宮位地支數)));
            相應方地支數 = 地支字數轉換(地支六合冲害破(地支字數轉換(宮位地支數)).六合支);
            break;
    }  // end switch 方位
    
    if(方位!="六合") 相應方地支數 = 地支滾動(宮位地支數, 相應方位數);
    
    var 相應方位 = {
        //"參照地支": 宮位,
        "相應方位": 方位,
        "地支數": 相應方地支數,
        "宮位": 命盤.地支宮位[相應方地支數].宮位,
        "無主星": 命盤.地支宮位[相應方地支數].無主星,
        "星曜": 星曜組件重組(命盤.地支宮位[相應方地支數].星曜),
        "備註": ""
    };  // end 相應方位
    
    if(相應方地支數 != -1) return 相應方位;
} //end function function 宮位相應宮位


function 地支轉換四地(地支){
    var 四地="";
    
    switch(地支) {
        case "辰": case "戌": case "丑":  case "未":
            四地 = "四墓地";
            break;
        case "寅": case "申": case "巳":  case "亥":
            四地 = "四馬地";
            break;
        case "子": case "午": case "卯":  case "酉":
            四地 = "桃花地";
            break;
    }  // end switch
    
    return 四地;
} // end function 地支轉換四地


function 星曜組件重組(宮位星曜, 借宮星曜) {
    // to transform the 星曜 arrangement, add the 借宮星曜 if provided
    var 星曜 = {};
    
    if(借宮星曜 === undefined) {
        星曜.主星 = 宮位星曜.主星;
        星曜.吉曜 = 宮位星曜.六吉星.concat(宮位星曜.祿馬星);
        星曜.煞星 = 宮位星曜.六凶星;
        星曜.四化 = 宮位星曜.四化星;
        星曜.雜曜 = 宮位星曜.雜曜.concat(宮位星曜.空曜);
        星曜.雜曜.push(宮位星曜.將前星, 宮位星曜.歲前星, 宮位星曜.博士星, 宮位星曜.十二長生);

        星曜.所有 = 星曜.主星.concat(星曜.吉曜, 星曜.煞星, 星曜.四化, 星曜.雜曜);
    }  // end if 借宮星曜 === undefined
    
    
    if(借宮星曜 != undefined) {
        星曜.主星 = 宮位星曜.主星.concat(借宮星曜.主星);
        星曜.吉曜 = 宮位星曜.六吉星.concat(宮位星曜.祿馬星, 借宮星曜.六吉星, 借宮星曜.祿馬星);
        星曜.煞星 = 宮位星曜.六凶星.concat(借宮星曜.六凶星);
        星曜.四化 = 宮位星曜.四化星.concat(借宮星曜.四化星);
        星曜.雜曜 = 宮位星曜.雜曜.concat(宮位星曜.空曜, 借宮星曜.雜曜, 借宮星曜.空曜);
        星曜.雜曜.push(宮位星曜.將前星, 宮位星曜.歲前星, 宮位星曜.博士星); //, 宮位星曜.十二長生
        if(借宮星曜.將前星 !="") 星曜.雜曜.push(借宮星曜.將前星, 借宮星曜.歲前星, 借宮星曜.博士星);

        星曜.所有 = 星曜.主星.concat(星曜.吉曜, 星曜.煞星, 星曜.四化, 星曜.雜曜);
    }  // end if 借宮星曜 != undefined
    
    return 星曜;
}  // end function 星曜組件重組



function 星曜加總(宮位星曜1, 宮位星曜2) {
    // to sum the 星曜 from 2 sets
    var 星曜 = {};
    
    星曜.主星 = 宮位星曜1.主星.concat(宮位星曜2.主星);
    星曜.吉曜 = 宮位星曜1.吉曜.concat(宮位星曜2.吉曜);
    星曜.煞星 = 宮位星曜1.煞星.concat(宮位星曜2.煞星);
    星曜.四化 = 宮位星曜1.四化.concat(宮位星曜2.四化);
    星曜.雜曜 = 宮位星曜1.雜曜.concat(宮位星曜2.雜曜);
    
    星曜.所有 = 星曜.主星.concat(星曜.吉曜, 星曜.煞星, 星曜.四化, 星曜.雜曜);
    
    return 星曜;
}  // end function 星曜加總


function 星曜矩陣所含星曜(星曜主陣, 所含星曜, 或與){
    // check if the main array contains the items of 2nd array, could be either "AND" or "OR"
    var 含有其中 = false, 包含所有 = true;
    if(或與 === undefined) 或與 = "AND";
    
    for(var i=0; i<所含星曜.length; i++){
        含有其中 = 含有其中 || _.contains(星曜主陣, 所含星曜[i]);
        包含所有 = 包含所有 && _.contains(星曜主陣, 所含星曜[i]);
    } // end for

    if(或與 == "AND" || 或與 == "and" || 或與 == "&&") return 包含所有;
    if(或與 == "OR" || 或與 == "or" || 或與 == "||") return 含有其中;
    
} // end function 星曜矩陣所含星曜

