function 三合格局元件 (){
    this.格局吉凶 = "";
    this.成立 = false;
    //this.星曜 = [];
    this.地支1 = -1; this.地支2 = -1;
    this.宮位1 = -1; this.宮位2 = -1;
    this.註解 = "";  // 精算後的註解
    this.破格 = false;
    this.形態 = 0;  // 格局形成的不同形態
    this.註解參考 = ""; // 參考資料，沒有計算
    this.古訣 = ""; // 古訣
    this.備註;
} // end function 三合格局元件


function 三合格局建立 (){
    var 紫微格局 = ["百官朝拱", "在野孤君", "無道之君", "化殺為權", "紫府同宮", "極響離明", "君臣慶會", "君臣不義", "桃花犯主", "卯位極居"];
    var 天機格局 = ["機巨同臨", "機梁加會", "機月同梁"];
    var 太陽格局 = ["陽梁昌祿", "日照雷門", "丹墀桂墀", "日麗中天"];
    var 日月格局 = ["日月反背", "日月並明", "明珠出海", "日月夾命", "陰陽左右"];
    var 武曲格局 = ["武貪同行", "鈴昌陀武", "將星得地", "殺陷震兌"];
    var 天同格局 = ["天同反背", "馬頭帶劍"];
    var 廉貞格局 = ["廉貞清白", "廉貞文武", "殺拱廉貞"];
    var 天府格局 = ["天府朝垣", "府相朝垣"];
    var 太陰格局 = ["月生滄海", "月朗天門", "火陰格", "鈴陰格"];
    var 貪狼格局 = ["火貪格", "鈴貪格", "貪居旺宮", "三合火貪", "三合鈴貪", "泛水桃花", "風流綵杖", "昌貪格", "曲貪格"];
    var 巨門格局 = ["石中隱玉", "巨門反背", "巨日同宮", "巨逢四煞"];
    var 天相格局 = ["財蔭夾印", "刑忌夾印", "府相得祿"];
    var 天梁格局 = ["文梁振紀", "天梁拱月", "壽星入廟", "天梁飄蕩", "天梁遇馬"];
    var 七殺格局 = ["七殺朝斗", "七殺仰斗"];
    var 破軍格局 = ["英星入廟", "眾水朝東", "水中作塚"];
    var 四化格局 = ["三奇加會", "甲第登庸", "科名會祿", "權祿巡逢", "科星煞湊", "祿文拱命"];
    var 六吉星格局 = ["祿馬交馳", "祿合鴛鴦", "祿馬佩印", "雙祿夾命", "雙祿朝垣", "坐貴向貴", "魁鉞凶沖", "貴星夾命", "文桂文華", "輔拱文星", "文星暗拱"];
    var 六煞星格局 = ["火鈴夾命", "空劫夾命", "羊陀夾忌", "文星遇夾", "命裏逢凶", "權煞化祿"];
    var 宮位格局 = ["命無正曜", "左右同宮", "魁钺夹命", "文星拱命", "祿居奴僕"];
    var 格局名稱;
    var 格局矩陣 = 紫微格局.concat(天機格局, 日月格局, 太陽格局, 武曲格局, 天同格局, 廉貞格局, 天府格局, 太陰格局, 貪狼格局, 巨門格局, 天相格局, 天梁格局, 七殺格局, 破軍格局, 四化格局, 六吉星格局, 六煞星格局, 宮位格局);
    var 格局 = {};
    
    for(var i=0; i < 格局矩陣.length; i++ ){
        格局名稱 = 格局矩陣[i];
        格局[格局名稱] = new 三合格局元件();
    }  // end for
    
    return 格局;
} // end function 三合格局建立


function 尋星曜屬性(命盤, 星曜名稱) {
    this.地支數 = 命盤.星曜[星曜名稱].地支數;
    this.對宮地支數 = 地支滾動(this.地支數, 6);
    this.地支 = 命盤.星曜[星曜名稱].地支;
    this.四化 = 命盤.星曜[星曜名稱].四化;
    this.吉化 = 命盤.地支宮位[命盤.星曜[星曜名稱].地支數].吉化;
    this.煞重 = 命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜架構.諸星群.煞曜.煞重;
    this.四化吉化 = 命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜架構.諸星群.四化.吉化;
    this.空劫同躔 = 星曜矩陣所含星曜(命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜架構.諸星群.煞曜.星曜, ["地空", "地劫",], "||");
    this.火鈴同躔 = 星曜矩陣所含星曜(命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜架構.諸星群.煞曜.星曜, ["火星", "鈴星",], "||");
    this.羊陀同躔 = 星曜矩陣所含星曜(命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜架構.諸星群.煞曜.星曜, ["擎羊", "陀羅",], "||");
    this.四煞同躔 = this.火鈴同躔 || this.羊陀同躔;
    this.六煞同躔 = this.空劫同躔 || this.火鈴同躔 || this.羊陀同躔;
    this.廟陷度 = 命盤.星曜[星曜名稱].廟陷.度;
    this.廟陷數 = 命盤.星曜[星曜名稱].廟陷.數;
    this.本宮星曜 = 命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜本宮.所有;
    this.互涉星曜 = 命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜四正.所有;
    this.雙方星曜 = 命盤.地支宮位[命盤.星曜[星曜名稱].地支數].右方.星曜.所有.concat(命盤.地支宮位[命盤.星曜[星曜名稱].地支數].左方.星曜.所有);
    this.架構 = 命盤.地支宮位[命盤.星曜[星曜名稱].地支數].星曜架構;
    this.備註 = "";
} // end function 尋星曜屬性


function 宮位格局分析(命盤) {
    var 星曜 = 命盤.星曜;
    var 紫微屬性 = new 尋星曜屬性(命盤, "紫微"); 命盤.星曜.紫微.對星 = 紫微屬性.對星; 命盤.星曜.紫微.互涉星曜 = 紫微屬性.互涉星曜; 命盤.星曜.紫微.架構 = 紫微屬性.架構; 命盤.星曜.紫微.吉化 = 紫微屬性.吉化;
    var 天機屬性 = new 尋星曜屬性(命盤, "天機"); 命盤.星曜.天機.對星 = 天機屬性.對星; 命盤.星曜.天機.互涉星曜 = 天機屬性.互涉星曜; 命盤.星曜.天機.架構 = 天機屬性.架構; 命盤.星曜.天機.吉化 = 天機屬性.吉化;
    var 太陽屬性 = new 尋星曜屬性(命盤, "太陽"); 命盤.星曜.太陽.對星 = 太陽屬性.對星; 命盤.星曜.太陽.互涉星曜 = 太陽屬性.互涉星曜; 命盤.星曜.太陽.架構 = 太陽屬性.架構; 命盤.星曜.太陽.吉化 = 太陽屬性.吉化;
    var 武曲屬性 = new 尋星曜屬性(命盤, "武曲"); 命盤.星曜.武曲.對星 = 武曲屬性.對星; 命盤.星曜.武曲.互涉星曜 = 武曲屬性.互涉星曜; 命盤.星曜.武曲.架構 = 武曲屬性.架構; 命盤.星曜.武曲.吉化 = 武曲屬性.吉化;
    var 天同屬性 = new 尋星曜屬性(命盤, "天同"); 命盤.星曜.天同.對星 = 天同屬性.對星; 命盤.星曜.天同.互涉星曜 = 天同屬性.互涉星曜; 命盤.星曜.天同.架構 = 天同屬性.架構; 命盤.星曜.天同.吉化 = 天同屬性.吉化;
    var 廉貞屬性 = new 尋星曜屬性(命盤, "廉貞"); 命盤.星曜.廉貞.對星 = 廉貞屬性.對星; 命盤.星曜.廉貞.互涉星曜 = 廉貞屬性.互涉星曜; 命盤.星曜.廉貞.架構 = 廉貞屬性.架構; 命盤.星曜.廉貞.吉化 = 廉貞屬性.吉化;
    var 天府屬性 = new 尋星曜屬性(命盤, "天府"); 命盤.星曜.天府.對星 = 天府屬性.對星; 命盤.星曜.天府.互涉星曜 = 天府屬性.互涉星曜; 命盤.星曜.天府.架構 = 天府屬性.架構; 命盤.星曜.天府.吉化 = 天府屬性.吉化;
    var 太陰屬性 = new 尋星曜屬性(命盤, "太陰"); 命盤.星曜.太陰.對星 = 太陰屬性.對星; 命盤.星曜.太陰.互涉星曜 = 太陰屬性.互涉星曜; 命盤.星曜.太陰.架構 = 太陰屬性.架構; 命盤.星曜.太陰.吉化 = 太陰屬性.吉化;
    var 貪狼屬性 = new 尋星曜屬性(命盤, "貪狼"); 命盤.星曜.貪狼.對星 = 貪狼屬性.對星; 命盤.星曜.貪狼.互涉星曜 = 貪狼屬性.互涉星曜; 命盤.星曜.貪狼.架構 = 貪狼屬性.架構; 命盤.星曜.貪狼.吉化 = 貪狼屬性.吉化;
    var 巨門屬性 = new 尋星曜屬性(命盤, "巨門"); 命盤.星曜.巨門.對星 = 巨門屬性.對星; 命盤.星曜.巨門.互涉星曜 = 巨門屬性.互涉星曜; 命盤.星曜.巨門.架構 = 巨門屬性.架構; 命盤.星曜.巨門.吉化 = 巨門屬性.吉化;
    var 天相屬性 = new 尋星曜屬性(命盤, "天相"); 命盤.星曜.天相.對星 = 天相屬性.對星; 命盤.星曜.天相.互涉星曜 = 天相屬性.互涉星曜; 命盤.星曜.天相.架構 = 天相屬性.架構; 命盤.星曜.天相.吉化 = 天相屬性.吉化;
    var 天梁屬性 = new 尋星曜屬性(命盤, "天梁"); 命盤.星曜.天梁.對星 = 天梁屬性.對星; 命盤.星曜.天梁.互涉星曜 = 天梁屬性.互涉星曜; 命盤.星曜.天梁.架構 = 天梁屬性.架構; 命盤.星曜.天梁.吉化 = 天梁屬性.吉化;
    var 七殺屬性 = new 尋星曜屬性(命盤, "七殺"); 命盤.星曜.七殺.對星 = 七殺屬性.對星; 命盤.星曜.七殺.互涉星曜 = 七殺屬性.互涉星曜; 命盤.星曜.七殺.架構 = 七殺屬性.架構; 命盤.星曜.七殺.吉化 = 七殺屬性.吉化;
    var 破軍屬性 = new 尋星曜屬性(命盤, "破軍"); 命盤.星曜.破軍.對星 = 破軍屬性.對星; 命盤.星曜.破軍.互涉星曜 = 破軍屬性.互涉星曜; 命盤.星曜.破軍.架構 = 破軍屬性.架構; 命盤.星曜.破軍.吉化 = 破軍屬性.吉化;
    
    var 左輔屬性 = new 尋星曜屬性(命盤, "左輔"); 命盤.星曜.左輔.對星 = 左輔屬性.對星; 命盤.星曜.左輔.互涉星曜 = 左輔屬性.互涉星曜; 命盤.星曜.左輔.架構 = 左輔屬性.架構; 命盤.星曜.左輔.吉化 = 左輔屬性.吉化;
    var 右弼屬性 = new 尋星曜屬性(命盤, "右弼"); 命盤.星曜.右弼.對星 = 右弼屬性.對星; 命盤.星曜.右弼.互涉星曜 = 右弼屬性.互涉星曜; 命盤.星曜.右弼.架構 = 右弼屬性.架構; 命盤.星曜.右弼.吉化 = 右弼屬性.吉化;
    var 文昌屬性 = new 尋星曜屬性(命盤, "文昌"); 命盤.星曜.文昌.對星 = 文昌屬性.對星; 命盤.星曜.文昌.互涉星曜 = 文昌屬性.互涉星曜; 命盤.星曜.文昌.架構 = 文昌屬性.架構; 命盤.星曜.文昌.吉化 = 文昌屬性.吉化;
    var 文曲屬性 = new 尋星曜屬性(命盤, "文曲"); 命盤.星曜.文曲.對星 = 文曲屬性.對星; 命盤.星曜.文曲.互涉星曜 = 文曲屬性.互涉星曜; 命盤.星曜.文曲.架構 = 文曲屬性.架構; 命盤.星曜.文曲.吉化 = 文曲屬性.吉化;
    var 天魁屬性 = new 尋星曜屬性(命盤, "天魁"); 命盤.星曜.天魁.對星 = 天魁屬性.對星; 命盤.星曜.天魁.互涉星曜 = 天魁屬性.互涉星曜; 命盤.星曜.天魁.架構 = 天魁屬性.架構; 命盤.星曜.天魁.吉化 = 天魁屬性.吉化;
    var 天鉞屬性 = new 尋星曜屬性(命盤, "天鉞"); 命盤.星曜.天鉞.對星 = 天鉞屬性.對星; 命盤.星曜.天鉞.互涉星曜 = 天鉞屬性.互涉星曜; 命盤.星曜.天鉞.架構 = 天鉞屬性.架構; 命盤.星曜.天鉞.吉化 = 天鉞屬性.吉化;
    var 祿存屬性 = new 尋星曜屬性(命盤, "祿存"); 命盤.星曜.祿存.對星 = 祿存屬性.對星; 命盤.星曜.祿存.互涉星曜 = 祿存屬性.互涉星曜; 命盤.星曜.祿存.架構 = 祿存屬性.架構; 命盤.星曜.祿存.吉化 = 祿存屬性.吉化;
    var 天馬屬性 = new 尋星曜屬性(命盤, "天馬"); 命盤.星曜.天馬.對星 = 天馬屬性.對星; 命盤.星曜.天馬.互涉星曜 = 天馬屬性.互涉星曜; 命盤.星曜.天馬.架構 = 天馬屬性.架構; 命盤.星曜.天馬.吉化 = 天馬屬性.吉化;
    
    var 擎羊屬性 = new 尋星曜屬性(命盤, "擎羊"); 命盤.星曜.擎羊.對星 = 擎羊屬性.對星; 命盤.星曜.擎羊.互涉星曜 = 擎羊屬性.互涉星曜; 命盤.星曜.擎羊.架構 = 擎羊屬性.架構; 命盤.星曜.擎羊.吉化 = 擎羊屬性.吉化;
    var 陀羅屬性 = new 尋星曜屬性(命盤, "陀羅"); 命盤.星曜.陀羅.對星 = 陀羅屬性.對星; 命盤.星曜.陀羅.互涉星曜 = 陀羅屬性.互涉星曜; 命盤.星曜.陀羅.架構 = 陀羅屬性.架構; 命盤.星曜.陀羅.吉化 = 陀羅屬性.吉化;
    var 火星屬性 = new 尋星曜屬性(命盤, "火星"); 命盤.星曜.火星.對星 = 火星屬性.對星; 命盤.星曜.火星.互涉星曜 = 火星屬性.互涉星曜; 命盤.星曜.火星.架構 = 火星屬性.架構; 命盤.星曜.火星.吉化 = 火星屬性.吉化;
    var 鈴星屬性 = new 尋星曜屬性(命盤, "鈴星"); 命盤.星曜.鈴星.對星 = 鈴星屬性.對星; 命盤.星曜.鈴星.互涉星曜 = 鈴星屬性.互涉星曜; 命盤.星曜.鈴星.架構 = 鈴星屬性.架構; 命盤.星曜.鈴星.吉化 = 鈴星屬性.吉化;   
    var 地空屬性 = new 尋星曜屬性(命盤, "地空"); 命盤.星曜.地空.對星 = 地空屬性.對星; 命盤.星曜.地空.互涉星曜 = 地空屬性.互涉星曜; 命盤.星曜.地空.架構 = 地空屬性.架構; 命盤.星曜.地空.吉化 = 地空屬性.吉化;
    var 地劫屬性 = new 尋星曜屬性(命盤, "地劫"); 命盤.星曜.地劫.對星 = 地劫屬性.對星; 命盤.星曜.地劫.互涉星曜 = 地劫屬性.互涉星曜; 命盤.星曜.地劫.架構 = 地劫屬性.架構; 命盤.星曜.地劫.吉化 = 地劫屬性.吉化;
    
    var 截路屬性 = new 尋星曜屬性(命盤, "截路");
    var 空亡屬性 = new 尋星曜屬性(命盤, "空亡");
    
    var 化祿屬性 = new 尋星曜屬性(命盤, "化祿");
    var 化權屬性 = new 尋星曜屬性(命盤, "化權");
    var 化科屬性 = new 尋星曜屬性(命盤, "化科");
    var 化忌屬性 = new 尋星曜屬性(命盤, "化忌");
    
    var 四煞曜 = ["火星", "鈴星", "擎羊", "陀羅"];
    
    // ************* 主要結構 *************
    
    //百官 = ["天府", "天相", "文昌", "文曲", "天魁", "天鉞", "左輔", "右弼", "龍池", "鳳閣", "三台", "八座", "恩光", "天貴", "台輔", "封誥"];
    // 優先檢測的格局，以方便其他格局參考
    
    // ****************************************************
    // ********************** 天相 ************************
    // ****************************************************
    
    //凡天相，其相鄰兩宮必分別為巨門及天梁坐守。祿存與天梁相夾則不成格，因為必同時有擎羊與天相同度，是為破格。
    //凡「財蔭夾印」之局，必須看是什麼星曜化祿﹔凡，「刑忌夾印」之局，必須看是什麼星曜化忌，然后才可推論吉凶克應的具體性質。
    
    var 天相右鄰宮 = 命盤.地支宮位[天相屬性.地支數].右鄰;
    var 天相左方宮 = 命盤.地支宮位[天相屬性.地支數].左方;
    
    命盤.星曜.天相.財蔭夾印 = false;
    命盤.星曜.天相.刑忌夾印 = false;
    
    // ------------ 財蔭夾印 ------------
    if(_.contains(天相右鄰宮.星曜.四化, "化祿") && !_.contains(天相右鄰宮.星曜.四化, "化忌")) {
        命盤.格局.財蔭夾印.成立 = true;
        命盤.星曜.天相.財蔭夾印 = true;
        命盤.格局.財蔭夾印.地支1 = 天相屬性.地支數;
        命盤.格局.財蔭夾印.宮位1 = 命盤.地支宮位[命盤.格局.財蔭夾印.地支1].宮位;
        命盤.格局.財蔭夾印.化祿星 = 命盤.生年四化.化祿星;
        天相屬性.吉化 = true;
        
        if(命盤.格局.財蔭夾印.化祿星 == "天機") 命盤.格局.財蔭夾印.形態 = 1;
        if(命盤.格局.財蔭夾印.化祿星 == "巨門") 命盤.格局.財蔭夾印.形態 = 2;
        
        命盤.地支宮位[天相屬性.地支數].星曜架構.格局.push("財蔭夾印");
    }  // end if 財蔭夾印1
    
    if(祿存屬性.地支 == 巨門屬性.地支 && 祿存屬性.地支 != 化忌屬性.地支) {  //天相在丑，則巨門在子，癸年生人祿存與巨門同度，亦為「財蔭夾印格」
        命盤.格局.財蔭夾印.成立 = true;
        命盤.星曜.天相.財蔭夾印 = true;
        命盤.格局.財蔭夾印.地支1 = 天相屬性.地支數;
        命盤.格局.財蔭夾印.宮位1 = 命盤.地支宮位[命盤.格局.財蔭夾印.地支1].宮位;
        命盤.格局.財蔭夾印.化祿星 = "祿存";
        天相屬性.吉化 = true;
        命盤.格局.財蔭夾印.形態 = 3;
        
        命盤.地支宮位[天相屬性.地支數].星曜架構.格局.push("財蔭夾印");
    } // end if 財蔭夾印2
    
    
    // ------------ 刑忌夾印1 ------------
    if(_.contains(天相右鄰宮.星曜.四化, "化忌")) {
        命盤.格局.刑忌夾印.成立 = true;
        命盤.星曜.天相.刑忌夾印 = true;
        命盤.格局.刑忌夾印.形態 = 1;
        命盤.格局.刑忌夾印.地支1 = 天相屬性.地支數;
        命盤.格局.刑忌夾印.宮位1 = 命盤.地支宮位[命盤.格局.刑忌夾印.地支1].宮位;
        命盤.格局.刑忌夾印.化忌星 = 命盤.生年四化.化忌星;
        
        命盤.地支宮位[天相屬性.地支數].星曜架構.格局.push("刑忌夾印");
    }  // end if  刑忌夾印1

    // ------------ 刑忌夾印2 ------------
    if(_.contains(天相屬性.本宮星曜, "祿存")) {
        命盤.格局.刑忌夾印.成立 = true;
        命盤.星曜.天相.刑忌夾印 = true;
        命盤.格局.刑忌夾印.形態 = 2;
        命盤.格局.刑忌夾印.地支1 = 天相屬性.地支數;
        命盤.格局.刑忌夾印.宮位1 = 命盤.地支宮位[命盤.格局.刑忌夾印.地支1].宮位;
        命盤.格局.刑忌夾印.化忌星 = "";
        
        命盤.地支宮位[天相屬性.地支數].星曜架構.格局.push("刑忌夾印");
    }  // end if  刑忌夾印1

    // ------------ 祿馬佩印 ------------
    /* moved to 祿馬交馳
    if(_.contains(天相屬性.本宮星曜, "天馬") && (_.contains(天相屬性.本宮星曜, "祿存") || _.contains(命盤.地支宮位[天相屬性.對宮地支數].星曜本宮.所有, "祿存")) ) {
        命盤.格局.祿馬佩印.成立 = true;
        命盤.格局.祿馬佩印.地支1 = 天相屬性.地支數;
        命盤.格局.祿馬佩印.宮位1 = 命盤.地支宮位[命盤.格局.祿馬佩印.地支1].宮位;
        
        命盤.地支宮位[天相屬性.地支數].星曜架構.格局.push("祿馬佩印");
    }  // end if 祿馬佩印
    */
    
    // ------------ 府相得祿 ------------
    if(_.contains(天相左方宮.星曜.所有, "祿存") || _.contains(天相左方宮.星曜.所有, "化祿")) {
        命盤.格局.府相得祿.成立 = true;
        命盤.格局.府相得祿.地支1 = 天相屬性.地支數;
        命盤.格局.府相得祿.宮位1 = 命盤.地支宮位[命盤.格局.府相得祿.地支1].宮位;
        命盤.格局.府相得祿.地支2 = 天府屬性.地支數;
        命盤.格局.府相得祿.宮位2 = 命盤.地支宮位[命盤.格局.府相得祿.地支2].宮位;
        
        if(_.contains(天相左方宮.星曜.所有, "祿存") && !_.contains(天相左方宮.星曜.所有, "化祿")) 命盤.格局.府相得祿.形態 = 1;
        if(!_.contains(天相左方宮.星曜.所有, "祿存") && _.contains(天相左方宮.星曜.所有, "化祿")) 命盤.格局.府相得祿.形態 = 2;
        if(_.contains(天相左方宮.星曜.所有, "祿存") && _.contains(天相左方宮.星曜.所有, "化祿")) 命盤.格局.府相得祿.形態 = 3;
        
        天相屬性.吉化 = true; 天府屬性.吉化 = true;
        
        命盤.地支宮位[天相屬性.地支數].星曜架構.格局.push("*府相得祿");
        命盤.地支宮位[天府屬性.地支數].星曜架構.格局.push("*府相得祿");
    }  // end if  府相得祿  
    
    
    
    
    // ****************************************************
    // ********************** 天府 ************************
    // ****************************************************
    
    命盤.星曜.天府.百官星 = 三方四正諸星群判斷(天府屬性.互涉星曜, 命盤.定義.百官).星曜;
    
    var 天府百官分數 = 命盤.星曜.天府.百官星.length / 2;
    var 生年干 = 命盤.生年天干;
    
    if(天府屬性.架構.對星.輔弼.同宮) 天府百官分數 +=3; if(天府屬性.架構.對星.輔弼.對宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.輔弼.相夾) 天府百官分數 +=1.5; if(天府屬性.架構.對星.輔弼.相對) 天府百官分數 +=2; if(天府屬性.架構.對星.輔弼.三方蝴蝶式) 天府百官分數 +=2; if(天府屬性.架構.對星.輔弼.三方斜飛式) 天府百官分數 +=1.5; if(天府屬性.架構.對星.輔弼.四正斜飛式) 天府百官分數 +=1;
    if(天府屬性.架構.對星.魁鉞.同宮) 天府百官分數 +=3; if(天府屬性.架構.對星.魁鉞.對宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.魁鉞.相夾) 天府百官分數 +=1.5; if(天府屬性.架構.對星.魁鉞.相對) 天府百官分數 +=2; if(天府屬性.架構.對星.魁鉞.三方蝴蝶式) 天府百官分數 +=2; if(天府屬性.架構.對星.魁鉞.三方斜飛式) 天府百官分數 +=1.5; if(天府屬性.架構.對星.魁鉞.四正斜飛式) 天府百官分數 +=1;
    if(天府屬性.架構.對星.昌曲.同宮) 天府百官分數 +=3; if(天府屬性.架構.對星.昌曲.對宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.昌曲.相夾) 天府百官分數 +=1.5; if(天府屬性.架構.對星.昌曲.相對) 天府百官分數 +=2; if(天府屬性.架構.對星.昌曲.三方蝴蝶式) 天府百官分數 +=2; if(天府屬性.架構.對星.昌曲.三方斜飛式) 天府百官分數 +=1.5; if(天府屬性.架構.對星.昌曲.四正斜飛式) 天府百官分數 +=1;
    if(天府屬性.架構.對星.祿馬.同宮) 天府百官分數 +=3; if(天府屬性.架構.對星.祿馬.對宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.祿馬.相夾) 天府百官分數 +=1.5; if(天府屬性.架構.對星.祿馬.相對) 天府百官分數 +=2; if(天府屬性.架構.對星.祿馬.三方蝴蝶式) 天府百官分數 +=2; if(天府屬性.架構.對星.祿馬.三方斜飛式) 天府百官分數 +=1.5; if(天府屬性.架構.對星.祿馬.四正斜飛式) 天府百官分數 +=1;
    if(天府屬性.架構.對星.三台八座.同宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.三台八座.對宮) 天府百官分數 +=0.75; if(天府屬性.架構.對星.三台八座.相夾) 天府百官分數 +=0.75; if(天府屬性.架構.對星.三台八座.相對) 天府百官分數 +=1; if(天府屬性.架構.對星.三台八座.三方蝴蝶式) 天府百官分數 +=1; if(天府屬性.架構.對星.三台八座.三方斜飛式) 天府百官分數 +=0.75; if(天府屬性.架構.對星.三台八座.四正斜飛式) 天府百官分數 +=0.5;
    if(天府屬性.架構.對星.龍池鳳閣.同宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.龍池鳳閣.對宮) 天府百官分數 +=0.75; if(天府屬性.架構.對星.龍池鳳閣.相夾) 天府百官分數 +=0.75; if(天府屬性.架構.對星.龍池鳳閣.相對) 天府百官分數 +=1; if(天府屬性.架構.對星.龍池鳳閣.三方蝴蝶式) 天府百官分數 +=1; if(天府屬性.架構.對星.龍池鳳閣.三方斜飛式) 天府百官分數 +=0.75; if(天府屬性.架構.對星.龍池鳳閣.四正斜飛式) 天府百官分數 +=0.5;
    if(天府屬性.架構.對星.恩光天貴.同宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.恩光天貴.對宮) 天府百官分數 +=0.75; if(天府屬性.架構.對星.恩光天貴.相夾) 天府百官分數 +=0.75; if(天府屬性.架構.對星.恩光天貴.相對) 天府百官分數 +=1; if(天府屬性.架構.對星.恩光天貴.三方蝴蝶式) 天府百官分數 +=1; if(天府屬性.架構.對星.恩光天貴.三方斜飛式) 天府百官分數 +=0.75; if(天府屬性.架構.對星.恩光天貴.四正斜飛式) 天府百官分數 +=0.5;
    if(天府屬性.架構.對星.台輔封誥.同宮) 天府百官分數 +=1.5; if(天府屬性.架構.對星.台輔封誥.對宮) 天府百官分數 +=0.75; if(天府屬性.架構.對星.台輔封誥.相夾) 天府百官分數 +=0.75; if(天府屬性.架構.對星.台輔封誥.相對) 天府百官分數 +=1; if(天府屬性.架構.對星.台輔封誥.三方蝴蝶式) 天府百官分數 +=1; if(天府屬性.架構.對星.台輔封誥.三方斜飛式) 天府百官分數 +=0.75; if(天府屬性.架構.對星.台輔封誥.四正斜飛式) 天府百官分數 +=0.5;
    
    命盤.星曜.天府.對星 = 天府屬性.對星;
    命盤.星曜.天府.互涉星曜 = 天府屬性.互涉星曜;
    命盤.星曜.天府.架構 = 天府屬性.架構;
    
    命盤.星曜.天府.百官朝拱 = 天府百官分數 > 命盤.定義.百官參數;
    
    
    命盤.星曜.天府.得祿 = ((天府屬性.架構.諸星群.祿曜.得祿 && !天府屬性.架構.諸星群.空曜.空曜重) || 命盤.星曜.天相.財蔭夹印); 
    命盤.星曜.天府.雙祿 = 天府屬性.架構.諸星群.祿曜.雙祿;
    命盤.星曜.天府.空庫 = !命盤.星曜.天府.得祿;
    
    if(天府屬性.架構.諸星群.空曜.空曜重) 命盤.星曜.天府.空庫 = true;
    命盤.星曜.天府.露庫 = (天府屬性.架構.諸星群.煞曜.煞重 || 命盤.星曜.天相.刑忌夹印 || 天相屬性.架構.諸星群.煞曜.煞重);
    
    if(命盤.星曜.天府.百官朝拱) 命盤.地支宮位[天府屬性.地支數].星曜架構.格局.push("*天府百官朝拱");
    
    if(命盤.星曜.天府.得祿) {
        if(命盤.星曜.天府.雙祿) 命盤.地支宮位[天府屬性.地支數].星曜架構.格局.push("*天府雙祿"); 
        if(!命盤.星曜.天府.雙祿 && !命盤.格局.府相得祿) 命盤.地支宮位[天府屬性.地支數].星曜架構.格局.push("*天府得祿");  //如果已經符合府相得祿，不再顯示天府得祿
    }  // end 天府.得祿
    
    // ----- 天府空庫、露庫 ----
    if(命盤.星曜.天府.空庫) 命盤.地支宮位[天府屬性.地支數].星曜架構.格局.push("*天府空庫");
    if(命盤.星曜.天府.露庫) 命盤.地支宮位[天府屬性.地支數].星曜架構.格局.push("*天府露庫");
    
    
    // ----- 天府朝垣 -----
    if(天府屬性.地支=="戌" && 命盤.星曜.天府.得祿) {
        命盤.格局.天府朝垣.成立 = true;
        命盤.格局.天府朝垣.地支1 = 天府屬性.地支數;
        命盤.格局.天府朝垣.宮位1 = 命盤.地支宮位[命盤.格局.天府朝垣.地支1].宮位;
        //命盤.格局.天府朝垣.古訣 = "古歌云：「乾為君象府為臣，得地來朝福自新。輔弼忠臣身報國，腰金衣紫拜重瞳」。";
        //命盤.格局.天府朝垣.註解參考 = "「天府朝垣」只能成為「輔弼」，所謂「腰金衣紫」，無非只是屬于大臣的榮譽，究竟不是領袖人材。根據現代社會結構，廉貞天府在戌宮同守的人，只是一位很好的理財人材。<br><br>若甲年生人，廉貞化祿，祿存又居于寅宮相會，則其人亦能創業致富，但卻缺少開創力，只能在守成中發展，不擅長開創。若天馬在寅宮，則其人利于外埠經商。";
        
        if(命盤.生年天干 == "甲") 命盤.格局.天府朝垣.形態 = 1;
    
        命盤.地支宮位[命盤.格局.天府朝垣.地支1].星曜架構.格局.push("天府朝垣");
    } // end if 天府朝垣
    
    
    // ----- 府相朝垣 -----
    if(天府屬性.地支=="申" || 天府屬性.地支=="寅" || 天府屬性.地支=="戌" || 天府屬性.地支=="辰") {
        var 府相朝垣地支數; var 府相朝垣宮位吉化 = false;
        
        if(天府屬性.地支=="戌") 府相朝垣地支數 = 7; //午
        if(天府屬性.地支=="辰") 府相朝垣地支數 = 1; //子
        if(天府屬性.地支=="寅") 府相朝垣地支數 = 11; //戌
        if(天府屬性.地支=="申") 府相朝垣地支數 = 5; //辰
        
        if(!命盤.格局.刑忌夾印.成立 && 命盤.星曜.天府.得祿 && !命盤.地支宮位[府相朝垣地支數].星曜架構.諸星群.煞曜.煞重) {
            命盤.格局.府相朝垣.成立 = true;
            命盤.格局.府相朝垣.地支1 = 府相朝垣地支數;
            命盤.格局.府相朝垣.宮位1 = 命盤.地支宮位[命盤.格局.府相朝垣.地支1].宮位;
            //命盤.格局.府相朝垣.古訣 = "古歌云：「命宮府相得俱逢，無煞身當待圣君。富貴雙全人景仰，巍巍德業滿乾坤」。經云：「府相朝垣格最良，出仕為官大吉昌」。經注：「天府、天相乃為衣祿之神，入仕為官，定主亨通之兆」。經云：「府相同來會命宮，全家食祿」。經云：「府相之星女命躔，必當子貴與夫賢」。";
            //命盤.格局.府相朝垣.註解參考 = "「府相朝垣」最佳的結構是天相居子，天府居申；天相居午，天府居寅；天相居申，天府居辰；天府居戌，天相居寅。";

            命盤.地支宮位[命盤.格局.府相朝垣.地支1].星曜架構.格局.push("府相朝垣");
        } //end if 府相朝垣成立
    } // end if 府相朝垣
    
    
    // ****************************************************
    // ********************** 紫微 ************************
    // ****************************************************
    
    // ------------ 百官朝拱、 無道之君、在野孤君 ------------
    命盤.星曜.紫微.百官星 = 三方四正諸星群判斷(紫微屬性.互涉星曜, 命盤.定義.百官).星曜;
    
    

    if(紫微屬性.架構.對星.輔弼.同宮) 紫微百官分數 +=3; if(紫微屬性.架構.對星.輔弼.對宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.輔弼.相夾) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.輔弼.相對) 紫微百官分數 +=2; if(紫微屬性.架構.對星.輔弼.三方蝴蝶式) 紫微百官分數 +=2; if(紫微屬性.架構.對星.輔弼.三方斜飛式) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.輔弼.四正斜飛式) 紫微百官分數 +=1;
    if(紫微屬性.架構.對星.魁鉞.同宮) 紫微百官分數 +=3; if(紫微屬性.架構.對星.魁鉞.對宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.魁鉞.相夾) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.魁鉞.相對) 紫微百官分數 +=2; if(紫微屬性.架構.對星.魁鉞.三方蝴蝶式) 紫微百官分數 +=2; if(紫微屬性.架構.對星.魁鉞.三方斜飛式) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.魁鉞.四正斜飛式) 紫微百官分數 +=1;
    if(紫微屬性.架構.對星.昌曲.同宮) 紫微百官分數 +=3; if(紫微屬性.架構.對星.昌曲.對宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.昌曲.相夾) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.昌曲.相對) 紫微百官分數 +=2; if(紫微屬性.架構.對星.昌曲.三方蝴蝶式) 紫微百官分數 +=2; if(紫微屬性.架構.對星.昌曲.三方斜飛式) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.昌曲.四正斜飛式) 紫微百官分數 +=1;
    if(紫微屬性.架構.對星.祿馬.同宮) 紫微百官分數 +=3; if(紫微屬性.架構.對星.祿馬.對宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.祿馬.相夾) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.祿馬.相對) 紫微百官分數 +=2; if(紫微屬性.架構.對星.祿馬.三方蝴蝶式) 紫微百官分數 +=2; if(紫微屬性.架構.對星.祿馬.三方斜飛式) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.祿馬.四正斜飛式) 紫微百官分數 +=1;
    if(紫微屬性.架構.對星.三台八座.同宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.三台八座.對宮) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.三台八座.相夾) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.三台八座.相對) 紫微百官分數 +=1; if(紫微屬性.架構.對星.三台八座.三方蝴蝶式) 紫微百官分數 +=1; if(紫微屬性.架構.對星.三台八座.三方斜飛式) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.三台八座.四正斜飛式) 紫微百官分數 +=0.5;
    if(紫微屬性.架構.對星.龍池鳳閣.同宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.龍池鳳閣.對宮) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.龍池鳳閣.相夾) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.龍池鳳閣.相對) 紫微百官分數 +=1; if(紫微屬性.架構.對星.龍池鳳閣.三方蝴蝶式) 紫微百官分數 +=1; if(紫微屬性.架構.對星.龍池鳳閣.三方斜飛式) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.龍池鳳閣.四正斜飛式) 紫微百官分數 +=0.5;
    if(紫微屬性.架構.對星.恩光天貴.同宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.恩光天貴.對宮) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.恩光天貴.相夾) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.恩光天貴.相對) 紫微百官分數 +=1; if(紫微屬性.架構.對星.恩光天貴.三方蝴蝶式) 紫微百官分數 +=1; if(紫微屬性.架構.對星.恩光天貴.三方斜飛式) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.恩光天貴.四正斜飛式) 紫微百官分數 +=0.5;
    if(紫微屬性.架構.對星.台輔封誥.同宮) 紫微百官分數 +=1.5; if(紫微屬性.架構.對星.台輔封誥.對宮) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.台輔封誥.相夾) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.台輔封誥.相對) 紫微百官分數 +=1; if(紫微屬性.架構.對星.台輔封誥.三方蝴蝶式) 紫微百官分數 +=1; if(紫微屬性.架構.對星.台輔封誥.三方斜飛式) 紫微百官分數 +=0.75; if(紫微屬性.架構.對星.台輔封誥.四正斜飛式) 紫微百官分數 +=0.5;
    
    //;
    命盤.星曜.紫微.在野孤君 = false;  // to be validated latter
    命盤.星曜.紫微.無道之君 = false;
    命盤.星曜.紫微.君臣慶會 = false;
    
    // ----- 百官朝拱1 -----
    var 紫微百官分數 = 命盤.星曜.紫微.百官星.length / 2;
    if(命盤.星曜.紫微.百官朝拱 = 紫微百官分數 > 命盤.定義.百官參數){
        命盤.格局.百官朝拱.成立 = true;
        命盤.格局.百官朝拱.形態 = 1;
        命盤.格局.百官朝拱.地支1 = 紫微屬性.地支數;
        命盤.格局.百官朝拱.宮位1 = 命盤.地支宮位[命盤.格局.百官朝拱.地支1].宮位;
        命盤.地支宮位[命盤.格局.百官朝拱.地支1].星曜架構.格局.push("*百官朝拱");
    }  // end if 百官朝拱1
    
    //console.log(紫微屬性);
    
    // ----- 百官朝拱2 -----
    if(星曜矩陣所含星曜(紫微屬性.互涉星曜, ["天相", "天府"], "&&") && (命盤.星曜.天相.財蔭夾印 && !命盤.星曜.天府.空庫)){
        命盤.格局.百官朝拱.成立 = true;
        命盤.格局.百官朝拱.形態 = 2;
        命盤.格局.百官朝拱.地支1 = 紫微屬性.地支數;
        命盤.格局.百官朝拱.宮位1 = 命盤.地支宮位[命盤.格局.百官朝拱.地支1].宮位;
        命盤.地支宮位[命盤.格局.百官朝拱.地支1].星曜架構.格局.push("*百官朝拱");
    }  // end if 百官朝拱2
    
    
    if(!命盤.星曜.紫微.百官朝拱) {
        if(紫微屬性.架構.諸星群.煞曜.煞重) {
            命盤.格局.無道之君.成立 = true;
            命盤.星曜.紫微.無道之君 = true;
            命盤.格局.無道之君.地支1 = 紫微屬性.地支數;
            命盤.格局.無道之君.宮位1 = 命盤.地支宮位[命盤.格局.無道之君.地支1].宮位;
            //命盤.格局.無道之君.古訣 = "《太微賦》：「帝遇凶徒，雖獲吉而無道」。";
            //命盤.格局.無道之君.註解參考 = "紫微不得百官，再逢惡曜則淪為無道之君，為人橫悖刁詐。";
            命盤.地支宮位[命盤.格局.無道之君.地支1].星曜架構.格局.push("*無道之君");
        }  // end if 無道之君
        
        if(紫微屬性.廟陷數<4 && 紫微屬性.四化!="化權" && 紫微屬性.四化!="化科") {
            命盤.格局.在野孤君.成立 = true;
            命盤.星曜.紫微.在野孤君 = true;
            命盤.格局.在野孤君.地支1 = 紫微屬性.地支數;
            命盤.格局.在野孤君.宮位1 = 命盤.地支宮位[命盤.格局.在野孤君.地支1].宮位;
            //命盤.格局.在野孤君.古訣 = "《全書》：「不入廟，無左右，為孤君，亦清閒僧道」。";
            //命盤.格局.在野孤君.註解參考 = "孤君指忠賢遠離，小人弄權的局面，因淪落失權，所以謀為費力。倘再見空曜，則容易淪為僧道。";
            if(!命盤.格局.無道之君.成立) 命盤.地支宮位[命盤.格局.在野孤君.地支1].星曜架構.格局.push("*在野孤君");  //如果已經是 無道之君，就不再顯示 在野孤君
        }  // end if 在野孤君
    } // end if 無百官
    
    
    // ------------ 化殺為權 ------------
    if(紫微屬性.地支=="巳" || 紫微屬性.地支=="亥") {
        命盤.格局.化殺為權.地支1 = 紫微屬性.地支數;
        命盤.格局.化殺為權.宮位1 = 命盤.地支宮位[命盤.格局.化殺為權.地支1].宮位;
        
        if(紫微屬性.架構.諸星群.祿曜.得祿 && !星曜矩陣所含星曜(紫微屬性.本宮星曜, 四煞曜, "||")) {  //但若見火鈴羊陀同度會照，則不成化殺之局。「紫微七殺同宮，會煞不貴，孤獨刑傷」。
            命盤.格局.化殺為權.形態 = 1;
            命盤.格局.化殺為權.成立 = true;
            //命盤.格局.化殺為權.註解參考 = "紫微七殺同度，得吉星會照，則七殺的剛勇便成為英雄有用武之地，化殺為權，主人有權勢。紫殺守命的人多個性倔強，不肯服輸。具開創的能力，可以白手興家，而且不畏困難，越戰越勇，越是困難，人生越是精彩。<br>提防順遂之時恃才傲物，逆境中怯弱不前。<br><br>需視昌曲的配搭審視個人的才華與能力。";
            //命盤.格局.化殺為權.古訣 = "《全書》：「紫微七殺化權，反作禎祥」。「紫微七殺加空亡，虛名受蔭」。「紫微巳亥旺地，與七殺同，丙戊生人財官格」。「紫微七殺與祿同，化殺為權逞英雄」。";
        }  // end if 得祿
        
        if(星曜矩陣所含星曜(紫微屬性.本宮星曜, 四煞曜, "||")) {
            命盤.格局.化殺為權.破格 = true;
            命盤.格局.化殺為權.形態 = -1;
            //命盤.格局.化殺為權.古訣 = "「紫微七殺同宮，會煞不貴，孤獨刑傷」。";
        }  // 破格
        
        if(紫微屬性.架構.對星.羊陀.相夾) {
            命盤.格局.化殺為權.破格 = true;
            命盤.格局.化殺為權.形態 = -2;
            //命盤.格局.化殺為權.註解參考 = "「紫微七殺」在巳亥宮，不喜為羊陀夾，主一得發展良機，即受人掣肘。";
        }  // 破格
        
        if (命盤.格局.化殺為權.形態 > 0) 命盤.地支宮位[命盤.格局.化殺為權.地支1].星曜架構.格局.push("化殺為權");
        if (命盤.格局.化殺為權.破格) 命盤.地支宮位[命盤.格局.化殺為權.地支1].星曜架構.格局.push("化殺為權[破格]");
    }  // end if 紫微七殺在巳亥，化殺為權
    
    
    // ------------ 紫府同宮 ------------
    if(紫微屬性.地支=="寅" || 紫微屬性.地支=="申") {
        命盤.格局.紫府同宮.成立 = true;
        命盤.格局.紫府同宮.地支1 = 紫微屬性.地支數;
        命盤.格局.紫府同宮.宮位1 = 命盤.地支宮位[命盤.格局.紫府同宮.地支1].宮位;
        
        if(命盤.星曜.紫微.百官朝拱 && 命盤.星曜.天府.得祿) {
            命盤.格局.紫府同宮.形態 = 2;
            //命盤.格局.紫府同宮.註解參考 = "紫府同宮最喜祿存同臨或在對宮。紫府守命，武曲守財，官祿宮為廉貞天相，且官祿宮的對宮為衝鋒陷陣的七殺，能守能攻，運籌帷幄，決胜千里。但嫌有力的星曜過於集中而使得其他宮垣的星曜變成無力，且紫微決斷而天府猶豫，反而容易形成相互牽制。";
            //命盤.格局.紫府同宮.古訣 = "《骨髓賦》：「紫府同宮，終生厚福」。";
        }  // end if 得百官，得祿
        
        if(命盤.星曜.紫微.百官朝拱 && !命盤.星曜.天府.得祿) {
            命盤.格局.紫府同宮.形態 = 1;
            //命盤.格局.紫府同宮.註解參考 = "紫府得百官，但不得祿，亦有相當的地位。比方場面上儼然一方领袖，出入也前呼後擁，但其人可能却是個空心老倌。或是一個在機構掛個虚銜，支點干薪，分點紅利的人物。";
            //命盤.格局.紫府同宮.古訣 = "《骨髓賦》：「紫府同宮，終生厚福」。";
        }  // end if 不得百官，得祿
        
        if(!命盤.星曜.紫微.百官朝拱 && !命盤.星曜.天府.得祿) {
            命盤.格局.紫府同宮.形態 = -1;
            命盤.格局.紫府同宮.破格 = true;
            //命盤.格局.紫府同宮.註解參考 = "紫府不得百官、不得祿、下格。";
            //命盤.格局.紫府同宮.古訣 = "";
        }  // end if 不得百官，得祿
        
        if(命盤.格局.紫府同宮.形態 >0) 命盤.地支宮位[命盤.格局.紫府同宮.地支1].星曜架構.格局.push("紫府同宮");
        if(命盤.格局.紫府同宮.破格) 命盤.地支宮位[命盤.格局.紫府同宮.地支1].星曜架構.格局.push("紫府同宮[破格]");
    }  // end if 紫府同宮
    
    
    // ------------ 極響離明 ------------
    if(紫微屬性.地支=="午") {
        命盤.格局.極響離明.成立 = true;
        命盤.格局.極響離明.地支1 = 紫微屬性.地支數;
        命盤.格局.極響離明.宮位1 = 命盤.地支宮位[命盤.格局.極響離明.地支1].宮位;
        
        if(紫微屬性.架構.諸星群.祿曜.得祿) {
            命盤.格局.極響離明.形態 = 1;
            //命盤.格局.極響離明.古訣 = "古書：「紫微居午無煞湊，位至公卿」。「如甲丁己生人，安命午宮，值之大格，主大貴。其餘亦主常貴。加煞不是」。「紫微居子午科權祿照最為奇」。";
            //命盤.格局.極響離明.註解參考 = "紫微在午，必得「府相朝垣」，不得百官亦不為「在野孤君」，若天府得祿，天相得權，則聲勢顯赫。以甲年生人最佳。";
        } // end if 得祿
        
        if(命盤.地支宮位[命盤.格局.極響離明.地支1].星曜架構.諸星群.煞曜.星曜.length >0) {  //星曜矩陣所含星曜(紫微屬性.本宮星曜, 四煞曜, "||")
            命盤.格局.極響離明.破格 = true;
            命盤.格局.極響離明.形態 = -1;  // 破格
            if(紫微屬性.架構.對星.空劫.三方四正) 命盤.格局.極響離明.形態 = -2;
            if(紫微屬性.架構.對星.空劫.相夾) 命盤.格局.極響離明.形態 = -2;
            //命盤.格局.極響離明.註解參考 = "此局不宜有煞星與紫微同度。若丙年生人，廉貞化忌，而擎羊與紫微同宮，視為破格。<br>若火鈴纏紫微，破格更甚；見空劫則宜哲學。";
        }  // end if 破格
        
        if(命盤.格局.極響離明.破格) 命盤.地支宮位[命盤.格局.極響離明.地支1].星曜架構.格局.push("極響離明[破格]");
        if(命盤.格局.極響離明.形態 > 0) 命盤.地支宮位[命盤.格局.極響離明.地支1].星曜架構.格局.push("極響離明");
    }  // end if 極響離明
    
    
    // ----- 君臣慶會 的3種情況 -----
    命盤.格局.君臣慶會.紫相昌曲 = false; 命盤.格局.君臣慶會.紫破辅弼夹 = false; 命盤.格局.君臣慶會.天府同梁夹 = false;
    if((紫微屬性.地支=="辰" || 紫微屬性.地支=="戌") && 紫微屬性.架構.對星.昌曲.三方四正) {
        命盤.格局.君臣慶會.成立 = true; 命盤.格局.君臣慶會.形態 = 1;
        命盤.星曜.紫微.君臣慶會 = true;
        命盤.格局.君臣慶會.地支1 = 紫微屬性.地支數;
        命盤.格局.君臣慶會.宮位1 = 命盤.地支宮位[命盤.格局.君臣慶會.地支1].宮位;
        命盤.格局.君臣慶會.紫相昌曲 = true;
        命盤.格局.君臣慶會.備註 = "紫微天相得昌曲";
        命盤.地支宮位[命盤.格局.君臣慶會.地支1].星曜架構.格局.push("君臣慶會");
    }  // end if 紫相昌曲
    
    if((紫微屬性.地支=="丑" || 紫微屬性.地支=="未") && 紫微屬性.架構.對星.輔弼.相夾) {
        命盤.格局.君臣慶會.成立 = true; 命盤.格局.君臣慶會.形態 = 2;
        命盤.星曜.紫微.君臣慶會 = true;
        命盤.格局.君臣慶會.地支1 = 紫微屬性.地支數;
        命盤.格局.君臣慶會.宮位1 = 命盤.地支宮位[命盤.格局.君臣慶會.地支1].宮位;
        命盤.格局.君臣慶會.紫破辅弼夹 = true;
        命盤.格局.君臣慶會.備註 = "紫微破軍得輔弼夾";
        命盤.地支宮位[命盤.格局.君臣慶會.地支1].星曜架構.格局.push("君臣慶會");
    }  // end if 紫破輔弼夾
    
    
    if(天府屬性.地支=="巳" || 天府屬性.地支=="亥") {
        命盤.格局.君臣慶會.成立 = true; 命盤.格局.君臣慶會.形態 = 3;
        命盤.格局.君臣慶會.地支1 = 天府屬性.地支數;
        命盤.格局.君臣慶會.宮位1 = 命盤.地支宮位[命盤.格局.君臣慶會.地支1].宮位;
        命盤.格局.君臣慶會.天府同梁夹 = true;
        命盤.格局.君臣慶會.備註 = "天府得天同、天梁相夾（機梁借宮）";
        命盤.地支宮位[命盤.格局.君臣慶會.地支1].星曜架構.格局.push("君臣慶會");
    }  // end if 天府得天同、天梁相夾
    
    if(命盤.格局.君臣慶會.成立) {
        //命盤.格局.君臣慶會.註解參考 = "《八喜樓抄本》：「假如紫微得府相、文昌、文曲；天府得天同、天梁協之；紫微得夾，為群臣慶會，逢之無不富貴。但有煞星與刑忌囚耗同，則謂之奴欺主，臣欺君，反為禍亂也」。";
        //命盤.格局.君臣慶會.古訣 = "《太微賦》：「群臣慶會，才善經邦」。";
        if(命盤.地支宮位[命盤.格局.君臣慶會.地支1].星曜架構.諸星群.煞曜.星曜.length >0) 命盤.格局.君臣慶會.破格 = true;
    }  // end if 君臣慶會.成立
        
    
    // ----- 君臣不義 -----
    if((紫微屬性.地支=="辰" || 紫微屬性.地支=="戌" || 紫微屬性.地支=="丑" || 紫微屬性.地支=="未") && 紫微屬性.架構.諸星群.祿曜.不見) {
        命盤.格局.君臣不義.成立 = true; 命盤.格局.君臣不義.形態 = 1;
        命盤.格局.君臣不義.地支1 = 紫微屬性.地支數;
        命盤.格局.君臣不義.宮位1 = 命盤.地支宮位[命盤.格局.君臣不義.地支1].宮位;
        //命盤.格局.君臣不義.古訣 = "《全書》：「紫微遇破軍於辰戌丑未四宮，主為臣不忠，為子不孝」。";
        //命盤.格局.君臣不義.註解參考 = "因紫微的主觀加上破軍叛逆，在不得祿的情況下會顯得愛憎分明，變容易與人反目成仇，亦易發揮叛逆性質。";
        //if(紫微屬性.地支=="辰" || 紫微屬性.地支=="戌") 命盤.格局.君臣不義.古訣 = "古訣：「紫微辰戌遇破軍，君臣不義，富而不貴有虛名」。";
        命盤.地支宮位[命盤.格局.君臣不義.地支1].星曜架構.格局.push("君臣不義");
    }  // end if 君臣不義
    

    // ----- 桃花犯主 -----
    if((紫微屬性.地支=="卯" || 紫微屬性.地支=="酉") && 紫微屬性.架構.諸星群.桃花.桃花重) {
        命盤.格局.桃花犯主.成立 = true; 命盤.格局.桃花犯主.形態 = 1;
        命盤.格局.桃花犯主.地支1 = 紫微屬性.地支數;
        命盤.格局.桃花犯主.宮位1 = 命盤.地支宮位[命盤.格局.桃花犯主.地支1].宮位;
        //命盤.格局.桃花犯主.古訣 = "《太微賦》：「桃花犯主為至淫」。";
        //命盤.格局.桃花犯主.註解參考 = "紫貪坐命宮、福德宮，乃至遷移宮，其人都有廣泛的交際才能，而且在命宮時具備語言天才，對學習方言外語容易上手。<br>倘如會上文曜如昌曲、天才、博士等，則有交際手腕，且帶酒詩才情，或是精通音律。但會帶自私成分，容易沉迷於酒色財氣。<br><br>紫貪會上吉曜如昌曲、魁鉞、輔弼、或遇上紀律之星如化忌、天刑、空曜等，就會偏向正道，可以成為有成就的藝術或文學家。<br>若遇上擎羊的破壞，會使貪狼的藝術性質趨於下流。";
        命盤.地支宮位[命盤.格局.桃花犯主.地支1].星曜架構.格局.push("桃花犯主");
    }  // end if 桃花犯主
    
    
     // ----- 卯位極居 -----
    if(紫微屬性.地支=="卯" && 命盤.生年天干 == "癸" && (_.contains(紫微屬性.架構.諸星群.空曜.星曜, "地空") || 紫微屬性.架構.諸星群.空曜.空曜重)) { // 貪狼化忌 + 地空
        命盤.格局.卯位極居.成立 = true; 命盤.格局.卯位極居.形態 = 1;
        命盤.格局.卯位極居.地支1 = 紫微屬性.地支數;
        命盤.格局.卯位極居.宮位1 = 命盤.地支宮位[命盤.格局.卯位極居.地支1].宮位;
        //命盤.格局.卯位極居.古訣 = "《太微賦》：「卯位極居，空門受蔭」。「紫曜遇空，必作談禪之客」。";
        //命盤.格局.卯位極居.註解參考 = "「卯位極居」是因為貪狼化忌再逢空曜後將紫貪的性質徹底改變所造成的。「卯位極居」主好哲學或藝術。更見煞曜，尤其是「火陀」或「羊鈴」，更主科名不利，懷才不遇。「卯位極居」之人容易在禪學上有所成就而得到名譽。";
        命盤.地支宮位[命盤.格局.卯位極居.地支1].星曜架構.格局.push("卯位極居");
    }  // end if 卯位極居
      

    // ****************************************************
    // ********************** 天機 ************************
    // ****************************************************
    
    // ----- 機巨同臨 -----
    if(天機屬性.地支=="卯" || 天機屬性.地支=="酉") {
        命盤.格局.機巨同臨.成立 = true;
        命盤.格局.機巨同臨.地支1 = 天機屬性.地支數;
        命盤.格局.機巨同臨.宮位1 = 命盤.地支宮位[命盤.格局.機巨同臨.地支1].宮位;

        if(天機屬性.地支=="卯" && (生年干 == "辛" || 生年干 == "乙" || 生年干 == "丙")) {
            if(生年干 == "辛") 命盤.格局.機巨同臨.形態 = 1; if(生年干 == "乙") 命盤.格局.機巨同臨.形態 = 2; if(生年干 == "丙") 命盤.格局.機巨同臨.形態 = 3;
            //命盤.格局.機巨同臨.古訣 = "《骨髓賦》：「巨機同宮，公卿之位」。注文云：「如辛乙年生人安命卯宮，二星守命更遇昌曲、左右，上格。如丙生人次之，丁生人亦平常，其餘宮分，不在此論」。<br>古訣云：「天機與巨門同宮卯酉，必退租而自興」。「巨機酉上化吉者，縱遇財官也不榮」。「巨門天機為破蕩」。古訣云：「巨門同一位，武職鎮邊疆，亦要權逢煞，方可立功名」，所指為「機巨同臨」的天機化權，見煞在三方而不在本宮。";
            //命盤.格局.機巨同臨.註解參考 = "「機巨同臨」以得祿為貴，但「機巨」的本質為破蕩，不喜見煞，尤不喜火鈴同纏，增加其破蕩的性質。天機主機變、靈動，但「機巨」卻因巨門的「暗」而削弱了它的分析力，只剩下靈動性得以發揮。<br>「機巨同臨」男命容易流為浮滑，而且有多學不實，見異思遷；女命則容易受誘惑，不持家道。「機巨」不宜再見桃花會合，會變成重視情慾，也帶有「巨門交人，始善終惡」的缺點。";
        }  // end if 機巨同臨 成立

        if(星曜矩陣所含星曜(天機屬性.本宮星曜, 四煞曜, "||")) {
            命盤.格局.機巨同臨.破格 = true;
            命盤.格局.機巨同臨.形態 = -1;
        }  // end if 破格
            
        if(命盤.格局.機巨同臨.形態 > 0) 命盤.地支宮位[命盤.格局.機巨同臨.地支1].星曜架構.格局.push("機巨同臨");
        if(命盤.格局.機巨同臨.破格) 命盤.地支宮位[命盤.格局.機巨同臨.地支1].星曜架構.格局.push("機巨同臨[破格]");
    }  // end if 機巨同臨
    
    
    // ----- 機梁加會 、善蔭朝綱格-----
    if(天機屬性.地支=="辰" || 天機屬性.地支=="戌") {
        命盤.格局.機梁加會.成立 = true;
        命盤.格局.機梁加會.地支1 = 天機屬性.地支數;
        命盤.格局.機梁加會.宮位1 = 命盤.地支宮位[命盤.格局.機梁加會.地支1].宮位;
        
        //命盤.格局.機梁加會.古訣 = "「機梁交會善談兵」。「天機更逢天梁，必有高藝隨身」。「天機與天梁左右昌曲交會，文為清顯，武為忠良」。「機梁同在辰戌守命，加吉曜，富貴慈祥，若遇羊陀空曜，偏宜僧道」。「天梁星同位，定作道和僧，女命若逢此，性巧比淫奔」。";
        //命盤.格局.機梁加會.註解參考 = "「天機天梁」是個性質容易改變的星系組合。見吉則文武富貴；見煞更主「高藝」；見煞、刑忌，更見空曜，則為僧道之命，亦指六親緣薄。<br><br>辰戌二宮為「天羅地網」，天機的靈動受制，發揮不出它的分析力，只會擅長思考，工程師或講師的命局。<br>天梁的性質也會影響它的性質，變得比較沉默寡言，品性清高。<br><br>如果天機力量強，便是高隨身之命。若天梁的力量強，逢吉曜，富貴慈祥；逢刑忌，天機的力量完全受制，天梁的力量發揮得徹底，其人就會偏於玄想，喜歡思索哲學問題，古人稱之會遁入空門，現代可能就會偏向於哲學宗教。<br>若流為工匠，也比善於鑽研技術，但卻不肯真心傳授，反而容易招怨。<br><br>「天機天梁」最不宜見煞，否則處事會變成一塌糊塗，而且心靈空虛，沒有寄託。";
        
        if(天機屬性.架構.對星.昌曲.三方四正 || 天機屬性.架構.對星.輔弼.三方四正) 命盤.格局.機梁加會.形態 = 1;

        if(命盤.格局.機梁加會.形態 !=1 && 天機屬性.架構.諸星群.煞曜.煞重) 命盤.格局.機梁加會.形態 = 2;
        
        if(命盤.格局.機梁加會.形態 ==2 && 天機屬性.架構.諸星群.空曜.空曜重) 命盤.格局.機梁加會.形態 = 3;
        
        命盤.地支宮位[命盤.格局.機梁加會.地支1].星曜架構.格局.push("機梁加會");
    }  // end if 機梁加會    
    
    
    // ----- 機月同梁 -----
    if(天機屬性.地支=="寅" || 天機屬性.地支=="申" || 天梁屬性.地支=="寅" || 天梁屬性.地支=="申") {
        命盤.格局.機月同梁.成立 = true;
        if(天機屬性.地支=="寅" || 天機屬性.地支=="申") {
            命盤.格局.機月同梁.形態 = 1;
            命盤.格局.機月同梁.地支1 = 天機屬性.地支數;
        } // end 機陰
        
        if(天梁屬性.地支=="寅" || 天梁屬性.地支=="申") {
            命盤.格局.機月同梁.形態 = 2;
            命盤.格局.機月同梁.地支1 = 天梁屬性.地支數;
        } // end 同梁
        
        命盤.格局.機月同梁.宮位1 = 命盤.地支宮位[命盤.格局.機月同梁.地支1].宮位;
        //命盤.格局.機月同梁.古訣 = "「機月同梁作吏人」。「天機太陰同居寅申，難免跋涉他鄉」。「寅申四曜命加臨，宗祖根源定有成，刀筆之中宜桌立，榮華發旺在公門」。";
        //命盤.格局.機月同梁.註解參考 = "「天機太陰」的性質浮動，也代表有機變的能力，又主感情不專一。「機月同梁」主其人有心機，又貪財；好挑剔，又討厭踏實工作，因此有吏人的風範。喜歡在職權之內弄權，挑剔別人的錯誤，卻又懶於承擔責任的個性。然而「機月同梁」遇吉，亦不是庸碌之輩。";

        命盤.地支宮位[命盤.格局.機月同梁.地支1].星曜架構.格局.push("機月同梁");
    }  // end if 機月同梁    
    


    // ****************************************************
    // ********************** 日月 ************************
    // ****************************************************

    // ----- 日月夾命 -----
    if(命盤.地支宮位[2].星曜架構.對星.太陽太陰.相夾) {
        命盤.格局.日月夾命.成立 = true;
        命盤.格局.日月夾命.地支1 = 2;
        命盤.格局.日月夾命.宮位1 = 命盤.地支宮位[命盤.格局.日月夾命.地支1].宮位;        
    }  // end if 日月夾命 丑
        
    if(命盤.地支宮位[8].星曜架構.對星.太陽太陰.相夾) {
        命盤.格局.日月夾命.成立 = true;
        命盤.格局.日月夾命.地支1 = 8;
        命盤.格局.日月夾命.宮位1 = 命盤.地支宮位[命盤.格局.日月夾命.地支1].宮位;        
    }  // end if 日月夾命 未
    
    if(命盤.格局.日月夾命.成立){
        //命盤.格局.日月夾命.古訣 = "";
        //命盤.格局.日月夾命.註解參考 = "";
        
        if(命盤.地支宮位[命盤.格局.日月夾命.地支1].星曜架構.諸星群.吉曜.吉化 && !命盤.地支宮位[命盤.格局.日月夾命.地支1].星曜架構.諸星群.煞曜.煞重) 命盤.格局.日月夾命.形態 = 1;
        
        if(星曜矩陣所含星曜(命盤.地支宮位[命盤.格局.日月夾命.地支1].星曜本宮借宮.所有 , ["擎羊", "陀羅"], "&&")) { 命盤.格局.日月夾命.形態 = -1; 命盤.格局.日月夾命.破格 = true; }
        if(星曜矩陣所含星曜(命盤.地支宮位[命盤.格局.日月夾命.地支1].星曜本宮借宮.所有 , ["地空", "地劫"], "&&")) { 命盤.格局.日月夾命.形態 = -2; 命盤.格局.日月夾命.破格 = true; }
        if(命盤.地支宮位[命盤.格局.日月夾命.地支1].星曜架構.諸星群.煞曜.煞重) { 命盤.格局.日月夾命.形態 = -3; 命盤.格局.日月夾命.破格 = true; }
        if(太陽屬性.四化 == "化忌" || 太陰屬性.四化 == "化忌") { 命盤.格局.日月夾命.形態 = -4; 命盤.格局.日月夾命.破格 = true; }
        
        if(命盤.格局.日月夾命.形態 >= 0) 命盤.地支宮位[命盤.格局.日月夾命.地支1].星曜架構.格局.push("日月夾命");
        if(命盤.格局.日月夾命.破格) 命盤.地支宮位[命盤.格局.日月夾命.地支1].星曜架構.格局.push("日月夾命[破格]");
    } // end if 日月夾命.成立    
    
    
    // ----- 日月反背 -----
    if(太陽屬性.地支=="子" || 太陽屬性.地支=="戌" || 太陽屬性.地支=="亥") {
        命盤.格局.日月反背.成立 = true;
        命盤.格局.日月反背.地支1 = 太陽屬性.地支數;
        命盤.格局.日月反背.地支2 = 太陰屬性.地支數;
        命盤.格局.日月反背.宮位1 = 命盤.地支宮位[命盤.格局.日月反背.地支1].宮位;
        命盤.格局.日月反背.宮位2 = 命盤.地支宮位[命盤.格局.日月反背.地支2].宮位;
        
        if(太陽屬性.架構.諸星群.煞曜.煞重) { 命盤.格局.日月反背.煞重 = true; 命盤.格局.日月反背.形態 = 1; }
        if(太陽屬性.地支=="亥" && (!太陽屬性.架構.諸星群.煞曜.煞重 && 太陽屬性.架構.諸星群.吉曜.吉化 || (太陽屬性.四化 == "化祿" || 太陽屬性.四化 == "化權" || 太陽屬性.四化 == "化科") || 太陽屬性.架構.諸星群.四化.吉化)) { 命盤.格局.日月反背.太陽變格 = true; 命盤.格局.日月反背.形態 = -1; }
        if(太陰屬性.地支=="辰" && (!太陰屬性.架構.諸星群.煞曜.煞重 && 太陰屬性.架構.諸星群.吉曜.吉化 || (太陰屬性.四化 == "化祿" || 太陰屬性.四化 == "化權" || 太陰屬性.四化 == "化科") || 太陰屬性.架構.諸星群.四化.吉化)) { 命盤.格局.日月反背.太陰變格 = true; 命盤.格局.日月反背.形態 = -2; }
            
        //命盤.格局.日月反背.古訣 = "古訣：「日月最嫌反背，乃為失輝」。 註文：「太陽在申酉戌亥子，太陰在寅卯辰巳午，則日月無輝」。";
        //命盤.格局.日月反背.註解參考 = "「日月反背」見煞，基本的反應是刑剋六親。夜生人太陽坐命者不利父；晝生人太陰坐命者不利母，仍需看太陽與太陰與什麼星曜同躔而定。若晝生人太陽坐命，失輝，見煞，且太陰同時見煞，則可能是少年喪母之象；夜生人太陰坐命者，仿此。<br><br>日反背者已惹官非口舌；月反背者易惹盜竊陰謀，加羊陀尤甚。";
        
        if(命盤.格局.日月反背.形態 >=0) 命盤.地支宮位[命盤.格局.日月反背.地支1].星曜架構.格局.push("日月反背");
        if(命盤.格局.日月反背.形態 >=0) 命盤.地支宮位[命盤.格局.日月反背.地支2].星曜架構.格局.push("日月反背");
        
        if(命盤.格局.日月反背.太陽變格) 命盤.地支宮位[命盤.格局.日月反背.地支1].星曜架構.格局.push("日月反背[變格]");
        if(命盤.格局.日月反背.太陰變格) 命盤.地支宮位[命盤.格局.日月反背.地支2].星曜架構.格局.push("日月反背[變格]");
    } // end if 太陽 在 子、戌、亥
    
    
    // ----- 日月並明 -----
    if(太陽屬性.地支==太陰屬性.地支 && (命盤.生年天干 == "丁" || 命盤.生年天干 == "戊")) {  // 只能在丑未成立
        命盤.格局.日月並明.成立 = true;
        命盤.格局.日月並明.地支1 = 太陽屬性.地支數;
        命盤.格局.日月並明.宮位1 = 命盤.地支宮位[命盤.格局.日月並明.地支1].宮位;
        
        if(命盤.生年天干 == "戊") 命盤.格局.日月並明.形態 = 1;
        //命盤.格局.日月並明.古訣 = "";
        //命盤.格局.日月並明.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.日月並明.地支1].星曜架構.格局.push("日月並明");
    } // end if 日月並明
    
    
    // ----- 明珠出海 -----
    if(太陽屬性.地支=="卯") {
        命盤.格局.明珠出海.成立 = true;
        命盤.格局.明珠出海.地支1 = 8;  // 未宮
        命盤.格局.明珠出海.宮位1 = 命盤.地支宮位[命盤.格局.明珠出海.地支1].宮位;
        
        if(命盤.生年天干 == "癸") 命盤.格局.明珠出海.形態 = 1; // 最佳
        if(命盤.生年天干 == "甲") { 命盤.格局.明珠出海.破格 = true; 命盤.格局.明珠出海.形態 = -1; } // 太陽化忌
        if(命盤.生年天干 == "乙") { 命盤.格局.明珠出海.破格 = true; 命盤.格局.明珠出海.形態 = -2; } // 太陰化忌
        if(命盤.生年天干 == "丁") { 命盤.格局.明珠出海.破格 = true; 命盤.格局.明珠出海.形態 = -3; } // 巨門化忌
        if(命盤.地支宮位[命盤.格局.明珠出海.地支1].星曜架構.諸星群.煞曜.煞重) { 命盤.格局.明珠出海.破格 = true; 命盤.格局.明珠出海.形態 = -4; }
        
        //命盤.格局.明珠出海.古訣 = "《骨髓賦》：「三合明珠生旺地，穩步蟾宮」。注文云：「未宮安命，日卯月亥來朝，為明珠出海，定主財官雙美」。";
        //命盤.格局.明珠出海.註解參考 = "「明珠出海」未宮無正曜，借對宮天同巨門，推斷時仍須視天同巨門是否遇煞忌，縱不化忌，亦易招惹妒忌，遭人耍手段，弄陰謀，遇煞更甚。<br><br>「明珠出海」最不喜有空劫、煞忌星沖破，否則命主的富貴程度便會大大降低。例如在戊年出生時，因為夫妻宮中有天機星化忌，命主雖然事業有成，但在感情方面會有不順；乙年出生的人，因為官祿宮中有太陰化忌，也容易在婚姻、事業方面遇到許多阻力。不過丁年出生的人，雖然遷移宮中有巨門星化忌，影響卻不是太大，命主會有不錯的事業運，婚姻感情也很好。只是特別容易招小人，事業上越成功的人，越容易有小人從中作梗。";
        
        if(命盤.格局.明珠出海.破格) 命盤.地支宮位[命盤.格局.明珠出海.地支1].星曜架構.格局.push("明珠出海[破格]");
        if(命盤.格局.明珠出海.形態 >=0) 命盤.地支宮位[命盤.格局.明珠出海.地支1].星曜架構.格局.push("明珠出海");
    } // end if 明珠出海
    
        
    // ----- 陰陽左右 -----
    if((_.contains(太陽屬性.本宮星曜, "左輔") && _.contains(太陰屬性.本宮星曜, "右弼")) || (_.contains(太陽屬性.本宮星曜, "右弼") && _.contains(太陰屬性.本宮星曜, "左輔"))) {
        命盤.格局.陰陽左右.成立 = true;
        if(_.contains(太陽屬性.本宮星曜, "左輔") && _.contains(太陰屬性.本宮星曜, "右弼")) 命盤.格局.陰陽左右.形態 = 1;
        if(_.contains(太陽屬性.本宮星曜, "右弼") && _.contains(太陰屬性.本宮星曜, "左輔")) 命盤.格局.陰陽左右.形態 = 2;
        
        命盤.格局.陰陽左右.地支1 = 太陽屬性.地支數;
        命盤.格局.陰陽左右.地支2 = 太陰屬性.地支數;
        命盤.格局.陰陽左右.宮位1 = 命盤.地支宮位[命盤.格局.陰陽左右.地支1].宮位;
        命盤.格局.陰陽左右.宮位2 = 命盤.地支宮位[命盤.格局.陰陽左右.地支2].宮位;
        
        命盤.格局.陰陽左右.古訣 = "";
        命盤.格局.陰陽左右.註解參考 = "";
        
        //命盤.地支宮位[命盤.格局.陰陽左右.地支1].星曜架構.格局.push("陰陽左右");
        //命盤.地支宮位[命盤.格局.陰陽左右.地支2].星曜架構.格局.push("陰陽左右");
    } // end if 陰陽左右
    
    
    // ----- 丹墀桂墀 -----
    if((太陽屬性.地支=="卯" || 太陽屬性.地支=="辰" || 太陽屬性.地支=="巳") && (太陽屬性.架構.對星.昌曲.三方四正 || 太陽屬性.架構.對星.魁鉞.三方四正)) {
        命盤.格局.丹墀桂墀.成立 = true;
        命盤.格局.丹墀桂墀.地支1 = 太陽屬性.地支數;
        命盤.格局.丹墀桂墀.宮位1 = 命盤.地支宮位[命盤.格局.丹墀桂墀.地支1].宮位;
        
        //命盤.格局.丹墀桂墀.古訣 = "《骨髓賦》：「丹墀桂墀，早逐青雲之志」。注文云：「丹墀謂日居卯辰巳；桂墀謂月居酉戌亥。此六宮身命值之是也。亦宜見昌曲魁鉞」。";
        //命盤.格局.丹墀桂墀.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.丹墀桂墀.地支1].星曜架構.格局.push("丹墀桂墀");
    }  // end if 丹墀
    
    
    if((太陰屬性.地支=="酉" || 太陰屬性.地支=="戌" || 太陰屬性.地支=="亥") && (太陰屬性.架構.對星.昌曲.三方四正 || 太陰屬性.架構.對星.魁鉞.三方四正)) {
        命盤.格局.丹墀桂墀.成立 = true;
        命盤.格局.丹墀桂墀.地支1 = 太陰屬性.地支數;
        命盤.格局.丹墀桂墀.宮位1 = 命盤.地支宮位[命盤.格局.丹墀桂墀.地支1].宮位;
        
        //命盤.格局.丹墀桂墀.古訣 = "《骨髓賦》：「丹墀桂墀，早逐青雲之志」。注文云：「丹墀謂日居卯辰巳；桂墀謂月居酉戌亥。此六宮身命值之是也。亦宜見昌曲魁鉞」。";
        //命盤.格局.丹墀桂墀.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.丹墀桂墀.地支1].星曜架構.格局.push("丹墀桂墀");
    }  // end if 桂墀
    
    
    
    // ****************************************************
    // ********************** 太陽 ************************
    // ****************************************************
    
    // ------------ 百官朝拱、 無道之君、在野孤君 ------------
    命盤.星曜.太陽.百官星 = 三方四正諸星群判斷(太陽屬性.互涉星曜, 命盤.定義.百官).星曜;
    
    var 太陽百官分數 = 命盤.星曜.太陽.百官星.length / 2;

    if(太陽屬性.架構.對星.輔弼.同宮) 太陽百官分數 +=3; if(太陽屬性.架構.對星.輔弼.對宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.輔弼.相夾) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.輔弼.相對) 太陽百官分數 +=2; if(太陽屬性.架構.對星.輔弼.三方蝴蝶式) 太陽百官分數 +=2; if(太陽屬性.架構.對星.輔弼.三方斜飛式) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.輔弼.四正斜飛式) 太陽百官分數 +=1;
    if(太陽屬性.架構.對星.魁鉞.同宮) 太陽百官分數 +=3; if(太陽屬性.架構.對星.魁鉞.對宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.魁鉞.相夾) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.魁鉞.相對) 太陽百官分數 +=2; if(太陽屬性.架構.對星.魁鉞.三方蝴蝶式) 太陽百官分數 +=2; if(太陽屬性.架構.對星.魁鉞.三方斜飛式) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.魁鉞.四正斜飛式) 太陽百官分數 +=1;
    if(太陽屬性.架構.對星.昌曲.同宮) 太陽百官分數 +=3; if(太陽屬性.架構.對星.昌曲.對宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.昌曲.相夾) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.昌曲.相對) 太陽百官分數 +=2; if(太陽屬性.架構.對星.昌曲.三方蝴蝶式) 太陽百官分數 +=2; if(太陽屬性.架構.對星.昌曲.三方斜飛式) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.昌曲.四正斜飛式) 太陽百官分數 +=1;
    if(太陽屬性.架構.對星.祿馬.同宮) 太陽百官分數 +=3; if(太陽屬性.架構.對星.祿馬.對宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.祿馬.相夾) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.祿馬.相對) 太陽百官分數 +=2; if(太陽屬性.架構.對星.祿馬.三方蝴蝶式) 太陽百官分數 +=2; if(太陽屬性.架構.對星.祿馬.三方斜飛式) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.祿馬.四正斜飛式) 太陽百官分數 +=1;
    if(太陽屬性.架構.對星.三台八座.同宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.三台八座.對宮) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.三台八座.相夾) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.三台八座.相對) 太陽百官分數 +=1; if(太陽屬性.架構.對星.三台八座.三方蝴蝶式) 太陽百官分數 +=1; if(太陽屬性.架構.對星.三台八座.三方斜飛式) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.三台八座.四正斜飛式) 太陽百官分數 +=0.5;
    if(太陽屬性.架構.對星.龍池鳳閣.同宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.龍池鳳閣.對宮) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.龍池鳳閣.相夾) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.龍池鳳閣.相對) 太陽百官分數 +=1; if(太陽屬性.架構.對星.龍池鳳閣.三方蝴蝶式) 太陽百官分數 +=1; if(太陽屬性.架構.對星.龍池鳳閣.三方斜飛式) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.龍池鳳閣.四正斜飛式) 太陽百官分數 +=0.5;
    if(太陽屬性.架構.對星.恩光天貴.同宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.恩光天貴.對宮) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.恩光天貴.相夾) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.恩光天貴.相對) 太陽百官分數 +=1; if(太陽屬性.架構.對星.恩光天貴.三方蝴蝶式) 太陽百官分數 +=1; if(太陽屬性.架構.對星.恩光天貴.三方斜飛式) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.恩光天貴.四正斜飛式) 太陽百官分數 +=0.5;
    if(太陽屬性.架構.對星.台輔封誥.同宮) 太陽百官分數 +=1.5; if(太陽屬性.架構.對星.台輔封誥.對宮) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.台輔封誥.相夾) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.台輔封誥.相對) 太陽百官分數 +=1; if(太陽屬性.架構.對星.台輔封誥.三方蝴蝶式) 太陽百官分數 +=1; if(太陽屬性.架構.對星.台輔封誥.三方斜飛式) 太陽百官分數 +=0.75; if(太陽屬性.架構.對星.台輔封誥.四正斜飛式) 太陽百官分數 +=0.5;
    
    命盤.星曜.太陽.百官朝拱 = 太陽百官分數 > 命盤.定義.百官參數;
    
    // ----- 陽梁昌祿 、日照雷門 -----
    if(太陽屬性.地支=="卯") {
        var 格局名稱 = "";
        if(!太陽屬性.架構.對星.昌曲.不見 && !太陽屬性.架構.對星.雙祿.不見) {
            命盤.格局.陽梁昌祿.成立 = true;
            命盤.格局.陽梁昌祿.地支1 = 太陽屬性.地支數;
            命盤.格局.陽梁昌祿.宮位1 = 命盤.地支宮位[命盤.格局.陽梁昌祿.地支1].宮位;

            if(!太陽屬性.架構.對星.昌曲.三方四正 && 太陽屬性.架構.對星.昌曲.單見星 == "文昌") { 格局名稱 = "陽梁昌祿"; 命盤.格局.陽梁昌祿.形態 = 1; }
            if(!太陽屬性.架構.對星.昌曲.三方四正 && 太陽屬性.架構.對星.昌曲.單見星 == "文曲") { 格局名稱 = "陽梁曲祿"; 命盤.格局.陽梁昌祿.形態 = 2; }
            if(太陽屬性.架構.對星.昌曲.三方四正) { 格局名稱 = "陽梁昌曲祿"; 命盤.格局.陽梁昌祿.形態 = 3; }
            if(命盤.生年天干 == "丁") 命盤.格局.陽梁昌祿.形態 = 4;  //最喜太陰化祿，然而夫妻宮不美
            if(命盤.生年天干 == "甲") { 命盤.格局.陽梁昌祿.破格 = true; 命盤.格局.陽梁昌祿.形態 = -1; }  //最忌太陽化忌，多是非困擾
            if(命盤.生年天干 == "壬") { 命盤.格局.陽梁昌祿.破格 = true; 命盤.格局.陽梁昌祿.形態 = -2; }  //亦不喜天梁化祿，主清貴

            //命盤.格局.陽梁昌祿.古訣 = "古書：「陽梁昌祿，傳臚第一名」。「甲年生人，既不見祿，且太陽化忌，雖會吉曜亦不利，一生多是非困擾，未為佳境；壬年生人天梁化祿，主清貧」。";
            //命盤.格局.陽梁昌祿.註解參考 = "";

            if(命盤.格局.陽梁昌祿.形態 >= 0) 命盤.地支宮位[命盤.格局.陽梁昌祿.地支1].星曜架構.格局.push(格局名稱);
            if(命盤.格局.陽梁昌祿.破格) 命盤.地支宮位[命盤.格局.陽梁昌祿.地支1].星曜架構.格局.push(格局名稱 + "[破格]");
        }  // end if 見昌曲與祿， 陽梁昌祿
        
        if(!命盤.格局.陽梁昌祿.成立 && (太陽屬性.架構.諸星群.吉曜.吉化 || (太陽屬性.架構.對星.昌曲.三方四正 || 太陽屬性.架構.對星.魁鉞.三方四正 || 太陽屬性.架構.對星.輔弼.三方四正)) ) {
            命盤.格局.日照雷門.成立 = true;
            命盤.格局.日照雷門.地支1 = 太陽屬性.地支數;
            命盤.格局.日照雷門.宮位1 = 命盤.地支宮位[命盤.格局.日照雷門.地支1].宮位;
            
            if(命盤.生年天干 == "丁") 命盤.格局.日照雷門.形態 = 1;  //最喜太陰化祿，然而夫妻宮不美
            if(命盤.生年天干 == "甲") { 命盤.格局.日照雷門.破格 = true; 命盤.格局.日照雷門.形態 = -1; }  //最忌太陽化忌，多是非困擾
            if(命盤.生年天干 == "壬") { 命盤.格局.日照雷門.破格 = true; 命盤.格局.日照雷門.形態 = -2; }  //亦不喜天梁化祿，主清貴
            
            //命盤.格局.日照雷門.古訣 = "《骨髓賦》：「日照雷門，榮華富貴」。注文云：「卯宮安命，太陽坐守，更三方左右、昌曲、魁鉞守照，富貴不小。甲乙庚辛人合格，加刑忌四煞亦主溫飽」。補注：「甲年生人，既不見祿，且太陽化忌，雖會吉曜亦不利，一生多是非困擾，未為佳境；壬年生人天梁化祿，主清貧」。";
            //命盤.格局.日照雷門.註解參考 = "蓋以卯宮為太陽初升之地，旭日東昇，是故富貴。中州派觀點，不喜壬年生人，蓋天梁最不喜見祿，若再加四煞，則絕非美格。";

            if(命盤.格局.日照雷門.形態 >= 0) 命盤.地支宮位[命盤.格局.日照雷門.地支1].星曜架構.格局.push("日照雷門");
            if(命盤.格局.日照雷門.破格) 命盤.地支宮位[命盤.格局.日照雷門.地支1].星曜架構.格局.push("日照雷門[破格]");
            
        } // end if 日照雷門
        
    } // end if 陽梁昌祿 、日照雷門 
    
    
    // ----- 日麗中天 -----
    if(太陽屬性.地支=="午") {
        命盤.格局.日麗中天.成立 = true;
        命盤.格局.日麗中天.地支1 = 太陽屬性.地支數;
        命盤.格局.日麗中天.宮位1 = 命盤.地支宮位[命盤.格局.日麗中天.地支1].宮位;
        //命盤.格局.日麗中天.古訣 = "古書：「太陽居午，庚辛丁己人富貴雙全」。";
        //命盤.格局.日麗中天.註解參考 = "太陽在午，得百官，或得祿為是，又名「金燦光輝」。";
        
        if(!太陽屬性.架構.對星.雙祿.不見 && !太陽屬性.架構.諸星群.煞曜.煞重 && 命盤.星曜.太陽.四化!="化忌") 命盤.格局.日麗中天.形態 = 1; // 得祿、煞輕，太陽不化忌
        if(命盤.星曜.太陽.百官朝拱 && 命盤.星曜.太陽.四化!="化忌") 命盤.格局.日麗中天.形態 = 2; // 得百官，太陽不化忌
        if(太陽屬性.架構.諸星群.四化.吉化 && !太陽屬性.架構.諸星群.煞曜.煞重) 命盤.格局.日麗中天.形態 = 3; // 得四化吉化，煞輕
        
        if(命盤.星曜.太陽.四化=="化忌") {命盤.格局.日麗中天.破格 = true; 命盤.格局.日麗中天.形態 = -1; }
        if(太陽屬性.架構.對星.雙祿.不見 && 太陽屬性.架構.諸星群.煞曜.煞重) {命盤.格局.日麗中天.破格 = true; 命盤.格局.日麗中天.形態 = -2; }

        if(命盤.格局.日麗中天.形態 >= 0) 命盤.地支宮位[命盤.格局.日麗中天.地支1].星曜架構.格局.push("日麗中天");
        if(命盤.格局.日麗中天.破格) 命盤.地支宮位[命盤.格局.日麗中天.地支1].星曜架構.格局.push("日麗中天[破格]");
    } // end if 日麗中天
    
    
    // ****************************************************
    // ********************** 武曲 ************************
    // ****************************************************
    
    // ----- 武貪同行 -----
    if(武曲屬性.地支=="丑" || 武曲屬性.地支=="未") {
        命盤.格局.武貪同行.成立 = true;
        命盤.格局.武貪同行.地支1 = 武曲屬性.地支數;
        命盤.格局.武貪同行.宮位1 = 命盤.地支宮位[命盤.格局.武貪同行.地支1].宮位;
        //命盤.格局.武貪同行.古訣 = "古書：「武曲貪狼同丑未，少年不利，三十後而發福，先貧後福，慳吝之人」。「武曲貪狼加煞忌，技藝之人」。補注：【無煞曜，則為商人之命】。古歌云「武貪入廟貴堪言，必主為官掌大權，文作監司身顯達，武臣勇猛鎮邊疆」。";
        //命盤.格局.武貪同行.註解參考 = "「武貪同行」因武曲為財星，又為武職，見貪狼同度主富，又能增加武曲的聲勢，所以定為美格。「武貪」具有很深的物慾色彩，所以必須經過奮鬥，然後才能發福。若少年享受，則可能影響以後的事業發展。<br><br>「武貪」在命宮的人，也可能是出身富裕，但不能剋享父蔭；或少年時家境逆轉，然後靠自身努力創業興家。<br><br>「武貪同行」最喜見祿，戊年貪狼化祿；辛年見酉宮祿存會合，都能成為富格。<br>最喜貪狼會見火鈴，而火鈴在對宮為上格。如果武貪與火鈴同宮，丑宮的命比未宮好，因為丑宮對武曲比較有利，火鈴又不可能與擎羊同坐，否則兩煞星會自己抵消了自己的力量。";
        
        if(武曲屬性.架構.諸星群.煞曜.不見) 命盤.格局.武貪同行.形態 = 1;
        if(命盤.生年天干 == "戊" || 命盤.生年天干 == "辛") 命盤.格局.武貪同行.形態 = 2;  //「武貪同行」最喜見祿，戊年貪狼化祿；辛年見酉宮祿存會合，都能成為富格。
        if(_.contains(命盤.地支宮位[武曲屬性.對宮地支數].星曜本宮.所有, ["火星", "鈴星"]) && !_.contains(命盤.地支宮位[武曲屬性.地支數].星曜本宮.所有, ["火星", "鈴星"])) 命盤.格局.武貪同行.形態 = 3; // 最喜貪狼會見火鈴，而火鈴在對宮為上格
        if(_.contains(命盤.地支宮位[武曲屬性.地支數].星曜本宮.所有, ["火星", "鈴星"])) 命盤.格局.武貪同行.形態 = 4; // 武貪與火鈴同宮，丑宮的命比未宮好，因為丑宮對武曲比較有利
           
        命盤.地支宮位[命盤.格局.武貪同行.地支1].星曜架構.格局.push("武貪同行");
    } // end if 武貪同行
    
    
    // ----- 鈴昌陀武 -----
    if(星曜矩陣所含星曜(武曲屬性.互涉星曜, ["鈴星", "文昌", "陀羅"], "&&")) { 
        命盤.格局.鈴昌陀武.成立 = true;
        命盤.格局.鈴昌陀武.地支1 = 武曲屬性.地支數;
        命盤.格局.鈴昌陀武.宮位1 = 命盤.地支宮位[命盤.格局.鈴昌陀武.地支1].宮位;
        //命盤.格局.鈴昌陀武.古訣 = "古書：「鈴昌陀武，限至投河」。";
        //命盤.格局.鈴昌陀武.註解參考 = "基本性質可視為意外不幸，或遇上有重大挫折。原局成「鈴昌陀武」的結構，大限或流年見流昌，流陀沖起，又見忌星者，凶險非常，也需留意水厄。";
        
         if(武曲屬性.地支=="辰" || 武曲屬性.地支=="戌") 命盤.格局.鈴昌陀武.形態 = 1;  // 中州派的觀點，武曲需在辰戌
        命盤.地支宮位[命盤.格局.鈴昌陀武.地支1].星曜架構.格局.push("鈴昌陀武");
        
    } // end if 鈴昌陀武
    
    
    // ----- 將星得地 -----
    if((武曲屬性.地支=="辰" || 武曲屬性.地支=="戌") && 武曲屬性.吉化) {
        命盤.格局.將星得地.成立 = true;
        命盤.格局.將星得地.地支1 = 武曲屬性.地支數;
        命盤.格局.將星得地.宮位1 = 命盤.地支宮位[命盤.格局.將星得地.地支1].宮位;
        //命盤.格局.將星得地.古訣 = "經云：「武曲廟垣，威名赫奕。」，詩曰：「將星入廟實為祥，位正官高到處強。掠地攻城多妙籌，威風凜凜鎮邊疆」。古云：「武曲墓中居，三十才發福」。經云：「武曲入廟，與昌曲同宮，出將入相」。「武曲魁鉞居廟旺，財賦之官」。「武曲祿馬同宮，發財遠鄉」。";
        //命盤.格局.將星得地.註解參考 = "武曲廟旺守命，此格之人，威權服眾，智慧過人，意氣風發，見科權祿，屬富貴上格，能出人頭地。";
        
        命盤.地支宮位[命盤.格局.將星得地.地支1].星曜架構.格局.push("將星得地");
    } // end if 將星得地
    
    
    // ----- 殺陷震兌 -----
    if(武曲屬性.地支=="卯" || 武曲屬性.地支=="酉") {
        if(!武曲屬性.吉化 && 武曲屬性.架構.諸星群.煞曜.煞忌) {
            命盤.格局.殺陷震兌.成立 = true;
            命盤.格局.殺陷震兌.形態 =1;
            命盤.格局.殺陷震兌.地支1 = 武曲屬性.地支數;
            命盤.格局.殺陷震兌.宮位1 = 命盤.地支宮位[命盤.格局.殺陷震兌.地支1].宮位;
            //命盤.格局.殺陷震兌.古訣 = "";
            //命盤.格局.殺陷震兌.註解參考 = "武曲廟旺守命，此格之人，威權服眾，智慧過人，意氣風發，見科權祿，屬富貴上格，能出人頭地。";

            命盤.地支宮位[命盤.格局.殺陷震兌.地支1].星曜架構.格局.push("殺陷震兌");
        }
    } // end if 殺陷震兌
    
    
    // ****************************************************
    // ********************** 天同 ************************
    // ****************************************************
    
    // ----- 天同反背 -----
    if(天同屬性.地支=="戌" && 命盤.生年天干=="丁") {
        命盤.格局.天同反背.成立 = true;
        命盤.格局.天同反背.地支1 = 天同屬性.地支數;
        命盤.格局.天同反背.宮位1 = 命盤.地支宮位[命盤.格局.天同反背.地支1].宮位;
        //命盤.格局.天同反背.古訣 = "《骨髓賦》：「天同戌宮為反背，丁人化吉主大貴」。注文云：「蓋天同戌宮本陷，如遇丁生人，則午宮祿存，更得寅宮化祿拱沖，定主大貴」。";
        //命盤.格局.天同反背.註解參考 = "主歷經艱危，甚至六親刑剋，然後終成富貴。";
        
        命盤.地支宮位[命盤.格局.天同反背.地支1].星曜架構.格局.push("天同反背");
    } // end if 天同反背
    
    
    // ----- 馬頭帶劍 -----
    if(天同屬性.地支=="子" && 命盤.星曜.擎羊.地支=="午") {  // 擎羊獨守午宮，無正曜同度為「馬頭帶劍」的正格。
        命盤.格局.馬頭帶劍.成立 = true;
        命盤.格局.馬頭帶劍.地支1 = 命盤.星曜.擎羊.地支數;
        命盤.格局.馬頭帶劍.宮位1 = 命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].宮位;
        
        if(命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].吉化 && !命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].星曜架構.諸星群.煞重) 命盤.格局.馬頭帶劍.形態 =1;
        if(!命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].吉化 && 命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].星曜架構.諸星群.煞重) { 命盤.格局.馬頭帶劍.形態 = -1; 命盤.格局.馬頭帶劍.破格 = true; }
    } // end if 馬頭帶劍： 1
    
    if(貪狼屬性.地支=="午" && 命盤.星曜.擎羊.地支 == "午" && (命盤.生年天干=="戊" || 命盤.生年天干=="丙")) {  // 貪狼與擎羊在午宮守命，尤其是戊年生人，貪狼化祿；或丙年生人，天同於未宮化祿，與巳宮的祿存夾命亦為美格。
        命盤.格局.馬頭帶劍.成立 = true;
        命盤.格局.馬頭帶劍.地支1 = 命盤.星曜.擎羊.地支數;
        命盤.格局.馬頭帶劍.宮位1 = 命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].宮位;
        命盤.格局.馬頭帶劍.形態 = 2;
    } // end if 馬頭帶劍： 2

    if(天同屬性.地支=="午" && 命盤.星曜.擎羊.地支 == "午" && (命盤.生年天干=="戊" || 命盤.生年天干=="丙")) {  // 天同與擎羊在午宮守命，亦以丙戊年生人為合格。
        命盤.格局.馬頭帶劍.成立 = true;
        命盤.格局.馬頭帶劍.地支1 = 命盤.星曜.擎羊.地支數;
        命盤.格局.馬頭帶劍.宮位1 = 命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].宮位;
        命盤.格局.馬頭帶劍.形態 = 3;
    } // end if 馬頭帶劍： 3
    
    
    if(命盤.格局.馬頭帶劍.成立) {
        命盤.格局.馬頭帶劍.古訣 = "";
        命盤.格局.馬頭帶劍.註解參考 = "";
        if(!命盤.格局.馬頭帶劍.破格) 命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].星曜架構.格局.push("馬頭帶劍"); else 命盤.地支宮位[命盤.格局.馬頭帶劍.地支1].星曜架構.格局.push("馬頭帶劍[破格]");
    } // end if 馬頭帶劍 成立
    
    
    
    // ****************************************************
    // ********************** 廉貞 ************************
    // ****************************************************
    
    // ----- 廉貞清白 -----
    if((廉貞屬性.地支=="未" && 命盤.生年天干=="甲") || (廉貞屬性.地支=="申" && 命盤.生年天干=="癸") || (廉貞屬性.地支=="寅" && 命盤.生年天干=="己")) { //注文云：「此星未宮坐命，甲生人合格。申宮坐命，癸生人合格。寅宮坐命，己生人合格」。古歌云：「申未廉貞得地方，縱加七殺不為凶，聲名顯達風雲遠，二限優游富貴中」。
        命盤.格局.廉貞清白.成立 = true;
        命盤.格局.廉貞清白.地支1 = 廉貞屬性.地支數;
        命盤.格局.廉貞清白.宮位1 = 命盤.地支宮位[命盤.格局.廉貞清白.地支1].宮位;
        
        if(廉貞屬性.地支=="未" && 命盤.生年天干=="甲") 命盤.格局.廉貞清白.形態 =1;
        if(廉貞屬性.地支=="申" && 命盤.生年天干=="癸") 命盤.格局.廉貞清白.形態 =2;
        if(廉貞屬性.地支=="寅" && 命盤.生年天干=="己") 命盤.格局.廉貞清白.形態 =3;
        
        //命盤.格局.廉貞清白.古訣 = "《骨髓賦》：「廉貞清白能相守」。注文云：「此星未宮坐命，甲生人合格。申宮坐命，癸生人合格。寅宮坐命，己生人合格」。古歌云：「申未廉貞得地方，縱加七殺不為凶，聲名顯達風雲遠，二限優游富貴中」。";
        //命盤.格局.廉貞清白.註解參考 = "廉貞喜見七殺，因為廉貞的陰火可以鍛煉七殺的陰金，使金能成器。但廉貞與七殺同居與未宮時，固然有鍛煉的能力。若廉貞居於申垣，七殺居於午垣，亦有冶煉陶熔的能力，所以古人便認為屬美格矣。說「能相守」，因命宮、夫宮見祿，可說成與配偶能度過苦日子而後發家。然本格生人，必經艱險而後有成，在男命，廉貞於未申宮合格，也稱之為「雄宿朝垣」。<br><br>「廉貞清白」格得兼看夫妻宮。未宮廉貞化祿會天府，夫妻宮天相見府庫充盈，是以為佳；寅申二宮，則命宮、夫妻宮同時見祿，故以為美。<br>現代女命亦適應著先性質，為夫妻分開發展，終能成家業。";
        
        命盤.地支宮位[命盤.格局.廉貞清白.地支1].星曜架構.格局.push("廉貞清白");
    } // end 廉貞清白
    
    
    if((廉貞屬性.地支=="寅" && 廉貞屬性.地支=="申") && !廉貞屬性.架構.對星.昌曲.不見) {  //三方四正見昌曲
        命盤.格局.廉貞文武.成立 = true;
        命盤.格局.廉貞文武.地支1 = 廉貞屬性.地支數;
        命盤.格局.廉貞文武.宮位1 = 命盤.地支宮位[命盤.格局.廉貞文武.地支1].宮位;
        
        //命盤.格局.廉貞文武.古訣 = "古歌云：「命中文武喜朝垣，入廟平生福氣全，純粹能文高折桂，戰征武定鎮三邊」。";
        //命盤.格局.廉貞文武.註解參考 = "廉貞在寅或申宮守命，財帛宮必為紫微天相；事業宮必為天府武曲，倘再會照文昌文曲，可謂眾吉會集，而且文武星曜齊全，基本上可以說是一個良好的配搭。<br>但企業家卻一定不會是這樣的命造，因為廉貞一曜稍嫌華而不實，欠缺腳踏實地，開創局面的能力，因此「廉貞文武格」僅能看成是一個企業經理或校長之類的命。";
        
        命盤.地支宮位[命盤.格局.廉貞文武.地支1].星曜架構.格局.push("廉貞文武");
    }  // end if 廉貞文武
    
    
    if(廉貞屬性.地支=="巳" && 廉貞屬性.地支=="亥") {
        命盤.格局.殺拱廉貞.成立 = true;
        命盤.格局.殺拱廉貞.地支1 = 廉貞屬性.地支數;
        命盤.格局.殺拱廉貞.宮位1 = 命盤.地支宮位[命盤.格局.殺拱廉貞.地支1].宮位;
        
        //命盤.格局.殺拱廉貞.古訣 = "古歌云：「古歌云：「貞逢七殺實堪傷，十載淹留有災殃，運至經求多不遂，錢財勝似雪澆湯」。";
        //命盤.格局.殺拱廉貞.註解參考 = "古人認為廉貞貪狼為桃花，武曲七殺為刑傷，所以四顆星曜配合起來，便是破盡祖業，流離浪蕩之人。即大限逢之，雖不主其人的性格浪蕩，亦主十年破敗。";
        
        if(廉貞屬性.吉化 && !廉貞屬性.架構.諸星群.煞曜.煞重) 命盤.格局.殺拱廉貞.形態 = 1;
        if(!廉貞屬性.吉化 && 廉貞屬性.架構.諸星群.煞曜.煞重) { 命盤.格局.殺拱廉貞.形態 = -1; 命盤.格局.殺拱廉貞.破格 = true; }
        
        命盤.地支宮位[命盤.格局.殺拱廉貞.地支1].星曜架構.格局.push("殺拱廉貞");
    }  // end if 殺拱廉貞
    

    // ****************************************************
    // ********************** 太陰 ************************
    // ****************************************************
    
	// ------------ 百官朝拱、 無道之君、在野孤君 ------------
    命盤.星曜.太陰.百官星 = 三方四正諸星群判斷(太陰屬性.互涉星曜, 命盤.定義.百官).星曜;
    
    var 太陰百官分數 = 命盤.星曜.太陰.百官星.length / 2;

    if(太陰屬性.架構.對星.輔弼.同宮) 太陰百官分數 +=3; if(太陰屬性.架構.對星.輔弼.對宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.輔弼.相夾) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.輔弼.相對) 太陰百官分數 +=2; if(太陰屬性.架構.對星.輔弼.三方蝴蝶式) 太陰百官分數 +=2; if(太陰屬性.架構.對星.輔弼.三方斜飛式) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.輔弼.四正斜飛式) 太陰百官分數 +=1;
    if(太陰屬性.架構.對星.魁鉞.同宮) 太陰百官分數 +=3; if(太陰屬性.架構.對星.魁鉞.對宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.魁鉞.相夾) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.魁鉞.相對) 太陰百官分數 +=2; if(太陰屬性.架構.對星.魁鉞.三方蝴蝶式) 太陰百官分數 +=2; if(太陰屬性.架構.對星.魁鉞.三方斜飛式) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.魁鉞.四正斜飛式) 太陰百官分數 +=1;
    if(太陰屬性.架構.對星.昌曲.同宮) 太陰百官分數 +=3; if(太陰屬性.架構.對星.昌曲.對宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.昌曲.相夾) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.昌曲.相對) 太陰百官分數 +=2; if(太陰屬性.架構.對星.昌曲.三方蝴蝶式) 太陰百官分數 +=2; if(太陰屬性.架構.對星.昌曲.三方斜飛式) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.昌曲.四正斜飛式) 太陰百官分數 +=1;
    if(太陰屬性.架構.對星.祿馬.同宮) 太陰百官分數 +=3; if(太陰屬性.架構.對星.祿馬.對宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.祿馬.相夾) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.祿馬.相對) 太陰百官分數 +=2; if(太陰屬性.架構.對星.祿馬.三方蝴蝶式) 太陰百官分數 +=2; if(太陰屬性.架構.對星.祿馬.三方斜飛式) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.祿馬.四正斜飛式) 太陰百官分數 +=1;
    if(太陰屬性.架構.對星.三台八座.同宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.三台八座.對宮) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.三台八座.相夾) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.三台八座.相對) 太陰百官分數 +=1; if(太陰屬性.架構.對星.三台八座.三方蝴蝶式) 太陰百官分數 +=1; if(太陰屬性.架構.對星.三台八座.三方斜飛式) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.三台八座.四正斜飛式) 太陰百官分數 +=0.5;
    if(太陰屬性.架構.對星.龍池鳳閣.同宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.龍池鳳閣.對宮) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.龍池鳳閣.相夾) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.龍池鳳閣.相對) 太陰百官分數 +=1; if(太陰屬性.架構.對星.龍池鳳閣.三方蝴蝶式) 太陰百官分數 +=1; if(太陰屬性.架構.對星.龍池鳳閣.三方斜飛式) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.龍池鳳閣.四正斜飛式) 太陰百官分數 +=0.5;
    if(太陰屬性.架構.對星.恩光天貴.同宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.恩光天貴.對宮) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.恩光天貴.相夾) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.恩光天貴.相對) 太陰百官分數 +=1; if(太陰屬性.架構.對星.恩光天貴.三方蝴蝶式) 太陰百官分數 +=1; if(太陰屬性.架構.對星.恩光天貴.三方斜飛式) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.恩光天貴.四正斜飛式) 太陰百官分數 +=0.5;
    if(太陰屬性.架構.對星.台輔封誥.同宮) 太陰百官分數 +=1.5; if(太陰屬性.架構.對星.台輔封誥.對宮) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.台輔封誥.相夾) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.台輔封誥.相對) 太陰百官分數 +=1; if(太陰屬性.架構.對星.台輔封誥.三方蝴蝶式) 太陰百官分數 +=1; if(太陰屬性.架構.對星.台輔封誥.三方斜飛式) 太陰百官分數 +=0.75; if(太陰屬性.架構.對星.台輔封誥.四正斜飛式) 太陰百官分數 +=0.5;
    
    命盤.星曜.太陰.百官朝拱 = 太陰百官分數 > 命盤.定義.百官參數;
	
    // ----- 月生滄海 -----
    if(太陰屬性.地支=="子") {
        命盤.格局.月生滄海.成立 = true;
        命盤.格局.月生滄海.地支1 = 太陰屬性.地支數;
        命盤.格局.月生滄海.宮位1 = 命盤.地支宮位[命盤.格局.月生滄海.地支1].宮位;
        //命盤.格局.月生滄海.古訣 = "";
        //命盤.格局.月生滄海.註解參考 = "";
        
        if(命盤.生年天干=="丁") 命盤.格局.月生滄海.形態 = 1;
        if(命盤.生年天干=="丙") 命盤.格局.月生滄海.形態 = 2;
        if(命盤.生年天干=="壬") 命盤.格局.月生滄海.形態 = 3;
        if(命盤.生年天干=="乙") 命盤.格局.月生滄海.形態 = 4;
        if(命盤.生年天干=="戊") { 命盤.格局.月生滄海.形態 = -1; 命盤.格局.月生滄海.破格 = true; }
        
        if(命盤.格局.月生滄海.破格) 命盤.地支宮位[命盤.格局.月生滄海.地支1].星曜架構.格局.push("月生滄海[破格]");
        if(命盤.格局.月生滄海.形態 >=0) 命盤.地支宮位[命盤.格局.月生滄海.地支1].星曜架構.格局.push("月生滄海");
    } // end if 月生滄海   
    
    
      // ----- 月朗天門 -----
    if(太陰屬性.地支=="亥" && 太陰屬性.吉化) {
        命盤.格局.月朗天門.成立 = true;
        命盤.格局.月朗天門.地支1 = 太陰屬性.地支數;
        命盤.格局.月朗天門.宮位1 = 命盤.地支宮位[命盤.格局.月朗天門.地支1].宮位;
        //命盤.格局.月朗天門.古訣 = "";
        //命盤.格局.月朗天門.註解參考 = "";
        
        if(命盤.生年天干=="丙") 命盤.格局.月朗天門.形態 = 1;
        if(命盤.生年天干=="壬") 命盤.格局.月朗天門.形態 = 2;
        if(命盤.生日.陰曆時=="丑") 命盤.格局.月朗天門.形態 = 3;
        if(太陰屬性.煞重) { 命盤.格局.月朗天門.形態 = -1; 命盤.格局.月朗天門.破格 = true; }
        
        if(命盤.格局.月朗天門.破格) 命盤.地支宮位[命盤.格局.月朗天門.地支1].星曜架構.格局.push("月朗天門[破格]");
        if(命盤.格局.月朗天門.形態 >=0) 命盤.地支宮位[命盤.格局.月朗天門.地支1].星曜架構.格局.push("月朗天門");
    } // end if 月朗天門      

    
    // ----- 火陰格 -----
    if(太陰屬性.地支數 == 火星屬性.地支數) {
        命盤.格局.火陰格.成立 = true;
        命盤.格局.火陰格.地支1 = 太陰屬性.地支數;
        命盤.格局.火陰格.宮位1 = 命盤.地支宮位[命盤.格局.火陰格.地支1].宮位;
        //命盤.格局.火陰格.古訣 = "";
        //命盤.格局.火陰格.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.火陰格.地支1].星曜架構.格局.push("火陰格");
    } // end if 火陰格
    
    
    // ----- 鈴陰格 -----
    if(太陰屬性.地支數 == 鈴星屬性.地支數) {
        命盤.格局.鈴陰格.成立 = true;
        命盤.格局.鈴陰格.地支1 = 太陰屬性.地支數;
        命盤.格局.鈴陰格.宮位1 = 命盤.地支宮位[命盤.格局.鈴陰格.地支1].宮位;
        //命盤.格局.鈴陰格.古訣 = "";
        //命盤.格局.鈴陰格.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.鈴陰格.地支1].星曜架構.格局.push("鈴陰格");
    } // end if 鈴陰格
    
    
    // ****************************************************
    // ********************** 貪狼 ************************
    // **************************************************** 
    命盤.星曜.貪狼.火貪格 = false;
    命盤.星曜.貪狼.鈴貪格 = false;
    
      // ----- 火貪格 -----
    if((貪狼屬性.地支=="辰" || 貪狼屬性.地支=="戌" || 貪狼屬性.地支=="丑" || 貪狼屬性.地支=="未") && 命盤.星曜.火星.地支==貪狼屬性.地支) {
        命盤.格局.火貪格.成立 = true;
        命盤.格局.火貪格.地支1 = 貪狼屬性.地支數;
        命盤.格局.火貪格.宮位1 = 命盤.地支宮位[命盤.格局.火貪格.地支1].宮位;
        //命盤.格局.火貪格.古訣 = "";
        //命盤.格局.火貪格.註解參考 = "";
        
        if(貪狼屬性.地支=="丑" || 貪狼屬性.地支=="未") 命盤.格局.火貪格.形態 = 1;
        if(貪狼屬性.吉化) 命盤.格局.火貪格.形態 = 2;
        if(貪狼屬性.四化 == "化忌") { 命盤.格局.火貪格.形態 = -1; 命盤.格局.火貪格.破格 = true; }
        if(命盤.格局.火貪格.成立 && !命盤.格局.火貪格.破格) 命盤.星曜.貪狼.火貪格 = true;
        
        if(命盤.格局.火貪格.破格) 命盤.地支宮位[命盤.格局.火貪格.地支1].星曜架構.格局.push("火貪格[破格]");
        if(命盤.格局.火貪格.形態 >=0) 命盤.地支宮位[命盤.格局.火貪格.地支1].星曜架構.格局.push("火貪格");
    } // end if 火貪格
    

      // ----- 鈴貪格 -----
    if((貪狼屬性.地支=="辰" || 貪狼屬性.地支=="戌" || 貪狼屬性.地支=="丑" || 貪狼屬性.地支=="未") && 命盤.星曜.鈴星.地支 == 貪狼屬性.地支) {
        命盤.格局.鈴貪格.成立 = true;
        命盤.格局.鈴貪格.地支1 = 貪狼屬性.地支數;
        命盤.格局.鈴貪格.宮位1 = 命盤.地支宮位[命盤.格局.鈴貪格.地支1].宮位;
        //命盤.格局.鈴貪格.古訣 = "";
        //命盤.格局.鈴貪格.註解參考 = "";
        
        if(貪狼屬性.地支=="丑" || 貪狼屬性.地支=="未") 命盤.格局.鈴貪格.形態 = 1;
        if(貪狼屬性.吉化) 命盤.格局.鈴貪格.形態 = 2;
        if(貪狼屬性.四化 == "化忌") { 命盤.格局.鈴貪格.形態 = -1; 命盤.格局.鈴貪格.破格 = true; }
        if(命盤.格局.鈴貪格.成立 && !命盤.格局.鈴貪格.破格) 命盤.星曜.貪狼.鈴貪格 = true;
        
        if(命盤.格局.鈴貪格.破格) 命盤.地支宮位[命盤.格局.鈴貪格.地支1].星曜架構.格局.push("鈴貪格[破格]");
        if(命盤.格局.鈴貪格.形態 >=0) 命盤.地支宮位[命盤.格局.鈴貪格.地支1].星曜架構.格局.push("鈴貪格");
    } // end if 鈴貪格
    
    
      // ----- 三合火貪 ----- //
    if(_.contains(貪狼屬性.雙方星曜, "火星") && 星曜矩陣所含星曜(貪狼屬性.互涉星曜, ["化祿", "祿存"], "||")) {
        命盤.格局.三合火貪.成立 = true;
        命盤.格局.三合火貪.地支1 = 貪狼屬性.地支數;
        命盤.格局.三合火貪.宮位1 = 命盤.地支宮位[命盤.格局.三合火貪.地支1].宮位;
        格局名稱 = "三合火貪";
        //命盤.格局.三合火貪.古訣 = "";
        //命盤.格局.三合火貪.註解參考 = "";
        
        if(貪狼屬性.四化 == "化忌") { 命盤.格局.三合火貪.形態 = -1; 命盤.格局.三合火貪.破格 = true; 格局名稱 = "三合火貪[破格]"; }
        
        命盤.地支宮位[命盤.格局.三合火貪.地支1].星曜架構.格局.push(格局名稱);
    } // end if 三合火貪
    

      // ----- 三合鈴貪 -----
    if(_.contains(貪狼屬性.雙方星曜, "鈴星") && 星曜矩陣所含星曜(貪狼屬性.互涉星曜, ["化祿", "祿存"], "||")) {
        命盤.格局.三合鈴貪.成立 = true;
        命盤.格局.三合鈴貪.地支1 = 貪狼屬性.地支數;
        命盤.格局.三合鈴貪.宮位1 = 命盤.地支宮位[命盤.格局.三合鈴貪.地支1].宮位;
        格局名稱 = "三合鈴貪";
        //命盤.格局.三合鈴貪.古訣 = "";
        //命盤.格局.三合鈴貪.註解參考 = "";
        
        if(貪狼屬性.四化 == "化忌") { 命盤.格局.三合鈴貪.形態 = -1; 命盤.格局.三合鈴貪.破格 = true; 格局名稱 = "三合鈴貪[破格]"; }
        
        命盤.地支宮位[命盤.格局.三合鈴貪.地支1].星曜架構.格局.push(格局名稱);
    } // end if 三合鈴貪
    
    
    // ----- 泛水桃花 -----
    if((貪狼屬性.地支=="亥" && 命盤.生年天干=="癸") || (貪狼屬性.地支=="子" && 命盤.生年天干=="壬")) {
        命盤.格局.泛水桃花.成立 = true;
        命盤.格局.泛水桃花.地支1 = 貪狼屬性.地支數;
        命盤.格局.泛水桃花.宮位1 = 命盤.地支宮位[命盤.格局.泛水桃花.地支1].宮位;
        //命盤.格局.泛水桃花.古訣 = "";
        //命盤.格局.泛水桃花.註解參考 = "";
        
        if(貪狼屬性.地支=="亥") 命盤.格局.泛水桃花.形態 = 1;
        if(貪狼屬性.地支=="子") 命盤.格局.泛水桃花.形態 = 2;
        if(命盤.地支宮位[命盤.格局.泛水桃花.地支1].星曜架構.諸星群.空曜.空曜重) { 命盤.格局.泛水桃花.破格 = true; 命盤.格局.泛水桃花.形態 = 2; }  //吉化
        
        if(命盤.格局.泛水桃花.破格) 命盤.地支宮位[命盤.格局.泛水桃花.地支1].星曜架構.格局.push("泛水桃花[吉化]");
        if(命盤.格局.泛水桃花.形態 >=0) 命盤.地支宮位[命盤.格局.泛水桃花.地支1].星曜架構.格局.push("泛水桃花");
    } // end if 泛水桃花
    
    
      // ----- 風流綵杖 -----
    if(貪狼屬性.地支=="寅" && 命盤.星曜.陀羅.地支=="寅" ) {
        命盤.格局.風流綵杖.成立 = true;
        命盤.格局.風流綵杖.地支1 = 貪狼屬性.地支數;
        命盤.格局.風流綵杖.宮位1 = 命盤.地支宮位[命盤.格局.風流綵杖.地支1].宮位;
        //命盤.格局.風流綵杖.古訣 = "";
        //命盤.格局.風流綵杖.註解參考 = "";
        
        if(命盤.星曜.火星.地支=="寅") 命盤.格局.風流綵杖.形態 = 1;
        if(_.contains(貪狼屬性.互涉星曜, "天刑")) 命盤.格局.風流綵杖.形態 = 2;
        
        命盤.地支宮位[命盤.格局.風流綵杖.地支1].星曜架構.格局.push("風流綵杖");
    } // end if 風流綵杖
    

      // ----- 貪居旺宮 ----- 「寅午戌人命坐午宮；巳酉丑人，命坐酉宮；亥卯未人命坐卯宮；申子辰人命坐子宮」。
    if(((命盤.生年地支=="寅" || 命盤.生年地支=="午" || 命盤.生年地支=="戌") && 貪狼屬性.地支=="午") || ((命盤.生年地支=="巳" || 命盤.生年地支=="酉" || 命盤.生年地支=="丑") && 貪狼屬性.地支=="丑") || ((命盤.生年地支=="申" || 命盤.生年地支=="子" || 命盤.生年地支=="辰") && 貪狼屬性.地支=="子") || ((命盤.生年地支=="亥" || 命盤.生年地支=="卯" || 命盤.生年地支=="未") && 貪狼屬性.地支=="卯")) {
        命盤.格局.貪居旺宮.成立 = true;
        命盤.格局.貪居旺宮.地支1 = 貪狼屬性.地支數;
        命盤.格局.貪居旺宮.宮位1 = 命盤.地支宮位[命盤.格局.貪居旺宮.地支1].宮位;
        
        命盤.地支宮位[命盤.格局.貪居旺宮.地支1].星曜架構.格局.push("貪居旺宮");
    } // end if 貪居旺宮
    
    // ----- 昌貪格 -----
    if(貪狼屬性.地支數 == 文昌屬性.地支數) {
        命盤.格局.昌貪格.成立 = true;
        命盤.格局.昌貪格.地支1 = 貪狼屬性.地支數;
        命盤.格局.昌貪格.宮位1 = 命盤.地支宮位[命盤.格局.昌貪格.地支1].宮位;
        
        命盤.地支宮位[命盤.格局.昌貪格.地支1].星曜架構.格局.push("昌貪格");
    }  // end if 昌貪格
    
    
    // ----- 曲貪格 -----
    if(貪狼屬性.地支數 == 文曲屬性.地支數) {
        命盤.格局.曲貪格.成立 = true;
        命盤.格局.曲貪格.地支1 = 貪狼屬性.地支數;
        命盤.格局.曲貪格.宮位1 = 命盤.地支宮位[命盤.格局.曲貪格.地支1].宮位;
        
        命盤.地支宮位[命盤.格局.曲貪格.地支1].星曜架構.格局.push("曲貪格");
    }  // end if 曲貪格
    
    
    // ****************************************************
    // ********************** 巨門 ************************
    // **************************************************** 
    
      // ----- 石中隱玉 -----
    if((巨門屬性.地支=="子" || 巨門屬性.地支=="午") && (巨門屬性.架構.諸星群.四化.祿權 || 巨門屬性.架構.諸星群.四化.祿權.權科)) {
        命盤.格局.石中隱玉.成立 = true;
        命盤.格局.石中隱玉.地支1 = 巨門屬性.地支數;
        命盤.格局.石中隱玉.宮位1 = 命盤.地支宮位[命盤.格局.石中隱玉.地支1].宮位;
        //命盤.格局.石中隱玉.古訣 = "";
        //命盤.格局.石中隱玉.註解參考 = "";
        
        if(命盤.生年天干=="辛") 命盤.格局.石中隱玉.形態 = 1;
        if(命盤.星曜.擎羊.地支數 == 巨門屬性.地支數) { 命盤.格局.石中隱玉.破格 = true; 命盤.格局.石中隱玉.形態 = -1; } 
        
        if(命盤.格局.石中隱玉.形態 >=0) 命盤.地支宮位[命盤.格局.石中隱玉.地支1].星曜架構.格局.push("石中隱玉");
        if(命盤.格局.石中隱玉.破格) 命盤.地支宮位[命盤.格局.石中隱玉.地支1].星曜架構.格局.push("石中隱玉[破格]");
    } // end if 石中隱玉
    
 
      // ----- 巨門反背 -----
    if((巨門屬性.地支=="辰" || 巨門屬性.地支=="戌") && (命盤.生年天干=="辛" && 命盤.星曜.文昌.地支數 == 巨門屬性.地支數)) {
        命盤.格局.巨門反背.成立 = true;
        命盤.格局.巨門反背.地支1 = 巨門屬性.地支數;
        命盤.格局.巨門反背.宮位1 = 命盤.地支宮位[命盤.格局.巨門反背.地支1].宮位;
        //命盤.格局.巨門反背.古訣 = "";
        //命盤.格局.巨門反背.註解參考 = "";
        
        if(命盤.生年天干=="辛") 命盤.格局.巨門反背.形態 = 1;
        
        命盤.地支宮位[命盤.格局.巨門反背.地支1].星曜架構.格局.push("巨門反背");
    } // end if 巨門反背
    
    
        // ----- 巨日同宮 -----
    if(巨門屬性.地支=="寅" && 巨門屬性.吉化) {
        命盤.格局.巨日同宮.成立 = true;
        命盤.格局.巨日同宮.地支1 = 巨門屬性.地支數;
        命盤.格局.巨日同宮.宮位1 = 命盤.地支宮位[命盤.格局.巨日同宮.地支1].宮位;
        //命盤.格局.巨日同宮.古訣 = "";
        //命盤.格局.巨日同宮.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.巨日同宮.地支1].星曜架構.格局.push("巨日同宮");
    } // end if 巨日同宮  
    

        // ----- 巨逢四煞-----
    if(巨門屬性.廟陷數 <=3 && 星曜矩陣所含星曜(巨門屬性.互涉星曜, 四煞曜, "&&")) {
        命盤.格局.巨逢四煞.成立 = true;
        命盤.格局.巨逢四煞.地支1 = 巨門屬性.地支數;
        命盤.格局.巨逢四煞.宮位1 = 命盤.地支宮位[命盤.格局.巨逢四煞.地支1].宮位;
        //命盤.格局.巨逢四煞.古訣 = "";
        //命盤.格局.巨逢四煞.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.巨逢四煞.地支1].星曜架構.格局.push("巨逢四煞");
    } // end if 巨逢四煞  
    
    
    
    // ****************************************************
    // ********************** 天梁 ************************
    // **************************************************** 
   

        // ----- 文梁振紀 -----
    if((天梁屬性.地支=="丑" || 天梁屬性.地支=="卯" || 天梁屬性.地支=="未") && 命盤.星曜.文曲.地支數 == 天梁屬性.地支數) {
        命盤.格局.文梁振紀.成立 = true;
        命盤.格局.文梁振紀.地支1 = 天梁屬性.地支數;
        命盤.格局.文梁振紀.宮位1 = 命盤.地支宮位[命盤.格局.文梁振紀.地支1].宮位;
        //命盤.格局.文梁振紀.古訣 = "";
        //命盤.格局.文梁振紀.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.文梁振紀.地支1].星曜架構.格局.push("文梁振紀");
    } // end if 文梁振紀  
    
    
        // ----- 壽星入廟 -----
    if(天梁屬性.地支=="午") {
        命盤.格局.壽星入廟.成立 = true;
        命盤.格局.壽星入廟.地支1 = 天梁屬性.地支數;
        命盤.格局.壽星入廟.宮位1 = 命盤.地支宮位[命盤.格局.壽星入廟.地支1].宮位;
        //命盤.格局.壽星入廟.古訣 = "";
        //命盤.格局.壽星入廟.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.壽星入廟.地支1].星曜架構.格局.push("壽星入廟");
    } // end if 壽星入廟  
    

        // ----- 天梁拱月-1 -----
    if((天梁屬性.地支=="巳" || 天梁屬性.地支=="亥") && 天梁屬性.煞重 && !天梁屬性.四化吉化) {
        命盤.格局.天梁拱月.成立 = true;
        命盤.格局.天梁拱月.地支1 = 天梁屬性.地支數;
        命盤.格局.天梁拱月.宮位1 = 命盤.地支宮位[命盤.格局.天梁拱月.地支1].宮位;
        //命盤.格局.天梁拱月.古訣 = "";
        //命盤.格局.天梁拱月.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.天梁拱月.地支1].星曜架構.格局.push("天梁拱月");
    } // end if 天梁拱月-1
    
 
        // ----- 天梁拱月-2 -----
    if((太陰屬性.地支=="寅" || 太陰屬性.地支=="申") && 太陰屬性.煞重 && !太陰屬性.四化吉化) {
        命盤.格局.天梁拱月.成立 = true;
        命盤.格局.天梁拱月.地支1 = 太陰屬性.地支數;
        命盤.格局.天梁拱月.宮位1 = 命盤.地支宮位[命盤.格局.天梁拱月.地支1].宮位;
        //命盤.格局.天梁拱月.古訣 = "";
        //命盤.格局.天梁拱月.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.天梁拱月.地支1].星曜架構.格局.push("天梁拱月");
    } // end if 天梁拱月-2
    
    
        // ----- 天梁飄蕩 -----
    if((天梁屬性.地支=="巳" || 天梁屬性.地支=="亥" || 天梁屬性.地支=="申") && 命盤.星曜.天馬.地支數 == 天梁屬性.地支數) {
        命盤.格局.天梁飄蕩.成立 = true;
        命盤.格局.天梁飄蕩.地支1 = 天梁屬性.地支數;
        命盤.格局.天梁飄蕩.宮位1 = 命盤.地支宮位[命盤.格局.天梁飄蕩.地支1].宮位;
        //命盤.格局.天梁飄蕩.古訣 = "";
        //命盤.格局.天梁飄蕩.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.天梁飄蕩.地支1].星曜架構.格局.push("天梁飄蕩");
    } // end if 天梁飄蕩  
    
    
        // ----- 天梁遇馬 -----
    //if((天馬屬性.地支=="寅" && 天梁屬性.地支=="申") || (天馬屬性.地支=="申" && 天梁屬性.地支=="寅") || (天馬屬性.地支=="巳" && 天梁屬性.地支=="亥") || (天馬屬性.地支=="亥" && 天梁屬性.地支=="巳")){
    if (((天馬屬性.地支=="寅" || 天馬屬性.地支=="申") && 星曜矩陣所含星曜(命盤.地支宮位[天馬屬性.對宮地支數].星曜本宮.主星 , ["天同", "天梁"], "&&")) || ((天馬屬性.地支=="巳" || 天馬屬性.地支=="亥") && _.contains(命盤.地支宮位[天馬屬性.地支數].星曜本宮.主星, "天同") && _.contains(命盤.地支宮位[天馬屬性.對宮地支數].星曜本宮.主星, "天梁"))) {
        命盤.格局.天梁遇馬.成立 = true;
        命盤.格局.天梁遇馬.地支1 = 天馬屬性.地支數;
        命盤.格局.天梁遇馬.宮位1 = 命盤.地支宮位[命盤.格局.天梁遇馬.地支1].宮位;
        //命盤.格局.天梁遇馬.古訣 = "";
        //命盤.格局.天梁遇馬.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.天梁遇馬.地支1].星曜架構.格局.push("天梁遇馬");
    } // end if 天梁遇馬  

    
    
    
    // ****************************************************
    // ********************** 七殺 ************************
    // **************************************************** 
   

        // ----- 七殺朝斗 -----
    if(七殺屬性.地支=="申") {
        命盤.格局.七殺朝斗.成立 = true;
        命盤.格局.七殺朝斗.地支1 = 七殺屬性.地支數;
        命盤.格局.七殺朝斗.宮位1 = 命盤.地支宮位[命盤.格局.七殺朝斗.地支1].宮位;
        if(七殺屬性.吉化) 命盤.格局.七殺朝斗.形態 = 1;
        if(!七殺屬性.吉化 && 七殺屬性.煞重) { 命盤.格局.七殺朝斗.形態 = -1; 命盤.格局.七殺朝斗.破格 = true; }
        //命盤.格局.七殺朝斗.古訣 = "";
        //命盤.格局.七殺朝斗.註解參考 = "";
        
        if(命盤.格局.七殺朝斗.破格) 命盤.地支宮位[命盤.格局.七殺朝斗.地支1].星曜架構.格局.push("七殺朝斗[破格]");
        if(命盤.格局.七殺朝斗.形態 >=0) 命盤.地支宮位[命盤.格局.七殺朝斗.地支1].星曜架構.格局.push("七殺朝斗");
    } // end if 七殺朝斗  
    
    
        // ----- 七殺仰斗 -----
    if(七殺屬性.地支=="寅") {
        命盤.格局.七殺仰斗.成立 = true;
        命盤.格局.七殺仰斗.地支1 = 七殺屬性.地支數;
        命盤.格局.七殺仰斗.宮位1 = 命盤.地支宮位[命盤.格局.七殺仰斗.地支1].宮位;
        if(七殺屬性.吉化) 命盤.格局.七殺仰斗.形態 = 1;
        if(!七殺屬性.吉化 && 七殺屬性.煞重) { 命盤.格局.七殺仰斗.形態 = -1; 命盤.格局.七殺仰斗.破格 = true; }
        //命盤.格局.七殺仰斗.古訣 = "";
        //命盤.格局.七殺仰斗.註解參考 = "";
        
        if(命盤.格局.七殺仰斗.破格) 命盤.地支宮位[命盤.格局.七殺仰斗.地支1].星曜架構.格局.push("七殺仰斗[破格]");
        if(命盤.格局.七殺仰斗.形態 >=0) 命盤.地支宮位[命盤.格局.七殺仰斗.地支1].星曜架構.格局.push("七殺仰斗");
    } // end if 七殺仰斗  
    
    
    
    // ****************************************************
    // ********************** 破軍 ************************
    // **************************************************** 
   
        // ----- 英星入廟 -----
    if(破軍屬性.地支=="子" || 破軍屬性.地支=="午") {
        命盤.格局.英星入廟.成立 = true;
        命盤.格局.英星入廟.地支1 = 破軍屬性.地支數;
        命盤.格局.英星入廟.宮位1 = 命盤.地支宮位[命盤.格局.英星入廟.地支1].宮位;
        if(破軍屬性.吉化) 命盤.格局.英星入廟.形態 = 1;
        
        if(命盤.生年天干=="甲" || 命盤.生年天干=="癸") 命盤.格局.英星入廟.形態 = 2;
        if(命盤.生年天干=="丁" || 命盤.生年天干=="己") 命盤.格局.英星入廟.形態 = 3;
        if(命盤.生年天干=="丙" || 命盤.生年天干=="戌") { 命盤.格局.英星入廟.形態 = -1; 命盤.格局.英星入廟.破格 = true; }
        if(!破軍屬性.吉化 && 破軍屬性.煞重) { 命盤.格局.英星入廟.形態 = -2; 命盤.格局.英星入廟.破格 = true; }
        
        //命盤.格局.英星入廟.古訣 = "";
        //命盤.格局.英星入廟.註解參考 = "";
        
        if(命盤.格局.英星入廟.破格) 命盤.地支宮位[命盤.格局.英星入廟.地支1].星曜架構.格局.push("英星入廟[破格]");
        if(命盤.格局.英星入廟.形態 >=0) 命盤.地支宮位[命盤.格局.英星入廟.地支1].星曜架構.格局.push("英星入廟");
    } // end if 英星入廟  
    
    
        // ----- 眾水朝東 -----
    if((破軍屬性.地支=="寅" || 破軍屬性.地支=="卯") && 文曲屬性.地支數 == 破軍屬性.地支數) {
        命盤.格局.眾水朝東.成立 = true;
        命盤.格局.眾水朝東.地支1 = 破軍屬性.地支數;
        命盤.格局.眾水朝東.宮位1 = 命盤.地支宮位[命盤.格局.眾水朝東.地支1].宮位;
        //命盤.格局.眾水朝東.古訣 = "";
        //命盤.格局.眾水朝東.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.眾水朝東.地支1].星曜架構.格局.push("眾水朝東");
    } // end if 眾水朝東
    
    
        // ----- 水中作塚 -----
    if((破軍屬性.地支=="亥" || 破軍屬性.地支=="子" || 破軍屬性.地支=="丑") && 文曲屬性.地支數 == 破軍屬性.地支數) {
        命盤.格局.水中作塚.成立 = true;
        命盤.格局.水中作塚.地支1 = 破軍屬性.地支數;
        命盤.格局.水中作塚.宮位1 = 命盤.地支宮位[命盤.格局.水中作塚.地支1].宮位;
        //命盤.格局.水中作塚.古訣 = "";
        //命盤.格局.水中作塚.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.水中作塚.地支1].星曜架構.格局.push("水中作塚");
    } // end if 水中作塚
    

    
    
    // ****************************************************
    // ******************* 四化的格局 *********************
    // ****************************************************
    
    // ----- 三奇加會 -----
    
    var 三奇加會成立 = false;
    for(var j=0; j<12; j++) {
        if(命盤.地支宮位[j].星曜架構.諸星群.四化.祿權科 && !命盤.地支宮位[j].星曜架構.諸星群.四化.祿權科忌) {
            命盤.格局.三奇加會.成立 = true;
            if (!三奇加會成立) {
                命盤.格局.三奇加會.地支1 = j;
                命盤.格局.三奇加會.宮位1 = 命盤.地支宮位[j].宮位;
            } 
            else {
                命盤.格局.三奇加會.地支2 = j;
                命盤.格局.三奇加會.宮位2 = 命盤.地支宮位[j].宮位; 
            }
            
            三奇加會成立 = true;
            命盤.地支宮位[j].星曜架構.格局.push("三奇加會");
        } // end if 三奇加會
    }  // end for
    
    //console.log(化權屬性);
    //console.log(化科屬性);
    // ----- 甲第登庸 -----
    if(化權屬性.地支數 == 化科屬性.對宮地支數) {
        命盤.格局.甲第登庸.成立 = true;
        命盤.格局.甲第登庸.地支1 = 化科屬性.地支數;
        命盤.格局.甲第登庸.宮位1 = 命盤.地支宮位[命盤.格局.甲第登庸.地支1].宮位;
        //命盤.格局.甲第登庸.古訣 = "";
        //命盤.格局.甲第登庸.註解參考 = "";
        
        if(化科屬性.煞重) { 命盤.格局.甲第登庸.形態 = -1; 命盤.格局.甲第登庸.破格 = true; }
        if(地空屬性.地支數 == 化科屬性.地支數 || 地劫屬性.地支數 == 化科屬性.地支數) { 命盤.格局.甲第登庸.形態 = -2; 命盤.格局.甲第登庸.破格 = true; }
        if(化科屬性.架構.對星.空劫.相夾) { 命盤.格局.甲第登庸.形態 = -3; 命盤.格局.甲第登庸.破格 = true; }
        if(化科屬性.架構.對星.空劫.三方四正) { 命盤.格局.甲第登庸.形態 = -4; 命盤.格局.甲第登庸.破格 = true; }
        
        if(!命盤.格局.甲第登庸.破格) 命盤.地支宮位[命盤.格局.甲第登庸.地支1].星曜架構.格局.push("甲第登庸"); else 命盤.地支宮位[命盤.格局.甲第登庸.地支1].星曜架構.格局.push("甲第登庸[破格]");
    }  // end if 甲第登庸
    

    // ----- 科名會祿 -----
    if(星曜矩陣所含星曜(化科屬性.互涉星曜, ["祿存", "化祿"], "||") && !化科屬性.煞重 && !化科屬性.空劫同躔 && !化科屬性.架構.對星.空劫.三方四正 && !化科屬性.架構.對星.空劫.相夾) {
        命盤.格局.科名會祿.成立 = true;
        命盤.格局.科名會祿.地支1 = 化科屬性.地支數;
        命盤.格局.科名會祿.宮位1 = 命盤.地支宮位[命盤.格局.科名會祿.地支1].宮位;
        //命盤.格局.科名會祿.古訣 = "";
        //命盤.格局.科名會祿.註解參考 = "";
        //if(化科屬性.煞重) { 命盤.格局.科名會祿.形態 = -1; 命盤.格局.科名會祿.破格 = true; }
        
        命盤.地支宮位[命盤.格局.科名會祿.地支1].星曜架構.格局.push("科名會祿");
    }  // end if 科名會祿

    
    // ----- 科星煞湊 -----
    if(化科屬性.煞重 || 化科屬性.架構.對星.空劫.三方四正 || 化科屬性.架構.對星.空劫.相夾) {
        命盤.格局.科星煞湊.成立 = true;
        命盤.格局.科星煞湊.地支1 = 化科屬性.地支數;
        命盤.格局.科星煞湊.宮位1 = 命盤.地支宮位[命盤.格局.科星煞湊.地支1].宮位;
        //命盤.格局.科星煞湊.古訣 = "";
        //命盤.格局.科星煞湊.註解參考 = "";
        
        if(化科屬性.空劫同躔) 命盤.格局.科名會祿.形態 = 1;
        if(化科屬性.架構.對星.空劫.三方四正) 命盤.格局.科名會祿.形態 = 2;
        if(化科屬性.架構.對星.空劫.相夾) 命盤.格局.科名會祿.形態 = 3;
        
        命盤.地支宮位[命盤.格局.科星煞湊.地支1].星曜架構.格局.push("科星煞湊");
    }  // end if 科星煞湊


    // ----- 權祿巡逢 -----
    if(星曜矩陣所含星曜(化權屬性.本宮星曜, ["化祿", "祿存"], "||")) {
        命盤.格局.權祿巡逢.成立 = true;
        命盤.格局.權祿巡逢.地支1 = 化權屬性.地支數;
        命盤.格局.權祿巡逢.宮位1 = 命盤.地支宮位[命盤.格局.權祿巡逢.地支1].宮位;
        //命盤.格局.權祿巡逢.古訣 = "";
        //命盤.格局.權祿巡逢.註解參考 = "";
        if(化權屬性.煞重) { 命盤.格局.權祿巡逢.形態 = -1; 命盤.格局.權祿巡逢.破格 = true; }
        if(化權屬性.空劫同躔) { 命盤.格局.權祿巡逢.形態 = -2; 命盤.格局.權祿巡逢.破格 = true; }
        if(化權屬性.架構.對星.空劫.相夾) { 命盤.格局.權祿巡逢.形態 = -3; 命盤.格局.權祿巡逢.破格 = true; }
        if(化權屬性.架構.對星.空劫.三方四正) { 命盤.格局.權祿巡逢.形態 = -4; 命盤.格局.權祿巡逢.破格 = true; }
        
        if(命盤.格局.權祿巡逢.破格) 命盤.地支宮位[命盤.格局.權祿巡逢.地支1].星曜架構.格局.push("權祿巡逢[破格]"); else 命盤.地支宮位[命盤.格局.權祿巡逢.地支1].星曜架構.格局.push("權祿巡逢");
    }  // end if 權祿巡逢
    
    
    
    
    // ****************************************************
    // ******************* 六吉曜的格局 *********************
    // ****************************************************

    // ------------ 祿馬交馳 ------------
    if(祿存屬性.地支數 == 天馬屬性.地支數 || 祿存屬性.地支數 == 天馬屬性.對宮地支數) {
        命盤.格局.祿馬交馳.成立 = true;
        命盤.格局.祿馬交馳.地支1 = 天馬屬性.地支數;
        命盤.格局.祿馬交馳.宮位1 = 命盤.地支宮位[命盤.格局.祿馬交馳.地支1].宮位;
        
        if(祿存屬性.地支數 == 天馬屬性.地支數) { 命盤.格局.祿馬交馳.形態 = 1; }
        if(祿存屬性.地支數 == 天馬屬性.對宮地支數) { 命盤.格局.祿馬交馳.形態 = 2; }
        if(天相屬性.地支數 == 天馬屬性.地支數) {     
            命盤.格局.祿馬交馳.形態 = 3;
            命盤.格局.祿馬佩印.成立 = true;
            命盤.格局.祿馬佩印.地支1 = 天馬屬性.地支數;
            命盤.格局.祿馬佩印.宮位1 = 命盤.地支宮位[命盤.格局.祿馬佩印.地支1].宮位;
            
            if(星曜矩陣所含星曜(天馬屬性.互涉星曜, ["擎羊", "火星", "鈴星", "地空", "地劫", "截路", "空亡"], "||")) { 命盤.格局.祿馬佩印.形態 = -1; 命盤.格局.祿馬佩印.破格 = true; }
        }  // end if 祿馬佩印
        
        if(陀羅屬性.地支數 == 天馬屬性.地支數) { 命盤.格局.祿馬交馳.形態 = -1; 命盤.格局.祿馬交馳.破格 = true; }
        if(火星屬性.地支數 == 天馬屬性.地支數 || 鈴星屬性.地支數 == 天馬屬性.地支數) { 命盤.格局.祿馬交馳.形態 = -2; 命盤.格局.祿馬交馳.破格 = true; }
        if(地空屬性.地支數 == 天馬屬性.地支數 || 地劫屬性.地支數 == 天馬屬性.地支數) { 命盤.格局.祿馬交馳.形態 = -3; 命盤.格局.祿馬交馳.破格 = true; }
        if(截路屬性.地支數 == 天馬屬性.地支數 || 空亡屬性.地支數 == 天馬屬性.地支數) { 命盤.格局.祿馬交馳.形態 = -4; 命盤.格局.祿馬交馳.破格 = true; }
        if(命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.對星.火鈴.三方四正) { 命盤.格局.祿馬交馳.形態 = -5; 命盤.格局.祿馬交馳.破格 = true; }
        if(命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.對星.火鈴.相夾) { 命盤.格局.祿馬交馳.形態 = -6; 命盤.格局.祿馬交馳.破格 = true; }
        if(命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.對星.空劫.三方四正) { 命盤.格局.祿馬交馳.形態 = -7; 命盤.格局.祿馬交馳.破格 = true; }
        if(命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.對星.空劫.相夾) { 命盤.格局.祿馬交馳.形態 = -8; 命盤.格局.祿馬交馳.破格 = true; }
        
        if(命盤.格局.祿馬交馳.破格) 命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.格局.push("祿馬交馳[破格]"); 
        if(命盤.格局.祿馬交馳.形態>=0 && !命盤.格局.祿馬佩印.成立) 命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.格局.push("祿馬交馳");
        
        if(命盤.格局.祿馬佩印.成立 && !命盤.格局.祿馬佩印.破格) 命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.格局.push("祿馬佩印");
        if(命盤.格局.祿馬佩印.破格) 命盤.地支宮位[命盤.格局.祿馬交馳.地支1].星曜架構.格局.push("祿馬佩印[破格]");
    }  // end 祿馬交馳
    
    
    
    // ------------ 祿合鴛鴦、雙祿朝垣 ------------
    var 祿合鴛鴦成立 = false; 
    for(var j=0; j<12; j++) {
        if(命盤.地支宮位[j].星曜架構.對星.雙祿.三方四正) {
            命盤.格局.祿合鴛鴦.成立 = true;
            if (!祿合鴛鴦成立) {
                命盤.格局.祿合鴛鴦.地支1 = j;
                命盤.格局.祿合鴛鴦.宮位1 = 命盤.地支宮位[j].宮位;
            } 
            else {
                命盤.格局.祿合鴛鴦.地支2 = j;
                命盤.格局.祿合鴛鴦.宮位2 = 命盤.地支宮位[j].宮位; 
            }
            
            命盤.格局.祿合鴛鴦.形態 = 1;
            if(命盤.地支宮位[j].星曜架構.對星.雙祿.三方) 命盤.格局.祿合鴛鴦.形態 = 2;
            if(命盤.地支宮位[j].星曜架構.對星.雙祿.對宮) 命盤.格局.祿合鴛鴦.形態 = 3;
            if(命盤.地支宮位[j].星曜架構.對星.雙祿.同宮) 命盤.格局.祿合鴛鴦.形態 = 4;
            if(命盤.地支宮位[j].星曜架構.對星.雙祿.三方蝴蝶式) { 命盤.格局.祿合鴛鴦.形態 = 5; 命盤.格局.雙祿朝垣.成立 = true; 命盤.格局.雙祿朝垣.地支1 = j; 命盤.格局.雙祿朝垣.宮位1 = 命盤.地支宮位[j].宮位;}  // 雙祿朝垣
            
            祿合鴛鴦成立 = true;
            if(命盤.格局.祿合鴛鴦.形態 == 5) 命盤.地支宮位[j].星曜架構.格局.push("雙祿朝垣"); else 命盤.地支宮位[j].星曜架構.格局.push("祿合鴛鴦");
        }  //end if 雙祿.三方四正
    } // end for
    
    
    // ------------ 雙祿夾命 ------------
    for(var j=0; j<12; j++) {
        if(命盤.地支宮位[j].星曜架構.對星.雙祿.相夾) {
            命盤.格局.雙祿夾命.成立 = true;
            命盤.格局.雙祿夾命.地支1 = j;
            命盤.格局.雙祿夾命.宮位1 = 命盤.地支宮位[j].宮位;
            
            命盤.地支宮位[j].星曜架構.格局.push("雙祿夾命");
        }  // end if 成立
    } // end for j， 雙祿夾命
    
    
    // ------------ 祿文拱命1 ------------
    var 祿文拱命成立 = false; 
    if(星曜矩陣所含星曜(化祿屬性.互涉星曜, ["文昌", "文曲"], "&&") && !化祿屬性.煞重 && !化祿屬性.空劫同躔) {
        命盤.格局.祿文拱命.成立 = true;
        命盤.格局.祿文拱命.形態 = 1;
        命盤.格局.祿文拱命.地支1 = 化祿屬性.地支數;
        命盤.格局.祿文拱命.宮位1 = 命盤.地支宮位[命盤.格局.祿文拱命.地支1].宮位;
        祿文拱命成立 = true;
        
        //命盤.格局.祿文拱命.古訣 = "";
        //命盤.格局.祿文拱命.註解參考 = "";
        
        命盤.地支宮位[命盤.格局.祿文拱命.地支1].星曜架構.格局.push("祿文拱命");
    }  // end if 祿文拱命1 
    
    // ------------ 祿文拱命2 ------------
    if(星曜矩陣所含星曜(祿存屬性.互涉星曜, ["文昌", "文曲"], "&&") && !祿存屬性.煞重 && !祿存屬性.空劫同躔) {
        命盤.格局.祿文拱命.成立 = true;
        命盤.格局.祿文拱命.形態 = 2;
        //命盤.格局.祿文拱命.古訣 = "";
        //命盤.格局.祿文拱命.註解參考 = "";
        
        if(!祿文拱命成立) {
            命盤.格局.祿文拱命.地支1 = 祿存屬性.地支數;
            命盤.格局.祿文拱命.宮位1 = 命盤.地支宮位[命盤.格局.祿文拱命.地支1].宮位;
            命盤.地支宮位[命盤.格局.祿文拱命.地支1].星曜架構.格局.push("祿文拱命");
        }  // end if !祿文拱命成立，化祿不成!祿文拱命
        
        if(祿文拱命成立) {
            命盤.格局.祿文拱命.地支2 = 祿存屬性.地支數;
            命盤.格局.祿文拱命.宮位2 = 命盤.地支宮位[命盤.格局.祿文拱命.地支2].宮位;
            命盤.地支宮位[命盤.格局.祿文拱命.地支2].星曜架構.格局.push("祿文拱命");
        }  // end if 祿文拱命成立，化祿也是祿文拱命
    }  // end if 祿文拱命2
    
    
    
    
    // ------------ 坐貴向貴 ------------
    if(天魁屬性.對宮地支數 == 天鉞屬性.地支數) {
        命盤.格局.坐貴向貴.成立 = true;
        命盤.格局.坐貴向貴.地支1 = 天魁屬性.地支數; 命盤.格局.坐貴向貴.地支2 = 天鉞屬性.地支數;
        命盤.格局.坐貴向貴.宮位1 = 命盤.地支宮位[命盤.格局.坐貴向貴.地支1].宮位; 
        命盤.格局.坐貴向貴.宮位2 = 命盤.地支宮位[命盤.格局.坐貴向貴.地支2].宮位;
        
        命盤.地支宮位[命盤.格局.坐貴向貴.地支1].星曜架構.格局.push("坐貴向貴");
        命盤.地支宮位[命盤.格局.坐貴向貴.地支2].星曜架構.格局.push("坐貴向貴");
    } // end if 坐貴向貴
        
    
    // ------------ 魁鉞凶沖1 ------------
    var 魁鉞凶沖成立 = false; 
    if(_.contains(天魁屬性.互涉星曜, "天鉞") && 天魁屬性.煞重) {
        魁鉞凶沖成立 = true;
        命盤.格局.魁鉞凶沖.形態 = 1;
        命盤.格局.魁鉞凶沖.成立 = true;
        命盤.格局.魁鉞凶沖.地支1 = 天魁屬性.地支數;
        命盤.格局.魁鉞凶沖.宮位1 = 命盤.地支宮位[命盤.格局.魁鉞凶沖.地支1].宮位; 
        
        命盤.地支宮位[命盤.格局.魁鉞凶沖.地支1].星曜架構.格局.push("魁鉞凶沖");
    } // end if 魁鉞凶沖1
    
    // ------------ 魁鉞凶沖2 ------------
    if(_.contains(天鉞屬性.互涉星曜, "天魁") && 天鉞屬性.煞重) {
        魁鉞凶沖成立 = true;
        命盤.格局.魁鉞凶沖.形態 = 2;
        
        if(!魁鉞凶沖成立){
            命盤.格局.魁鉞凶沖.地支1 = 天鉞屬性.地支數;
            命盤.格局.魁鉞凶沖.宮位1 = 命盤.地支宮位[命盤.格局.魁鉞凶沖.地支1].宮位;
            命盤.地支宮位[命盤.格局.魁鉞凶沖.地支1].星曜架構.格局.push("魁鉞凶沖");
        }  // end if 魁鉞凶沖不曾在天魁成立
        
        if(魁鉞凶沖成立) {
            命盤.格局.魁鉞凶沖.地支2 = 天鉞屬性.地支數;
            命盤.格局.魁鉞凶沖.宮位2 = 命盤.地支宮位[命盤.格局.魁鉞凶沖.地支2].宮位;
            命盤.地支宮位[命盤.格局.魁鉞凶沖.地支2].星曜架構.格局.push("魁鉞凶沖");
        }  // end if 魁鉞凶沖已經在天魁成立
    } // end if 魁鉞凶沖2
    
    
    
    // ------------ 貴星夾命2， 貴星夾命1屬於日月夾命，同時又輔弼夾------------
    
     if(命盤.生年天干=="丙" || 命盤.生年天干=="丁" || 命盤.生年天干=="壬" || 命盤.生年天干=="癸") {  // 丙丁夾戌宮；壬癸夾辰宮
        if(命盤.生年天干=="丙" || 命盤.生年天干=="丁") { 
            if(星曜矩陣所含星曜(命盤.地支宮位[11].星曜本宮借宮.所有 , ["恩光", "天貴"], "&&")) {
                命盤.格局.貴星夾命.成立 = true;
                命盤.格局.貴星夾命.形態 = 1;
                命盤.格局.貴星夾命.地支1 = 11;
                命盤.格局.貴星夾命.宮位1 = 命盤.地支宮位[命盤.格局.貴星夾命.地支1].宮位;
                命盤.地支宮位[命盤.格局.貴星夾命.地支1].星曜架構.格局.push("貴星夾命");
            } // end if 戌宮得 恩光、天貴
        } // end if 丙丁

        if(命盤.生年天干=="壬" || 命盤.生年天干=="癸") { 
            if(星曜矩陣所含星曜(命盤.地支宮位[5].星曜本宮借宮.所有 , ["恩光", "天貴"], "&&")) {
                命盤.格局.貴星夾命.成立 = true;
                命盤.格局.貴星夾命.形態 = 2;
                命盤.格局.貴星夾命.地支1 = 5;
                命盤.格局.貴星夾命.宮位1 = 命盤.地支宮位[命盤.格局.貴星夾命.地支1].宮位;
                命盤.地支宮位[命盤.格局.貴星夾命.地支1].星曜架構.格局.push("貴星夾命");
            } // end if 辰宮得 恩光、天貴
        } // end if 丙丁
         
     }  // end if 貴星夾命2
    


    // ------------ 文桂文華 ------------
    if(文昌屬性.地支數 == 文曲屬性.地支數) {  //只可能在丑未宮發生，卯時生
        命盤.格局.文桂文華.成立 = true;
        命盤.格局.文桂文華.地支1 = 文昌屬性.地支數;
        命盤.格局.文桂文華.宮位1 = 命盤.地支宮位[命盤.格局.文桂文華.地支1].宮位; 
        
        命盤.地支宮位[命盤.格局.文桂文華.地支1].星曜架構.格局.push("文桂文華");
    } // end if 文桂文華
    
    
    // ------------ 輔拱文星 ------------
    if(_.contains(文昌屬性.互涉星曜, "左輔") && !文昌屬性.煞重 && (文昌屬性.地支數 == 天府屬性.地支數 || 文昌屬性.地支數 == 天相屬性.地支數)) {
        命盤.格局.輔拱文星.成立 = true;
        命盤.格局.輔拱文星.地支1 = 文昌屬性.地支數;
        命盤.格局.輔拱文星.宮位1 = 命盤.地支宮位[命盤.格局.輔拱文星.地支1].宮位; 
        
        命盤.地支宮位[命盤.格局.輔拱文星.地支1].星曜架構.格局.push("輔拱文星");
    } // end if 輔拱文星
    
    
    // ------------ 文星暗拱 ------------
    for(var j=0; j<12; j++) {
        if(命盤.地支宮位[j].星曜架構.對星.昌曲.相夾 && !命盤.地支宮位[j].星曜架構.諸星群.煞曜.煞重) {
            命盤.格局.文星暗拱.成立 = true;
            命盤.格局.文星暗拱.地支1 = j;
            命盤.格局.文星暗拱.宮位1 = 命盤.地支宮位[j].宮位;
            
            命盤.地支宮位[j].星曜架構.格局.push("文星暗拱");
        }  // end if 成立
    } // end for j，文星暗拱
    
    
    
    // ------------ 火鈴夾命、空劫夾命、羊陀夾忌 ------------
    
    for(var j=0; j<12; j++) {
        // ------------ 火鈴夾命 ------------
        if(命盤.地支宮位[j].星曜架構.對星.火鈴.相夾) {
            命盤.格局.火鈴夾命.成立 = true;
            命盤.格局.火鈴夾命.地支1 = j;
            命盤.格局.火鈴夾命.宮位1 = 命盤.地支宮位[j].宮位;
            
            命盤.地支宮位[j].星曜架構.格局.push("火鈴夾命");
        }  // end if 成立
        
        // ------------ 空劫夾命 ------------
        if(命盤.地支宮位[j].星曜架構.對星.空劫.相夾) {
            格局名稱 = "空劫夾命";
            命盤.格局.空劫夾命.成立 = true;
            命盤.格局.空劫夾命.地支1 = j;
            命盤.格局.空劫夾命.宮位1 = 命盤.地支宮位[j].宮位;
            
            if(星曜矩陣所含星曜(命盤.地支宮位[j].星曜本宮.所有 , ["文昌", "文曲"], "||")) 格局名稱 = "文星遇夾";
            命盤.地支宮位[j].星曜架構.格局.push(格局名稱);
        }  // end if 成立
        
        
        // ------------ 羊陀夾忌 ------------
        if(命盤.地支宮位[j].星曜架構.對星.羊陀.夾忌) {
            命盤.格局.羊陀夾忌.成立 = true;
            命盤.格局.羊陀夾忌.地支1 = j;
            命盤.格局.羊陀夾忌.宮位1 = 命盤.地支宮位[j].宮位;
            
            命盤.地支宮位[j].星曜架構.格局.push("羊陀夾忌");
        }  // end if 成立
        
    } // end for j， 火鈴夾命、空劫夾命、羊陀夾忌
    
    
    
    // ------------ 權煞化祿1 ------------
    if(火星屬性.地支數 == 擎羊屬性.地支數 && (火星屬性.廟陷數>=4 && 擎羊屬性.廟陷數>=4) && 命盤.地支宮位[火星屬性.地支數].無主星) {
        命盤.格局.權煞化祿.成立 = true;
        命盤.格局.權煞化祿.形態 = 1;
        命盤.格局.權煞化祿.地支1 = 火星屬性.地支數;
        命盤.格局.權煞化祿.宮位1 = 命盤.地支宮位[命盤.格局.權煞化祿.地支1].宮位; 
        格局名稱 = "權煞化祿";
        
        if(火星屬性.吉化) 命盤.格局.權煞化祿.形態 = 3;
        if(火星屬性.煞重) { 命盤.格局.權煞化祿.形態 = -1; 命盤.格局.權煞化祿.破格 = true;  格局名稱 = "權煞化祿[破格]" };
        
        命盤.地支宮位[命盤.格局.權煞化祿.地支1].星曜架構.格局.push(格局名稱);
    } // end if 權煞化祿 1
    
    // ------------ 權煞化祿2 ------------
    if(鈴星屬性.地支數 == 陀羅屬性.地支數 && (鈴星屬性.廟陷數>=4 && 陀羅屬性.廟陷數>=4) && 命盤.地支宮位[鈴星屬性.地支數].無主星) {
        命盤.格局.權煞化祿.成立 = true;
        命盤.格局.權煞化祿.形態 = 2;
        命盤.格局.權煞化祿.地支1 = 鈴星屬性.地支數;
        命盤.格局.權煞化祿.宮位1 = 命盤.地支宮位[命盤.格局.權煞化祿.地支1].宮位; 
        格局名稱 = "權煞化祿";
        
        if(鈴星屬性.吉化) 命盤.格局.權煞化祿.形態 = 4;
        if(鈴星屬性.煞重) { 命盤.格局.權煞化祿.形態 = -1; 命盤.格局.權煞化祿.破格 = true;  格局名稱 = "權煞化祿[破格]" };
        
        命盤.地支宮位[命盤.格局.權煞化祿.地支1].星曜架構.格局.push(格局名稱);
    } // end if 權煞化祿 2
    
    
    // ------------ 命裏逢凶1 ------------
    if(命盤.地支宮位[6].無主星 && 地空屬性.地支數 == 6 && 地劫屬性.地支數 == 6) {  // 巳宫
        命盤.格局.命裏逢凶.成立 = true;
        命盤.格局.命裏逢凶.形態 = 1;
        命盤.格局.命裏逢凶.地支1 = 6;
        命盤.格局.命裏逢凶.宮位1 = 命盤.地支宮位[命盤.格局.命裏逢凶.地支1].宮位; 
        
        命盤.地支宮位[命盤.格局.命裏逢凶.地支1].星曜架構.格局.push("命裏逢凶");
    } // end if 命裏逢凶1 
    
    
    if(命盤.地支宮位[0].無主星 && 地空屬性.地支數 == 0 && 地劫屬性.地支數 == 0) {  //亥宫
        命盤.格局.命裏逢凶.成立 = true;
        命盤.格局.命裏逢凶.形態 = 2;
        命盤.格局.命裏逢凶.地支1 = 0;
        命盤.格局.命裏逢凶.宮位1 = 命盤.地支宮位[命盤.格局.命裏逢凶.地支1].宮位; 
        
        命盤.地支宮位[命盤.格局.命裏逢凶.地支1].星曜架構.格局.push("命裏逢凶");
    } // end if 命裏逢凶1 
    
    
    
    
    // ******************************************************
    // ********************** 宮位格局 ************************
    // ******************************************************
    
    // ------------ 命無正曜 ------------
    if(命盤.地支宮位[命盤.人事宮.命宮.地支數].無主星) {
        命盤.格局.命無正曜.成立 = true;
        命盤.格局.命無正曜.形態 = 1;
        命盤.格局.命無正曜.地支1 = 命盤.人事宮.命宮.地支數;
        命盤.格局.命無正曜.宮位1 = "命宮";
        格局名稱 = "命無正曜";
        
        命盤.地支宮位[命盤.格局.命無正曜.地支1].星曜架構.格局.push(格局名稱);
    } // end if 命無正曜
    
    
    // ------------ 左右同宮1 (命宮) ------------
    if(命盤.人事宮.命宮.地支數 == 左輔屬性.地支數 && 命盤.人事宮.命宮.地支數 == 右弼屬性.地支數) {
        命盤.格局.左右同宮.成立 = true;
        命盤.格局.左右同宮.形態 = 1;
        命盤.格局.左右同宮.地支1 = 命盤.人事宮.命宮.地支數;
        命盤.格局.左右同宮.宮位1 = "命宮";
        格局名稱 = "左右同宮";
        
        命盤.地支宮位[命盤.格局.左右同宮.地支1].星曜架構.格局.push(格局名稱);
    } // end if 左右同宮1
    
     // ------------ 左右同宮2 (身宮) ------------
    if(命盤.身宮地支數 == 左輔屬性.地支數 && 命盤.身宮地支數 == 右弼屬性.地支數) {
        命盤.格局.左右同宮.成立 = true;
        命盤.格局.左右同宮.形態 = 2;
        命盤.格局.左右同宮.地支1 = 命盤.身宮地支數;
        命盤.格局.左右同宮.宮位1 = "身宮";
        格局名稱 = "左右同宮";
        
        命盤.地支宮位[命盤.格局.左右同宮.地支1].星曜架構.格局.push(格局名稱);
    } // end if 左右同宮1
    
    
    // ------------ 魁钺夹命 ------------
    if(命盤.地支宮位[命盤.人事宮.命宮.地支數].星曜架構.對星.魁鉞.相夾 && 命盤.格局.貴星夾命.地支1 != 命盤.人事宮.命宮.地支數) {  // 貴星夾命沒有在命宮成立才論魁鉞夾命
        命盤.格局.魁钺夹命.成立 = true;
        命盤.格局.魁钺夹命.形態 = 1;
        命盤.格局.魁钺夹命.地支1 = 命盤.人事宮.命宮.地支數;
        命盤.格局.魁钺夹命.宮位1 = "命宮";
        格局名稱 = "魁钺夹命";
        
        命盤.地支宮位[命盤.格局.魁钺夹命.地支1].星曜架構.格局.push(格局名稱);
    } // end if 魁钺夹命
    
    // ------------ 文星拱命1 (命宮)------------
    if((命盤.人事宮.命宮.地支 == "亥" || 命盤.人事宮.命宮.地支 == "子" || 命盤.人事宮.命宮.地支 == "丑") && 命盤.人事宮.命宮.地支數 == 文昌屬性.地支數) {
        命盤.格局.文星拱命.成立 = true;
        命盤.格局.文星拱命.形態 = 1;
        命盤.格局.文星拱命.地支1 = 命盤.人事宮.命宮.地支數;
        命盤.格局.文星拱命.宮位1 = "命宮";
        格局名稱 = "文星拱命";
        
        if(文昌屬性.四化 == "化忌") { 命盤.格局.文星拱命.形態 = -1; 命盤.格局.文星拱命.破格 = true;  格局名稱 = "文星拱命[破格]" };
        if(文昌屬性.煞重) { 命盤.格局.文星拱命.形態 = -2; 命盤.格局.文星拱命.破格 = true;  格局名稱 = "文星拱命[破格]" };
        
        命盤.地支宮位[命盤.格局.文星拱命.地支1].星曜架構.格局.push(格局名稱);
    }  // end if 文星拱命1
    
    // ------------ 文星拱命2 (身宮)------------
    if((命盤.身宮地支數 == 0 || 命盤.身宮地支數 == 1 || 命盤.身宮地支數 == 2) && 命盤.身宮地支數 == 文昌屬性.地支數) {
        命盤.格局.文星拱命.成立 = true;
        命盤.格局.文星拱命.形態 = 2;
        命盤.格局.文星拱命.地支1 = 命盤.身宮地支數;
        命盤.格局.文星拱命.宮位1 = "身宮";
        格局名稱 = "文星拱命";
        
        if(文昌屬性.四化 == "化忌") { 命盤.格局.文星拱命.形態 = -1; 命盤.格局.文星拱命.破格 = true;  格局名稱 = "文星拱命[破格]" };
        if(文昌屬性.煞重) { 命盤.格局.文星拱命.形態 = -2; 命盤.格局.文星拱命.破格 = true;  格局名稱 = "文星拱命[破格]" };
        
        命盤.地支宮位[命盤.格局.文星拱命.地支1].星曜架構.格局.push(格局名稱);
    }  // end if 文星拱命2
    
    
    
    // ------------ 祿居奴僕 ------------
    if(_.contains(命盤.地支宮位[命盤.人事宮.交友宮.地支數].星曜本宮.所有, "祿存")) {
        命盤.格局.祿居奴僕.成立 = true;
        //命盤.格局.祿居奴僕.形態 = 1;
        命盤.格局.祿居奴僕.地支1 = 命盤.人事宮.交友宮.地支數;
        命盤.格局.祿居奴僕.宮位1 = 命盤.地支宮位[命盤.格局.祿居奴僕.地支1].宮位; 
        
        命盤.地支宮位[命盤.格局.祿居奴僕.地支1].星曜架構.格局.push("祿居奴僕");
    } // end if 祿居奴僕
    
    
} // end function 宮位格局分析












//ref function
// 星曜矩陣所含星曜(天馬屬性.互涉星曜, ["擎羊", "火星", "鈴星", "地空", "地劫", "截路", "空亡"], "||")
// 星曜矩陣所含星曜(命盤.地支宮位[11].星曜本宮借宮.所有 , ["恩光", "天貴"], "&&")
// _.contains(天魁屬性.互涉星曜, "天鉞")

// http://www.ziweixueyuan.com/category/geju
// http://www.zhuqiyang.com/alist/125
