function 斗數三合命盤架構(輸入資料, 系統設定){
    //this.運行參數=new 系統參數設定();

    var 輸入生日 = new 日期格式(輸入資料.西曆日期);
    var 干支曆 = 西曆轉換干支曆(輸入資料);
    var 農曆 = 西曆轉換農曆(輸入資料.西曆日期, "", true, false, false, false, false);
    var 陰曆 = 農曆轉換陰曆(農曆);
    var ErrorLog = [];

    var 曆法={
        "干支曆": 干支曆,
        "農曆": 農曆,
        "陰曆": 陰曆,
        "備註": ""
    } // end 曆法 obj

    //***************************** 設定 *****************************
    this.設定 = 系統設定.設定.用戶設定.三合派;
    this.定義 = 系統設定.設定.用戶設定.定義;
    
    //***************************** 生日 *****************************
    //this.姓名=輸入資料.姓名;
    this.輸入資料 = 輸入資料;
    this.曆法 = 曆法;
    this.運行 = {
        "大限數": -1,  // 現行的大限數
        "選擇的大限數": -1,  //用戶選擇的大限數
        "選擇的大限地支數": -1,
        "選擇的大限流年數": -1,  //用戶選擇的大限流年
        "選擇的大限流年地支數": -1,
        "星曜註解": "",
        "流年數": -1,
        "流年地支數": -1,
        "大限流年矩陣數": -1,
        "大限": false,  // 是否顯示了大限
        "流年": false,
        "流年干支": "",
        "中宮菜單": 1,  //center court menu
        "宮干MouseDown": -1,  // 那個地支的宮干是mousedown
        "大限流曜顯示": false,
        "流年流曜顯示": false,
    }; // end this.運行

    var 調整陰曆時 = (曆法.陰曆.時.length > 1) ? 曆法.陰曆.時.substr(1,1) : 曆法.陰曆.時;  //去掉早子夜子
    
    this.生日 = {
        "西曆生日": 輸入資料.西曆日期,
        "運算生日": 曆法.干支曆.運算的西曆,
        "西曆生日格式": new 日期格式(輸入資料.西曆日期),
        "西曆年": 輸入生日.Year,
        "生日年": (曆法.陰曆.騎年) ? 輸入生日.Year - 1 : 輸入生日.Year,
        "西曆月": 輸入生日.Month,
        "西曆日": 輸入生日.Day,
        "西曆時": 輸入生日.Hour,
        "西曆分": 輸入生日.Minute,
        "西曆中文": (輸入資料.西曆日期.getSeconds()==1) ? 輸入生日.西曆日期 : 輸入生日.西曆, //西曆顯示, //輸入生日.西曆,
        "西曆英文": 輸入生日.MalaysiaDate,
        "性別": 輸入資料.性別,
        "男命": (this.性別 == "男"),
        "女命": (this.性別 == "女"),
        "星座": 尋星座(輸入生日.Month, 輸入生日.Day, 1),
        "星座代號": 尋星座(輸入生日.Month, 輸入生日.Day, 3), //zodiac sign
        "陰曆": 曆法.陰曆.陰曆日期,
        "陰曆年": 曆法.陰曆.干支年,
        "陰曆月": 曆法.陰曆.月,
        "陰曆計算月": 曆法.陰曆.月,  //default
        "陰曆閏月": 曆法.陰曆.閏月,
        "陰曆日": 曆法.陰曆.日,
        "陰曆時": 調整陰曆時,
        "陰曆時數": 地支字數轉換(調整陰曆時),
        "生肖": 曆法.陰曆.生肖,
        "閏年": 曆法.陰曆.閏年,
        "四季": "",
        "上弦月": false,
        "下弦月": false,
        "日生人": false,
        "夜生人": 曆法.陰曆.閏年,
        "備註": ""
    };  //end this.生日
    
    
    if(this.生日.陰曆閏月 !=0) {
        switch(this.設定.閏月月份計算){
            case 1:
                this.生日.陰曆計算月 = 十二滾動(this.生日.陰曆月, 1);
                break;
            case 2:
                if(this.生日.陰曆日 > 15) this.生日.陰曆計算月 = 十二滾動(this.生日.陰曆月, 1);
                break;
        } //end switch
    } // end if
    
    // ***** 四季、上弦月、下弦月、日生人、夜生人 *****
    var 生月地支 = 曆法.干支曆.四柱.substr(3,1);
    switch(生月地支) {
        case "寅": case "卯": case "辰":  this.生日.四季 = "春"; break;
        case "巳": case "午": case "未":  this.生日.四季 = "夏"; break;
        case "申": case "酉": case "戌":  this.生日.四季 = "秋"; break;
        case "亥": case "子": case "丑":  this.生日.四季 = "冬";
    } // end switch 生月地支 for 四季
    
    if(this.生日.陰曆日<16) this.生日.上弦月 = true;
    if(this.生日.陰曆日>15) this.生日.下弦月 = true;
    
    switch(this.生日.陰曆時) {
        case "寅": case "卯": case "辰": case "巳": case "午": case "未": this.生日.日生人 = true; break;
        case "申": case "酉": case "戌": case "亥": case "子": case "丑": this.生日.夜生人 = true;
    } // end switch 陰曆時 for 日夜生人
    
    
    // ***** 八字 *****
    this.八字 = 曆法.干支曆.四柱;
    this.日主 = 曆法.干支曆.四柱.substr(4,1);
    this.命局 = new 命局元件();
    this.生年天干 = this.生日.陰曆年.substr(0,1);
    this.生年地支 = this.生日.陰曆年.substr(1,1);
    this.生年天干數 = 天干字數轉換(this.生年天干);
    this.陽男陰女 = 尋陽男陰女(this.生日.性別, this.生日.陰曆年.substr(1,1)); //same function from std
    this.行運順逆 = 尋行運順逆(this.陽男陰女);  //same function from std
    this.命宮地支數 = 尋命宮地支數(this.生日.陰曆計算月, this.生日.陰曆時);  //same function from std
    this.身宮地支數 = 尋身宮地支數(this.生日.陰曆計算月, this.生日.陰曆時);  //same function from std
    
    this.人事宮 = new 三合人事宮位();
    this.星曜 = new 三合星曜初始();
    this.中宮;
    
    this.地支宮位 = [];  // 12 地支宮位的矩陣
    for(var i=0; i<12; i++){
        this.地支宮位.push(new 三合地支宮位元件(i));
    }  // end for i
	
	
    填寫宮干四化(this.地支宮位, this.生年天干數);  // 填寫12地支宮位的宮干, same function from std
    填寫人事宮位(this.地支宮位, this.人事宮, this.命宮地支數);

    this.五行局 = 尋五行局(this.人事宮.命宮.天干數, this.人事宮.命宮.地支數);
    var 命主星矩陣 = ["貪狼", "巨門", "祿存", "文曲", "廉貞", "武曲", "破軍", "武曲", "廉貞", "文曲", "祿存", "巨門"];
    var 身主星矩陣 = ["火星", "天相", "天梁", "天同", "文昌", "天機", "火星", "天相", "天梁", "天同", "文昌", "天機"];
    this.命主星 = 命主星矩陣[地支滾動(this.命宮地支數,-1)];
    this.身主星 = 身主星矩陣[地支滾動(地支字數轉換(this.生年地支),-1)];
    var 斗君月支 = 地支滾動(this.命宮地支數, (-1)*(this.生日.陰曆計算月-1));
    var 斗君地支數 = 地支滾動(斗君月支, 地支滾動(地支字數轉換(this.生日.陰曆時), -1));
    this.斗君 = 地支字數轉換(斗君地支數);

    
    var 安星元件 = {
        "紫微地支": 尋紫微地支(this.生日.陰曆日, this.五行局.局名),
        "生年天干": this.生年天干,
        "生年地支": this.生年地支,
        "生月": this.生日.陰曆計算月,
        "生日": this.生日.陰曆日,
        "生時": this.生日.陰曆時,
        "命宮地支數": this.命宮地支數,
        "身宮地支數": this.身宮地支數,
        "五行局": this.五行局.局名,
        "男女": this.陽男陰女
    };
    
    //shhpIntegrityAudit(this.設定.hash, this.設定.imghash, this.設定.橫盤橫幅, 安星元件, 系統.設定.運行狀態);
    
    安三合星曜(安星元件, this.地支宮位, this.星曜);
    
    this.生年四化 = new 三合四化(安星元件.生年天干, this.地支宮位, this.星曜, this.設定.四化門派);
    
    this.星曜[this.生年四化.化祿星].四化 = "化祿"; this.星曜[this.生年四化.化祿星].化祿權科 = true; this.星曜["化祿"].地支 = this.生年四化.化祿星地支; this.星曜["化祿"].地支數 = 地支字數轉換(this.生年四化.化祿星地支); this.星曜["化祿"].宮位 = this.地支宮位[this.星曜["化祿"].地支數].宮位; this.星曜["化祿"].星曜 = this.生年四化.化祿星;
    this.星曜[this.生年四化.化權星].四化 = "化權"; this.星曜[this.生年四化.化權星].化祿權科 = true; this.星曜["化權"].地支 = this.生年四化.化權星地支; this.星曜["化權"].地支數 = 地支字數轉換(this.生年四化.化權星地支); this.星曜["化權"].宮位 = this.地支宮位[this.星曜["化權"].地支數].宮位; this.星曜["化權"].星曜 = this.生年四化.化權星;
    this.星曜[this.生年四化.化科星].四化 = "化科"; this.星曜[this.生年四化.化科星].化祿權科 = true; this.星曜["化科"].地支 = this.生年四化.化科星地支; this.星曜["化科"].地支數 = 地支字數轉換(this.生年四化.化科星地支); this.星曜["化科"].宮位 = this.地支宮位[this.星曜["化科"].地支數].宮位; this.星曜["化科"].星曜 = this.生年四化.化科星;
    this.星曜[this.生年四化.化忌星].四化 = "化忌"; this.星曜["化忌"].地支 = this.生年四化.化忌星地支; this.星曜["化忌"].地支數 = 地支字數轉換(this.生年四化.化忌星地支); this.星曜["化忌"].宮位 = this.地支宮位[this.星曜["化忌"].地支數].宮位; this.星曜["化忌"].星曜 = this.生年四化.化忌星;
    
    this.地支宮位[this.星曜["化祿"].地支數].星曜.四化星.push("化祿");
    this.地支宮位[this.星曜["化權"].地支數].星曜.四化星.push("化權");
    this.地支宮位[this.星曜["化科"].地支數].星曜.四化星.push("化科");
    this.地支宮位[this.星曜["化忌"].地支數].星曜.四化星.push("化忌");
    
    this.格局 = 三合格局建立();  // 三合格局分析.js
    
    this.大限 = []; 
    for(var i=0; i<13; i++){
        this.大限.push(new 三合大限元件(i));
    }  // end for i
	
    
    安三合大限(this.大限, this.生日.陰曆年, this.命宮地支數, this.五行局.局數, this.陽男陰女, this.地支宮位, this.星曜, this.設定.四化門派);
    
    安三合流年(this);
	
    計算當下大限流年(this.生日.生日年, this.五行局.局數, this.運行, this.大限);
    

    // -------------------- 架構分析 --------------------

    this.一四四局數 = (地支滾動(this.星曜.紫微.地支數, -1) * 12) + this.命宮地支數;
    三合命盤架構分析(this);
	
    
    
    // **************************
    // *        其他雜項分析      *
    // **************************
    
    this.雜項論命 = 雜項算命主控(輸入資料.西曆日期, this.陽男陰女.substr(1,1));

} // end function 斗數三合命盤架構


// ------------------------------



function 安三合大限(大限, 生年干支, 命宮地支數, 五行局數, 男女, 地支矩陣, 星曜元件, 四化派別){
    //var 命宮地支數 = 命盤.命宮地支數;
    //var 五行局數 = 命盤.五行局.局數;
    var 順逆 = (男女 == "陽男" || 男女 == "陰女") ? 1 : -1;
    var 歲數句 = "", 地支數;
    var 歲數分段;
    
    for(var i=1; i<13; i++){
        歲數句 = (五行局數 + (i-1)*10).toString() + " - " + ((五行局數 + 9) + (i-1)*10).toString();
        歲數分段 = 歲數句.split(" - ");
        大限[i].歲數段 = 歲數句;
        大限[i].限始歲 = Number(歲數分段[0]);
        大限[i].限終歲 = Number(歲數分段[1]);
        大限[i].地支數 = 地支滾動(命宮地支數, (i-1) * 順逆);
		大限[i].大限名 = "第" + i + "大限";
		大限[i].宮位干支 = 地支矩陣[大限[i].地支數].宮干 + 地支矩陣[大限[i].地支數].地支;
		大限[i].四化 = new 三合四化(地支矩陣[大限[i].地支數].宮干, 地支矩陣, 星曜元件, 四化派別);
        大限[i].流曜 = new 三合流曜 (地支矩陣[大限[i].地支數].宮干, 地支矩陣[大限[i].地支數].地支, "大限");
        
        // *** 移植到地支宮位矩陣 ***
        地支矩陣[大限[i].地支數].大限數 = 大限[i].大限數;
        地支矩陣[大限[i].地支數].大限歲數段 = 大限[i].歲數段;
		
		// 填寫大限的宮位地支數 --- to remove later on
		大限[i].人事宮.命宮 = 大限[i].地支數;
		大限[i].人事宮.兄弟宮 = 地支滾動(大限[i].地支數, -1);
		大限[i].人事宮.夫妻宮 = 地支滾動(大限[i].地支數, -2);
		大限[i].人事宮.子女宮 = 地支滾動(大限[i].地支數, -3);
		大限[i].人事宮.財帛宮 = 地支滾動(大限[i].地支數, -4);
		大限[i].人事宮.疾厄宮 = 地支滾動(大限[i].地支數, -5);
		大限[i].人事宮.遷移宮 = 地支滾動(大限[i].地支數, -6);
		大限[i].人事宮.交友宮 = 地支滾動(大限[i].地支數, -7);
		大限[i].人事宮.官祿宮 = 地支滾動(大限[i].地支數, -8);
		大限[i].人事宮.田宅宮 = 地支滾動(大限[i].地支數, -9);
		大限[i].人事宮.福德宮 = 地支滾動(大限[i].地支數, -10);
		大限[i].人事宮.父母宮 = 地支滾動(大限[i].地支數, -11);
        
        // 填寫大限的宮位資料
        大限[i].宮位.命宮.地支數 = 大限[i].地支數;
        大限[i].宮位.命宮.本命宮名 = 地支矩陣[大限[i].宮位.命宮.地支數].宮位;
        大限[i].宮位.命宮.宮位重疊 = "大限命宮重疊" + 地支矩陣[大限[i].宮位.命宮.地支數].宮位;
        
        大限[i].宮位.兄弟宮.地支數 = 地支滾動(大限[i].地支數, -1);;
        大限[i].宮位.兄弟宮.本命宮名 = 地支矩陣[大限[i].宮位.兄弟宮.地支數].宮位;
        大限[i].宮位.兄弟宮.宮位重疊 = "大限兄弟宮重疊" + 地支矩陣[大限[i].宮位.兄弟宮.地支數].宮位;
        
        大限[i].宮位.夫妻宮.地支數 = 地支滾動(大限[i].地支數, -2);;
        大限[i].宮位.夫妻宮.本命宮名 = 地支矩陣[大限[i].宮位.夫妻宮.地支數].宮位;
        大限[i].宮位.夫妻宮.宮位重疊 = "大限夫妻宮重疊" + 地支矩陣[大限[i].宮位.夫妻宮.地支數].宮位;
        
        大限[i].宮位.子女宮.地支數 = 地支滾動(大限[i].地支數, -3);;
        大限[i].宮位.子女宮.本命宮名 = 地支矩陣[大限[i].宮位.子女宮.地支數].宮位;
        大限[i].宮位.子女宮.宮位重疊 = "大限子女宮重疊" + 地支矩陣[大限[i].宮位.子女宮.地支數].宮位;
        
        大限[i].宮位.財帛宮.地支數 = 地支滾動(大限[i].地支數, -4);;
        大限[i].宮位.財帛宮.本命宮名 = 地支矩陣[大限[i].宮位.財帛宮.地支數].宮位;
        大限[i].宮位.財帛宮.宮位重疊 = "大限財帛宮重疊" + 地支矩陣[大限[i].宮位.財帛宮.地支數].宮位;
        
        大限[i].宮位.疾厄宮.地支數 = 地支滾動(大限[i].地支數, -5);;
        大限[i].宮位.疾厄宮.本命宮名 = 地支矩陣[大限[i].宮位.疾厄宮.地支數].宮位;
        大限[i].宮位.疾厄宮.宮位重疊 = "大限疾厄宮重疊" + 地支矩陣[大限[i].宮位.疾厄宮.地支數].宮位;
        
        大限[i].宮位.遷移宮.地支數 = 地支滾動(大限[i].地支數, -6);;
        大限[i].宮位.遷移宮.本命宮名 = 地支矩陣[大限[i].宮位.遷移宮.地支數].宮位;
        大限[i].宮位.遷移宮.宮位重疊 = "大限遷移宮重疊" + 地支矩陣[大限[i].宮位.遷移宮.地支數].宮位;
        
        大限[i].宮位.交友宮.地支數 = 地支滾動(大限[i].地支數, -7);;
        大限[i].宮位.交友宮.本命宮名 = 地支矩陣[大限[i].宮位.交友宮.地支數].宮位;
        大限[i].宮位.交友宮.宮位重疊 = "大限交友宮重疊" + 地支矩陣[大限[i].宮位.交友宮.地支數].宮位;
        
        大限[i].宮位.官祿宮.地支數 = 地支滾動(大限[i].地支數, -8);;
        大限[i].宮位.官祿宮.本命宮名 = 地支矩陣[大限[i].宮位.官祿宮.地支數].宮位;
        大限[i].宮位.官祿宮.宮位重疊 = "大限官祿宮重疊" + 地支矩陣[大限[i].宮位.官祿宮.地支數].宮位;
        
        大限[i].宮位.田宅宮.地支數 = 地支滾動(大限[i].地支數, -9);;
        大限[i].宮位.田宅宮.本命宮名 = 地支矩陣[大限[i].宮位.田宅宮.地支數].宮位;
        大限[i].宮位.田宅宮.宮位重疊 = "大限田宅宮重疊" + 地支矩陣[大限[i].宮位.田宅宮.地支數].宮位;
        
        大限[i].宮位.福德宮.地支數 = 地支滾動(大限[i].地支數, -10);;
        大限[i].宮位.福德宮.本命宮名 = 地支矩陣[大限[i].宮位.福德宮.地支數].宮位;
        大限[i].宮位.福德宮.宮位重疊 = "大限福德宮重疊" + 地支矩陣[大限[i].宮位.福德宮.地支數].宮位;
        
        大限[i].宮位.父母宮.地支數 = 地支滾動(大限[i].地支數, -11);;
        大限[i].宮位.父母宮.本命宮名 = 地支矩陣[大限[i].宮位.父母宮.地支數].宮位;
        大限[i].宮位.父母宮.宮位重疊 = "大限父母宮重疊" + 地支矩陣[大限[i].宮位.父母宮.地支數].宮位;
    
    // *********** 填寫大限地支資料 ***********
        var 人事宮名 = "", 人事宮地支 = -1;
        for(var j=0; j<12; j++){
            人事宮名 = 人事宮字數轉換(j);
            人事宮地支 = 大限[i].人事宮[人事宮名];

            大限[i].地支[人事宮地支].人事宮 = 人事宮名;
            大限[i].地支[人事宮地支].本命人事宮 = 地支矩陣[人事宮地支].宮位;
            大限[i].地支[人事宮地支].六線 = 宮位轉六線(人事宮名);
            大限[i].地支[人事宮地支].三方 = 尋三合方(人事宮名).三合簡短;
            大限[i].地支[人事宮地支].本命三方 = 尋三合方(地支矩陣[人事宮地支].宮位).三合簡短;
        }  // end for j
    } // end for i


    // **** 填補尚未開運的童限資料 ****
    var 生年地支數 = 地支字數轉換(生年干支.substr(1,1));
    大限[0].地支數 = 生年地支數;
    大限[0].大限名 = "童限";
    大限[0].宮位干支 = 地支矩陣[生年地支數].宮干 + 地支矩陣[生年地支數].地支;
    
	大限[0].宮位.命宮.地支數 = 大限[0].地支數;
    大限[0].宮位.命宮.本命宮名 = 地支矩陣[大限[0].宮位.命宮.地支數].宮位;
    大限[0].宮位.命宮.宮位重疊 = "童限命宮重疊" + 地支矩陣[大限[0].宮位.命宮.地支數].宮位;
    
	大限[0].宮位.兄弟宮.地支數 = 地支滾動(大限[0].地支數, -1);
    大限[0].宮位.兄弟宮.本命宮名 = 地支矩陣[大限[0].宮位.兄弟宮.地支數].宮位;
    大限[0].宮位.兄弟宮.宮位重疊 = "童限兄弟宮重疊" + 地支矩陣[大限[0].宮位.兄弟宮.地支數].宮位;
    
	大限[0].宮位.夫妻宮.地支數 = 地支滾動(大限[0].地支數, -2);
    大限[0].宮位.夫妻宮.本命宮名 = 地支矩陣[大限[0].宮位.夫妻宮.地支數].宮位;
    大限[0].宮位.夫妻宮.宮位重疊 = "童限夫妻宮重疊" + 地支矩陣[大限[0].宮位.夫妻宮.地支數].宮位;
    
	大限[0].宮位.子女宮.地支數 = 地支滾動(大限[0].地支數, -3);
    大限[0].宮位.子女宮.本命宮名 = 地支矩陣[大限[0].宮位.子女宮.地支數].宮位;
    大限[0].宮位.子女宮.宮位重疊 = "童限子女宮重疊" + 地支矩陣[大限[0].宮位.子女宮.地支數].宮位;
    
	大限[0].宮位.財帛宮.地支數 = 地支滾動(大限[0].地支數, -4);
    大限[0].宮位.財帛宮.本命宮名 = 地支矩陣[大限[0].宮位.財帛宮.地支數].宮位;
    大限[0].宮位.財帛宮.宮位重疊 = "童限財帛宮重疊" + 地支矩陣[大限[0].宮位.財帛宮.地支數].宮位;
    
	大限[0].宮位.疾厄宮.地支數 = 地支滾動(大限[0].地支數, -5);
    大限[0].宮位.疾厄宮.本命宮名 = 地支矩陣[大限[0].宮位.疾厄宮.地支數].宮位;
    大限[0].宮位.疾厄宮.宮位重疊 = "童限疾厄宮重疊" + 地支矩陣[大限[0].宮位.疾厄宮.地支數].宮位;
    
	大限[0].宮位.遷移宮.地支數 = 地支滾動(大限[0].地支數, -6);
    大限[0].宮位.遷移宮.本命宮名 = 地支矩陣[大限[0].宮位.遷移宮.地支數].宮位;
    大限[0].宮位.遷移宮.宮位重疊 = "童限遷移宮重疊" + 地支矩陣[大限[0].宮位.遷移宮.地支數].宮位;
    
	大限[0].宮位.交友宮.地支數 = 地支滾動(大限[0].地支數, -7);
    大限[0].宮位.交友宮.本命宮名 = 地支矩陣[大限[0].宮位.交友宮.地支數].宮位;
    大限[0].宮位.交友宮.宮位重疊 = "童限交友宮重疊" + 地支矩陣[大限[0].宮位.交友宮.地支數].宮位;
    
	大限[0].宮位.官祿宮.地支數 = 地支滾動(大限[0].地支數, -8);
    大限[0].宮位.官祿宮.本命宮名 = 地支矩陣[大限[0].宮位.官祿宮.地支數].宮位;
    大限[0].宮位.官祿宮.宮位重疊 = "童限官祿宮重疊" + 地支矩陣[大限[0].宮位.官祿宮.地支數].宮位;
    
	大限[0].宮位.田宅宮.地支數 = 地支滾動(大限[0].地支數, -9);
    大限[0].宮位.田宅宮.本命宮名 = 地支矩陣[大限[0].宮位.田宅宮.地支數].宮位;
    大限[0].宮位.田宅宮.宮位重疊 = "童限田宅宮重疊" + 地支矩陣[大限[0].宮位.田宅宮.地支數].宮位;
    
	大限[0].宮位.福德宮.地支數 = 地支滾動(大限[0].地支數, -10);
    大限[0].宮位.福德宮.本命宮名 = 地支矩陣[大限[0].宮位.福德宮.地支數].宮位;
    大限[0].宮位.福德宮.宮位重疊 = "童限福德宮重疊" + 地支矩陣[大限[0].宮位.福德宮.地支數].宮位;
    
	大限[0].宮位.父母宮.地支數 = 地支滾動(大限[0].地支數, -11);
    大限[0].宮位.父母宮.本命宮名 = 地支矩陣[大限[0].宮位.父母宮.地支數].宮位;
    大限[0].宮位.父母宮.宮位重疊 = "童限父母宮重疊" + 地支矩陣[大限[0].宮位.父母宮.地支數].宮位;

} //end function 安大限


function 安三合流年(命盤){

    var 大限矩陣 = 命盤.大限;    
	var 生年地支數 = 地支字數轉換(命盤.生日.陰曆年.substr(1,1));
	var 起運地支數 = 地支滾動(生年地支數, 命盤.五行局.局數 -2);
	var 起歲 = 命盤.五行局.局數; 
	var 起運年 = 命盤.生日.生日年 + 命盤.五行局.局數 - 1;
    var 小限起支數 = -1;
    var 小限順逆 = (命盤.陽男陰女.substr(1,1) == "男") ? 1 : -1;
	var 流年西曆;
	
    switch(命盤.生年地支) {
        case "寅": case "午": case "戌":
            小限起支數 = 5; //辰
            break;
        case "申": case "子": case "辰":
            小限起支數 = 11; //戌
            break;
        case "巳": case "酉": case "丑":
            小限起支數 = 8; //未
            break;
        case "亥": case "卯": case "未":
            小限起支數 = 2; //丑
            break;
    } // end switch
    
	for(var i=1; i<12; i++){ // 從第1大限排起，排12個大限。0為童限
		for(var j=0; j<10; j++){
			流年西曆 = 起運年++;
			起運地支數 = 地支滾動(起運地支數, 1);
			大限矩陣[i].流年[j].歲數 = 起歲++;
			大限矩陣[i].流年[j].地支數 = 起運地支數;
			大限矩陣[i].流年[j].地支 = 地支字數轉換(起運地支數);
			大限矩陣[i].流年[j].西曆年 = 流年西曆;
			大限矩陣[i].流年[j].大限流年數 = j+1;
			大限矩陣[i].流年[j].流年干支 = 六十干支屬性((流年西曆 - 1923) % 60, "干支");
            大限矩陣[i].流年[j].天干 = 大限矩陣[i].流年[j].流年干支.substr(0,1);
            大限矩陣[i].流年[j].四化 = new 三合四化(大限矩陣[i].流年[j].天干, 命盤.地支宮位, 命盤.星曜, 命盤.設定.四化門派);
            大限矩陣[i].流年[j].流曜 = new 三合流曜(大限矩陣[i].流年[j].天干, 大限矩陣[i].流年[j].地支, "流年");
            大限矩陣[i].流年[j].小限地支數 = 地支滾動(小限起支數, (大限矩陣[i].流年[j].歲數 - 1)*小限順逆);
		}  // end for j, 流年數
	} // end for i, 大限數
	
    
    for(var i=0; i<命盤.五行局.局數; i++){  //童限
        大限矩陣[0].流年[i].歲數 = i+1;
        大限矩陣[0].流年[i].地支數 = 地支滾動(生年地支數, i);
        大限矩陣[0].流年[i].地支 = 地支字數轉換(大限矩陣[0].流年[i].地支數);
        大限矩陣[0].流年[i].西曆年 = 命盤.生日.生日年 + i;
        大限矩陣[0].流年[i].大限流年數 = i+1;
        大限矩陣[0].流年[i].流年干支 = 六十干支屬性((大限矩陣[0].流年[i].西曆年 - 1923) % 60, "干支");
        //大限矩陣[0].流年[i].流年天干十神 = 尋十神(大限矩陣[0].流年[i].流年干支.substr(0,1), 日主);
    } // end for 童限
} // end for function 安流年



function 計算三合當下大限流年(出生年份, 五行局數, 運行元件, 大限元件){
    
    // now yet use !!
    var 現在日期 = new Date();
    var 當下歲數 = 現在日期.getFullYear() - 出生年份 + 1;
    var StartAge, EndAge;
	
	//console.log(五行局數 + ", " + 當下歲數);
	
    for(var i=1; i < 13; i++){
        StartAge = (五行局數) + ((i-1) * 10);
		EndAge = (五行局數-1) + (i * 10);
		//console.log(i + ": Age:" + StartAge + " - " + EndAge);
        if (當下歲數 >= StartAge && 當下歲數 <= EndAge) {
            運行元件.大限數 = i;
            break;
        }  // end if 正常大限

        if(當下歲數 > 0 || 當下歲數 < 五行局數) {
            運行元件.大限數 = 0;  // 尚未開運
        }  // end if 童限

    }  // end for

    運行元件.流年數 = 現在日期.getFullYear();
    運行元件.歲數 = 當下歲數;
	//console.log(運行元件.大限數);
	//console.log(運行元件.流年數 + ", " +運行元件.歲數);
	
    for(var i=0; i < 10; i++){  //流年地支數
        if(大限元件[運行元件.大限數].流年[i].西曆年 == 運行元件.流年數) {
            運行元件.大限流年矩陣數 = i;
            break;
        }  // end if
    }  // end for 流年地支數

    //console.log(當下歲數);
    if (當下歲數>0) { // 尚未開運

		//console.log(運行元件.大限流年矩陣數);
		運行元件.流年干支 = 大限元件[運行元件.大限數].流年[運行元件.大限流年矩陣數].流年干支;
        運行元件.流年十神 = 大限元件[運行元件.大限數].流年[運行元件.大限流年矩陣數].流年天干十神;
		//console.log(運行元件.流年干支);
	}
    else {
        //console.log(運行元件.流年數);
        var 立春干支曆 = 萬年曆("立春干支曆", Number(運行元件.流年數));
        //console.log(立春干支曆);
        運行元件.流年干支 = 立春干支曆.substr(0,2);
        }

    運行元件.流年地支數 = 地支字數轉換(運行元件.流年干支.substr(1,1));
}  // end function 計算當下大限流年





// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
function 刷新三合星曜宮位(星曜, 地支宮位){
    //讀取星曜的地支數，然後從地支宮位導出人事宮位
    Object.keys(星曜).forEach(function (key) {
            //console.log(星曜[key].星曜 + ":"+ 星曜[key]['地支數']);
            星曜[key]['宮位'] = 地支宮位[星曜[key]['地支數']].宮位;
            星曜[key]['廟陷'] = 尋星曜廟陷(星曜[key]['星曜'], 地支字數轉換(星曜[key]['地支數']));
        });
}  //end function 尋星曜宮位


function 刷新三合宮位(人事宮, 地支宮位){
    //讀取星曜的地支數，然後從地支宮位導出人事宮位
    Object.keys(人事宮).forEach(function (key) {
            人事宮[key]['主星'] = 地支宮位[人事宮[key]['地支數']].主星;
            人事宮[key]['星曜'] = 地支宮位[人事宮[key]['地支數']].星曜;
            人事宮[key]['無主星'] = 地支宮位[人事宮[key]['地支數']].無主星;
            人事宮[key]['空宮'] = 地支宮位[人事宮[key]['地支數']].空宮;
        
            人事宮[key]['分析'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            //人事宮[key]['自化權'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            //人事宮[key]['自化科'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            //人事宮[key]['自化忌'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            人事宮[key]['自化'] = 人事宮[key]['自化祿'] || 人事宮[key]['自化權'] || 人事宮[key]['自化忌']; //不納入自化科
        
        });
}  //end function 刷新宮位



