function 尋沖自身六線(地支矩陣){
    // to delete
    var 宮位, 忌入宮位;
    var 相對父母宮, 相對疾厄宮, 相對兄弟宮, 相對交友宮, 相對子女宮, 相對田宅宮;
    for(var i=0; i<12; i++){
        宮位 = 地支矩陣[i].宮位;
        相對父母宮 = 人事宮位挪移(宮位, "父母宮"); 相對疾厄宮 = 人事宮位挪移(宮位, "疾厄宮");
        相對兄弟宮 = 人事宮位挪移(宮位, "兄弟宮"); 相對交友宮 = 人事宮位挪移(宮位, "交友宮");
        相對子女宮 = 人事宮位挪移(宮位, "子女宮"); 相對田宅宮 = 人事宮位挪移(宮位, "田宅宮");
        
        忌入宮位 = 地支矩陣[i].宮干四化.忌出.人事宮[0];
        if(忌入宮位 == 相對父母宮 || 忌入宮位 == 相對疾厄宮) 地支矩陣[i].宮干四化.沖光明線 = true;  //console.log(宮位 + "沖光明線");
        if(忌入宮位 == 相對兄弟宮 || 忌入宮位 == 相對交友宮) 地支矩陣[i].宮干四化.沖成就線 = true;  //console.log(宮位 + "沖成就線");
        if(忌入宮位 == 相對子女宮 || 忌入宮位 == 相對田宅宮) 地支矩陣[i].宮干四化.沖子田線 = true;  //console.log(宮位 + "沖子田線");
    } // end for
} // end function 尋沖自身六線


function 尋自化流出(地支矩陣, 星曜){
    // to delete
	for(var i=0; i<12; i++){
		// ××××× 自化 ×××××
		if(地支矩陣[i].宮干四化.祿出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化祿星].自化 ="祿";
			地支矩陣[i].宮干四化.自化祿 = true;
		}// end if

		if(地支矩陣[i].宮干四化.權出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化權星].自化 ="權";
			地支矩陣[i].宮干四化.自化權 = true;
		}// end if

		if(地支矩陣[i].宮干四化.科出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化科星].自化 ="科";
			地支矩陣[i].宮干四化.自化科 = true;
		}// end if

		if(地支矩陣[i].宮干四化.忌出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化忌星].自化 ="忌";
			地支矩陣[i].宮干四化.自化忌 = true;
		}// end if

		
		// ××××× 流出 ×××××
		if(地支矩陣[i].宮干四化.祿出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化祿星].流出 ="祿";
			地支矩陣[i].宮干四化.流出祿 = true;
		}// end if

		if(地支矩陣[i].宮干四化.權出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化權星].流出 ="權";
			地支矩陣[i].宮干四化.流出權 = true;
		}// end if

		if(地支矩陣[i].宮干四化.科出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化科星].流出 ="科";
			地支矩陣[i].宮干四化.流出科 = true;
		}// end if

		if(地支矩陣[i].宮干四化.忌出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化忌星].流出 ="忌";
			地支矩陣[i].宮干四化.流出忌 = true;
		}// end if
		
        if(地支矩陣[i].宮干四化.流出祿) 地支矩陣[i].宮干四化.流出矩陣.push("祿");
        if(地支矩陣[i].宮干四化.流出權) 地支矩陣[i].宮干四化.流出矩陣.push("權");
        //if(地支矩陣[i].宮干四化.流出科) 地支矩陣[i].宮干四化.流出矩陣.push("科");
        if(地支矩陣[i].宮干四化.流出忌) 地支矩陣[i].宮干四化.流出矩陣.push("忌");
	} // end for i
} //end function 尋自化流出



function 尋自身一六互沖(地支矩陣){
    var 宮位, 宮位六, 宮位六地支, 宮位忌沖地支, 宮位六忌入地支, 互沖線;
    
    for(var i=0; i<12; i++){
        宮位 = 地支矩陣[i].宮位;
        宮位六地支 = 地支滾動(i, -5);
        宮位忌沖地支 = 地支矩陣[i].宮干四化.忌出沖.地支數1;
        宮位六忌入地支 = 地支矩陣[宮位六地支].宮干四化.忌出.地支數1;
        
        if(宮位忌沖地支 == 宮位六忌入地支) {
            地支矩陣[i].宮干四化.一六互沖 = true;
            互沖線 = 地支矩陣[宮位忌沖地支].六線;
            //console.log(宮位 + "一六互沖於" + 互沖線);
        }  // end if
    } // end for
} // end function 尋自身一六互沖


// *****************************


function 化入祿權忌一六(命盤, 化出宮地支數, 借宮){
	// Input: 每個宮位飛出的化祿權忌的地支數，然後分析是否化入一六共宗位

	var 化入祿權忌 = {
		"成立": false, // 如果化入一六方成立 ！！
		"祿權": false,
		"祿忌": false,
		"祿權忌": false,
		"四化": "",  // 結論是化祿權、祿忌還是祿權忌
		"一六地支": "",
		"一六宮位": "",
		"一六大限宮位": "",
		"備註": ""
	} // end obj 化入祿權忌

	if(借宮===undefined || 借宮!=true) 借宮 = false;

	if(isNaN(化出宮地支數)) {
		命盤.ErrorLog.push("化入祿權忌一六: 化出宮的地支數錯誤：" + 化出宮地支數);
		return 化入祿權忌;
	} // end if 

	var 化祿地支 = 命盤.地支宮位[化出宮地支數].宮干四化.祿出.地支數1;
	var 化權地支 = 命盤.地支宮位[化出宮地支數].宮干四化.權出.地支數1;
	var 化忌地支 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出.地支數1;
	var 祿權差距數 = Math.abs(化祿地支 - 化權地支);
	var 祿忌差距數 = Math.abs(化祿地支 - 化忌地支);
	var 權忌差距數 = Math.abs(化權地支 - 化忌地支);

	var 一六共宗支數 = -1, 祿權一六支數 = -1, 祿忌一六支數 = -1;

	// ---- 檢測祿權 是否入一六 ----
	if(祿權差距數==7 || 祿權差距數==5) {
		化入祿權忌.祿權 = true;
		化入祿權忌.四化 = "祿權";
		祿權一六支數 = 尋一六方(化祿地支, 化權地支);
	}

	if(祿忌差距數==7 || 祿忌差距數==5) {
		化入祿權忌.祿忌 = true;
		化入祿權忌.四化 = "祿忌";
		祿忌一六支數 = 尋一六方(化祿地支, 化忌地支);
	}

	if(化入祿權忌.祿權 || 化入祿權忌.祿忌){
		化入祿權忌.成立 = true;
		if((化入祿權忌.祿權 && 化入祿權忌.祿忌) || (化入祿權忌.祿權 && (祿忌差距數==0 || 權忌差距數==0)) ){
			化入祿權忌.祿權忌 = true;
			化入祿權忌.四化 = "祿權忌";
		}  //end if  四化祿權忌

		if(祿權一六支數>-1) 一六共宗支數 = 祿權一六支數;
		if(祿忌一六支數>-1) 一六共宗支數 = 祿忌一六支數;

		化入祿權忌.一六地支 = 一六共宗支數;
		化入祿權忌.一六宮位 = 命盤.地支宮位[一六共宗支數].宮位;
	} // end if


	return 化入祿權忌;
} // end function 化入祿權忌一六



function 化忌沖化祿的六線(命盤, 化出宮, 大限數) {
	// 輸入化出宮（本命或大限），然後測試化忌是否有沖了化祿星的六線
	var 化出宮地支數 = -1;
	if(大限數 === undefined) 大限數 = 0;
	var 化出宮位 = 宮位分解(化出宮);
	var 化出宮位數 = 人事宮字數轉換(化出宮位.宮名);
	var 化出與化祿關係 = -1;

	if(化出宮位.流運 == "大限") 化出宮地支數=命盤.大限[大限數].人事宮[化出宮位.宮名];
	if(化出宮位.流運 == "") 化出宮地支數=命盤.人事宮[化出宮位.宮名].地支數;

	var 祿入地支 = 命盤.地支宮位[化出宮地支數].宮干四化.祿出.地支數1;
	var 祿入宮位 = 命盤.地支宮位[祿入地支].宮位;
	var 祿入宮位數 = 人事宮字數轉換(祿入宮位);
	var 忌沖地支 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出沖.地支數1;
	var 忌沖宮位 = 命盤.地支宮位[忌沖地支].宮位;
	var 忌沖宮位數 = 人事宮字數轉換(忌沖宮位);

	var 祿入地支光明線 = {
		"地支1": 地支滾動(祿入地支, 1),
		"地支2": 地支滾動(祿入地支, (1 + 6))
	};
	var 祿入地支子田線 = {
		"地支1": 地支滾動(祿入地支, 9),
		"地支2": 地支滾動(祿入地支, (9 - 6))
	};
	var 祿入地支成就線 = {
		"地支1": 地支滾動(祿入地支, -1),
		"地支2": 地支滾動(祿入地支, (-1 + 6))
	};

	var 祿入地支數挪前6 = 地支滾動(祿入宮位數, -7);
	var 祿入地支數挪後6 = 地支滾動(祿入宮位數, 5);

	if(化出宮位.宮名==祿入宮位) 化出與化祿關係 = 0; //祿入同類
	if(化出宮位數 == 祿入地支數挪前6) 化出與化祿關係 = 1; //化入化出宮的6，比方交友宮化入夫妻宮
	if(化出宮位數 == 祿入地支數挪後6) 化出與化祿關係 = 2; //化入化出宮的6，比方夫妻宮化入交友宮

	var 忌沖祿六線={
		"化出宮": 化出宮位.宮名,
		"化祿宮": 祿入宮位,
		"忌沖宮": 忌沖宮位,
		"化出與化祿關係": 化出與化祿關係,
		"沖光明線": false,
		"沖子田線": false,
		"沖成就線": false,
		"沖命遷線": false,
		"同宮": false,
		"沖線": "",
		"判斷句": "",
		"成立": false
	};

	if(忌沖地支 == 祿入地支光明線.地支1 || 忌沖地支 == 祿入地支光明線.地支2) {
		忌沖祿六線.沖光明線=true;
		忌沖祿六線.沖線="光明線";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿入" + 祿入宮位 + "，但忌沖它的光明線";
	}

	if(忌沖地支 == 祿入地支子田線.地支1 || 忌沖地支 == 祿入地支子田線.地支2) {
		忌沖祿六線.沖子田線=true;
		忌沖祿六線.沖線="子田線";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿入" + 祿入宮位 + "，但忌沖它的子田線";
	}

	if(忌沖地支 == 祿入地支成就線.地支1 || 忌沖地支 == 祿入地支成就線.地支2) {
		忌沖祿六線.沖成就線=true;
		忌沖祿六線.沖線="成就線";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿入" + 祿入宮位 + "，但忌沖它的成就線";
	}

	return 忌沖祿六線;

}  // end function 化忌沖化祿的六線









function 一六互沖(命盤, 人事宮){
    // ** to be deleted
	var 人事宮地支 = 命盤.人事宮[人事宮].地支數;
	var 人事宮的六的地支 = 地支滾動(人事宮地支, -5);
	var 人事宮的六忌入的地支 = 命盤.地支宮位[人事宮的六的地支].宮干四化.忌出.地支數1;
	var 人事宮忌沖地支 = 命盤.地支宮位[人事宮地支].宮干四化.忌出沖.地支數1;
	var 一相六沖 = {
		"成立": false,
		"六人事宮": 命盤.地支宮位[人事宮的六的地支].宮位,
		"一忌入地支": -1,
		"六忌入地支": -1
	}

	if(人事宮忌沖地支 == 人事宮的六忌入的地支) {
		 一相六沖.成立=true;
		 一相六沖.一忌入地支=命盤.地支宮位[人事宮地支].宮干四化.忌出.地支數1;
		 一相六沖.六忌入地支=人事宮的六忌入的地支;
	}

	//console.log(人事宮地支  + ", " + 一相六沖.一忌入地支);
	//console.log(人事宮的六的地支  + ", " + 一相六沖.六忌入地支);
	return  一相六沖;
} // end function 一六互沖


function 宮位互沖六線(命盤, 人事宮, 相對宮, 六線){
    // this one may be useless ................
	var 人事宮破他宮六線 = new 宮位飛四化元件();
	人事宮破他宮六線.化出宮 = 人事宮;
	人事宮破他宮六線.化出相對宮 = "";
	人事宮破他宮六線.四化 ="忌沖";
	人事宮破他宮六線.化入宮線 = 相對宮;
	人事宮破他宮六線.化入相對宮 = 六線;

	宮位單向四化(人事宮破他宮六線, 命盤);

	//console.log(人事宮破他宮六線.化出宮 + "與" + 相對宮 + ", " + 人事宮破他宮六線.成立); 

	var 他宮破人事宮六線 = new 宮位飛四化元件();
	他宮破人事宮六線.化出宮 = 相對宮;
	他宮破人事宮六線.化出相對宮 = "";
	他宮破人事宮六線.四化 ="忌沖";
	他宮破人事宮六線.化入宮線 =人事宮;
	他宮破人事宮六線.化入相對宮 = 六線;

	宮位單向四化(他宮破人事宮六線, 命盤);

	var 宮位相沖六線 = {
		"成立": false,
		"條件": "" 
	} // end 宮位相沖六線

	if (人事宮破他宮六線.成立 && 他宮破人事宮六線.成立) {
		宮位相沖六線.成立 = true;
		宮位相沖六線.條件 = 人事宮 + "與" + 相對宮 + "相互沖彼此的" + 六線;
	}  //end if

	return 宮位相沖六線;
}  // end function 宮位互沖六線


// --------------------------------------------

function 大限宮位自化流出重疊六線(命盤, 大限數, 大限宮位, 四化, 相對沖宮1, 相對沖宮2, 相對沖宮3){
    // *** to delete ***
	// 四化：祿、權、忌
	// 重疊宮線： [12宮位]、六線、成就線、光明線、子田線、成就線光明線

	var 自化流出成立 = false;
	var 重疊宮位六線成立 = false;
	var 自化流出 = "";  // 看自化、流出什麼，比方流出忌
	var 大限宮位地支 = 命盤.地支宮位[命盤.大限[大限數].人事宮[大限宮位]].地支數;

	var 重疊的宮位 = 命盤.地支宮位[大限宮位地支].宮位;
	var 重疊的沖宮 =人事宮位挪移(重疊的宮位, "遷移宮");
	var 重疊的六線 ="";

	if(相對沖宮1===undefined) 相對沖宮1 = ""; if(相對沖宮2===undefined) 相對沖宮2 = ""; if(相對沖宮3===undefined) 相對沖宮3 = "";

	switch(四化){
		case "化祿":
			if(命盤.地支宮位[大限宮位地支].宮干四化.自化祿) 自化流出 = "自化祿";
			if(命盤.地支宮位[大限宮位地支].宮干四化.流出祿) 自化流出 = "流出祿";
			break;
		case "化權":
			if(命盤.地支宮位[大限宮位地支].宮干四化.自化權) 自化流出 = "自化權";
			if(命盤.地支宮位[大限宮位地支].宮干四化.流出權) 自化流出 = "流出權";
			break;
		case "化忌":
			if(命盤.地支宮位[大限宮位地支].宮干四化.自化忌) 自化流出 = "自化忌";
			if(命盤.地支宮位[大限宮位地支].宮干四化.流出忌) 自化流出 = "流出忌";
			break;		
	} // end switch
	if(自化流出!="") 自化流出成立 = true;

	//console.log("大限" + 大限宮位 + "的地支是" + 大限宮位地支 + "，沖宮為" + 重疊的沖宮);

} // end function 大限宮位自化流出重疊六線


function 大限宮位流出論斷(命盤, 大限數, 大限宮位, 四化){
    // *** to delete **
	var 流出祿成立 = false, 流出權成立 = false, 流出科成立 = false, 流出忌成立 = false, 流出成立=false;
	var 性別 = 命盤.生日.性別;
	var 大限順逆 = 命盤.行運順逆;
	var 大限宮位地支 = 命盤.地支宮位[命盤.大限[大限數].人事宮[大限宮位]].地支數;
	var 大限化出宮轉換宮位, 論斷句1="", 論斷句2="", 附加論斷, 論斷矩陣=[];

	if(四化=="化祿" && 命盤.地支宮位[大限宮位地支].宮干四化.流出祿) 流出祿成立 = true;
	if(四化=="化權" && 命盤.地支宮位[大限宮位地支].宮干四化.流出權) 流出權成立 = true;
	if(四化=="化科" && 命盤.地支宮位[大限宮位地支].宮干四化.流出科) 流出科成立 = true;
	if(四化=="化忌" && 命盤.地支宮位[大限宮位地支].宮干四化.流出忌) 流出忌成立 = true;

	//console.log(大限數 + "：" + 大限順逆 + ", " + 流出祿成立 + ", " + 流出權成立 + ", " + 流出科成立 + ", " + 流出忌成立);
	switch(大限數){
		case 2:
			//
			break;
		case 3: case 5:
			if(大限順逆=="順行" && 流出忌成立){
				大限化出宮轉換宮位 = 人事宮位挪移(大限宮位, "交友宮"); //化出宮是那個宮位的疾厄宮
				switch(大限宮位){
					case "命宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "兄弟宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "夫妻宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "子女宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "財帛宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "疾厄宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "遷移宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "交友宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "官祿宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						if(性別=="女") 附加論斷 = "，女命容易流產或剖腹生產";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "田宅宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "福德宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
					case "父母宮":
						附加論斷="";
						論斷句1 = "大限" + 大限宮位 + "（" + 大限化出宮轉換宮位 + "的疾厄宮）流出忌沖" + 大限化出宮轉換宮位 + "的子田線";
						論斷矩陣.push(論斷句1 + 附加論斷);
						break;
				}  // end switch 大限宮位
			}  // end if
			break;
		case 4:
			//
			break;
		case 5:
			//
			break;
		case 6:
			//
			break;
		case 7:
			//
			break;
	}  // end switch

	var 流出判斷 = {
		"成立": false,
		"判斷句": ""
	} // end 流出判斷成立

	if(論斷矩陣.length>0) {
		流出判斷.成立 = true;
		流出判斷.判斷句 = 論斷矩陣.join("<br>");
	}

	return 流出判斷;
} //function 大限宮位流出論斷


// ===================================================














function 宮干飛化句子(宮飛元件) {
	var 運限字, 飛化句子, 化出宮, 化入宮, 顯示運限字;
	
	//if(顯示運限 != false) 顯示運限字 = true;
	化出宮 = (宮飛元件.化出相對宮 == "命宮") ? 宮飛元件.化出宮 : 宮飛元件.化出宮 +　"的" + 宮飛元件.化出相對宮;
	化入宮 = (宮飛元件.化入相對宮 == "命宮") ? 宮飛元件.化入宮線 : 宮飛元件.化入宮線 +　"的" + 宮飛元件.化入相對宮;
	運限字 = (宮飛元件.化出運限 == "大限") ? "第" + 宮飛元件.大限數 + "大限：" : "";
	if(顯示運限字 == false) 運限字 ="";
	
	//飛化句子 = 運限字 + 化出宮 + 宮飛元件.四化 + 化入宮;
	var 宮干飛化 = {
		"飛化句": 運限字 + 化出宮 + 宮飛元件.四化 + 化入宮,
		"化出地支數": 宮飛元件.化出宮地支數,
		"化入地支數": 宮飛元件.化入宮地支數,
		"備註": ""
	};
	return 宮干飛化;
}  //end function 宮干飛化句子




function 單向四化分析句(單向四化){
    // ??? need to delete ??
	var 化出宮位轉換詞="", 化出宮重疊詞="", 四化詞="", 化入宮詞="", 化入宮位轉換詞="", 化入宮重疊詞="", 註解詞="";
	
	if(單向四化.化出相對宮!="" && 單向四化.化出相對宮!="命宮") 化出宮位轉換詞 = "的" + 單向四化.化出相對宮;
	if(單向四化.化出宮重疊!="") 化出宮重疊詞 = "重疊" + 單向四化.化出宮重疊;
	
	switch(單向四化.四化){
		case "化祿":
			四化詞 = "化祿入";
			break;
		case "化權":
			四化詞 = "化權入";
			break;
		case "化科":
			四化詞 = "化科入";
			break;
		case "化忌":
			四化詞 = "化忌入";
			break;
		case "祿沖":
			四化詞 = "化祿沖";
			break;
		case "權沖":
			四化詞 = "化權沖";
			break;
		case "忌沖":
			四化詞 = "化忌沖";
			break;
	} //end switch
	化入宮詞 = (單向四化.化出宮==單向四化.化入宮線) ? "自身" : 單向四化.化入宮線;
	if(單向四化.化入相對宮!="" && 單向四化.化入相對宮!="命宮") 化入宮位轉換詞 = "的" + 單向四化.化入相對宮;
	if(單向四化.化入宮重疊!="") 化入宮重疊詞 = "重疊" + 單向四化.化入宮重疊;
	if(單向四化.註解!="") 註解詞 = "，" + 單向四化.註解;
	
	return 單向四化.化出宮 + 化出宮位轉換詞 + 化出宮重疊詞 + 單向四化.星曜 + 四化詞 + 化入宮詞 + 化入宮位轉換詞 + 化入宮重疊詞 + 註解詞;
}  //end function 單向四化分析句










// =============================================
function 分析大限感情婚姻(命盤, 大限數, 分析矩陣){
    // to be deleted
	// -------------------- 第四大限 --------------------

	// @@@@ 大夫飛  @@@
	// ++++++++
	var 大夫沖兄友 = new 宮位飛四化元件();
	大夫沖兄友.大限數 = 大限數;
	大夫沖兄友.化出宮 = "大限夫妻宮";
	大夫沖兄友.四化 ="忌沖";
	大夫沖兄友.化入宮線 ="兄友線";
	大夫沖兄友.化入宮重疊 = "大限財福線";

	宮位單向四化(大夫沖兄友, 命盤);
	if(大夫沖兄友.成立) {
		大夫沖兄友.註解 = "大限夫妻沖兄友線，重疊財福線為兄友線的子田線，夫妻感情不佳。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖兄友));
	}

	var 大夫沖財福 = new 宮位飛四化元件();
	大夫沖財福.大限數 = 大限數;
	大夫沖財福.化出宮 = "大限夫妻宮";
	大夫沖財福.四化 ="忌沖";
	大夫沖財福.化入宮線 ="財福線";
	大夫沖財福.化入宮重疊 = "大限兄友線";

	宮位單向四化(大夫沖財福, 命盤);
	if(大夫沖財福.成立) {
		大夫沖財福.註解 = "大限夫妻沖財福線為兄友線的子田線重疊兄友線，夫妻感情不佳。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖財福));
	}

	// ++++++++
	var 大夫沖夫官 = new 宮位飛四化元件();
	大夫沖夫官.大限數 = 大限數;
	大夫沖夫官.化出宮 = "大限夫妻宮";
	大夫沖夫官.四化 ="忌沖";
	大夫沖夫官.化入宮線 ="夫官線";
	大夫沖夫官.化入宮重疊 = "大限父疾線";

	宮位單向四化(大夫沖夫官, 命盤);
	if(大夫沖夫官.成立) {
		大夫沖夫官.註解 = "大限夫妻宮忌沖夫官線重疊夫妻宮的子田線，感情破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖夫官));
	}

	var 大夫沖父疾 = new 宮位飛四化元件();
	大夫沖父疾.大限數 = 大限數;
	大夫沖父疾.化出宮 = "大限夫妻宮";
	大夫沖父疾.四化 ="忌沖";
	大夫沖父疾.化入宮線 ="父疾線";
	大夫沖父疾.化入宮重疊 = "大限夫官線";

	宮位單向四化(大夫沖父疾, 命盤);
	if(大夫沖父疾.成立) {
		大夫沖父疾.註解 = "大限夫妻宮忌沖夫妻宮的子田線重疊夫官線，感情破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖父疾));
	}

	// ++++++++
	var 大夫沖子田 = new 宮位飛四化元件();
	大夫沖子田.大限數 = 大限數;
	大夫沖子田.化出宮 = "大限夫妻宮";
	大夫沖子田.四化 ="忌沖";
	大夫沖子田.化入宮線 ="子田線";
	大夫沖子田.化入宮重疊 = "大限命遷線";

	宮位單向四化(大夫沖子田, 命盤);
	if(大夫沖子田.成立) {
		大夫沖子田.註解 = "大限夫妻宮沖破田宅宮重疊田宅宮的子田線，分居、離異之象。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖子田));
	}

	var 大夫沖命遷 = new 宮位飛四化元件();
	大夫沖命遷.大限數 = 大限數;
	大夫沖命遷.化出宮 = "大限夫妻宮";
	大夫沖命遷.四化 ="忌沖";
	大夫沖命遷.化入宮線 ="命遷線";
	大夫沖命遷.化入宮重疊 = "大限子田線";

	宮位單向四化(大夫沖命遷, 命盤);
	if(大夫沖命遷.成立) {
		大夫沖命遷.註解 = "大限夫妻宮沖破田宅宮的子田線重疊田宅宮，分居、離異之象。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖命遷));
	}


	// @@@@ 大友飛  @@@
	// ++++++++
	var 大友沖兄友 = new 宮位飛四化元件();
	大友沖兄友.大限數 = 大限數;
	大友沖兄友.化出宮 = "大限交友宮";
	大友沖兄友.四化 ="忌沖";
	大友沖兄友.化入宮線 ="兄友線";
	大友沖兄友.化入宮重疊 = "大限財福線";

	宮位單向四化(大友沖兄友, 命盤);
	if(大友沖兄友.成立) {
		大友沖兄友.註解 = "大限交友沖兄友線，重疊財福線為兄友線的子田線，夫妻感情不佳。";
		分析矩陣.感情婚姻.push(單向四化分析句(大友沖兄友));
	}

	var 大友沖財福 = new 宮位飛四化元件();
	大友沖財福.大限數 = 大限數;
	大友沖財福.化出宮 = "大限交友宮";
	大友沖財福.四化 ="忌沖";
	大友沖財福.化入宮線 ="財福線";
	大友沖財福.化入宮重疊 = "大限兄友線";

	宮位單向四化(大友沖財福, 命盤);
	if(大友沖財福.成立) {
		大友沖財福.註解 = "大限交友沖財福線為兄友線的子田線重疊兄友線，夫妻感情不佳。";
		分析矩陣.感情婚姻.push(單向四化分析句(大友沖財福));
	}

	// ++++++++
	var 大友沖夫官 = new 宮位飛四化元件();
	大友沖夫官.大限數 = 大限數;
	大友沖夫官.化出宮 = "大限交友宮";
	大友沖夫官.四化 ="忌沖";
	大友沖夫官.化入宮線 ="夫官線";
	大友沖夫官.化入宮重疊 = "大限父疾線";

	宮位單向四化(大友沖夫官, 命盤);
	if(大友沖夫官.成立) {
		大友沖夫官.註解 = "大限交友宮忌沖夫官線重疊夫妻宮的子田線，感情破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大友沖夫官));
	}

	var 大友沖父疾 = new 宮位飛四化元件();
	大友沖父疾.大限數 = 大限數;
	大友沖父疾.化出宮 = "大限交友宮";
	大友沖父疾.四化 ="忌沖";
	大友沖父疾.化入宮線 ="父疾線";
	大友沖父疾.化入宮重疊 = "大限夫官線";

	宮位單向四化(大友沖父疾, 命盤);
	if(大友沖父疾.成立) {
		大友沖父疾.註解 = "大限交友宮忌沖夫妻宮的子田線重疊夫官線，感情破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大友沖父疾));
	}

	// @@@@ 大父、大疾飛  @@@
	// ++++++++
	var 大父沖子田 = new 宮位飛四化元件();
	大父沖子田.大限數 = 大限數;
	大父沖子田.化出宮 = "大限父母宮";
	大父沖子田.四化 ="忌沖";
	大父沖子田.化入宮線 ="子田線";
	大父沖子田.化入宮重疊 = "大限命遷線";

	宮位單向四化(大父沖子田, 命盤);
	if(大父沖子田.成立) {
		大父沖子田.註解 = "大限父母宮為夫妻宮的子田線，沖破田宅宮重疊田宅宮的子田線，分居、離異之象。";
		分析矩陣.感情婚姻.push(單向四化分析句(大父沖子田));
	}

	var 大父沖命遷 = new 宮位飛四化元件();
	大父沖命遷.大限數 = 大限數;
	大父沖命遷.化出宮 = "大限父母宮";
	大父沖命遷.四化 ="忌沖";
	大父沖命遷.化入宮線 ="命遷線";
	大父沖命遷.化入宮重疊 = "大限子田線";

	宮位單向四化(大父沖命遷, 命盤);
	if(大父沖命遷.成立) {
		大父沖命遷.註解 = "大限父母宮為夫妻宮的子田線，沖破田宅宮的子田線重疊田宅宮，分居、離異之象。";
		分析矩陣.感情婚姻.push(單向四化分析句(大父沖命遷));
	}

	// ++++++++
	var 大疾沖夫官 = new 宮位飛四化元件();
	大疾沖夫官.大限數 = 大限數;
	大疾沖夫官.化出宮 = "大限疾厄宮";
	大疾沖夫官.四化 ="忌沖";
	大疾沖夫官.化入宮線 ="夫官線";
	大疾沖夫官.化入宮重疊 = "大限父疾線";

	宮位單向四化(大疾沖夫官, 命盤);
	if(大疾沖夫官.成立) {
		大疾沖夫官.註解 = "本命夫妻宮忌沖夫官線，重疊夫妻宮的子田線，感情破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大疾沖夫官));
	}

	var 大疾沖父疾 = new 宮位飛四化元件();
	大疾沖父疾.大限數 = 大限數;
	大疾沖父疾.化出宮 = "大限疾厄宮";
	大疾沖父疾.四化 ="忌沖";
	大疾沖父疾.化入宮線 ="父疾線";
	大疾沖父疾.化入宮重疊 = "大限夫官線";

	宮位單向四化(大疾沖父疾, 命盤);
	if(大疾沖父疾.成立) {
		大疾沖父疾.註解 = "本命夫妻宮忌沖夫妻宮的子田線，重疊夫妻宮的子田線，感情破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大疾沖父疾));
	}



	// ********* below to delete !! **************
	// ************* 沖本夫 **************

	var 大夫沖夫官 = new 宮位飛四化元件();
	大夫沖夫官.大限數 = 大限數;
	大夫沖夫官.化出宮 = "大限夫妻宮";
	大夫沖夫官.四化 ="忌沖";
	大夫沖夫官.化入宮線 ="夫官線";

	大夫沖夫官.化入宮重疊 = "大限兄友線"; //順行第六大限，逆行第二大限
	宮位單向四化(大夫沖夫官, 命盤);

	if(大夫沖夫官.成立) {
		大夫沖夫官.註解 = "因重疊的是夫妻宮的光明線，婚姻危機。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖夫官));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大夫沖夫官));
	}

	
	大夫沖夫官.化入宮重疊 = "大限子田線"; //順行第二大限，逆行第六大限
	宮位單向四化(大夫沖夫官, 命盤);
	if(大夫沖夫官.成立) {
		大夫沖夫官.註解 = "因重疊的是夫妻宮的成就線，婚姻危機。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖夫官));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大夫沖夫官));
	}

	大夫沖夫官.化入宮重疊 = "大限父疾線";  //順行逆行第四大限
	宮位單向四化(大夫沖夫官, 命盤);
	if(大夫沖夫官.成立) {
		大夫沖夫官.註解 = "因重疊的是夫妻宮的子田線，婚姻動搖。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖夫官));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大夫沖夫官));
	}


	大夫沖夫官.化入宮重疊 = "大限財帛宮"; //順行第三大限，逆行第五大限
	宮位單向四化(大夫沖夫官, 命盤);
	if(大夫沖夫官.成立) {
		大夫沖夫官.註解 = "財帛宮為夫妻感情。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖夫官));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大夫沖夫官));
	}
	// --------- 大友 ----------

	// --------- 大父 ----------
	var 大父沖夫官 = new 宮位飛四化元件();
	大父沖夫官.大限數 = 大限數;
	大父沖夫官.化出宮 = "大限父母宮";
	大父沖夫官.四化 ="忌沖";
	大父沖夫官.化入宮線 ="夫官線";
	大父沖夫官.化入宮重疊 = "大限子田線";  //順行第二大限
	宮位單向四化(大父沖夫官, 命盤);

	if(大父沖夫官.成立) {
		大父沖夫官.註解 = "因重疊的是子田線，形成夫妻宮的田宅宮沖子田線。";
		分析矩陣.感情婚姻.push(單向四化分析句(大父沖夫官));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大父沖夫官));
	}


	// ************* 沖父疾 **************
	/*
	var 大夫沖父疾 = new 宮位飛四化元件();
	大夫沖父疾.大限數 = 大限數;
	大夫沖父疾.化出宮 = "大限夫妻宮";
	大夫沖父疾.化出宮重疊 = "父疾線"; //順行逆行第四大限
	大夫沖父疾.四化 ="忌沖";
	大夫沖父疾.化入宮線 ="父疾線";
	//大夫沖父疾.化入宮重疊 = "大限兄友線";
	宮位單向四化(大夫沖父疾, 命盤);

	if(大夫沖父疾.成立) {
		大夫沖父疾.註解 = "沖破自身子田線，婚姻破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大夫沖父疾));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大夫沖父疾));
	}
	*/

	// --------- 大友 ----------
	var 大友沖父疾 = new 宮位飛四化元件();
	大友沖父疾.大限數 = 大限數;
	大友沖父疾.化出宮 = "大限交友宮";
	//大友沖父疾.化出宮重疊 = "";
	大友沖父疾.四化 ="忌沖";
	大友沖父疾.化入宮線 ="父疾線";
	大友沖父疾.化入宮重疊 = "大限子田線"; //逆行第三大限
	宮位單向四化(大友沖父疾, 命盤);

	if(大友沖父疾.成立) {
		大友沖父疾.註解 = "沖破自身子田線，重疊成就線，感情發展艱難。";
		分析矩陣.感情婚姻.push(單向四化分析句(大友沖父疾));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大友沖父疾));
	}

	/*
	大友沖父疾.化入宮重疊 = "大限夫官線";  //逆行第四大限
	宮位單向四化(大友沖父疾, 命盤);
	if(大友沖父疾.成立) {
		大友沖父疾.註解 = "沖破自身子田線，重疊夫官線，感情破裂。";
		分析矩陣.感情婚姻.push(單向四化分析句(大友沖父疾));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大友沖父疾));
	}
	*/

	// ************* 沖命 **************
	// --------- 大友 ----------
	var 大友沖命遷 = new 宮位飛四化元件();
	大友沖命遷.大限數 = 大限數;
	大友沖命遷.化出宮 = "大限交友宮";  //交友立標
	大友沖命遷.化出宮重疊 = "父母宮";
	大友沖命遷.四化 ="忌沖";
	大友沖命遷.化入宮線 ="命遷線";
	大友沖命遷.化入宮重疊 = "大限夫官線"; //逆行第五大限
	宮位單向四化(大友沖命遷, 命盤);

	if(大友沖命遷.成立) {
		大友沖命遷.註解 = "婚姻有問題？？？";
		分析矩陣.感情婚姻.push(單向四化分析句(大友沖命遷));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大友沖命遷));
	}


	// ************* 沖子田 **************
	/*
	var 大父沖子田 = new 宮位飛四化元件();
	大父沖子田.大限數 = 大限數;
	大父沖子田.化出宮 = "大限父母宮";
	大父沖子田.化出宮重疊 = "夫妻宮";  //逆行第四大限
	大父沖子田.四化 ="忌沖";
	大父沖子田.化入宮線 ="子田線";
	//大父沖子田.化入宮重疊 = "";
	宮位單向四化(大父沖子田, 命盤);
	if(大父沖子田.成立) {
		大父沖子田.註解 = "形成夫妻宮的田宅宮沖子田線。";
		分析矩陣.感情婚姻.push(單向四化分析句(大父沖子田));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大父沖子田));
	}
	*/
	
	大父沖子田.化出宮重疊 = "交友宮";  //順行第五大限
	宮位單向四化(大父沖子田, 命盤);
	if(大父沖子田.成立) {
		大父沖子田.註解 = "形成夫妻宮的田宅宮沖子田線";
		分析矩陣.感情婚姻.push(單向四化分析句(大父沖子田));
		console.log("大限" + 大限數 + "：" + 單向四化分析句(大父沖子田));
	}	
}  // end function 分析大限感情婚姻



// ---------------------------------------------------

function 宮位單向四化(宮飛元件, 命盤){
    // check why need this in "function 另類同類相沖"
	var err=false, errDesc=[];
	if(宮飛元件.化入宮重疊===undefined) 宮飛元件.化入宮重疊="";
	if(宮飛元件.化出宮重疊===undefined) 宮飛元件.化出宮重疊="";
	if(宮飛元件.大命重疊===undefined) 宮飛元件.大命重疊="";
	if(宮飛元件.大限數===undefined) 宮飛元件.大限數=命盤.運行.大限數;
	if(宮飛元件.流年數===undefined) 宮飛元件.流年數= -1;
	if(宮飛元件.化出相對宮===undefined || 宮飛元件.化出相對宮=="") 宮飛元件.化出相對宮="命宮";
	if(宮飛元件.化入相對宮===undefined || 宮飛元件.化入相對宮=="") 宮飛元件.化入相對宮="命宮";
	if(宮飛元件.化入宮線.substr(宮飛元件.化入宮線.length-1,1) == "線") 宮飛元件.化入相對宮="命宮"; //化入六線，沒有用相對宮
 

	if(宮飛元件.化出宮.length>3){
		宮飛元件.化出運限=宮飛元件.化出宮.substr(0,2);
		宮飛元件.化出人事宮=宮飛元件.化出宮.substr(2,宮飛元件.化出宮.length-2);
	} else 宮飛元件.化出人事宮=宮飛元件.化出宮;

	if(宮飛元件.化出運限=="" && 宮飛元件.化出宮重疊!=""){
		宮飛元件.化出宮重疊="";
		alert(宮飛元件.化出宮 + "：化出宮是本命，因此化出宮不應該有重疊宮位");
	}

	if(宮飛元件.化入宮線.length>3){
		宮飛元件.化入運限=宮飛元件.化入宮線.substr(0,2);
		宮飛元件.化入人事宮=宮飛元件.化入宮線.substr(2,宮飛元件.化入宮線.length-2);
	} else 宮飛元件.化入人事宮=宮飛元件.化入宮線;

	
	宮飛元件.化出宮地支數=人事宮位轉換(宮飛元件.化出宮, 宮飛元件.化出相對宮, 命盤, 宮飛元件.大限數).地支數1;

	var 化入宮 = 人事宮位轉換(宮飛元件.化入宮線, 宮飛元件.化入相對宮, 命盤,宮飛元件.大限數);
	宮飛元件.化入宮地支數1=化入宮.地支數1;
	宮飛元件.化入宮地支數2=化入宮.地支數2;
	宮飛元件.化入宮1 = 化入宮.宮位1;
	宮飛元件.化入宮2 = 化入宮.宮位2;

	var 飛出四化 = 宮飛元件.四化;
	if(飛出四化 == "化祿" || 飛出四化 == "化權" || 飛出四化 == "化科" || 飛出四化 == "化忌" || 飛出四化 == "忌沖") {
		檢測單向四化(宮飛元件, 命盤);  //成立，星曜
	}
	//console.log(宮飛元件);
	//console.log(宮干飛化句子(宮飛元件));
}  //end function 宮飛四化


function 宮位飛四化元件(){
    // to be deleted once "function 宮位單向四化" is demolish !!
	this.化出宮 = "";  //輸入，可能是大限夫妻宮，帶有運限的名稱
	this.化出運限 = ""; //*計算："": 本命，大限，流年，從化出宮分拆出來
	this.化出人事宮 = "";  //*計算： 就單單人事宮位，比方化出宮是大限夫妻宮，這裡就只是顯示夫妻宮
	this.化出宮地支數 = -1;  //*計算：
	this.四化 = "";  //輸入，化祿、化權、化科、化忌、忌沖
	this.化入宮線 = "";  //輸入：命宮、兄弟宮。。。。 子田線、光明線、成就線
	this.化入宮1 = ""; //*計算：
	this.化入宮2 = ""; //*計算：
	this.化入運限 = ""; //*計算："": 本命，大限，流年，從化入宮分拆出來
	this.化入人事宮 = "";  //*計算： 就單單人事宮位，比方化出宮是大限夫妻宮，這裡就只是顯示夫妻宮
	this.化入宮地支數1 = -1;  //*計算
	this.化入宮地支數2 = -1;  //*計算：
	this.大限數 = 1;  // 本命
	this.流年數 = -1;  // not assigned yet !!
	this.宮干飛化 = "";  // object of the result
	this.化出宮重疊 = "";  //輸入：化出重疊的宮位：命宮、兄弟宮。。。。
	this.化入宮重疊 = "";  //輸入：化入重疊的宮位：命宮、兄弟宮。。。。
	this.大命重疊 = "";
	this.流命重疊 = "";
	this.化出相對宮 = "";
	this.化入相對宮 = "";
	this.成立 = false;
	this.星曜 = "";  //*計算：四化的星曜
	this.註解 = "";
} //end function 宮位飛四化元件


