function 命盤總分析(命盤){
	var 本命飛星分析 = {
        "命宮": [],
        "兄弟宮": [],
        "夫妻宮": [],
        "子女宮": [],
        "財帛宮": [],
        "疾厄宮": [],
        "遷移宮": [],
        "交友宮": [],
        "官祿宮": [],
        "田宅宮": [],
        "福德宮": [],
        "父母宮": [],
        "無分類": []
    };  // end var 本命飛星十二宮分析
    
    本命化祿權忌入三方論斷(命盤, 本命飛星分析);
    本命宮位沖六線論斷(命盤, 本命飛星分析);
    本命自化流出論斷(命盤, 本命飛星分析);
    本命人事宮論斷(命盤, 本命飛星分析);
    
    本命化祿權忌入一六十論斷(命盤, 本命飛星分析); //	2017年9月9日-丑-男
    本命一六祿忌論斷(命盤, 本命飛星分析);
    
    //本命宮位破六線(命盤);
    
    // --------------- show result --------------
	$("#tab-本命飛星分析內容").html(顯示本命分析(本命飛星分析));

} // end function 命盤總分析


// ------------------------------------
function 顯示本命分析(本命人事宮矩陣){
	var 人事宮位 = ["命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮", "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮", "無分類"];
	var 分析人事宮位;
	var 本命分析內容 = [];
	
// --------- 命宮 ---------
	for(var j=0; j<人事宮位.length; j++){
		分析人事宮位=人事宮位[j];
        
		if(本命人事宮矩陣[分析人事宮位].length > 0) {
			var 宮位分析內容 = [];
			宮位分析內容.push('<div class = "ds-本命分析宮位">' + 分析人事宮位 + '</div>');
			for(var i=0; i < 本命人事宮矩陣[分析人事宮位].length; i++) {
				宮位分析內容.push('<div class = "ds-本命分析內容">' + 本命人事宮矩陣[分析人事宮位][i] + '</div>');
			} // end for i
			本命分析內容.push(宮位分析內容.join("<br>"));
		} // end if
	} // end for j
	return 本命分析內容.join("<br><br>");
} // end 顯示本命分析