

function 宮干四化選星(命盤, 宮干, 地支數){

	if(斗數命盤.運行.宮干MouseDown >=0) {
		清除星曜顏色();
		斗數命盤.運行.宮干MouseDown = -1;
	}  // end if

	var 宮干四化星曜 = 十干四化(宮干);
	var 化星位置 =  {"化祿": "星曜格-" + 命盤.星曜[宮干四化星曜.化祿].命盤位置, "化權": "星曜格-" + 命盤.星曜[宮干四化星曜.化權].命盤位置, "化科": "星曜格-" + 命盤.星曜[宮干四化星曜.化科].命盤位置, "化忌": "星曜格-" + 命盤.星曜[宮干四化星曜.化忌].命盤位置};
	命盤.運行.宮干MouseDown = 地支數;

	// 改變四化星曜的顏色
	switch(系統.設定.用戶設定.命盤顯示.宮干四化顯示){
		case 0:
			$("#"+化星位置.化祿).addClass("化祿字體顏色");
			$("#"+化星位置.化權).addClass("化權字體顏色");
			$("#"+化星位置.化科).addClass("化科字體顏色");
			$("#"+化星位置.化忌).addClass("化忌字體顏色");
			break;
		case 1:
			$("#"+化星位置.化祿).addClass("化祿背景顏色");
			$("#"+化星位置.化權).addClass("化權背景顏色");
			$("#"+化星位置.化科).addClass("化科背景顏色");
			$("#"+化星位置.化忌).addClass("化忌背景顏色");
		case 2:
			$("#"+化星位置.化祿).addClass("化祿星曜顏色");
			$("#"+化星位置.化權).addClass("化權星曜顏色");
			$("#"+化星位置.化科).addClass("化科星曜顏色");
			$("#"+化星位置.化忌).addClass("化忌星曜顏色");
			$("#宮干格-"+地支數).addClass("宮干飛顏色");
	} // end switch

	$("#ds-DZ-"+地支數).addClass("飛四化人事宮");  //改變化出宮位的顏色

	if (命盤.運行.宮干MouseDown >=0) { setInterval("宮干四化選星", 100); }
}  // end function 宮干四化選星



// ××××××××××× 排盤程序 ×××××××××××

function 刷新命盤資訊(命盤){
	/*
	 性別名字, 陽曆生日, 陰曆生日, 五行局, 八字;
	
	*/

	var 性別名字 = 命盤.陽男陰女 + " " + 命盤.輸入資料.姓名;
	var 陽曆生日 = 命盤.生日.西曆生日格式.西曆日期;
	var 陰曆生日 = 命盤.生日.陰曆;
	var 五行局 = 命盤.五行局.局名;
	var 八字 = 命盤.八字.substr(0, 2) + " " + 命盤.八字.substr(2, 2) + " " + 命盤.八字.substr(4, 2) + " " + 命盤.八字.substr(6, 2);
	var 流年歲數 = 命盤.運行.流年數 + "" + 命盤.運行.流年干支 + "年，" + 命盤.運行.歲數 + "歲，" + 命盤.運行.流年十神;
	if(命盤.運行.歲數 < 1) 流年歲數 = "";  // 如果排未來的命盤，流年不顯示

	$("#中宮資訊-命主").html(性別名字);
	$("#中宮資訊-陽曆生日").html(陽曆生日);
	$("#中宮資訊-陰曆生日").html(陰曆生日);
	$("#中宮資訊-五行局").html(五行局);
	$("#中宮資訊-八字").html(八字);
	$("#中宮資訊-流年").html(流年歲數);
}  //end function 刷新命盤資訊


function 清除命盤(){
	var NullChar;
    for(var i=0; i<12; i++){
        for(var j=0; j<6; j++){
            $("#星曜格-" + i + "-" + Number(j+1)).html("<br><br>");
            $("#四化格-" + i + "-" + Number(j+1)).html("<br>");
            $("#自化格-" + i + "-" + Number(j+1)).html("<br>");
        } // end for j
		
		$("#宮名格-" + i).html("<br>");
		$("#宮干格-" + i).html("<br>");
		$("#地支格-" + i).html("<br>");
		
		$("#大限宮位-" + i).html("<br>");
		$("#大限歲數格-" + i).html("<br>");
		
		$("#流年宮位-" + i).html("<br>");
		$("#流年歲數格-" + i).html("<br>");
		$("#流年份格-" + i).html("<br>");

		if(i == 7 || i == 8 || i ==1 || i==2) NullChar = "&nbsp"; else NullChar = "<br>"
		$("#流出格-" + i + "-1").html(NullChar);
		$("#流出格-" + i + "-2").html(NullChar);
		$("#流出格-" + i + "-3").html(NullChar);
    } // end for i


    $("#中宮資訊-命主").html("");
    $("#中宮資訊-陽曆生日").html("");
    $("#中宮資訊-陰曆生日").html("");
    $("#中宮資訊-五行局").html("");
    $("#中宮資訊-八字").html("");

    $("#中宮資訊-流年").html("");
    $("#中宮資訊-流年十神").html("");

    $(".ds-大限歲數").removeClass("ds-當下大限歲數");
    清除星曜顏色();
} //end function 清除命盤


function 清除大限宮位(){
    for(var i=0; i<12; i++){
		$("#大限宮位-" + i).html("<br>");
		清除流年宮位歲數年份();
    } // end for i
} //end function 清除大限宮位

function 清除流年宮位歲數年份(){
    for(var i=0; i<12; i++){
		$("#流年宮位-" + i).html("<br>");
		$("#流年歲數格-" + i).html("<br>");
		$("#流年份格-" + i).html("<br>");
		$("#中宮資訊-流年").html("");
		$("#中宮資訊-流年十神").html("");
    } // end for i
} //end function 清除大限宮位


function 清除流年宮位(){
    for(var i=0; i<12; i++){
		$("#流年宮位-" + i).html("<br>");
    } // end for i
		$("#中宮資訊-流年").html("");
		$("#中宮資訊-流年十神").html("");
} //end function 清除流年宮位


function 清除星曜顏色(){
   for(var i=0; i<12; i++){
   		for(var j=1; j<7; j++){
   			$("#星曜格-" + i + "-" + j).removeClass("化祿字體顏色 化權字體顏色 化科字體顏色 化忌字體顏色");
   			$("#星曜格-" + i + "-" + j).removeClass("化祿背景顏色 化權背景顏色 化科背景顏色 化忌背景顏色");
   			$("#星曜格-" + i + "-" + j).removeClass("化祿星曜顏色 化權星曜顏色 化科星曜顏色 化忌星曜顏色");
   		}  //end for j
   	$("#宮干格-"+i).removeClass("宮干飛顏色");
   	$("#ds-DZ-"+i).removeClass("飛四化人事宮"); 
   }  //end for i
}  // end function 清除星曜背景顏色


function 排星曜(命盤){
	var 大限起歲, 大限起歲字, 星曜級別;

	for(var i=0; i<12 ; i++) {
		var 星曜矩陣 = 命盤.地支宮位[i].星曜;
		for(var j=0; j<星曜矩陣.length ; j++) {
			星曜級別 = 星曜分類(星曜矩陣[j]);
			$("#星曜格-" + i + "-" + Number(j+1)).html(星曜矩陣[j]);
			
			命盤.星曜[星曜矩陣[j]].命盤位置 = i + "-" + Number(j+1);  //update 星曜在命盤的位置
			$("#四化格-" + i + "-" + Number(j+1)).html(命盤.星曜[星曜矩陣[j]].生年四化);
			$("#自化格-" + i + "-" + Number(j+1)).html(命盤.星曜[星曜矩陣[j]].自化);

			switch(星曜級別){
				case "主星":
					$("#星曜格-" + i + "-" + Number(j+1)).addClass("ds-主星");
					$("#四化格-" + i + "-" + Number(j+1)).addClass("ds-主星");
					$("#自化格-" + i + "-" + Number(j+1)).addClass("ds-主星");
					break;
				case "六吉":
					$("#星曜格-" + i + "-" + Number(j+1)).addClass("ds-副星");
					$("#四化格-" + i + "-" + Number(j+1)).addClass("ds-副星");
					$("#自化格-" + i + "-" + Number(j+1)).addClass("ds-副星");
					break;				
			} // end switch
		} //end for j
		
		大限起歲字 = 命盤.地支宮位[i].大限歲數段.split(" ");
		大限起歲 = Number(大限起歲字[0]);

		$("#宮名格-" + i).html(命盤.地支宮位[i].宮位);
		$("#宮干格-" + i).html(命盤.地支宮位[i].宮干);
		$("#地支格-" + i).html(命盤.地支宮位[i].地支);
		if (大限起歲 < 90) $("#大限歲數格-" + i).html(命盤.地支宮位[i].大限歲數段);
	} //end for i

	安流出四化(命盤.地支宮位);
}  //end function 排星曜


function 安流出四化(地支矩陣){
    var 流出四化數;
    for(var i=0; i<12; i++){
        流出四化數 = 地支矩陣[i].宮干四化.分析.流出矩陣.length;

        for(var j=0; j<流出四化數; j++){
            $("#流出格-" + i + "-" + Number(j+1)).html(地支矩陣[i].宮干四化.分析.流出矩陣[j]);
            //console.log("#流出格-" + i + "-" + j+1 + "，" + 地支矩陣[i].宮干四化.分析.流出矩陣[j]);
        }
    } // end for
} // end function 安流出四化


function 刷新命盤大限(地支數, 命盤){
	var 大限宮位;
	var j, 流年二字, 流年疊字,流年地支數;
	清除流年宮位歲數年份();
	
	//console.log(命盤.運行.大限數);
	for(var i=0; i<12 ; i++) {
		j = 地支滾動(1, i);
		大限宮位 = 大限人事宮字數轉換(j);
		$("#大限宮位-" + 地支滾動(地支數, (-1)*i)).html(大限宮位);
	} // end for i
	
	if(命盤.運行.大限數 < 10) { // 第十個大限以上不顯示流年
		for(var k=0; k<10 ; k++) {
			流年二字 = (命盤.大限[命盤.運行.大限數].流年[k].西曆年).toString();
			流年疊字 = 流年二字.substr(0,2) + "<br>" + 流年二字.substr(2,2);
			流年地支數 = 命盤.大限[命盤.運行.大限數].流年[k].地支數;
			$("#流年份格-" + 流年地支數).html(流年二字);
			$("#流年歲數格-" + 流年地支數).html(命盤.大限[命盤.運行.大限數].流年[k].歲數);

			$("#流年份格-" + 流年地支數).attr("data-大運流年數", k.toString());
			$("#流年歲數格-" + 流年地支數).attr("data-大運流年歲數", k.toString());
		} //end for k
	} // end if
} // end function 刷新命盤大限


function 刷新命盤流年(地支數){
	var 流年宮位;
	var j;
	for(var i=0; i<12 ; i++) {
		j = 地支滾動(1, i);
		流年宮位 = 流年人事宮字數轉換(j);
		$("#流年宮位-" + 地支滾動(地支數, (-1)*i)).html(流年宮位);
	} // end for i
} // end function 刷新命盤流年


// ××××××××××

function 刷新四化格式(){
	var 生年四化, 生年四化顏色, 自化, 自化顏色, 流出四化, 流出顏色;
    for (var i = 0; i < $(".ds-生年四化格式").length; i++) {
        生年四化 = $(".ds-生年四化格式").eq(i).html();
        自化 = $(".ds-自化格式").eq(i).html();
        流出四化 = $(".ds-流出格式").eq(i).html();

        $(".ds-生年四化格式").eq(i).removeClass("化祿字體顏色 化權字體顏色 化科字體顏色 化忌字體顏色");
        $(".ds-自化格式").eq(i).removeClass("化祿背景顏色 化權背景顏色 化科背景顏色 化忌背景顏色");
        $(".ds-流出格式").eq(i).removeClass("化祿背景顏色 化權背景顏色 化科背景顏色 化忌背景顏色");

        if(生年四化 == "祿" || 生年四化 == "權" || 生年四化 == "科" || 生年四化 == "忌") {
        	生年四化顏色 = 四化顏色選擇器(生年四化);
        	$(".ds-生年四化格式").eq(i).addClass(生年四化顏色.字體);
        }  // end if

        if(自化 == "祿" || 自化 == "權" || 自化 == "科" || 自化 == "忌") {
        	自化顏色 = 四化顏色選擇器(自化);
        	$(".ds-自化格式").eq(i).addClass(自化顏色.背景);
        }  // end if

        if(流出四化 == "祿" || 流出四化 == "權" || 流出四化 == "科" || 流出四化 == "忌") {
        	流出顏色 = 四化顏色選擇器(流出四化);
        	$(".ds-流出格式").eq(i).addClass(流出顏色.背景);
        }  // end if
        
    } //end for
}  // end function 刷新四化格式



function 刷新人事宮格式(){
	// 人事宮不同三合宮位用不同顏色，暫時不用！！
	var 人事宮;
    for (var i = 0; i < 12; i++) {
        人事宮 = $(".ds-宮名字").eq(i).html();

        $(".ds-宮名字").eq(i).removeClass("命財官顏色 夫遷福顏色 田疾兄顏色 父子友顏色");

        if(人事宮 == "命宮" || 人事宮 == "財帛宮" || 人事宮 == "官祿宮") {
        	$(".ds-宮名字").eq(i).addClass("命財官顏色");
        }  // end if

        if(人事宮 == "夫妻宮" || 人事宮 == "遷移宮" || 人事宮 == "福德宮") {
        	$(".ds-宮名字").eq(i).addClass("夫遷福顏色");
        }  // end if

        if(人事宮 == "田宅宮" || 人事宮 == "疾厄宮" || 人事宮 == "兄弟宮") {
        	$(".ds-宮名字").eq(i).addClass("田疾兄顏色");
        }  // end if

        if(人事宮 == "父母宮" || 人事宮 == "子女宮" || 人事宮 == "交友宮") {
        	$(".ds-宮名字").eq(i).addClass("父子友顏色");
        }  // end if  
    } //end for
}  // end function 刷新人事宮格式