
function 大限化入三方論斷(命盤, 大限數, 大限人事宮, 借宮, 輸出顯示矩陣){
    //大限人事宮: 命宮、兄弟宮。。。。。不需要"大限"
    // required function 化入祿權忌三方 (斗數分析配件)
    
    if(借宮===undefined || 借宮 != true) 借宮 = false;
    
    var 大限人事宮地支 = 命盤.大限[大限數].宮位[大限人事宮].地支數;
    var 輸出顯示分類 = "無分類";  //default display at 無分類
    //var 化出的重疊宮 = 命盤.大限[大限數].地支[大限人事宮地支].本命人事宮;
    var 大限化入三方分析 = {
        "性別": 命盤.陽男陰女.substr(1,1),
        "化出宮": "大限" + 大限人事宮,
        "化出重疊宮": 命盤.大限[大限數].地支[大限人事宮地支].本命人事宮,
        "化入三方": "",
        "三方重疊": "", //命盤.大限[大限數].地支[大限人事宮地支].三方,  //重疊的大限三方
        "四化": "",
        "祿入宮": "",
        "祿入宮線": "",
        "忌沖宮": "",
        "忌沖宮線": "",
        "成立": false,
        "條件": "",
        "事件": "",
        "判斷句": "",
        "備註": ""
    } // end var 大限化入三方分析
    
    var 大限人事宮化入三方 = 化入祿權忌三方(命盤, 大限人事宮地支, true);
    if(大限人事宮化入三方.成立) {
        大限化入三方分析.化入三方 = 大限人事宮化入三方.三方宮位;
        大限化入三方分析.四化 = 大限人事宮化入三方.四化;
        大限化入三方分析.成立 = true;
        大限化入三方分析.祿入宮 = 大限人事宮化入三方.祿入宮;
        大限化入三方分析.祿入宮線 = 大限人事宮化入三方.祿入宮線;
        大限化入三方分析.忌沖宮 = 大限人事宮化入三方.忌沖宮;
        大限化入三方分析.忌沖宮線 = 大限人事宮化入三方.忌沖宮線;
        
        var 化入三方的頭一個地支數 = 地支字數轉換(大限人事宮化入三方.三方地支.substr(0,1));
        
        大限化入三方分析.三方重疊 = 命盤.大限[大限數].地支[化入三方的頭一個地支數].三方;
        大限化入三方分析.條件 = 大限化入三方分析.化出宮 + "重疊" + 大限化入三方分析.化出重疊宮 + "，化" + 大限化入三方分析.四化 + "入" + 大限化入三方分析.化入三方 + "，"; 
        
        switch(大限人事宮化入三方.三方宮位){
            case "命財官":
                輸出顯示分類 = "財官";
                switch (大限人事宮) {
                    case "命宮":
                        輸出顯示分類 = "無分類";
                        大限化入三方分析.判斷句 = "";
                        
                        if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "升官、創業機遇。"; }
                        if(大限化入三方分析.化出重疊宮=="財帛宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "賺錢機遇。"; }
                        if(大限化入三方分析.化出重疊宮=="田宅宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "得房地產。"; }
                        break;
                    case "兄弟宮":
                        輸出顯示分類 = "無分類";
                        大限化入三方分析.判斷句 = "";
                        
                        if(大限化入三方分析.化出重疊宮=="田宅宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "賺房地產的錢財。"; }
                        break;
                    case "夫妻宮":
                        輸出顯示分類 = "感情婚姻";
                        大限化入三方分析.判斷句 = "有婚姻機遇";
                        
                        if(大限化入三方分析.化出重疊宮=="福德宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "得偏財。"; }
                        if(大限化入三方分析.化出重疊宮=="遷移宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "海外、驛馬事業。"; }
                        break;
                    case "子女宮":
                        輸出顯示分類 = "六親";
                        大限化入三方分析.判斷句 = "得子*";
                        
                        if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "合夥、新工作機遇"; }
                        if(大限化入三方分析.化出重疊宮=="交友宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "工作、合夥機遇"; }
                        break;
                    case "財帛宮":
                        輸出顯示分類 = "財官";
                        大限化入三方分析.判斷句 = "錢財機遇*";
                        if(大限化入三方分析.化出重疊宮=="官祿宮") 大限化入三方分析.判斷句 = "投資創業。";
                        if(大限化入三方分析.化出重疊宮=="父母宮") 大限化入三方分析.判斷句 = "賺到朋友的錢財。";
                        if(大限化入三方分析.化出重疊宮=="交友宮") 大限化入三方分析.判斷句 = "賺到朋友的錢財。";
                        if(大限化入三方分析.化出重疊宮=="子女宮") 大限化入三方分析.判斷句 = "得到父母的錢財。";
                        if(大限化入三方分析.化出重疊宮=="夫妻宮") 大限化入三方分析.判斷句 = "得到偏財或從事偏財行業。";
                        if(大限化入三方分析.化出重疊宮=="遷移宮") 大限化入三方分析.判斷句 = "得到配偶的錢財。";
                        break;
                    case "疾厄宮":
                        輸出顯示分類 = "無分類";
                        大限化入三方分析.判斷句 = "";
                        
                        if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "適合從事房地產行業。"; }
                        break;
                    case "遷移宮":
                        輸出顯示分類 = "財官";
                        大限化入三方分析.判斷句 = "驛馬事業，賣車*";
                        if(大限化入三方分析.化出重疊宮=="官祿宮") 大限化入三方分析.判斷句 = "驛馬事業、創業、海外工作。";
                        if(大限化入三方分析.化出重疊宮=="財帛宮") 大限化入三方分析.判斷句 = "海外投資，得配偶錢財*。";
                        if(大限化入三方分析.化出重疊宮=="夫妻宮") 大限化入三方分析.判斷句 = "得配偶錢財。";
                        break;
                    case "交友宮":
                        輸出顯示分類 = "無分類";
                        大限化入三方分析.判斷句 = "";
                        if(大限化入三方分析.化出重疊宮=="父母宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "賺到錢，朋友或父親出資給命主創業。"; }
                        if(大限化入三方分析.化出重疊宮=="田宅宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "從事房地產的事業機遇。"; }
                        break;
                    case "官祿宮":
                        輸出顯示分類 = "財官";
                        大限化入三方分析.判斷句 = "升遷，創業、工作機遇";
                        
                        if(大限化入三方分析.化出重疊宮=="子女宮") 大限化入三方分析.判斷句 = "重疊子女宮，交友的官，創業機遇。";
                        if(大限化入三方分析.化出重疊宮=="交友宮") 大限化入三方分析.判斷句 = "重疊交友宮，官的父母，升職。";
                        if(大限化入三方分析.化出重疊宮=="福德宮") 大限化入三方分析.判斷句 = "重疊福德宮（夫妻宮的官祿宮），夫妻合檔創業**";
                        if(大限化入三方分析.化出重疊宮=="遷移宮") 大限化入三方分析.判斷句 = "重疊遷移宮，驛馬事業、賣車行業。";
                        break;
                    case "田宅宮":
                        輸出顯示分類 = "家運田宅";
                        大限化入三方分析.判斷句 = "獲得房地產，或從事房地產業賺錢。";
                        break;
                    case "福德宮":
                        輸出顯示分類 = "無分類";
                        大限化入三方分析.判斷句 = "";
                        
                        if(大限化入三方分析.化出重疊宮=="夫妻宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "得偏財。"; }
                        if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "福德宮（夫妻宮的官祿宮），夫妻合檔創業**"; }
                        break;
                    case "父母宮":
                        輸出顯示分類 = "財官";
                        大限化入三方分析.判斷句 = "有利於賺朋友的錢財。";
                
                        if(大限化入三方分析.化出重疊宮=="交友宮") 大限化入三方分析.判斷句 = "朋友出資給命主創業，或得到父親的事業";
                        if(大限化入三方分析.化出重疊宮=="財帛宮") 大限化入三方分析.判斷句 = "賺到朋友的錢財。";
                        break;
                    } // end switch (大限人事宮)
                    break;
        
                case "田疾兄":
                    輸出顯示分類 = "無分類";
                    switch (大限人事宮) {
                        case "命宮":
                            大限化入三方分析.判斷句 = "";

                            if(大限化入三方分析.化出重疊宮=="田宅宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "得到房地產。"; }
                            if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "有得到父母房地產的機遇。"; }
                            if(大限化入三方分析.化出重疊宮=="財帛宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "投資房地產。"; }
                            if(大限化入三方分析.化出重疊宮=="子女宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "海外購買房地產，因為命宮（子[遷之田]之田）又重疊子女宮（遷之田）。"; }
                            break;
                        case "兄弟宮":
                            大限化入三方分析.判斷句 = "";
                            if(大限化入三方分析.化出重疊宮=="田宅宮") { 
                                輸出顯示分類 = "家運田宅"; 
                                大限化入三方分析.判斷句 = "賺到房地產的錢財。";
                                if(大限化入三方分析.忌沖宮線 == "夫官線") 大限化入三方分析.判斷句 = "但因忌沖田宅宮的光明線，賺房地產的錢財機遇不佳，房子難出租/賣出。";
                                if(大限化入三方分析.忌沖宮線 == "財福線") 大限化入三方分析.判斷句 = "但因忌沖田宅宮的成就線，難賺到房地產的錢財，房子虧錢出租/賣出。";
                                if(大限化入三方分析.忌沖宮線 == "兄友線") 大限化入三方分析.判斷句 = "但因忌沖田宅宮的財福線，難賺到房地產的錢財，房子租金/賣價不好。";
                                if(大限化入三方分析.祿入宮 == "兄弟宮") 大限化入三方分析.判斷句 = "賺到房地產的錢財機遇，因化祿入兄弟宮，賺錢豐厚。";
                                //console.log(大限化入三方分析);
                            } // end if

                            if(大限化入三方分析.化出重疊宮=="財帛宮") { 
                                輸出顯示分類 = "財官"; 
                                大限化入三方分析.判斷句 = "賺到房地產的錢財**。";
                            } // end if

                            break;
                        case "夫妻宮":
                            大限化入三方分析.判斷句 = "";

                            if(大限化入三方分析.化出重疊宮=="福德宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "得偏財。"; }
                            break;
                        case "子女宮":
                            大限化入三方分析.判斷句 = "";

                            if(大限化入三方分析.性別=="女" && 大限化入三方分析.化出重疊宮=="疾厄宮") { 輸出顯示分類 = "六親"; 大限化入三方分析.判斷句 = "懷孕、得子*"; }
                            if(大限化入三方分析.化出重疊宮=="父母宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "得父母錢財。"; }
                            break;
                        case "財帛宮":
                            輸出顯示分類 = "財官";
                            大限化入三方分析.判斷句 = "得到錢財機遇**。";
                            if(大限化入三方分析.化出重疊宮=="父母宮") 大限化入三方分析.判斷句 = "賺到朋友的錢財。";
                            if(大限化入三方分析.化出重疊宮=="交友宮") 大限化入三方分析.判斷句 = "賺到朋友的錢財。";
                            if(大限化入三方分析.化出重疊宮=="子女宮") 大限化入三方分析.判斷句 = "得到父母的錢財。";
                            if(大限化入三方分析.化出重疊宮=="夫妻宮") 大限化入三方分析.判斷句 = "得到偏財的錢財。";
                            if(大限化入三方分析.化出重疊宮=="遷移宮") 大限化入三方分析.判斷句 = "得到配偶的錢財。";
                            if(大限化入三方分析.化出重疊宮=="兄弟宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "房地產獲利，或購得房地產。"; }
                            break;
                        case "疾厄宮":
                            大限化入三方分析.判斷句 = "";
                            break;
                        case "遷移宮":
                            大限化入三方分析.判斷句 = "";

                            if(大限化入三方分析.化出重疊宮=="夫妻宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "得到配偶的錢財。"; }
                            break;
                        case "交友宮":
                            大限化入三方分析.判斷句 = "";
                            if(大限化入三方分析.化出重疊宮=="父母宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "交友的財入田宅宮三方，賺錢，或是賣地產。"; }
                            if(大限化入三方分析.化出重疊宮=="財帛宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "交友的田宅入田宅宮三方，房地產買賣（流父重疊大友時為賣，有賺錢之意；流友重疊大友為買房地產）。"; }
                            break;
                        case "官祿宮":
                            大限化入三方分析.判斷句 = "";

                            if(大限化入三方分析.化出重疊宮=="命宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "宜從事房地產相關事業。"; }
                            if(大限化入三方分析.化出重疊宮=="疾厄宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "宜從事房地產相關事業。"; }
                            break;
                        case "田宅宮":
                            輸出顯示分類 = "家運田宅";
                            大限化入三方分析.判斷句 = "得到、買房地產。";

                            if(大限化入三方分析.三方重疊 == "命財官") 大限化入三方分析.判斷句 = "得到、買房地產，或房地產賺到錢。";
                            break;
                        case "福德宮":
                            大限化入三方分析.判斷句 = "";

                            if(大限化入三方分析.化出重疊宮=="夫妻宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "得偏財。"; }
                            break;
                        case "父母宮":
                            輸出顯示分類 = "財官";
                            大限化入三方分析.判斷句 = "交友的財入財庫，賺錢。***";

                            if(大限化入三方分析.化出重疊宮=="交友宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "交友的財入財庫，賺錢。"; }
                            if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "交友的財入財庫，賺錢。"; }
                            if(大限化入三方分析.化出重疊宮=="子女宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "父親的財入財庫，得到父親的錢財"; }
                            break;
                    } // end switch (大限人事宮) @ 田疾兄
                    break;
            case "夫遷福":
                輸出顯示分類 = "無分類";
                switch (大限人事宮) {
                    case "命宮":
                        大限化入三方分析.判斷句 = "";
                        if(大限化入三方分析.化出重疊宮=="田宅宮") { 輸出顯示分類 = "感情婚姻"; 大限化入三方分析.判斷句 = "桃花對象可能是已婚、失婚人士。"; }
                        break;
                    case "兄弟宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "夫妻宮":
                        輸出顯示分類 = "感情婚姻";
                        大限化入三方分析.判斷句 = "桃花，姻緣";
                        break;
                    case "子女宮":
                        大限化入三方分析.判斷句 = "";
                    
                        if(大限化入三方分析.性別=="男") { 輸出顯示分類 = "六親"; 大限化入三方分析.判斷句 = "配偶懷孕。"; }
                        break;
                    case "財帛宮":
                        大限化入三方分析.判斷句 = "";
                        if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "海外投資事業。"; }
                        break;
                    case "疾厄宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "遷移宮":
                        輸出顯示分類 = "家運田宅";
                        大限化入三方分析.判斷句 = "驛馬";
                        if(大限化入三方分析.化出重疊宮=="田宅宮") { 輸出顯示分類 = "家運田宅"; 大限化入三方分析.判斷句 = "宜海外投資房地產。"; }
                        if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "宜海外創業。"; }
                        if(大限化入三方分析.化出重疊宮=="官祿宮") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "宜海外投資。"; }
                        break;
                    case "交友宮":
                        輸出顯示分類 = "感情婚姻";
                        大限化入三方分析.判斷句 = "桃花。";
                        if(大限化入三方分析.化出重疊宮=="田宅宮") { 大限化入三方分析.判斷句 = "因重疊的是田宅宮（交友宮的夫妻宮），對象可能是已婚/離婚人士。"; }
                        break;
                    case "官祿宮":
                        輸出顯示分類 = "財官";
                        大限化入三方分析.判斷句 = "事業多驛馬、夫妻合夥*";
                        break;
                    case "田宅宮":
                        大限化入三方分析.判斷句 = "";
                        if(大限化入三方分析.化出重疊宮=="夫妻宮") { 輸出顯示分類 = "感情婚姻"; 大限化入三方分析.判斷句 = "三角戀情。"; }
                        break;
                    case "福德宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "父母宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                } // end switch (大限人事宮) @ 夫遷福
                break;
            case "父子友":
                輸出顯示分類 = "無分類";
                switch (大限人事宮) {
                    case "命宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "兄弟宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "夫妻宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "子女宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "財帛宮":
                        輸出顯示分類 = "財官";
                        大限化入三方分析.判斷句 = "錢財去了交友三方。";
                        if(大限化入三方分析.三方重疊 == "命財官") 大限化入三方分析.判斷句 += "出資給交友合夥。";
                        if(大限化入三方分析.三方重疊 == "父子友") 大限化入三方分析.判斷句 += "借錢給朋友**。";
                        if(大限化入三方分析.三方重疊 == "田疾兄") 大限化入三方分析.判斷句 += "投資房地產*。";
                        if(大限化入三方分析.三方重疊 == "夫遷福") 大限化入三方分析.判斷句 += "給錢父母、配偶、或花錢享受**。";
                        break;
                    case "疾厄宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "遷移宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "交友宮":
                        輸出顯示分類 = "感情婚姻";
                        大限化入三方分析.判斷句 = "桃花";
                        break;
                    case "官祿宮":
                        輸出顯示分類 = "財官";
                        大限化入三方分析.判斷句 = "合夥機遇";
                        break;
                    case "田宅宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "福德宮":
                        大限化入三方分析.判斷句 = "";
                        break;
                    case "父母宮":
                        大限化入三方分析.判斷句 = "";
                        if(大限化入三方分析.三方重疊 =="命財官") { 輸出顯示分類 = "財官"; 大限化入三方分析.判斷句 = "借貸行為。"; }
                        break;
                } // end switch (大限人事宮) @ 父子友
                break;
        }// end switch 大限人事宮化入三方.三方宮位
      輸出顯示矩陣[輸出顯示分類].push(大限化入三方分析.條件 + 大限化入三方分析.判斷句);
    } // end if 大限人事宮化入三方.成立
    
}  //end function 大限化入三方分析



// ---------------------------------------------------------------------

function 大限化祿權忌入一六十論斷(命盤, 大限數, 輸出顯示矩陣){
    // required function 化入祿權忌一六十(命盤, 化出宮, 對應宮位, 大限數, 借宮) (斗數分析配件)
    
    var 成立條件="", 判斷句="", 性別=命盤.生日.性別, 行運順逆=命盤.行運順逆, 大限人事宮化入一六十;
    var 人事宮位 = ["命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮", "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮"];
    var 運算宮位, 對應宮, 忌沖宮, 忌沖宮線, 對應宮線;
    var 輸出顯示分類 = "無分類";  //default display at 無分類
    var 判斷句, 判斷句附加;
    
    for(var i=0; i<12; i++){
        var 運算宮位 = 人事宮位[i];
            for(var j=0; j<12; j++){
                對應宮 = 人事宮位[j];
                大限人事宮化入一六十 = 化入祿權忌一六十(命盤, 運算宮位, 對應宮, 大限數, false);
                if(大限人事宮化入一六十.成立) {
                    判斷句 = ""; 判斷句附加 = "";
                    成立條件 = 大限人事宮化入一六十.化出宮 + "重疊" + 大限人事宮化入一六十.化出宮重疊 + 大限人事宮化入一六十.成立條件;
                    忌沖宮 = 大限人事宮化入一六十.忌沖宮; 忌沖宮線 = 大限人事宮化入一六十.忌沖宮線;
                    
                    switch(運算宮位){
                        case "命宮":
                            判斷句 = "";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "田宅宮":
                                    輸出顯示分類 = "家運田宅";
                                    if(大限人事宮化入一六十.化出宮重疊 == "財帛宮")  判斷句 = "，房地產投資。";
                                    break;
                                case "交友宮":
                                    輸出顯示分類 = "家運田宅";
                                    if(大限人事宮化入一六十.化入一十 && 大限人事宮化入一六十.化出宮重疊 == "田宅宮") {
                                       判斷句 = "，賣房地產。";
                                       if(大限人事宮化入一六十.忌沖宮 == "兄弟宮") 判斷句 += "因忌沖兄弟宮，可能是虧錢或價格不佳的變賣房地產。";
                                    } // 忌入交友一十
                                    break;
                            } // end switch 命宮
                            break;
                            
                        case "兄弟宮":
                            判斷句 = "";
                            輸出顯示分類 = "財官";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "田宅宮":
                                    if(大限人事宮化入一六十.化出宮重疊 == "財帛宮")  判斷句 = "，房地產投資。";
                                    break;
                                case "財帛宮":
                                    if(大限人事宮化入一六十.化出宮重疊 == "田宅宮")  判斷句 = "，房地產賺錢。";
                                    break;
                                case "兄弟宮":
                                    if(大限人事宮化入一六十.化出宮重疊 == "財帛宮") {
                                        判斷句 = "，房地產賺錢。**";
                                        if(大限人事宮化入一六十.忌入宮 == "兄弟宮") 判斷句 = "，房地產賺錢。";
                                    }
                                    break;
                            } // end switch 兄弟宮
                            break;
                        
                        case "夫妻宮":
                            判斷句 = "";
                            switch(大限人事宮化入一六十.對應宮) {
                                case "財帛宮":
                                    輸出顯示分類 = "財官";
                                    判斷句 = "，偏財。**";
                                    if(大限人事宮化入一六十.化出宮重疊 == "福德宮")  判斷句 = "，得偏財。";
                                    break;
                                case "夫妻宮":
                                    輸出顯示分類 = "感情婚姻";
                                    判斷句 = "，桃花姻緣。**";
                                    break;
                                case "命宮":
                                    輸出顯示分類 = "感情婚姻";
                                    判斷句 = "，桃花姻緣。**";
                                    break;
                            } // end switch 夫妻宮
                            break;
                        
                        case "子女宮":
                            判斷句 = "";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "子女宮":
                                    輸出顯示分類 = "財官";
                                    判斷句 = "，得子、合夥機遇。**"; 
                                    break;
                            } // end switch 子女宮
                            break;
                        
                        case "財帛宮":
                            判斷句 = "";
                            輸出顯示分類 = "財官";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "財帛宮":
                                    判斷句 = "，賺到錢。******";
                                    if(大限人事宮化入一六十.化出宮重疊 == "兄弟宮") 判斷句 = "，賺到房地產方面的錢財。";
                                    break;
                                case "交友宮":
                                    判斷句 = "，錢財給交友賺了。*";
                                    if(大限人事宮化入一六十.忌沖宮線 == "兄友線")  判斷句 = "，錢財給交友賺了又沖破財的子田線，嚴重損財。";
                                    break;
                                case "命宮":
                                    判斷句 = "，賺到錢財**。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "兄弟宮") 判斷句 = "，適合賺房地產方面的錢財。";
                                    break;
                            } // end switch 財帛宮
                            break;
                        
                        case "疾厄宮":
                            判斷句 = "";
                            輸出顯示分類 = "財官";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "官祿宮":
                                    if(大限人事宮化入一六十.化出宮重疊 == "官祿宮") 判斷句 = "，房地產事業。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "田宅宮") 判斷句 = "，房地產事業。";
                                    break;
                                case "財帛宮":
                                    if(大限人事宮化入一六十.化出宮重疊 == "官祿宮") 判斷句 = "，公司事業賺錢。";
                                    break;
                            } // end switch 疾厄宮
                            break;
                        
                        case "遷移宮":
                            判斷句 = "";
                            輸出顯示分類 = "財官";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "官祿宮":
                                    判斷句 = "，驛馬事業。******";
                                    if(大限人事宮化入一六十.化出宮重疊 == "福德宮") 判斷句 = "，適合從事五術行業。";
                                    break;
                                case "命宮":
                                    判斷句 = "，有得到配偶或驛馬錢財的機遇。**";
                                    if(大限人事宮化入一六十.化出宮重疊 == "夫妻宮") 判斷句 = "，有得到配偶錢財的機遇。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "官祿宮") 判斷句 = "，驛馬錢財的機遇。";
                                    break;
                                case "財帛宮":
                                    判斷句 = "，有得到配偶或驛馬錢財的機遇**";
                                    if(大限人事宮化入一六十.化出宮重疊 == "夫妻宮") 判斷句 = "，有得到配偶錢財的機遇。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "官祿宮") 判斷句 = "，驛馬錢財的機遇。";
                                    break;
                            } // end switch 遷移宮
                            break;
                        
                        case "交友宮":
                            判斷句 = "";
                            輸出顯示分類 = "財官";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "官祿宮":
                                    判斷句 = "，合夥事業機遇***。"; 
                                    break;
                                case "夫妻宮":
                                    輸出顯示分類 = "感情婚姻";
                                    判斷句 = "，桃花運。"; 
                                    break;
                            } // end switch 交友宮
                            break;
                        
                        case "官祿宮":
                            判斷句 = "";
                            輸出顯示分類 = "財官";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "官祿宮":
                                    判斷句 = "，事業機遇***。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "遷移宮") 判斷句 = "，驛馬事業。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "交友宮") 判斷句 = "，合夥事業或繼承父業。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "子女宮") 判斷句 = "，合夥事業。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "福德宮") 判斷句 = "，夫妻合夥事業。";
                                    if(大限人事宮化入一六十.化出宮重疊 == "疾厄宮") 判斷句 = "，房地產事業。";
                                    break;
                                case "財帛宮":
                                    判斷句 = "，事業賺錢。**";
                                    if(大限人事宮化入一六十.化出宮重疊 == "疾厄宮") 判斷句 = "，從事房地產事業賺錢。";
                                    break;
                                case "福德宮":
                                    判斷句 = "，夫妻合夥事業。";
                                    break;
                                case "命宮":
                                    判斷句 = "，事業機遇。**";
                                    if(大限人事宮化入一六十.化出宮重疊 == "子女宮") 判斷句 = "，合夥事業機遇。";
                                    break;
                            } // end switch 官祿宮
                            break;
                        
                        case "田宅宮":
                            判斷句 = "";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "財帛宮":
                                    輸出顯示分類 = "財官";
                                    判斷句 = "，房地產賺錢、買房地產。**";
                                    if(大限人事宮化入一六十.化出宮重疊 == "兄弟宮") 判斷句 = "，房地產賺錢。";
                                    break;
                                case "官祿宮":
                                    輸出顯示分類 = "財官";
                                    判斷句 = "，房地產事業。**";
                                    break;
                                case "命宮":
                                    輸出顯示分類 = "家運田宅";
                                    判斷句 = "，得房地產。**";
                                    break;
                            } // end switch 田宅宮
                            break;
                        
                        case "福德宮":
                            判斷句 = ""; 
                            break;
                        
                        case "父母宮":
                            判斷句 = "";
                            輸出顯示分類 = "財官";
                            成立條件 = 大限人事宮化入一六十.成立條件結論;
                            switch(大限人事宮化入一六十.對應宮) {
                                case "財帛宮":
                                    判斷句 = "，賺到朋友的錢。******"; 
                                    break;
                                case "交友宮":
                                    判斷句 = "，錢財給交友賺了。*";
                                    if(大限人事宮化入一六十.忌沖宮線 == "兄友線")  判斷句 = "難賺到朋友大眾的錢財，又自損財庫。";
                                    break;
                                
                            } // end switch 父母宮

                            break;
                        
                    } // end switch 運算宮位
                    
                    if(判斷句 !="") 輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷句); else 輸出顯示矩陣.無分類.push(大限人事宮化入一六十.成立條件結論);
                } // end if
            } // end for j 對應宮
    } // end for i 人事宮
    
} // end 大限化祿權忌入一六十論斷



// ---------------------------------------------------------------------

function 大限另類同類相沖論斷(命盤, 大限數, 應事宮, 相應沖宮, 輸出顯示矩陣){
    // 江氏另類相沖，比方大父沖田是夫妻的田沖田，應事宮 = 夫妻宮，相應沖宮 = 田宅宮，應事宮的相應宮 = 父母官
    // 應事宮: 大限交友宮，大限夫妻宮。。。。（含"大限"）
    // 相應沖宮：田宅宮、疾厄宮。。。。 （不含"大限"）
    // 輸出顯示矩陣：要export到那個analysis的array，比方"分析矩陣.特殊形態"
    
    var 大限另類同類相沖分析 = {
    "化出宮": 應事宮,  //比方大限夫妻宮
    "沖宮": 相應沖宮,
    "大限數": 大限數,
    "成立": false,
    "成立數次": 0,  //可能符合數個場景
    "四化條件": "",
    "四化含義": "",
    "場景": 0,
    "判斷句": "",
    "矩陣": [],
    "備註": ""
    } // end var 大限另類同類相沖分析

    var 分析場景, 論斷註解;
    var tempstr = "****";
    
    var 大限另類同類相沖 = 另類同類相沖(命盤, 大限數, 應事宮, 相應沖宮);
    if(大限另類同類相沖.成立) {
        大限另類同類相沖分析.成立 = true;
        大限另類同類相沖分析.成立數次 = 大限另類同類相沖.成立數次;
        大限另類同類相沖分析.四化條件 = 大限另類同類相沖.四化條件;  //如果成立數次 >1，就儲存最後一個成立條件
        大限另類同類相沖分析.四化含義 = 大限另類同類相沖.四化含義;  //如果成立數次 >1，就儲存最後一個成立條件
        大限另類同類相沖分析.矩陣 = 大限另類同類相沖.矩陣;
        
        switch(相應沖宮){
            case "財帛宮":
                if(應事宮=="大限交友宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        if(分析場景==1 || 分析場景==2) 論斷註解 = "因朋友損財。"; else 論斷註解 = "賺到朋友的錢財。";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限交友宮")
                
                if(應事宮=="大限夫妻宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        if(分析場景==1 || 分析場景==2) 論斷註解 = "因配偶損財。"; else 論斷註解 = "損配偶的財。";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限夫妻宮")
                
                break;
            case "官祿宮":
                if(應事宮=="大限交友宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        if(分析場景==1 || 分析場景==2) 論斷註解 = "交友破我的事業，事業不順利，上司與命主不和，被裁員等。"; else 論斷註解 = "命主破交友的事業，自身與上司不和，離職等。";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限交友宮")
                break;
            case "疾厄宮":
                if(應事宮=="大限夫妻宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "夫妻聚少離多，分居或離異。";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限夫妻宮")
                
                if(應事宮=="大限父母宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "與父親緣薄。";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限父母宮")
                
                if(應事宮=="大限兄弟宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "與母親、兄弟緣薄。";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限兄弟宮")
                
                if(應事宮=="大限子女宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "與孩子緣薄、流產等。";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限子女宮")
                
                break;
            case "田宅宮":
                if(應事宮=="大限夫妻宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "夫妻聚少離多，分居或離異。";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限夫妻宮")
                
                if(應事宮=="大限父母宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "與父親聚少離多、搬離祖屋。";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限父母宮")
                
                if(應事宮=="大限兄弟宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "與母親、兄弟聚少離多";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限兄弟宮")
                
                if(應事宮=="大限子女宮"){
                    for(var i=0; i < 大限另類同類相沖.矩陣.length; i++){
                        分析場景 = 大限另類同類相沖.矩陣[i].substr(0,1);
                        論斷註解 = "與孩子緣分較差，或孩子被別人帶。";
                        //if(分析場景==1 || 分析場景==2) 論斷註解 = ""; else 論斷註解 = "";
                        輸出顯示矩陣.push(大限另類同類相沖.矩陣[i].substr(1,大限另類同類相沖.矩陣[i].length-1) + 論斷註解);
                    } // end for
                } //end if(應事宮=="大限子女宮")
                break;
        }  // end switch(相應沖宮)
          
    } // end if(大限另類同類相沖.成立)
        
}  // end function 大限另類同類相沖論斷


function 另類同類相沖 (命盤, 大限數, 應事宮, 相應沖宮) {
   
    var 另類相沖 = {
        "輸入條件成立": true,
        "測試場景": 0,
        "四化條件": "",
        "四化含義": "",
		"大限數": 0,
		"判斷句": "",
        "成立數次": 0,  //可能符合數個場景
		"成立": false,
        "矩陣": []
	};
    
    var 輸入條件 = false, 大限成立=false;
    var 應事宮位 = 宮位分解(應事宮, 大限數);
    var 應事宮位數, 應事宮位地支數, 應事宮的相應宮, 應事宮的相應宮的地支數;
    var 克應含義 = "";
    
    if(大限數 != undefined && Number(大限數)>0 && Number(大限數)<10) 大限成立 = true;
    
    if(!(應事宮位.正確 && 大限成立)) {
        console.log('function 另類同類相沖 輸入錯誤！ 應事宮：' + 應事宮 + ', 大限數：' + 大限數);
        另類相沖.輸入條件成立 = false;
        return 另類相沖;
    }  // end if
    
    另類相沖.大限數 = 大限數;
    
    應事宮位數 = 人事宮字數轉換(應事宮位.宮名);
    if(大限成立) 應事宮位地支數 = 命盤.大限[大限數].人事宮[應事宮位.宮名];
    應事宮的相應宮 = 人事宮位挪移(應事宮位.宮名, 相應沖宮);  //本命宮位
    //console.log('大限：' + 大限數 + ',' + 應事宮位.宮名 + '地支數為' + 應事宮位地支數 + '。相應宮位為' + 應事宮的相應宮);
    
    //場景1：流運 應事宮的相應宮 重疊 應事宮 沖 相應沖宮， 比方 大父重疊夫妻宮沖田宅宮
    var 場景1 = 單向四化分析(命盤, 大限數, "忌沖", 應事宮的相應宮, 相應沖宮, "命宮", 應事宮位.宮名);  //1994年12月10日-戌-女
    
    //(命盤, 大限數, 四化, 化出宮, 化入宮人事宮, 化入對應宮, 化出宮重疊條件)
    //大限另類同類相沖論斷(命盤, 大限數, "大限夫妻宮", "田宅宮", 分析矩陣.六親);
    
    /*
	var 場景1 = new 宮位飛四化元件();
    場景1.大限數 = 大限數;
	場景1.化出宮 =  "大限" + 應事宮的相應宮;
	場景1.化出宮重疊 = 應事宮位.宮名;
    場景1.四化 ="忌沖";
    場景1.化入宮線 = 相應沖宮;
	場景1.化入宮重疊 = "";
    宮位單向四化(場景1, 命盤);
    */
    
    
    if(場景1.成立) {
        //console.log("場景1 - 成立：" + 大限數 + "，" + 應事宮 + "，" + 相應沖宮);
        另類相沖.測試場景 = 1;
        另類相沖.四化條件 = "大限" + 應事宮的相應宮 + "重疊" + 應事宮位.宮名 + 場景1.星曜 + "化忌沖" + 相應沖宮;
        另類相沖.四化含義 = 應事宮位.宮名 + "的" + 相應沖宮 + "沖命主的" + 相應沖宮;
        另類相沖.成立 = true;
        另類相沖.成立數次++;
        另類相沖.判斷句 = 另類相沖.四化條件  + "，" +  另類相沖.四化含義 + "，" + 克應含義;
        另類相沖.矩陣.push(另類相沖.測試場景 + 另類相沖.判斷句);
    }  // end if if(場景1.成立)


    //場景2：流運 應事宮 重疊 應事宮的相應宮 沖 相應沖宮， 比方 大夫重疊父母宮沖田宅宮
    var 場景2 = 單向四化分析(命盤, 大限數, "忌沖", 應事宮位.宮名, 相應沖宮, "命宮", 應事宮的相應宮);  //1992年9月1日-戌-男
    /*
	var 場景2 = new 宮位飛四化元件();
    場景2.大限數 = 大限數;
	場景2.化出宮 =  "大限" + 應事宮位.宮名;
	場景2.化出宮重疊 = 應事宮的相應宮;
    場景2.四化 ="忌沖";
    場景2.化入宮線 = 相應沖宮;
	場景2.化入宮重疊 = "";
    宮位單向四化(場景2, 命盤);
    */
    
    if(場景2.成立) {
        //console.log("場景2 - 成立：" + 大限數 + "，" + 應事宮 + "，" + 相應沖宮);
        另類相沖.測試場景 = 2;
        另類相沖.四化條件 = "大限" + 應事宮位.宮名 + "重疊" + 應事宮的相應宮 + 場景2.星曜 + "化忌沖" + 相應沖宮;
        另類相沖.四化含義 = 應事宮位.宮名 + "的" + 相應沖宮 + "沖命主的" + 相應沖宮;
        另類相沖.成立 = true;
        另類相沖.成立數次++;
        另類相沖.判斷句 = 另類相沖.四化條件  + "，" +  另類相沖.四化含義 + "，" + 克應含義;
        另類相沖.矩陣.push(另類相沖.測試場景 + 另類相沖.判斷句);
    }  // end if if(場景2.成立)

    
    //場景3：流運 相應沖宮 沖 應事宮 重疊 應事宮的相應宮 ， 比方 大田沖夫妻宮重疊大限父母宮
    var 場景3 = 單向四化分析(命盤, 大限數, "忌沖", 相應沖宮, 應事宮位.宮名, "命宮", "", 應事宮的相應宮); //1998年9月24日-戌-女
    /*
	var 場景3 = new 宮位飛四化元件();
    場景3.大限數 = 大限數;
	場景3.化出宮 =  "大限" + 相應沖宮;
	場景3.化出宮重疊 = "";
    場景3.四化 ="忌沖";
    場景3.化入宮線 = 應事宮位.宮名;
	場景3.化入宮重疊 = "大限" + 應事宮的相應宮;
    宮位單向四化(場景3, 命盤);
    */
    
    if(場景3.成立) {
        另類相沖.測試場景 = 3;
        另類相沖.四化條件 = "大限" + 相應沖宮 + 場景3.星曜 + "化忌沖" + 應事宮位.宮名 + "重疊大限" + 應事宮的相應宮;
        另類相沖.四化含義 = "命主的" + 相應沖宮 + "沖" + 應事宮位.宮名 + "的" + 相應沖宮;
        另類相沖.成立 = true;
        另類相沖.成立數次++;
        另類相沖.判斷句 = 另類相沖.四化條件  + "，" +  另類相沖.四化含義 + "，" + 克應含義;
        另類相沖.矩陣.push(另類相沖.測試場景 + 另類相沖.判斷句);
        //console.log("場景3 - 成立：" + 另類相沖.四化條件);
    }  // end if if(場景3.成立)

    
    //場景4：流運 相應沖宮 沖 應事宮 重疊 應事宮的相應宮 ， 比方 大命重疊田宅宮，沖父母宮重疊大限夫妻宮
    var 場景4 = 單向四化分析(命盤, 大限數, "忌沖", "命宮", 應事宮的相應宮, "命宮", 相應沖宮, 應事宮位.宮名); // 2004年9月19日-戌-男
    /*
	var 場景4 = new 宮位飛四化元件();
    場景4.大限數 = 大限數;
	場景4.化出宮 =  "大限命宮";
	場景4.化出宮重疊 = 相應沖宮;
    場景4.四化 ="忌沖";
    場景4.化入宮線 = 應事宮的相應宮;
	場景4.化入宮重疊 = "大限" + 應事宮位.宮名;
    宮位單向四化(場景4, 命盤);
    */
    
    if(場景4.成立) {
        另類相沖.測試場景 = 4;
        另類相沖.四化條件 = "大限命宮重疊" + 相應沖宮 + 場景4.星曜 + "化忌沖" + 應事宮的相應宮 + "重疊大限" + 應事宮位.宮名;
        另類相沖.四化含義 = "命主的" + 相應沖宮 + "沖" + 應事宮位.宮名 + "的" + 相應沖宮;
        另類相沖.成立 = true;
        另類相沖.成立數次++;
        另類相沖.判斷句 = 另類相沖.四化條件  + "，" +  另類相沖.四化含義 + "，" + 克應含義;
        另類相沖.矩陣.push(另類相沖.測試場景 + 另類相沖.判斷句);
        //console.log("場景4 - 成立：" + 另類相沖.四化條件);
    }  // end if if(場景4.成立)


    //場景5：流運 相應沖宮 沖 應事宮 重疊 應事宮的相應宮 ， 比方 大田沖 父母宮重疊大限夫妻宮
    var 場景5 = 單向四化分析(命盤, 大限數, "忌沖", 相應沖宮, 應事宮的相應宮, "命宮", "", 應事宮位.宮名); //1995年3月7日-辰-女
    /*
	var 場景5 = new 宮位飛四化元件();
    場景5.大限數 = 大限數;
	場景5.化出宮 =  "大限" + 相應沖宮;
	場景5.化出宮重疊 = "";
    場景5.四化 ="忌沖";
    場景5.化入宮線 = 應事宮的相應宮;
	場景5.化入宮重疊 = "大限" + 應事宮位.宮名;
    宮位單向四化(場景5, 命盤);
    */
    
    if(場景5.成立) {
        另類相沖.測試場景 = 5;
        另類相沖.四化條件 = "大限" + 相應沖宮 + 場景5.星曜 + "化忌沖" + 應事宮的相應宮 + "重疊大限" + 應事宮位.宮名;
        另類相沖.四化含義 = "命主的" + 相應沖宮 + "沖" + 應事宮位.宮名 + "的" + 相應沖宮;
        另類相沖.成立 = true;
        另類相沖.成立數次++;
        另類相沖.判斷句 = 另類相沖.四化條件  + "，" +  另類相沖.四化含義 + "，" + 克應含義;
        另類相沖.矩陣.push(另類相沖.測試場景 + 另類相沖.判斷句);
        //console.log("場景5 - 成立：" + 另類相沖.四化條件);
    }  // end if if(場景5.成立)
    
    
    //if(另類相沖.成立) console.log(另類相沖);
    return 另類相沖;
} // function 另類同類相沖


function 單向四化分析(命盤, 大限數, 四化, 化出宮, 化入宮人事宮, 化入對應宮, 化出宮重疊條件, 化入宮重疊條件){
    // 大限數，1 for 本命，rest for 大限
    // required function 宮位四化落宮 (斗數分析配件)
    // 大官（人事宮）化祿（四化）入 財帛宮（化入宮）的田宅宮（化入對應宮）
    
    if(化入對應宮 === undefined) 化入對應宮 = "命宮";
    if(化出宮重疊條件 === undefined) 化出宮重疊條件 = "";
    if(化入宮重疊條件 === undefined) 化入宮重疊條件 = "";
    
    var 單向四化 = {
        "大限數": 大限數,
        "化出宮": (大限數 == 1) ? 化出宮 : "大限" + 化出宮,
        "化出宮地支": 命盤.大限[大限數].宮位[化出宮].地支數,
        "化出宮重疊": "",
        "化出宮重疊條件": 化出宮重疊條件,
        "四化": 四化,
        "星曜": "",
        "化入宮人事宮": 化入宮人事宮,
        "化入對應宮": 化入對應宮,
        "化入宮重疊": "",  //重疊的宮位
        "化入宮重疊線": "",  //重疊的宮位線
        "化入宮重疊條件": 化入宮重疊條件,  //可以是線或宮位
        "化入宮": "",
        "化入宮線": "",
        "化入宮地支": "",
        "忌沖宮": "",
        "忌沖宮線": "",
        "忌沖地支": "",
        "成立": false,
        "成立條件": "",
        "備註": ""
    } // end var 單向四化
    
    
    //var 化出宮地支 = 命盤.大限[大限數].宮位[化出宮].地支數;
    單向四化.化入宮 = 人事宮位挪移(化入宮人事宮, 單向四化.化入對應宮);
    單向四化.化入宮線 = 宮位轉六線(單向四化.化入宮);
    單向四化.化入宮地支 = 命盤.人事宮[單向四化.化入宮].地支數;
    
    var 宮位飛四化 = 宮位四化落宮(命盤, 化出宮, 大限數);
    單向四化.化出宮重疊 = 宮位飛四化.化出重疊宮;
    單向四化.化入宮重疊 = 宮位飛四化[四化].大限宮位;
    單向四化.化入宮重疊線 = 宮位飛四化[四化].大限宮位線;
    
    單向四化.忌沖宮 = 宮位飛四化.忌沖.宮位; 單向四化.忌沖宮線 = 宮位飛四化.忌沖.宮位線; 單向四化.忌沖地支 = 宮位飛四化.忌沖.地支數; 
    
    var 化出重疊句 = (單向四化.化出宮重疊條件 == "") ? "" : "重疊" + 單向四化.化出宮重疊;
    var 化入重疊句 = (單向四化.化入宮重疊條件 == "") ? "" : "重疊大限" + 單向四化.化入宮重疊;
    
    if(單向四化.化出宮重疊條件 != "" && 宮位飛四化.化出重疊宮 != 單向四化.化出宮重疊條件) return 單向四化;
    
    switch(四化) {
        case "化祿":
            if(宮位飛四化.化祿.宮位 == 單向四化.化入宮) {
                單向四化.成立 = true;
                單向四化.星曜 = 宮位飛四化.化祿.星曜;
                單向四化.成立條件 = 單向四化.化出宮 + 化出重疊句 + 單向四化.星曜 + 單向四化.四化 + "入" + 單向四化.化入宮 + 化入重疊句 + "，為" + 單向四化.四化 + "入" + 單向四化.化入宮人事宮 + "的" + 單向四化.化入對應宮;
            } // end for 化祿
            break;
        case "化權":
            if(宮位飛四化.化權.宮位 == 單向四化.化入宮) {
                單向四化.成立 = true;
                單向四化.星曜 = 宮位飛四化.化權.星曜;
                單向四化.成立條件 = 單向四化.化出宮 + 化出重疊句 + 單向四化.星曜 + 單向四化.四化 + "入" + 單向四化.化入宮 + 化入重疊句 + "，為" + 單向四化.四化 + "入" + 單向四化.化入宮人事宮 + "的" + 單向四化.化入對應宮;
            } // end for 化權
            break;
        case "化科":
            if(宮位飛四化.化科.宮位 == 單向四化.化入宮) {
                單向四化.成立 = true;
                單向四化.星曜 = 宮位飛四化.化科.星曜;
                單向四化.成立條件 = 單向四化.化出宮 + 化出重疊句 + 單向四化.星曜 + 單向四化.四化 + "入" + 單向四化.化入宮 + 化入重疊句 + "，為" + 單向四化.四化 + "入" + 單向四化.化入宮人事宮 + "的" + 單向四化.化入對應宮;
            } // end for 化科
            break;
        case "化忌":
            if(宮位飛四化.化忌.宮位 == 單向四化.化入宮) {
                單向四化.成立 = true;
                單向四化.星曜 = 宮位飛四化.化忌.星曜;
                單向四化.成立條件 = 單向四化.化出宮 + 化出重疊句 + 單向四化.星曜 + 單向四化.四化 + "入" + 單向四化.化入宮 + 化入重疊句 + "，為" + 單向四化.四化 + "入" + 單向四化.化入宮人事宮 + "的" + 單向四化.化入對應宮;
            } // end for 化忌
            break;
        case "忌沖":
            if(宮位飛四化.忌沖.宮位 == 單向四化.化入宮) {
                單向四化.成立 = true;
                單向四化.星曜 = 宮位飛四化.化忌.星曜;
                單向四化.成立條件 = 單向四化.化出宮 + "重疊" + 單向四化.化出宮重疊 + 單向四化.星曜 + "化" + 單向四化.四化 + 單向四化.化入宮 + 化入重疊句 + "，為化" + 單向四化.四化 + 單向四化.化入宮人事宮 + "的" + 單向四化.化入對應宮;
            } // end for 化忌
            break;
    } // end switch(四化)
    
    //if(大限數 == 4 && 化出宮 == "命宮") console.log(單向四化);
    
    if(單向四化.成立 && 單向四化.化入宮重疊條件 != "") {
       if(單向四化.化入宮重疊 == 單向四化.化入宮重疊條件 || 單向四化.化入宮重疊線 == 單向四化.化入宮重疊條件) 單向四化.成立 = true; else 單向四化.成立 = false;
    } // end if 化入宮重疊條件 成立
       
    return 單向四化;
} // end function 單向四化分析



// ---------------------------------------------------------------------

function 大限化入光明成就田宅論斷(命盤, 大限數, 大限人事宮, 四化, 輸出顯示矩陣){
    //大限人事宮：比方大限夫妻宮，大限財帛宮（可以 含或不含"大限"，依大限數決定是本命或大限）
    //是否化入或沖到大限化出宮的光明、成就、子田線，且大限的光明、成就、子田線又重疊
    //四化：祿忌，化祿、化忌，祿忌就同時測試化祿與化忌
    
    var 大限宮位 = 宮位分解(大限人事宮, 大限數).宮名;  //不帶大限
    //var 大限宮位數 = 人事宮字數轉換(大限宮位.宮名);
    var 大限人事宮地支 = 命盤.大限[大限數].宮位[大限人事宮].地支數;
    var 輸出顯示分類 = "無分類";  //default display at 無分類
    
    var 宮位飛四化 = 宮位四化落宮(命盤, 大限宮位, 大限數);
    var 宮位相關流線本命, 宮位相關流線大限;
    var 光明成就子田重疊 = false, 判斷吉凶="";
    var 化出宮重疊 = 宮位飛四化.化出重疊宮;
    var 祿入宮重疊 = 宮位飛四化.化祿.宮位;
    var 忌沖宮重疊 = 宮位飛四化.忌沖.宮位;
    var 成立條件 = "";
    var 判斷屬吉 = 大限宮位 + "有機遇*";
    var 判斷屬凶 = 大限宮位 + "前景不理想*";
    
    switch(四化){
        case "化祿":
            宮位相關流線本命 = 六線宮位光明成就子田分析(宮位飛四化.化祿.宮位線, 大限宮位).光明成就子田;
            宮位相關流線大限 = 六線宮位光明成就子田分析(宮位飛四化.化祿.大限宮位線, 大限宮位).光明成就子田;
            
            if(宮位相關流線本命.length==3 && 宮位相關流線大限.length==3) 光明成就子田重疊 = true;
            成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + "，" + 宮位飛四化.化祿.星曜 + 四化 + "入" + 宮位飛四化.化祿.宮位線 + "重疊" + 宮位飛四化.化祿.大限宮位線 + "，為祿入自身的" + 宮位相關流線本命 + "重疊" + 宮位相關流線大限 + "，";
            判斷吉凶 = 判斷屬吉;
            break;
        case "忌沖":
            宮位相關流線本命 = 六線宮位光明成就子田分析(宮位飛四化.忌沖.宮位線, 大限宮位).光明成就子田;
            宮位相關流線大限 = 六線宮位光明成就子田分析(宮位飛四化.忌沖.大限宮位線, 大限宮位).光明成就子田;
            
            if(宮位相關流線本命.length==3 && 宮位相關流線大限.length==3) 光明成就子田重疊 = true;
            成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + "，" + 宮位飛四化.化忌.星曜 + "化" + 四化 + 宮位飛四化.忌沖.宮位線 + "重疊" + 宮位飛四化.忌沖.大限宮位線 + "，為沖自身的" + 宮位相關流線本命 + "重疊" + 宮位相關流線大限 + "，";
            判斷吉凶 = 判斷屬凶;
            break;
    } // switch(四化)
    
    if(光明成就子田重疊) {
        switch(大限宮位){
            case "命宮":
                輸出顯示分類 = "無分類";
                
                if(四化 == "化祿") {
                    重疊宮位相關流線本命 = 六線宮位光明成就子田分析(宮位飛四化.化祿.宮位線, 化出宮重疊).光明成就子田;
                    重疊宮位相關流線大限 = 六線宮位光明成就子田分析(宮位飛四化.化祿.大限宮位線, 化出宮重疊).光明成就子田;
                    if(重疊宮位相關流線本命.length==3 && 重疊宮位相關流線大限.length==3) 成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + "，" + 宮位飛四化.化祿.星曜 + 四化 + "入" + 宮位飛四化.化祿.宮位線 + "重疊" + 宮位飛四化.化祿.大限宮位線 + "，為化祿入自身的" + 重疊宮位相關流線本命 + "重疊" + 重疊宮位相關流線大限 + "，";
                }
                
                if(四化 == "忌沖") {
                    重疊宮位相關流線本命 = 六線宮位光明成就子田分析(宮位飛四化.忌沖.宮位線, 化出宮重疊).光明成就子田;
                    重疊宮位相關流線大限 = 六線宮位光明成就子田分析(宮位飛四化.忌沖.大限宮位線, 化出宮重疊).光明成就子田;
                    if(重疊宮位相關流線本命.length==3 && 重疊宮位相關流線大限.length==3) 成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + "，" + 宮位飛四化.化忌.星曜 + "化" + 四化 + 宮位飛四化.忌沖.宮位線 + "重疊" + 宮位飛四化.忌沖.大限宮位線 + "，為化忌沖自身的" + 重疊宮位相關流線本命 + "重疊" + 重疊宮位相關流線大限 + "，";
                }
                
                switch(四化){
                    case "化祿":
                        if(化出宮重疊 == "夫妻宮") { 輸出顯示分類 = "感情婚姻"; 判斷吉凶 = "感情、桃花機遇**"; }
                        
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                    case "忌沖":
                        if(化出宮重疊 == "夫妻宮") { 輸出顯示分類 = "感情婚姻"; 判斷吉凶 = "感情挫折**"; }
                        
                        if(化出宮重疊 == "官祿宮") { 
                            輸出顯示分類 = "財官";
                            if(宮位飛四化.忌沖.宮位線 == "父疾線") 判斷吉凶 = "事業潰敗，從商者易資金周轉不靈而倒閉；打工者可能失業減薪。"; 
                            if(宮位飛四化.忌沖.宮位線 == "子田線") 判斷吉凶 = "事業沒有什麼前途。"; 
                            if(宮位飛四化.忌沖.宮位線 == "兄友線") 判斷吉凶 = "事業每況益下、保守為宜。"; 
                        } //end if 化出宮重疊 == "官祿宮"

                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                } // end switch(四化)
                break;
            case "兄弟宮":
                switch(true){
                    case (化出宮重疊 =="xx" && 四化 == "xx"):
                        判斷吉凶 = "";
                        輸出顯示矩陣.六親.push(成立條件 + 判斷吉凶);
                        break;
                    default:
                        輸出顯示矩陣.六親.push(成立條件 + 判斷吉凶);
                } // end switch(化出宮重疊)
                break;
            case "夫妻宮":
                switch(true){
                    case (化出宮重疊 =="xx" && 四化 == "xx"):
                        判斷吉凶 = "";
                        輸出顯示矩陣.感情婚姻.push(成立條件 + 判斷吉凶);
                        break;
                    default:
                        輸出顯示矩陣.感情婚姻.push(成立條件 + 判斷吉凶);
                } // end switch(化出宮重疊)
                break;
            case "子女宮":
                switch(true){
                    case (化出宮重疊 =="xx" && 四化 == "xx"):
                        判斷吉凶 = "";
                        輸出顯示矩陣.六親.push(成立條件 + 判斷吉凶);
                        break;
                    default:
                        輸出顯示矩陣.六親.push(成立條件 + 判斷吉凶);
                } // end switch(化出宮重疊)
                break;
            case "財帛宮":
                輸出顯示分類 = "財官";
                switch(四化){
                    case "化祿":
                        if(宮位飛四化.化忌.宮位=="兄弟宮") 判斷吉凶 = "錢財投資有利。";
                        if(化出宮重疊 =="官祿宮" && 祿入宮重疊 == "疾厄宮") 判斷吉凶 = "錢財事業祿入官的6、10與錢財六線重疊，事業發展、賺錢。";
                        
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                    case "忌沖":
                        判斷吉凶 = "損財。**";
                        
                        if(宮位飛四化.忌沖.宮位線 == "兄友線") { 
                            判斷吉凶 = "為財帛宮化忌沖自身的子田線重疊成就線，嚴重損財。";
                            if(宮位飛四化.化忌.宮位 == "兄弟宮") {
                                成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + "，" + 宮位飛四化.化忌.星曜 + "化忌入" + 宮位飛四化.化忌.宮位 + "重疊" + 宮位飛四化.化忌.大限宮位 + "，為化忌入自身的財庫，";
                                判斷吉凶 = "事業上或投資都容易賺到錢。";
                            }
                        }  // end if 宮位飛四化.忌沖.宮位線 == "兄友線"
                        
                        if(宮位飛四化.忌沖.宮位線 == "父疾線") { 判斷吉凶 = "為財帛宮化忌沖自身的成就線，賺錢困難。"; }
                        if(宮位飛四化.忌沖.宮位線 == "子田線") { 判斷吉凶 = "為財帛宮化忌沖自身光明線，沒有賺錢的機遇。"; }
                        
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                } // end switch(四化)
                break;
            case "疾厄宮":
                switch(true){
                    case (化出宮重疊 =="xx" && 四化 == "xx"):
                        判斷吉凶 = "";
                        輸出顯示矩陣.健康意外.push(成立條件 + 判斷吉凶);
                        break;
                    default:
                        輸出顯示矩陣.健康意外.push(成立條件 + 判斷吉凶);
                } // end switch(化出宮重疊)
                break;
            case "遷移宮":
                switch(true){
                    case (化出宮重疊 =="xx" && 四化 == "xx"):
                        判斷吉凶 = "";
                        輸出顯示矩陣.健康意外.push(成立條件 + 判斷吉凶);
                        break;
                    default:
                        輸出顯示矩陣.健康意外.push(成立條件 + 判斷吉凶);
                } // end switch(化出宮重疊)
                break;
            case "交友宮":
                switch(四化){
                    case "化祿":
                        
                        break;
                    case "忌沖":
                        輸出顯示分類 = "財官";
                        判斷吉凶 = "交友（上司/公司）的前景不佳，可能導致裁員、轉換工作、部門的狀況。";
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                } // end switch(交友宮 四化)
                break;
            case "官祿宮":
                輸出顯示分類 = "財官";
                switch(四化){
                    case "化祿":
                        
                        break;
                    case "忌沖":
                        判斷吉凶 = "事業挫折。**";
                        if(宮位飛四化.忌沖.宮位線 == "兄友線" && 宮位飛四化.忌沖.大限宮位線 == "父疾線") { 判斷吉凶 = "為官祿宮化忌沖自身的光明線重疊成就線，事業每況益下、保守為宜。"; }
                        if(宮位飛四化.忌沖.宮位線 == "父疾線" && 宮位飛四化.忌沖.大限宮位線 == "子田線") { 判斷吉凶 = "為官祿宮化忌沖自身的子田線重疊成就線，事業潰敗。從商者易資金周轉不靈而倒閉；打工者可能失業減薪。"; }
                        if(宮位飛四化.忌沖.宮位線 == "子田線" && 宮位飛四化.忌沖.大限宮位線 == "兄友線") { 判斷吉凶 = "為官祿宮化忌沖自身的成就線重疊光明線，事業沒有什麼前途。"; }
                        
                        輸出顯示矩陣.財官.push(成立條件 + 判斷吉凶);
                        break;
                    } // end switch(官祿宮 四化)
                break;
            case "田宅宮":
                輸出顯示分類 = "家運田宅";
                switch(四化){
                    case "化祿":
                        判斷吉凶 = "買入、得到房地產。*";
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                    case "忌沖":
                        判斷吉凶 = "家宅不穩定，搬家等。";
                        if(化出宮重疊 =="父母宮"){
                            輸出顯示分類 = "感情婚姻";
                            判斷吉凶 = "命主的田宅重疊配偶的田宅沖子田，與配偶聚少離多，婚姻感情問題。";
                        } // end if
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                } // end switch(田宅宮 四化)
                break;
            case "福德宮":
                輸出顯示分類 = "健康意外";
                switch(四化){
                    case "化祿":
                        判斷吉凶 = 判斷屬吉;
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                    case "忌沖":
                        判斷吉凶 = 判斷屬凶;
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                } // end switch(福德宮 四化)
                break;
            case "父母宮":
                輸出顯示分類 = "六親";
                switch(四化){
                    case "化祿":
                        判斷吉凶 = 判斷屬吉;
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                        break;
                    case "忌沖":
                        判斷吉凶 = 判斷屬凶;
                        if(化出宮重疊 =="夫妻宮"){
                            輸出顯示分類 = "感情婚姻";
                            判斷吉凶 = "宮夫妻宮的田宅重疊夫妻，與配偶聚少離多，婚姻感情問題。";
                        } // end if
                        輸出顯示矩陣[輸出顯示分類].push(成立條件 + 判斷吉凶);
                } // end switch(父母宮 四化)
                break;
        } // end switch(大限宮位)
    } // end if(光明成就子田重疊)
    //console.log("大限" + 大限數 + "：" + 大限人事宮 + "：" + 宮位相關流線本命 + "" + 宮位相關流線大限);

}  // end function 大限化入光明成就田宅論斷

// ---------------------------------------------------------------------

function 大限化同類論斷(命盤, 大限數, 大限人事宮, 四化, 輸出顯示矩陣){
    //同類論斷，比方大財忌沖財帛宮，大夫祿入夫妻宮
    //四化：化祿、化忌、忌沖
    
    var 大限宮位 = 宮位分解(大限人事宮, 大限數).宮名;  //不帶大限
    //var 大限人事宮地支 = 命盤.大限[大限數].宮位[大限人事宮].地支數;
    var 輸出顯示分類 = "無分類";  //default display at 無分類
    var 忌沖子田光明成就線 = false;
    
    var 宮位飛四化 = 宮位四化落宮(命盤, 大限宮位, 大限數);
    var 化出宮重疊 = 宮位飛四化.化出重疊宮;
    var 化入宮重疊;
    var 同類化入成立 = false;
    var 成立條件 = "";
    var 判斷句 = "";
    var 判斷句矩陣 = [];
    //判斷句
    switch(四化){
        case "化祿":
            if(大限宮位 == 宮位飛四化.化祿.宮位) {
                同類化入成立 = true; var 忌沖化祿光明成就子田 = false;
                化入宮重疊 = 宮位飛四化.化祿.大限宮位;
                成立條件 = "大限" + 大限宮位 + 宮位飛四化.化祿.星曜 + "化祿入" + 宮位飛四化.化祿.宮位 + "，";
                var 成立條件附加 = "但" + 宮位飛四化.化忌.星曜 + "忌沖" + 宮位飛四化.忌沖.宮位;
                判斷句 = "- 祿 - 祿 - 祿 - 祿 -";
                
                var 忌沖宮與祿入宮關係 = 六線宮位光明成就子田分析(宮位飛四化.忌沖.宮位線, 大限宮位).光明成就子田;
                if(忌沖宮與祿入宮關係 !="") {
                    忌沖化祿光明成就子田 = true;
                    成立條件附加 += "（" + 忌沖宮與祿入宮關係 + "），";
                } else 成立條件附加 += "，";
                
                    //console.log(大限數 + " : " + 大限宮位 + " / " + 忌沖宮與祿入宮關係);
                switch(大限宮位){
                    case "命宮":
                        if(化出宮重疊 == "子女宮") {
                            if(宮位飛四化.忌沖.宮位 == "田宅宮") {  //1971年10月19日-亥-男（江）
                                輸出顯示分類 = "財官";
                                判斷句 = "為官祿宮的財帛宮重疊交友宮的官祿宮忌沖田宅宮，事業不賺錢。";
                                判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                            }
                        }  // end if 重疊 子女宮
                        
                        break;
                    case "兄弟宮":

                        break;
                    case "夫妻宮":
                        輸出顯示分類 = "感情婚姻";
                        判斷句 = "桃花。";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "有桃花，但對象不太理想。";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "有桃花，但難修成正果。";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "有桃花，但失敗告終。";
                        
                        if(化出宮重疊 == "田宅宮") {
                            判斷句 = 判斷句 + "化出宮重疊田宅宮為交友的夫妻，桃花容易是已婚人事或三角戀情";
                        }  // end if(化出宮重疊 == "田宅宮")
                        
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "子女宮":
                        輸出顯示分類 = "六親";
                        判斷句 = "得子或合夥";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "得子或合夥，但不太理想。";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "得子或合夥，但沒有成就。";
                        if(忌沖宮與祿入宮關係 == "子田線") { 輸出顯示分類 = "財官"; 判斷句 = "得子或合夥，但失敗告終，上班族可以是公司的業務出現狀況。"; }
                        
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "財帛宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "有賺錢機遇";
                        
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "有賺錢機遇，但不太理想。";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "有賺錢機遇，但沒有成就。";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "有賺錢機遇，但失敗告終。";
                        /*
                        忌沖子田光明成就線 = (忌沖宮與祿入宮關係 == "光明線" || 忌沖宮與祿入宮關係 == "成就線" || 忌沖宮與祿入宮關係 == "子田線");
                        
                        if(宮位飛四化.化權.宮位 == "兄弟宮" || 宮位飛四化.化權.宮位 == "田宅宮") {
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化祿入" + 宮位飛四化.化忌.宮位 + "，化權入" + 宮位飛四化.化祿.宮位 + "，";
                            判斷句 += "祿權入財帛宮的1、6、10方，有利於賺到錢財，看化出宮重疊宮位判斷**。";
                        } // end if
                        */
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "疾厄宮":
                        輸出顯示分類 = "健康意外";
                        判斷句 = "健康問題";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "健康問題。";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "健康問題。";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "健康問題。";
                        
                        判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "遷移宮":
                        輸出顯示分類 = "健康意外";
                        判斷句 = "驛馬、交通問題*";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "驛馬、交通問題*";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "驛馬、交通問題*";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "驛馬、交通問題*";
                        
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "交友宮":
                        輸出顯示分類 = "感情婚姻";
                        判斷句 = "桃花，人緣好。";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "有桃花，但對象不太理想。";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "有桃花，但難修成正果。";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "有桃花，但失敗告終。";
                        
                        if(化出宮重疊 == "田宅宮") {
                            判斷句 = 判斷句 + "化出宮重疊田宅宮為交友的夫妻，桃花容易是已婚人事或三角戀情";
                        }  // end if(化出宮重疊 == "田宅宮")
                        
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "官祿宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "事業機遇*";
                        
                        if(化出宮重疊 == "疾厄宮") 判斷句 = "事業擴展機遇。";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "有事業機遇，但不太理想。";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "有事業機遇，但沒有成就。";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "有事業機遇，但失敗告終。";
                        
                        if(宮位飛四化.化忌.宮位線 == "夫官線") {
                            if(宮位飛四化.化忌.大限宮位線 == "父疾線") {
                                成立條件附加 += "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "（官祿宮的子田線），";
                                判斷句 = "事業不穩定、失敗。";
                            }
                            if(宮位飛四化.化忌.大限宮位線 == "子田線") {
                                成立條件附加 += "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "（官祿宮的成就線），";
                                判斷句 = "事業沒有成就。";
                            }
                            if(宮位飛四化.化忌.大限宮位線 == "兄友線") {
                                成立條件附加 += "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "（官祿宮的光明線），";
                                判斷句 = "事業沒有什麼前途。";
                            }
                            
                        }  // end if
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "田宅宮":
                        輸出顯示分類 = "家運田宅";
                        判斷句 = "田宅、搬遷問題*";
                        
                        if(化出宮重疊 == "疾厄宮") 判斷句 = "事業擴展機遇。";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "田宅、搬遷問題*";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "田宅、搬遷問題*";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "田宅、搬遷問題*";
                        
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "福德宮":
                        輸出顯示分類 = "健康意外";
                        判斷句 = "健康、情緒、福報問題*";
                        if(忌沖宮與祿入宮關係 == "光明線") 判斷句 = "健康、情緒、福報問題*";
                        if(忌沖宮與祿入宮關係 == "成就線") 判斷句 = "健康、情緒、福報問題*";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "健康、情緒、福報問題*";
                        
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                    case "父母宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "名譽機遇或問題，參考忌入/沖的宮位做判斷。*";
                        if(宮位飛四化.忌沖.宮位線 == "子田線") 判斷句 = "忌沖子田線（官祿宮的成就線），因是非問題而影響事業成就。";
                        if(宮位飛四化.忌沖.宮位線 == "父疾線") 判斷句 = "忌沖父疾線（官祿宮的子田線），因是非問題而影響事業出狀況。";
                        if(宮位飛四化.忌沖.宮位線 == "兄友線") 判斷句 = "忌沖兄友線（官祿宮的光明線），因是非問題而影響事業的前途、機遇。";
                        
                        判斷句矩陣.push(成立條件 + 成立條件附加 + 判斷句);
                        break;
                } // end switch(大限宮位) 化祿
            } // end if(大限宮位 == 宮位飛四化.化祿.宮位)
            break;
            
        case "化權": //化權只考慮同類
            if(大限宮位 == 宮位飛四化.化權.宮位) {
                化入宮重疊 = 宮位飛四化.化權.大限宮位;
                成立條件 = "大限" + 大限宮位 + 宮位飛四化.化權.星曜 + "化權入" + 宮位飛四化.化權.宮位 + "，";
                判斷句 = "- 權 - 權 - 權 - 權 -";
                var 忌沖宮與權入宮關係 = 六線宮位光明成就子田分析(宮位飛四化.忌沖.宮位線, 大限宮位).光明成就子田;
                if(忌沖宮與權入宮關係 == "子田線") {
                    同類化入成立 = true;
                    成立條件 = 成立條件 + "但忌沖" + 大限宮位 + "的子田線" + "，";
                }
                
                輸出顯示分類 = "無分類";
                判斷句 = "";
                switch(大限宮位){
                    case "命宮":

                        break;
                    case "兄弟宮":

                        break;
                    case "夫妻宮":

                        break;
                    case "子女宮":

                        break;
                    case "財帛宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "花錢、投資*";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "花錢、投資，損財。";
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "疾厄宮":

                        break;
                    case "遷移宮":

                        break;
                    case "交友宮":
                        break;
                    case "官祿宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "創業*";
                        if(忌沖宮與祿入宮關係 == "子田線") 判斷句 = "創業失敗*。";
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "田宅宮":

                        break;
                    case "福德宮":

                        break;
                    case "父母宮":

                        break;
                } // end switch(大限宮位) 化權
            } // end if(大限宮位 == 宮位飛四化.化權.宮位)
            break;
            
         case "化忌":
            if(大限宮位 == 宮位飛四化.化忌.宮位) {
                同類化入成立 = true;
                化入宮重疊 = 宮位飛四化.化忌.大限宮位;
                成立條件 = "大限" + 大限宮位 + "重疊" + 化入宮重疊 + 宮位飛四化.化忌.星曜 + "化忌入" + 宮位飛四化.化忌.宮位 + "，";
                判斷句 = "- 忌 - 忌 - 忌 - 忌 -";
                switch(大限宮位){
                    case "命宮":

                        break;
                    case "兄弟宮":
        
                        break;
                    case "夫妻宮":

                        break;
                    case "子女宮":
                        輸出顯示分類 = "六親";
                        判斷句 = "得子，招生之象。";
                        
                        if(宮位飛四化.化忌.大限宮位線 == "兄友線") { //1986年1月23日-卯-男（江）/ 1962年9月19日-丑-男（江-吳俊宏）
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化忌入" + 宮位飛四化.化忌.宮位 + "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "，";
                            判斷句 += "為交友的官祿宮忌入自身官祿宮，忌沖命主事業的成就線，事業沒有成就。但因也是官祿宮的子女宮忌入子女宮，適合招攬學生。";
                        } // end if
                        
                        if(宮位飛四化.化忌.大限宮位線 == "夫官線") { //1962年9月19日-丑-男（江-吳俊宏）
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化忌入" + 宮位飛四化.化忌.宮位 + "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "，";
                            判斷句 += "為官祿宮的子女宮忌入子女宮，但忌沖大限重疊夫官線，為子女宮的光明線，招生前途不佳。";
                        } // end if
                        
                        if(宮位飛四化.化忌.大限宮位線 == "命遷線") {
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化忌入" + 宮位飛四化.化忌.宮位 + "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "，";
                            判斷句 += "為官祿宮的子女宮忌入子女宮，但忌沖大限重疊命遷線，為子女宮的光明線，招生失敗。";
                        } // end if
                        
                        if(宮位飛四化.化忌.大限宮位線 == "財福線") {
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化忌入" + 宮位飛四化.化忌.宮位 + "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "，";
                            判斷句 += "為官祿宮的子女宮忌入子女宮，但忌沖大限重疊財福線，為子女宮的成就線，招生不理想。";
                        } // end if
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "財帛宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "";
                        
                        if(宮位飛四化.化祿.宮位 == "兄弟宮" || 宮位飛四化.化祿.宮位 == "田宅宮") {
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化忌入" + 宮位飛四化.化忌.宮位 + "，化祿入" + 宮位飛四化.化祿.宮位 + "，";
                            判斷句 += "祿忌入財帛宮的1、6、10方，有利於賺到錢財，看化出宮重疊宮位判斷**。";
                        } // end if
                        
                        
                        break;
                    case "疾厄宮":

                        break;
                    case "遷移宮":

                        break;
                    case "交友宮":
                        輸出顯示分類 = "感情婚姻";
                        判斷句 = "";
                        
                        if(宮位飛四化.忌沖.大限宮位 == "財帛宮") {
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化忌沖" + 宮位飛四化.忌沖.宮位 + "重疊大限" + 宮位飛四化.化忌.大限宮位 + "，";
                            判斷句 += "為交友沖破財庫重疊財，嚴重人事損財。";
                        } // end if
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "官祿宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "";
                        成立條件 = "大限" + 大限宮位 + "化忌入" + 宮位飛四化.化忌.宮位 + "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "，";
                        
                        if(宮位飛四化.忌沖.大限宮位線 == "父疾線") 判斷句 += "事業不穩定、潰敗。";  //1979年9月7日-辰-女， Candice Huang
                        if(宮位飛四化.忌沖.大限宮位線 == "子田線") 判斷句 += "事業沒有成就。";
                        if(宮位飛四化.忌沖.大限宮位線 == "兄友線") 判斷句 += "事業沒有機遇、不得賞識。";
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "田宅宮":

                        break;
                    case "福德宮":

                        break;
                    case "父母宮":
                        if(宮位飛四化.化忌.大限宮位線 == "夫官線") { //1981年11月9日-辰-女（江）
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "化忌入" + 宮位飛四化.化忌.宮位 + "重疊大限" + 宮位飛四化.化忌.大限宮位線 + "，";
                            判斷句 = "事業官非。";
                        } // end if
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                } // end switch(大限宮位) 化忌
            } // end if(大限宮位 == 宮位飛四化.化忌.宮位)
            break;
            
         case "忌沖":
            if(大限宮位 == 宮位飛四化.忌沖.宮位) {
                同類化入成立 = true;
                化入宮重疊 = 宮位飛四化.忌沖.大限宮位;
                成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + 宮位飛四化.化忌.星曜 + "化忌沖" + 宮位飛四化.忌沖.宮位 + "，";
                判斷句 = "- 沖 - 沖 - 沖 - 沖 -";
                //var 忌沖大限重疊線 = 宮位飛四化.忌沖.大限宮位線;
                var 忌沖大限重疊相對線 = 六線宮位光明成就子田分析(宮位飛四化.忌沖.大限宮位線, 大限宮位).光明成就子田;
                
                switch(大限宮位){
                    case "命宮":
                        輸出顯示分類 = "健康意外";
                        判斷句 = "沖命*";  //2017年7月18日-丑-女
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，沖命*";
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，沖命*";  //2017年7月18日-戌-男
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，沖命*";  //2017年7月10日-寅-男
                        if(化出宮重疊 == "田宅宮") { 輸出顯示分類 = "家運田宅"; 判斷句 = "搬家。"; }
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "兄弟宮":
                        輸出顯示分類 = "六親";
                        判斷句 = "母親、兄弟無緣*";  //2017年7月18日-子-女
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，母親、兄弟無緣*";  //2008年4月19日-寅-男
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，母親、兄弟無緣*";  //2017年7月18日-戌-女
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，母親、兄弟無緣*";  //2007年3月19日-寅-男
                        
                        if(化出宮重疊 == "田宅宮") { 輸出顯示分類 = "家運田宅"; 判斷句 = "房地產投資不賺錢，家庭開銷大。"; }
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "夫妻宮":
                        //沖光明，對象不是合適人選，沖成就，戀情無法開花結果
                        輸出顯示分類 = "感情婚姻";
                        判斷句 = "配偶無緣*";  //2008年4月17日-寅-男
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，感情對象不是合適的人選。";  //2017年7月18日-酉-男
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，戀情無法開花結果。";  //2009年4月10日-寅-女
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，感情失敗或沒有對象。";  //2017年7月18日-戌-女
                        
                        
                        break;
                    case "子女宮":
                        輸出顯示分類 = "六親";
                        判斷句 = "子女無緣*";
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，子女無緣*";  
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，子女無緣*";  //2017年7月18日-戌-男
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，子女無緣*";  //2017年7月18日-戌-男
                        
                        if(宮位飛四化.忌沖.大限宮位 == "官祿宮") {  //1963年12月14日-子-女（江）
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "忌沖" + 宮位飛四化.忌沖.宮位 + "重疊" + 宮位飛四化.忌沖.大限宮位;
                            判斷句 = "，交友的事業沖自身事業，公司運營困難，失業裁員。";
                        } //end if
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "財帛宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "損財*";  //2017年7月18日-丑-男
                        
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，沒有賺錢的機遇。";  //2017年7月18日-子-男
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，賺錢困難，若是從商的事業不賺錢。";  //2009年4月10日-寅-女
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，財庫破。";  //2017年7月18日-子-男
                        
                        if(宮位飛四化.忌沖.大限宮位 == "官祿宮") {  //1980年5月8日-丑-男（江，盲俠命盤）
                            成立條件 = "大限" + 大限宮位 + "忌沖" + 宮位飛四化.忌沖.宮位 + "重疊" + 宮位飛四化.忌沖.大限宮位;
                            判斷句 = "，事業損財或賺不到錢。";
                        } //end if
                        
                        if(宮位飛四化.忌沖.大限宮位 == "交友宮") { // 1978年6月15日-日丑時-男
                            成立條件 = "大限" + 大限宮位 + "忌沖" + 宮位飛四化.忌沖.宮位 + "重疊" + 宮位飛四化.忌沖.大限宮位;
                            判斷句 = "，為命主破交友宮重疊交友的田宅，大財重疊兄弟宮（田宅宮的財），買房子。";
                            if(宮位飛四化.化祿.宮位 == "交友宮") {
                                成立條件 = "大限" + 大限宮位 + "化祿入" + 宮位飛四化.化祿.宮位 + "，忌沖" + 宮位飛四化.忌沖.宮位 + "重疊" + 宮位飛四化.忌沖.大限宮位;
                                判斷句 = "，大財重疊兄弟宮（田宅宮的財），祿入了交友，同時破了交友宮重疊交友的田宅，買房子。";
                            } //end if
                        } //end if
                        
                        if(宮位飛四化.忌沖.大限宮位 == "兄弟宮") {
                            成立條件 = "大限" + 大限宮位 + "忌沖" + 宮位飛四化.忌沖.宮位 + "重疊" + 宮位飛四化.忌沖.大限宮位;
                            判斷句 = "，為交友破了命主的財帛宮重疊財帛的田宅，嚴重損財。";
                        } //end if
                        
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "疾厄宮":
                        輸出顯示分類 = "健康意外";  //2017年7月18日-子-男
                        判斷句 = "健康問題*";
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，健康不佳。";  //2009年4月17日-寅-男
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，健康不好。";  //2005年7月10日-寅-女
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，健康問題嚴重。";  //2017年7月18日-寅-男
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "遷移宮":
                        輸出顯示分類 = "健康意外";
                        判斷句 = "交通意外、驛馬*";  //2009年4月17日-寅-男
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，交通意外、驛馬*";
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，交通意外、驛馬*";  //2017年7月18日-丑-男
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，車禍。";  //2007年3月19日-寅-男
                        
                        判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "交友宮":
                        輸出顯示分類 = "六親";
                        判斷句 = "人事是非，因友損財。";  //2017年7月18日-丑-男
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，人事是非，因友損財。";
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，人事是非，因友損財。";  //2017年7月18日-子-男
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，人事是非，因友損財。";  //2017年7月10日-寅-男
                        if(化出宮重疊 == "子女宮") {
                            輸出顯示分類 = "財官";
                            判斷句 = "人事是非，因友損財，因交友宮重疊子女宮，所以不宜合作。";
                        } // end if
                        if(化出宮重疊 == "財帛宮") {
                            輸出顯示分類 = "財官";
                            判斷句 = "交友破命主的財，損財，或賺不到錢。";  //1981年11月9日-辰-女（江）
                        } // end if
                        
                        判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "官祿宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "事業不穩定*";  //2017年7月18日-子-女
                        // 沖疾，事業失敗，沖父，是非
                        if(化出宮重疊 == "田宅宮") { } //end if
                        
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，事業沒有機遇，前途不光明。也可以論為父母的田宅宮重疊田宅宮沖父母的田宅宮，搬家。";  //2007年3月19日-寅-女，2000年3月17日-亥-女（江）
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，事業沒有發展空間，成就差。";  //2017年7月18日-子-男
                        if(忌沖大限重疊相對線 == "子田線") {
                            判斷句 = "重疊" + 忌沖大限重疊相對線 + "，事業失敗。";
                            if(宮位飛四化.忌沖.大限宮位 == "父母宮")  判斷句 = "重疊" + "父母宮/子田線" + "，事業潰敗，多是非、官非，找工作困難。";  //1982年8月15日-丑-男（江）
                            if(宮位飛四化.忌沖.大限宮位 == "疾厄宮")  判斷句 = "重疊" + "疾厄宮/子田線" + "，事業潰敗，倒閉，找工作困難。";  //1981年12月2日-辰-女（江）
                        }
                        if(宮位飛四化.忌沖.大限宮位線 == "財福線") 判斷句 = "重疊" + 宮位飛四化.忌沖.大限宮位線 + "，事業賺不到錢，轉行。";  //1967年7月13日-辰-男（江）
                        if(宮位飛四化.忌沖.大限宮位 == "命宮") 判斷句 = "重疊" + 宮位飛四化.忌沖.大限宮位線 + "，事業資金周轉困難。";  //2017年7月18日-子-女
                        
                        判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "田宅宮":
                        輸出顯示分類 = "家運田宅";
                        判斷句 = "為沖破命的子田線，搬家*";
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，搬家*";
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，搬家*";
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，搬家*";
                        
                        if(宮位飛四化.忌沖.大限宮位 == "命宮") { //1984年2月10日-戌-男（江）
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + 宮位飛四化.忌沖.星曜 + "化忌沖" + 宮位飛四化.忌沖.宮位 + "重疊" + 宮位飛四化.忌沖.大限宮位 + "，";
                            判斷句 = "為沖破命的子田線，重疊大限命宮，命宮為官祿宮的財帛宮，在外的事業工作賺不到錢。";
                            if(宮位飛四化.忌沖.星曜 == "太陽") 判斷句 += "忌沖的星曜是太陽，為官祿主，因此也不適合從事房地產的行業。";
                        } // end if
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "福德宮":
                        輸出顯示分類 = "健康意外";
                        判斷句 = "壓力、健康問題*";  //2009年4月10日-寅-女
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，壓力、健康問題*";
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，壓力、健康問題*"; //2008年4月19日-寅-女
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，壓力、健康問題*"; //2017年7月18日-戌-男
                        
                        判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                    case "父母宮":
                        輸出顯示分類 = "財官";
                        判斷句 = "事業官非、合夥問題、父親無緣*";  //2017年7月10日-寅-男
                        if(忌沖大限重疊相對線 == "光明線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，父親無緣*";  //2009年4月10日-寅-女
                        if(忌沖大限重疊相對線 == "成就線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，父親無緣*";  //2009年4月17日-寅-男
                        if(忌沖大限重疊相對線 == "子田線") 判斷句 = "重疊" + 忌沖大限重疊相對線 + "，父親無緣*";  //2008年4月17日-寅-女
                        
                        if(宮位飛四化.化忌.大限宮位線 == "夫官線") {
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "忌沖" + 宮位飛四化.忌沖.宮位 + "重疊大限" + 宮位飛四化.忌沖.大限宮位線 + "，";
                            判斷句 = "事業官非。";
                        } // end if
                        
                        if(化出宮重疊 == "交友宮") { //1974年11月19日-午-男（江-王志文）
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + "化忌沖" + 宮位飛四化.忌沖.宮位 + "，";
                            判斷句 = "事業官非、合夥問題、朋友錢財糾紛。";
                        } // end if
                        
                        if(化出宮重疊 == "子女宮") {
                            輸出顯示分類 = "財官";
                            成立條件 = "大限" + 大限宮位 + "重疊" + 化出宮重疊 + "化忌沖" + 宮位飛四化.忌沖.宮位 + "，";
                            判斷句 = "子女事業，招生問題。";
                        } // end if
                        
                        if(判斷句 != "") 判斷句矩陣.push(成立條件 + 判斷句);
                        break;
                } // end switch(大限宮位) 忌沖
            } // end if(大限宮位 == 宮位飛四化.忌沖.宮位)
            break;
    } // end switch(四化)
    
    if(判斷句矩陣.length>0) 輸出顯示矩陣[輸出顯示分類].push(判斷句矩陣.join("<br>"));
} // end function 大限化同類論斷



// ---------------------------------------------------------------------

function 大限自化流出論斷(命盤, 宮位, 大限數, 分析矩陣){
    // required function 宮位自化流出判斷(命盤, 宮位, 大限數, 自化流出, 四化) （file：大限分析配件）
    // 宮位: 大限十二人事宮（無需“大限”）
    // 分析矩陣 就是人事12宮
    
    var 成立條件="", 判斷句="", 輸出顯示分類 = "無分類";
    
    switch(宮位){
        case "命宮":
            var 命宮自化忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "自化", "化忌");
            if(命宮自化忌.成立) {
                成立條件=命宮自化忌.成立條件;
                //console.log(命宮自化忌);
                if(命宮自化忌.化出重疊宮 == "官祿宮") {
                    判斷句 = "沖" + 命宮自化忌.化入宮線 + "，為沖父母宮的子田線，事業官非。";
                    分析矩陣.財官.push(命宮自化忌.成立條件 + 判斷句);
                } // end if 官祿宮
                
                if(命宮自化忌.化出重疊宮 == "田宅宮") {
                    判斷句 = "喜歡待在家當宅男/宅女。";
                    分析矩陣.家運田宅.push(命宮自化忌.成立條件 + 判斷句);
                } // end if 田宅宮
            } //end if(命宮自化忌.成立)
            break;
        case "兄弟宮":
            
            break;
        case "夫妻宮":
            
            break;
        case "子女宮":
            
            break;
        case "財帛宮":
            var 財帛宮自化忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "自化", "化忌");
            if(財帛宮自化忌.化出重疊宮 == "田宅宮") {
                判斷句 = "投資房地產。";
                分析矩陣.家運田宅.push(財帛宮自化忌.成立條件 + 判斷句);
            } // end if 重疊宮 == "田宅宮"
            
            if(財帛宮自化忌.忌沖宮 == "夫妻宮") {
                判斷句 = "忌沖夫妻宮重疊大福，偏財運差。";
                分析矩陣.財官.push(財帛宮自化忌.成立條件 + 判斷句);
            } // end if 忌沖宮 == "夫妻宮"
    
            break;
        case "疾厄宮":
            
            break;
        case "遷移宮":
            var 遷移宮流出忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "流出", "化忌");
            if(遷移宮流出忌.化出重疊宮 == "官祿宮") {
                判斷句 = "驛馬事業。";
                分析矩陣.財官.push(遷移宮流出忌.成立條件 + 判斷句);
            } // end if 重疊 官祿宮
            
            break;
        case "交友宮":
            
            break;
        case "官祿宮":
            var 官祿宮自化忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "自化", "化忌");
            if(官祿宮自化忌.化出重疊宮 == "父母宮") {
                判斷句 = "是非、官非。";
                分析矩陣.財官.push(官祿宮自化忌.成立條件 + 判斷句);
            } // end if 重疊宮 父母宮
            
            if(官祿宮自化忌.化出重疊宮 == "子女宮") {
                判斷句 = "因忌入交友宮的官祿宮，會找人合夥，但因忌沖田宅宮，故不宜房地產事業合作。";
                分析矩陣.財官.push(官祿宮自化忌.成立條件 + 判斷句);
            } // end if 重疊宮 子女宮
            
            var 官祿宮流出忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "流出", "化忌");
            if(官祿宮流出忌.化出重疊宮 == "父母宮") {
                判斷句 = "是非、官非。";
                分析矩陣.財官.push(官祿宮流出忌.成立條件 + 判斷句);
            } // end if 重疊 父母宮
            
            break;
        case "田宅宮":
            var 田宅宮自化忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "自化", "化忌");
            if(田宅宮自化忌.化出重疊宮 == "遷移宮") {
                判斷句 = "大田自化忌沖命，搬家。";
                分析矩陣.家運田宅.push(田宅宮自化忌.成立條件 + 判斷句);
            } // end if 重疊宮 遷移宮
            
            break;
            
        case "福德宮":
            
            break;
        case "父母宮":
            var 父母宮流出祿 = 宮位自化流出判斷(命盤, 宮位, 大限數, "流出", "化祿");
            if(父母宮流出祿.成立) {
                成立條件=父母宮流出祿.成立條件;

                if(父母宮流出祿.化出重疊宮 == "交友宮") {
                    判斷句 = "大父（交友宮的官祿宮）重疊交友宮，祿入兄弟宮（財帛宮的田宅宮），賺到大眾的錢財。";
                    分析矩陣.財官.push(父母宮流出祿.成立條件 + 判斷句);
                } // end if 重疊交友宮
            } //end if(父母宮流出祿.成立)
            
            var 父母宮自化忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "自化", "化忌");
            if(父母宮自化忌.成立) {
                成立條件=父母宮自化忌.成立條件;

                if(父母宮自化忌.化出重疊宮 == "交友宮") {
                    判斷句 = "大父（交友宮的財帛宮）重疊交友宮，自化忌沖兄弟宮（財帛宮的田宅宮），損財、賺不到錢。";
                    分析矩陣.財官.push(父母宮自化忌.成立條件 + 判斷句);
                } // end if 重疊交友宮
            } //end if(父母宮自化忌.成立)
            
            
            var 父母宮流出忌 = 宮位自化流出判斷(命盤, 宮位, 大限數, "流出", "化忌");
            if(父母宮流出忌.成立) {
                成立條件=父母宮流出忌.成立條件;

                if(父母宮流出忌.化出重疊宮 == "交友宮") {
                    判斷句 = "大父（交友宮的財帛宮）重疊交友宮，忌入兄弟宮（財帛宮的田宅宮），賺到大眾的錢財。";
                    分析矩陣.財官.push(父母宮流出忌.成立條件 + 判斷句);
                } // end if 重疊交友宮
            } //end if(父母宮流出忌.成立)
            
            break;
    } // end switch
}  // end function 大限自化流出論斷


// ---------------------------------------------------------------------

function 大限化入光明成就子田論斷(命盤, 大限數, 輸出顯示矩陣){
    // required function 大限化入光明成就子田(命盤, 大限數, 大限人事宮, 相應宮)
    // 判斷大限的某宮是否化入自身的光明線、成就線、子田線 （暫時不斷成就線）

    var 輸出顯示分類 = "無分類";  //default display at 無分類
    var 判斷句 = "";
    
    
    var 大限官祿宮論斷 = 大限化入光明成就子田判斷(命盤, 大限數, "官祿宮", "官祿宮");
    if(大限官祿宮論斷.成立) {
        輸出顯示分類 = "財官";
        判斷句 ="";
        switch(大限官祿宮論斷.六線){
            case "光明線": 判斷句 = "，有事業機遇。";
            case "子田線": 判斷句 = "，有事業機遇。";
        }  //end switch
        
        if(判斷句 != "") 輸出顯示矩陣[輸出顯示分類].push(大限官祿宮論斷.條件 + 判斷句); 
    }  // end if
    
    var 大限財帛宮論斷 = 大限化入光明成就子田判斷(命盤, 大限數, "財帛宮", "財帛宮");
    if(大限財帛宮論斷.成立) {
        輸出顯示分類 = "財官";
        判斷句 ="";
        
        switch(大限財帛宮論斷.六線){
            case "光明線": 判斷句 = "，有賺錢機遇。";
            case "子田線": 判斷句 = "，得到錢財**。";
        }  //end switch
        
        if(判斷句 != "") 輸出顯示矩陣[輸出顯示分類].push(大限財帛宮論斷.條件 + 判斷句); 
    }  // end if
    
    var 大限夫妻宮論斷 = 大限化入光明成就子田判斷(命盤, 大限數, "夫妻宮", "夫妻宮");
    if(大限夫妻宮論斷.成立) {
        輸出顯示分類 = "感情婚姻";
        判斷句 ="";
        switch(大限夫妻宮論斷.六線){
            case "光明線": 判斷句 = "，有姻緣，感情機遇。";
            case "子田線": 判斷句 = "，得到感情。";
        }  //end switch
        
        if(判斷句 != "") 輸出顯示矩陣[輸出顯示分類].push(大限夫妻宮論斷.條件 + 判斷句); 
    }  // end if
    
    var 大限交友宮論斷 = 大限化入光明成就子田判斷(命盤, 大限數, "交友宮", "交友宮");
    if(大限交友宮論斷.成立) {
        輸出顯示分類 = "感情婚姻";
        判斷句 ="";
        switch(大限夫妻宮論斷.六線){
            case "光明線": 判斷句 = "，有桃花機遇。";
            case "子田線": 判斷句 = "，得到桃花。";
        }  //end switch
        
        if(判斷句 != "") 輸出顯示矩陣[輸出顯示分類].push(大限交友宮論斷.條件 + 判斷句); 
    }  // end if
    
}  // end function 大限化入光明成就子田論斷



function 大限化入光明成就子田判斷(命盤, 大限數, 大限人事宮, 相應宮){
    
    // --------- ??? -----------
    // 大限化出宮是否化入相應宮的六線，比方大限官祿宮是否化入 財帛宮（相應宮）的光明、成就、子田線
    // 測是四化否是祿入，祿權或是祿忌
    //大限人事宮: 命宮、兄弟宮。。。。。不需要"大限"
    
    var 大限人事宮地支 = 命盤.大限[大限數].宮位[大限人事宮].地支數;
    //var 化出的重疊宮 = 命盤.大限[大限數].地支[大限人事宮地支].本命人事宮;
    var 大限化入光明成就子田 = {
        "大限數": 大限數,
        "化出宮": "大限" + 大限人事宮,
        "相應宮": 相應宮,
        "化出重疊宮": 命盤.大限[大限數].地支[大限人事宮地支].本命人事宮,
        "祿入宮": "",
        "祿入重疊宮": "",
        "六線": "",
        "吉凶": "",
        "四化": "",
        "成立": false,
        "條件": "",
        //"判斷句": "",
        "備註": ""
    } // end var 大限化入光明成就子田
    
    var 大限人事宮飛四化 = 宮位四化落宮(命盤, 大限人事宮, 大限數);
    
    大限化入光明成就子田.祿入宮 = 大限人事宮飛四化.化祿.宮位; 大限化入光明成就子田.祿入重疊宮 = 大限人事宮飛四化.化祿.大限宮位;
    
    var 祿入相應宮六線 = 六線宮位光明成就子田分析(大限人事宮飛四化.化祿.宮位線, 大限化入光明成就子田.相應宮).光明成就子田;
    var 權入相應宮六線 = 六線宮位光明成就子田分析(大限人事宮飛四化.化權.宮位線, 大限化入光明成就子田.相應宮).光明成就子田;
    var 忌入相應宮六線 = 六線宮位光明成就子田分析(大限人事宮飛四化.化忌.宮位線, 大限化入光明成就子田.相應宮).光明成就子田;
    

    if(祿入相應宮六線 == "光明線") {
        if(權入相應宮六線 == "光明線") {
            var 祿權光明線例外 = false;
            if(大限人事宮飛四化.化祿.宮位 == 大限人事宮飛四化.化權.宮位 && 大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "父母宮")) 祿權光明線例外 = true;
            if(!祿權光明線例外){
                大限化入光明成就子田.成立 = true;
                大限化入光明成就子田.四化 = "祿權";
                大限化入光明成就子田.六線 = "光明線";
                大限化入光明成就子田.吉凶 = "吉";
                大限化入光明成就子田.條件 = "大限" + 大限人事宮 + "化祿權入" + 大限化入光明成就子田.相應宮 + "的光明線";
            }  // end if 祿權入光明線成立        
        } // end if
        
        if(忌入相應宮六線 == "光明線") {
            var 祿忌光明線例外 = false;
            if(大限人事宮飛四化.化祿.宮位 == 大限人事宮飛四化.化忌.宮位 && 大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "父母宮")) 祿忌光明線例外 = true;
            if(!祿忌光明線例外){
                大限化入光明成就子田.成立 = true;
                大限化入光明成就子田.四化 = "祿忌";
                大限化入光明成就子田.六線 = "光明線";
                大限化入光明成就子田.吉凶 = "吉";
                大限化入光明成就子田.條件 = "大限" + 大限人事宮 + "化祿忌入" + 大限化入光明成就子田.相應宮 + "的光明線";
                
                if(大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "疾厄宮") && 大限人事宮飛四化.化忌.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "父母宮")) 大限化入光明成就子田.吉凶 = "凶";
                if(大限化入光明成就子田.吉凶 == "凶") 大限化入光明成就子田.條件 = 大限化入光明成就子田.條件 + "，但祿逢沖破";
            }  // end if 祿忌入光明線成立        
        } // end if
        
        if(大限化入光明成就子田.四化 == "" && 大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "疾厄宮")) {
            大限化入光明成就子田.成立 = true;
                大限化入光明成就子田.四化 = "化祿";
                大限化入光明成就子田.六線 = "光明線";
                大限化入光明成就子田.吉凶 = "吉";
                大限化入光明成就子田.條件 = "大限" + 大限人事宮 + "化祿入" + 大限化入光明成就子田.相應宮 + "的光明線";
        }  // end if 只是祿入光明線
    } // end if 祿入光明線
    

    if(祿入相應宮六線 == "子田線") {
        if(權入相應宮六線 == "子田線") {
            var 祿權子田線例外 = false;
            if(大限人事宮飛四化.化祿.宮位 == 大限人事宮飛四化.化權.宮位 && 大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "子女宮")) 祿權子田線例外 = true;
            if(!祿權子田線例外){
                大限化入光明成就子田.成立 = true;
                大限化入光明成就子田.四化 = "祿權";
                大限化入光明成就子田.六線 = "子田線";
                大限化入光明成就子田.吉凶 = "吉";
                大限化入光明成就子田.條件 = "大限" + 大限人事宮 + "化祿權入" + 大限化入光明成就子田.相應宮 + "的子田線";
            }  // end if 祿權入子田線成立        
        } // end if
        
        if(忌入相應宮六線 == "子田線") {
            var 祿忌子田線例外 = false;
            if(大限人事宮飛四化.化祿.宮位 == 大限人事宮飛四化.化忌.宮位 && 大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "子女宮")) 祿忌子田線例外 = true;
            if(!祿忌子田線例外){
                大限化入光明成就子田.成立 = true;
                大限化入光明成就子田.四化 = "祿忌";
                大限化入光明成就子田.六線 = "子田線";
                大限化入光明成就子田.吉凶 = "吉";
                大限化入光明成就子田.條件 = "大限" + 大限人事宮 + "化祿忌入" + 大限化入光明成就子田.相應宮 + "的子田線";
                
                if(大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "田宅宮") && 大限人事宮飛四化.化忌.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "子女宮")) 大限化入光明成就子田.吉凶 = "凶";
                if(大限化入光明成就子田.吉凶 == "凶") 大限化入光明成就子田.條件 = 大限化入光明成就子田.條件 + "，但祿逢沖破";
            }  // end if 祿忌入子田線成立        
        } // end if
        
        if(大限化入光明成就子田.四化 == "" && 大限人事宮飛四化.化祿.宮位 == 人事宮位挪移(大限化入光明成就子田.相應宮, "田宅宮")) {
            大限化入光明成就子田.成立 = true;
                大限化入光明成就子田.四化 = "化祿";
                大限化入光明成就子田.六線 = "子田線";
                大限化入光明成就子田.吉凶 = "吉";
                大限化入光明成就子田.條件 = "大限" + 大限人事宮 + "化祿入" + 大限化入光明成就子田.相應宮 + "的子田線";
        }  // end if 只是祿入子田線
    } // end if 祿入子田線
    
    return 大限化入光明成就子田;
} // end function 大限化入光明成就子田論斷

// ---------------------------------------------------------------------
