
function 大限分析原件() {
	this.大限歲數 = "";
	this.大限干支 = "";
	this.大限名 = "";
	this.大限數=-1;
	this.感情婚姻 = [];
	this.財官 = [];
	this.家運田宅=[];
	this.六親 = [];
	this.健康意外 = [];
	this.特殊形態=[];
	this.無分類=[];
} // end function 大限分析原件


function 大限分析(命盤){
	var 大限分析矩陣=[];

	for(var i=2; i<8; i++){
		大限分析矩陣[i] = new 大限分析原件();
		大限分析矩陣[i].大限數 = i;
		大限分析矩陣[i].大限名 = 命盤.大限[i].大限名;
		大限分析矩陣[i].大限歲數 = 命盤.大限[i].歲數段;
		大限分析矩陣[i].大限干支 = 命盤.大限[i].宮位干支

		分析大限四化特殊形態(命盤, i, 大限分析矩陣[i]);
		//分析大限感情婚姻(命盤, i, 大限分析矩陣[i]);
	} // end for

	$("#DaXianContent").html(大限分析內容排版(大限分析矩陣));
	//console.log(大限分析矩陣);
}  // end function 大限分析


function 大限分析內容排版(大限矩陣){
	var 大限段落矩陣=[];
	var 大限標題, 單元標題;
	var 大限段落, 大限分析內容, 特殊形態內容, 感情婚姻內容;
    
    
	for(var i=2; i < 8; i++){
		var 大限內容矩陣=[];
		//<div class="container-fluid" id="DaXianContent" style="width: 720px; height: auto; float:left;"><p><br></p></div>
		大限標題 = 大限矩陣[i].大限名 + "（" + 大限矩陣[i].大限干支 + "）：" + 大限矩陣[i].大限歲數;
		大限內容矩陣.push('<div class="container-fluid" id="fxnr-大限-' + 大限矩陣[i].大限數 + '">');
		大限內容矩陣.push('<div class="ds-大限標題" id="fxnr-大限標題-' + 大限矩陣[i].大限數 + '">' + 大限標題 + '</div>');

		if(大限矩陣[i].特殊形態.length>0){
			特殊形態內容 = 大限矩陣[i].特殊形態.join("<br>");
			大限內容矩陣.push('<div class="container-fluid">');
			大限內容矩陣.push('<div class="ds-大限單元標題" id="fxnr-特殊形態標題-"' + 大限矩陣[i].大限數 + '">' + '特殊四化' +'</div>');
			大限內容矩陣.push('<div class="container-fluid ds-大限單元內容" id="fxnr-特殊形態內容-"' + 大限矩陣[i].大限數 + '">' + 特殊形態內容  + '</div>');
			大限內容矩陣.push('</div>');
		}

        if(大限矩陣[i].財官.length>0){
			
            for(var j=0; j < 大限矩陣[i].財官.length; j++) { 大限矩陣[i].財官[j] = "<li>" + 大限矩陣[i].財官[j] + "</li>" };
            財官內容 = "<ul>" + 大限矩陣[i].財官.join("") + "</ul>";
			大限內容矩陣.push('<div class="container-fluid">');
			大限內容矩陣.push('<div class="ds-大限單元標題" id="fxnr-感情標題-"' + 大限矩陣[i].大限數 + '">' + '事業錢財' +'</div>');
			大限內容矩陣.push('<div class="container-fluid ds-大限單元內容" id="fxnr-財官內容-"' + 大限矩陣[i].大限數 + '">' + 財官內容 + '</div>');
			大限內容矩陣.push('</div>');
		}
        
        if(大限矩陣[i].家運田宅.length>0){
            
            for(var j=0; j < 大限矩陣[i].家運田宅.length; j++) { 大限矩陣[i].家運田宅[j] = "<li>" + 大限矩陣[i].家運田宅[j] + "</li>" };
			家運田宅內容 = "<ul>" + 大限矩陣[i].家運田宅.join("") + "</ul>";
			大限內容矩陣.push('<div class="container-fluid">');
			大限內容矩陣.push('<div class="ds-大限單元標題" id="fxnr-家運田宅標題-"' + 大限矩陣[i].大限數 + '">' + '家運田宅' +'</div>');
			大限內容矩陣.push('<div class="container-fluid ds-大限單元內容" id="fxnr-家運田宅內容-"' + 大限矩陣[i].大限數 + '">' + 家運田宅內容 + '</div>');
			大限內容矩陣.push('</div>');
		}
        
		if(大限矩陣[i].六親.length>0){
            
            for(var j=0; j < 大限矩陣[i].六親.length; j++) { 大限矩陣[i].六親[j] = "<li>" + 大限矩陣[i].六親[j] + "</li>" };
			六親內容 = "<ul>" + 大限矩陣[i].六親.join("") + "</ul>";
			大限內容矩陣.push('<div class="container-fluid">');
			大限內容矩陣.push('<div class="ds-大限單元標題" id="fxnr-六親標題-"' + 大限矩陣[i].大限數 + '">' + '六親論斷' +'</div>');
			大限內容矩陣.push('<div class="container-fluid ds-大限單元內容" id="fxnr-六親內容-"' + 大限矩陣[i].大限數 + '">' + 六親內容  + '</div>');
			大限內容矩陣.push('</div>');
		}

		if(大限矩陣[i].健康意外.length>0){
            
            for(var j=0; j < 大限矩陣[i].健康意外.length; j++) { 大限矩陣[i].健康意外[j] = "<li>" + 大限矩陣[i].健康意外[j] + "</li>" };
			健康意外內容 = "<ul>" + 大限矩陣[i].健康意外.join("") + "</ul>";
			大限內容矩陣.push('<div class="container-fluid">');
			大限內容矩陣.push('<div class="ds-大限單元標題" id="fxnr-健康意外標題-"' + 大限矩陣[i].大限數 + '">' + '健康意外論斷' +'</div>');
			大限內容矩陣.push('<div class="container-fluid ds-大限單元內容" id="fxnr-健康意外內容-"' + 大限矩陣[i].大限數 + '">' + 健康意外內容  + '</div>');
			大限內容矩陣.push('</div>');
		}

		if(大限矩陣[i].感情婚姻.length>0){
            
            for(var j=0; j < 大限矩陣[i].感情婚姻.length; j++) { 大限矩陣[i].感情婚姻[j] = "<li>" + 大限矩陣[i].感情婚姻[j] + "</li>" };
			感情婚姻內容 = "<ul>" + 大限矩陣[i].感情婚姻.join("") + "</ul>";
			大限內容矩陣.push('<div class="container-fluid">');
			大限內容矩陣.push('<div class="ds-大限單元標題" id="fxnr-感情標題-"' + 大限矩陣[i].大限數 + '">' + '感情' +'</div>');
			大限內容矩陣.push('<div class="container-fluid ds-大限單元內容" id="fxnr-感情內容-"' + 大限矩陣[i].大限數 + '">' + 感情婚姻內容  + '</div>');
			大限內容矩陣.push('</div>');
		}

		if(大限矩陣[i].無分類.length>0){
            
            for(var j=0; j < 大限矩陣[i].無分類.length; j++) { 大限矩陣[i].無分類[j] = "<li>" + 大限矩陣[i].無分類[j] + "</li>" };
			無分類內容 = "<ul>" + 大限矩陣[i].無分類.join("") + "</ul>";
			大限內容矩陣.push('<div class="container-fluid">');
			大限內容矩陣.push('<div class="ds-大限單元標題" id="fxnr-無分類標題-"' + 大限矩陣[i].大限數 + '">' + '無分類論斷' +'</div>');
			大限內容矩陣.push('<div class="container-fluid ds-大限單元內容" id="fxnr-無分類內容-"' + 大限矩陣[i].大限數 + '">' + 無分類內容  + '</div>');
			大限內容矩陣.push('</div>');
		}

		大限內容矩陣.push('</div>');
		大限段落 = 大限內容矩陣.join("");
		大限段落矩陣.push(大限段落);
	}  // end for

	return 大限段落矩陣.join("<br>");
} // end function



function 分析大限四化特殊形態(命盤, 大限數, 分析矩陣) {
	var 大限分析宮位, 大限重疊宮;
    var 十二人事宮 = ["命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮", "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮"];
	var 附加註解 = "";

    for(var j=0; j<12; j++){
        // ------------------ 化祿權忌入三方 ------------------
        大限化入三方論斷(命盤, 大限數, 十二人事宮[j], false, 分析矩陣);
        大限化入光明成就田宅論斷(命盤, 大限數, 十二人事宮[j], "化祿", 分析矩陣); 大限化入光明成就田宅論斷(命盤, 大限數, 十二人事宮[j], "忌沖", 分析矩陣);
        大限化同類論斷(命盤, 大限數, 十二人事宮[j], "化祿", 分析矩陣); 大限化同類論斷(命盤, 大限數, 十二人事宮[j], "化權", 分析矩陣); 大限化同類論斷(命盤, 大限數, 十二人事宮[j], "化忌", 分析矩陣); 大限化同類論斷(命盤, 大限數, 十二人事宮[j], "忌沖", 分析矩陣); 
        大限自化流出論斷(命盤, 十二人事宮[j], 大限數, 分析矩陣);
    } // end for
    
    大限化祿權忌入一六十論斷(命盤, 大限數, 分析矩陣);
    
    // ------------------ 化入自身光明、成就、子田線 ------------------
    大限化入光明成就子田論斷(命盤, 大限數, 分析矩陣);
    
    // ------------------ 另類同類相沖 ------------------
        //  *** 財官 ***
        大限另類同類相沖論斷(命盤, 大限數, "大限交友宮", "官祿宮", 分析矩陣.財官);
        大限另類同類相沖論斷(命盤, 大限數, "大限交友宮", "財帛宮", 分析矩陣.財官);

        //  *** 六親 ***
        大限另類同類相沖論斷(命盤, 大限數, "大限夫妻宮", "田宅宮", 分析矩陣.感情婚姻);
        大限另類同類相沖論斷(命盤, 大限數, "大限夫妻宮", "疾厄宮", 分析矩陣.感情婚姻);
    
        大限另類同類相沖論斷(命盤, 大限數, "大限父母宮", "田宅宮", 分析矩陣.家運田宅);
        大限另類同類相沖論斷(命盤, 大限數, "大限父母宮", "疾厄宮", 分析矩陣.六親);
    
        大限另類同類相沖論斷(命盤, 大限數, "大限兄弟宮", "田宅宮", 分析矩陣.六親);
        大限另類同類相沖論斷(命盤, 大限數, "大限兄弟宮", "疾厄宮", 分析矩陣.六親);

        大限另類同類相沖論斷(命盤, 大限數, "大限子女宮", "田宅宮", 分析矩陣.六親);
        大限另類同類相沖論斷(命盤, 大限數, "大限子女宮", "疾厄宮", 分析矩陣.六親);

    // ------------------ 財官論斷 ------------------
    
    大限事業論斷(命盤, 大限數, 分析矩陣);
    大限錢財論斷(命盤, 大限數, 分析矩陣);
    大限田宅論斷(命盤, 大限數, 分析矩陣);
    
    
    //單向四化分析(命盤, 大限數, "忌沖", "財帛宮", "財帛宮", "官祿宮");
}  // end 分析大限四化特殊形態



