// ---------------

function 宮位四化分析(命盤) {
    var 人事宮位 = ["命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮", "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮"];
    var 地支矩陣 = 命盤.地支宮位;
    var 星曜原件 = 命盤.星曜;
    
    // ---------------- 測試是否符合 殺破狼，府相朝垣，機月同梁 ----------------
    var 測試星曜矩陣 = [];
    測試星曜矩陣 = 地支矩陣[命盤.人事宮.命宮.地支數].星曜.concat(地支矩陣[命盤.人事宮.財帛宮.地支數].星曜, 地支矩陣[命盤.人事宮.官祿宮.地支數].星曜);
    測試星曜矩陣 = _.without(測試星曜矩陣, "文昌", "文曲", "左輔", "右弼");

    if(_.contains(測試星曜矩陣, "天府") && _.contains(測試星曜矩陣, "天相") && 測試星曜矩陣.length==2) {
        地支矩陣[命盤.人事宮.命宮.地支數].宮干四化.分析.府相朝垣 = true;
        地支矩陣[命盤.人事宮.財帛宮.地支數].宮干四化.分析.府相朝垣 = true;
        地支矩陣[命盤.人事宮.官祿宮.地支數].宮干四化.分析.府相朝垣 = true;
    }  // end if 府相朝垣
    
    if(_.contains(測試星曜矩陣, "七殺") && _.contains(測試星曜矩陣, "破軍") && _.contains(測試星曜矩陣, "貪狼") && 測試星曜矩陣.length==3) {
        地支矩陣[命盤.人事宮.命宮.地支數].宮干四化.分析.殺破狼 = true;
        地支矩陣[命盤.人事宮.財帛宮.地支數].宮干四化.分析.殺破狼 = true;
        地支矩陣[命盤.人事宮.官祿宮.地支數].宮干四化.分析.殺破狼 = true;
    }  // end if 殺破狼
    
    
    測試星曜矩陣 = 地支矩陣[命盤.人事宮.命宮.地支數].星曜.concat(地支矩陣[命盤.人事宮.財帛宮.地支數].星曜, 地支矩陣[命盤.人事宮.官祿宮.地支數].星曜, 地支矩陣[命盤.人事宮.遷移宮.地支數].星曜);
    測試星曜矩陣 = _.without(測試星曜矩陣, "文昌", "文曲", "左輔", "右弼");
    
    if(_.contains(測試星曜矩陣, "天機") && _.contains(測試星曜矩陣, "太陰") && _.contains(測試星曜矩陣, "天同") && _.contains(測試星曜矩陣, "天梁") && 測試星曜矩陣.length==4) {
        地支矩陣[命盤.人事宮.命宮.地支數].宮干四化.分析.機月同梁 = true;
        地支矩陣[命盤.人事宮.財帛宮.地支數].宮干四化.分析.機月同梁 = true;
        地支矩陣[命盤.人事宮.官祿宮.地支數].宮干四化.分析.機月同梁 = true;
        地支矩陣[命盤.人事宮.遷移宮.地支數].宮干四化.分析.機月同梁 = true;
    }  // end if 機月同梁
    
    
    // ----------------------------------------
    
    分析自化流出(地支矩陣, 星曜原件);  // 刷新各宮是否自化、流出
    
    // ---------------- 分析 祿沖宮 ----------------
    var 本命宮六名, 本命宮十名;
    var 本命宮位飛四化, 本命宮六飛四化, 本命宮十飛四化, 宫干分析;
    var 宮位地支, 宮位的六, 宮位的五, 宮位的九, 宮位的十;  //地支數
    var 祿入宮, 忌入宮, 忌沖宮, 忌沖宮線, 祿入宮六, 忌沖宮六, 忌沖宮十; //地支數
    for(var i=0; i<12; i++){
        本命宮六名 = 人事宮位[地支滾動(i, 5)]; 本命宮十名 = 人事宮位[地支滾動(i, 6)];
        本命宮位飛四化 = 宮位四化落宮(命盤, 人事宮位[i], 1);
        本命宮六飛四化 = 宮位四化落宮(命盤, 本命宮六名, 1);
        本命宮十飛四化 = 宮位四化落宮(命盤, 本命宮十名, 1);
        
        祿入宮 = 本命宮位飛四化.化祿.地支數; 忌入宮 = 本命宮位飛四化.化忌.地支數; 忌沖宮 = 本命宮位飛四化.忌沖.地支數; 
        祿入宮六 = 本命宮六飛四化.化祿.地支數; 忌沖宮六 = 本命宮六飛四化.忌沖.地支數; 忌沖宮十 = 本命宮十飛四化.忌沖.地支數;
        祿入宮線 = 本命宮位飛四化.化祿.宮位線; 忌沖宮線 = 本命宮位飛四化.忌沖.宮位線;
        
        宮位地支 = 本命宮位飛四化.化出宮地支數; 宮位的六 = 地支滾動(宮位地支, 7); 宮位的五 = 地支滾動(宮位地支, 8); 宮位的九 = 地支滾動(宮位地支, 4); 宮位的十 = 地支滾動(宮位地支, 3); 
        宫干分析 = 命盤.地支宮位[宮位地支].宮干四化.分析;
        
        // ------------- 一沖六，六沖一 -------------
        if(祿入宮 == 宮位的六) 宫干分析.祿入六 = true;
        if(忌入宮 == 宮位的六) 宫干分析.忌入六 = true;
        if(忌沖宮 == 宮位的六) 宫干分析.一沖六 = true;
        if(祿入宮六 == 宮位地支) 宫干分析.六祿一 = true;
        if(忌沖宮六 == 宮位地支) 宫干分析.六沖一 = true;
        
        // ------------- 一沖十，十沖一 -------------
        if(祿入宮 == 宮位的十) 宫干分析.祿入十 = true;
        if(忌入宮 == 宮位的十) 宫干分析.忌入十 = true;
        if(忌沖宮 == 宮位的十) 宫干分析.一沖十 = true;
        if(忌沖宮十 == 宮位地支) 宫干分析.十沖一 = true;
        
        // ------------- 沖三方 -------------
        if(祿入宮 == 宮位的五 || 祿入宮 == 宮位的九) 宫干分析.祿三方 = true;
        if(忌沖宮 == 宮位的五 || 忌沖宮 == 宮位的九) 宫干分析.沖三方 = true;
        
        // ------------- 沖六線 -------------
        var 祿入六線 = 六線宮位光明成就子田分析(祿入宮線, 人事宮位[i]).光明成就子田;
        if(祿入六線 == "子田線" || 祿入六線 == "光明線" || 祿入六線 == "成就線") 宫干分析["祿入" + 祿入六線] = true;
        //if(祿入六線 == "子田線" || 祿入六線 == "光明線" || 祿入六線 == "成就線") console.log(人事宮位[i] + "祿入" + 祿入六線);
        
        var 忌沖六線 = 六線宮位光明成就子田分析(忌沖宮線, 人事宮位[i]).光明成就子田;
        if(忌沖六線 == "子田線" || 忌沖六線 == "光明線" || 忌沖六線 == "成就線") 宫干分析["忌沖" + 忌沖六線] = true;
        //if(忌沖六線 == "子田線" || 忌沖六線 == "光明線" || 忌沖六線 == "成就線") console.log(人事宮位[i] + "忌沖" + 忌沖六線);
        
        
        // ------------- 一六互沖 -------------  1976年12月16日-申-男
        if(忌入宮 == 忌沖宮六) {
            宫干分析.一六互沖 = true;
            宫干分析.一六互沖線 = 本命宮位飛四化.化忌.宮位線;
            //console.log(人事宮位[i] + "一六互沖 於" + 宫干分析.一六互沖線);
        } // end if 一六互沖
        
        
        
        // ------------- 祿權忌同對宮 -------------
        if(本命宮位飛四化.化祿.地支數 == 本命宮位飛四化.化權.地支數) 宫干分析.祿權同宮 = true;
        if(本命宮位飛四化.化祿.地支數 == 本命宮位飛四化.化忌.地支數) 宫干分析.祿忌同宮 = true;
        
        if(本命宮位飛四化.化祿.地支數 == 地支滾動(本命宮位飛四化.化權.地支數, 6)) 宫干分析.祿權對宮 = true;
        if(本命宮位飛四化.化祿.地支數 == 地支滾動(本命宮位飛四化.化忌.地支數, 6)) 宫干分析.祿忌對宮 = true;
    } // end for i
    
    //console.log(地支矩陣);
} // end function 宮位四化分析



// -----------------------------------------------------------------

function 分析自化流出(地支矩陣, 星曜){
	for(var i=0; i<12; i++){
		// ××××× 自化 ×××××
		if(地支矩陣[i].宮干四化.祿出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化祿星].自化 ="祿";
			地支矩陣[i].宮干四化.分析.自化祿 = true;
		}// end if

		if(地支矩陣[i].宮干四化.權出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化權星].自化 ="權";
			地支矩陣[i].宮干四化.分析.自化權 = true;
		}// end if

		if(地支矩陣[i].宮干四化.科出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化科星].自化 ="科";
			地支矩陣[i].宮干四化.分析.自化科 = true;
		}// end if

		if(地支矩陣[i].宮干四化.忌出.地支數 == i) {
			星曜[地支矩陣[i].宮干四化.化忌星].自化 ="忌";
			地支矩陣[i].宮干四化.分析.自化忌 = true;
		}// end if

		
		// ××××× 流出 ×××××
		if(地支矩陣[i].宮干四化.祿出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化祿星].流出 ="祿";
			地支矩陣[i].宮干四化.分析.流出祿 = true;
		}// end if

		if(地支矩陣[i].宮干四化.權出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化權星].流出 ="權";
			地支矩陣[i].宮干四化.分析.流出權 = true;
		}// end if

		if(地支矩陣[i].宮干四化.科出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化科星].流出 ="科";
			地支矩陣[i].宮干四化.分析.流出科 = true;
		}// end if

		if(地支矩陣[i].宮干四化.忌出.地支數 == 地支滾動(i, 6)) {
			星曜[地支矩陣[i].宮干四化.化忌星].流出 ="忌";
			地支矩陣[i].宮干四化.分析.流出忌 = true;
		}// end if
		
        if(地支矩陣[i].宮干四化.分析.流出祿) 地支矩陣[i].宮干四化.分析.流出矩陣.push("祿");
        if(地支矩陣[i].宮干四化.分析.流出權) 地支矩陣[i].宮干四化.分析.流出矩陣.push("權");
        //if(地支矩陣[i].宮干四化.分析.流出科) 地支矩陣[i].宮干四化.分析.流出矩陣.push("科");
        if(地支矩陣[i].宮干四化.分析.流出忌) 地支矩陣[i].宮干四化.分析.流出矩陣.push("忌");
	} // end for i
} //end function 尋自化流出

