



function 宮位自化流出判斷(命盤, 宮位, 大限數, 自化流出, 四化){
    // 宮位: 十二人事宮位，本命或大限依照“大限數”，1為本命，其他為大限
    var 自化流出 ={
        "大限數": 大限數,
        "四化": 自化流出 + 四化.substr(1,1),
        "成立": false,
        "星曜": "",
        "成立條件": "",
        //"判斷句": "",
        "行運順逆": "",
        "化出宮": 宮位,
        "化出宮地支數": -1,
        "宮干": "",
        "化出重疊宮": "",
        "化入宮": "",
        "忌沖宮": "",
        "化入宮地支數": -1,
        "忌沖宮地支數": -1,
        "化入重疊宮": "",
        "忌沖重疊宮": "",
        "化入宮線": "",
        "化入重疊線": "",
        "備註": ""
    } //end var 自化流出
    
    if(大限數>0 && 大限數<8) 自化流出.化出宮地支數 = 命盤.大限[大限數].人事宮[宮位]; else {
        console.log("function 宮位自化流出判斷 的輸入大限數錯誤：" + 大限數);
        return 自化流出;
    }  // end if
    
    //console.log(自化流出.化出宮地支數 + " : " +自化流出.四化);
    
    if(命盤.地支宮位[自化流出.化出宮地支數].宮干四化.分析[自化流出.四化] !=true) return 自化流出;

    //  *********** 條件成立 *********
    //console.log(大限數 + "/" + 自化流出.化出宮地支數);
    var 四化宮字;
    
    switch(四化){
        case "化祿": 四化宮字 = "祿出"; break;
        case "化權": 四化宮字 = "權出"; break;
        case "化科": 四化宮字 = "科出"; break;
        case "化忌": 四化宮字 = "忌出"; break;
    } // end switch
    
    自化流出.成立 = true;
    自化流出.行運順逆 = 命盤.行運順逆;
    自化流出.宮干 = 命盤.地支宮位[自化流出.化出宮地支數].宮干;
    自化流出.星曜 = 命盤.地支宮位[自化流出.化出宮地支數].宮干四化[四化+"星"];
    自化流出.化入宮線 = 命盤.地支宮位[自化流出.化出宮地支數].六線;

    自化流出.化入宮 = 命盤.地支宮位[自化流出.化出宮地支數].宮干四化[四化宮字].人事宮[0];
    自化流出.化入宮地支數 = 命盤.人事宮[自化流出.化入宮].地支數;
    
    if(四化 == "化忌") {
        自化流出.忌沖宮 = 命盤.地支宮位[自化流出.化出宮地支數].宮干四化[四化宮字+"沖"].人事宮[0];
        自化流出.忌沖宮地支數 = 命盤.人事宮[自化流出.忌沖宮].地支數;
    }  //end if

    //console.log(自化流出);
    if(大限數==1) { // 本命
        自化流出.成立條件 = 宮位 + 自化流出.星曜 + 自化流出.四化 +"，";
        return 自化流出;
    } //end if
    
    if(大限數>1) {  //大限
        自化流出.化出重疊宮 = 命盤.地支宮位[自化流出.化出宮地支數].宮位;
        自化流出.化入重疊宮 = 命盤.大限[大限數].地支[自化流出.化入宮地支數].人事宮;
        自化流出.化入重疊線 = 命盤.大限[大限數].地支[自化流出.化入宮地支數].六線;
        if(四化 == "化忌") 自化流出.忌沖重疊宮 =命盤.大限[大限數].地支[自化流出.忌沖宮地支數].人事宮;
        自化流出.成立條件 = "大限" + 宮位 + "重疊" + 自化流出.化出重疊宮 + 自化流出.星曜 + 自化流出.四化 +"，";
        return 自化流出;
    } //end if
    //console.log(自化流出);
} //end function 宮位自化流出判斷




// *************************************************************

function 忌沖祿的六線(命盤, 化出宮, 化祿星, 化忌星, 借宮) {
    // 祿入的宮位的六線被忌沖破，比方大限夫妻宮祿入夫妻宮，但卻沖破父疾線
    // used by function 星曜架構飛四化, to be deleted !!
	if(化出宮 === undefined) 化出宮 ="";
	if(借宮 !=true) 借宮 =false;

	//var 化出宮地支數 = -1;

	var 祿入地支1 = 命盤.星曜[化祿星].地支數;
	var 祿入地支2 = -1;

	if(命盤.地支宮位[地支滾動(祿入地支1, 6)].空宮==true && 命盤.星曜[化祿星].自化!="祿" && 借宮) 祿入地支2 = 地支滾動(祿入地支1, 6);
	var 祿入宮位1 = 命盤.地支宮位[祿入地支1].宮位;
	var 祿入宮位2 = "";
	if(祿入地支2 != -1) 祿入宮位2 = 命盤.地支宮位[祿入地支2].宮位;


	var 忌入地支1 = 命盤.星曜[化忌星].地支數;
	var 忌入地支2 = -1;
	if(命盤.地支宮位[地支滾動(忌入地支1, 6)].空宮==true && 命盤.星曜[化祿星].自化!="忌" && 借宮) 忌入地支2 = 地支滾動(忌入地支1, 6);
	var 忌沖地支1= 地支滾動(忌入地支1, 6);
	var 忌沖地支2 = -1;
	if(忌入地支2 != -1) 忌沖地支2 = 忌入地支1;
	var 忌入宮位1 = 命盤.地支宮位[忌入地支1].宮位;
	var 忌入宮位2 = "";
	if(忌入地支2 != -1) 忌入宮位2 = 命盤.地支宮位[忌入地支2].宮位;
	var 忌沖宮位1 = 命盤.地支宮位[忌沖地支1].宮位;
	var 忌沖宮位2 = "";
	if(忌入地支2 != -1) 忌沖宮位2 = 忌入宮位1;


	var 祿入地支田宅宮1 = 地支滾動(祿入地支1, 3);
	var 祿入地支光明線 = {
		"地支1": 地支滾動(祿入地支1, 1),
		"地支2": 地支滾動(祿入地支1, (1 + 6))
	};
	var 祿入地支子田線 = {
		"地支1": 地支滾動(祿入地支1, 9),
		"地支2": 地支滾動(祿入地支1, (9 - 6))
	};
	var 祿入地支成就線 = {
		"地支1": 地支滾動(祿入地支1, -1),
		"地支2": 地支滾動(祿入地支1, (-1 + 6))
	};

	var 忌沖祿六線={
		"沖光明線": false,
		"沖子田線": false,
		"沖成就線": false,
		"沖命遷線": false,
		"同宮": false,
		"祿忌一六": false,
		"沖線": "",
		"判斷句": "",
		"成立": false
	};

	if(忌沖地支1 == 祿入地支光明線.地支1 || 忌沖地支1 == 祿入地支光明線.地支2) {
		忌沖祿六線.沖光明線=true;
		忌沖祿六線.沖線="光明線";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿入" + 祿入宮位1 + "但忌沖它的光明線";
	}

	if((忌沖地支1 == 祿入地支子田線.地支1 || 忌沖地支1 == 祿入地支子田線.地支2) && 忌入地支1!=祿入地支田宅宮1) {
		忌沖祿六線.沖子田線=true;
		忌沖祿六線.沖線="子田線";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿入" + 祿入宮位1 + "但忌沖它的子田線";
	}

	if(忌沖地支1 == 祿入地支成就線.地支1 || 忌沖地支1 == 祿入地支成就線.地支2) {
		忌沖祿六線.沖成就線=true;
		忌沖祿六線.沖線="成就線";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿入" + 祿入宮位1 + "但忌沖它的成就線";
	}

	if(祿入地支1 == 忌沖地支1) {
		忌沖祿六線.沖命遷線=true;
		忌沖祿六線.沖線="命遷線";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿入" + 祿入宮位1 + "但同時被忌沖，為祿逢沖破";
	}
	
	if(祿入地支1 == 忌入地支1) {
		忌沖祿六線.同宮=true;
		忌沖祿六線.沖線="";
		忌沖祿六線.成立=true;
		忌沖祿六線.判斷句 = 化出宮 + "化祿忌入" + 祿入宮位1;
	}
	
	// --------------- 祿忌進1、6 ---------------
	var 祿入宮的六1 = 地支滾動(祿入地支1, -5);
	var 祿入宮的六2 = -2;
	if(祿入地支2 != -1) 祿入宮的六2 = 地支滾動(祿入地支2, -5);
	var 忌入宮的六1 = 地支滾動(忌入地支1, -5);
	var 忌入宮的六2 = -2;
	if(忌入地支2 != -1) 忌入宮的六2 = 地支滾動(忌入地支2, -5);
	var 一六宮;

	if(祿入宮的六1==忌入地支1 || 祿入宮的六2==忌入地支1) {
		一六宮 = (祿入宮的六1==忌入地支1) ? 祿入宮位1 : 祿入宮位2;
		忌沖祿六線.祿忌一六=true;
		忌沖祿六線.成立=true;
		忌沖祿六線.沖線="";
		忌沖祿六線.判斷句 = 化出宮 + "化祿忌入" + 一六宮 + "的1、6";
	}

	if(祿入宮的六1==忌入地支2 || (祿入宮的六2==忌入地支2)) {
		一六宮 = (祿入宮的六1==忌入地支2) ? 祿入宮位1 : 祿入宮位2;
		忌沖祿六線.祿忌一六=true;
		忌沖祿六線.成立=true;
		忌沖祿六線.沖線="";
		忌沖祿六線.判斷句 = 化出宮 + "化祿忌入" + 一六宮 + "的1、6";
	}

	if(忌入宮的六1==祿入地支1 || 忌入宮的六2==祿入地支1) {
		一六宮 = (忌入宮的六1==祿入地支1) ? 忌入宮位1 : 忌入宮位2;
		忌沖祿六線.祿忌一六=true;
		忌沖祿六線.成立=true;
		忌沖祿六線.沖線="";
		忌沖祿六線.判斷句 = 化出宮 + "化祿忌入" + 一六宮 + "的1、6";
	}

	if(忌入宮的六1==祿入地支2 || 忌入宮的六2==祿入地支2) {
		一六宮 = (忌入宮的六1==祿入地支2) ? 忌入宮位1 : 忌入宮位2;
		忌沖祿六線.祿忌一六=true;
		忌沖祿六線.成立=true;
		忌沖祿六線.沖線="";
		忌沖祿六線.判斷句 = 化出宮 + "化祿忌入" + 一六宮 + "的1、6";
	}

	if((祿入宮的六1==忌入地支2 && 祿入宮的六2==忌入地支1) || (祿入宮的六1==忌入地支1 && 祿入宮的六2==忌入地支2)) {
		一六宮 = 祿入宮位1 + "與" + 祿入宮位2;
		忌沖祿六線.祿忌一六=true;
		忌沖祿六線.成立=true;
		忌沖祿六線.沖線="";
		忌沖祿六線.判斷句 = 化出宮 + "化祿忌入" + 一六宮 + "的1、6";
	} // special case for 紫殺，文曲在寅申
	return 忌沖祿六線;
}  //end function 忌沖祿的六線



function 忌沖疾厄田宅(命盤, 化出地支, 忌入地支, 化忌星曜) {
    // used by function 星曜架構飛四化, to be deleted !!
	var 忌沖地支1 = 地支滾動(忌入地支, 6);
	var 忌沖地支2 = -1;
	if(命盤.地支宮位[忌沖地支1].空宮==true && 命盤.星曜[化忌星曜].自化!="忌") 忌沖地支2 = 忌入地支;
	var 化出地支疾厄宮 = 地支滾動(化出地支, -5);
	var 化出地支田宅宮 = 地支滾動(化出地支, -9);
	
	var 忌沖疾田={
		"沖疾厄宮": false,
		"沖田宅宮": false,
		"沖宮": "",
		"成立": false
	};
	
	//console.log(化出地支);
	//console.log(忌入地支);
	//console.log(忌沖地支1);
	//console.log(忌沖地支2);
	if(忌沖地支1 == 化出地支疾厄宮 || 忌沖地支2 == 化出地支疾厄宮) {
		忌沖疾田.沖疾厄宮=true;
		忌沖疾田.沖宮="疾厄宮";
		忌沖疾田.成立=true;
	}  // end if 化出地支疾厄宮
	
	if(忌沖地支1 == 化出地支田宅宮 || 忌沖地支2 == 化出地支田宅宮) {
		忌沖疾田.沖田宅宮=true;
		忌沖疾田.沖宮="田宅宮";
		忌沖疾田.成立=true;
	}  // end if 化出地支田宅宮

	return 忌沖疾田;
}  //end function 忌沖疾厄田宅



// *********************************************************
function 化入祿權忌三方(命盤, 化出宮地支數, 借宮, tag){
	// Input: 每個宮位飛出的化祿權忌的地支數，然後分析是否化入三方

	var 化入祿權忌 = {
		"成立": false, // 如果化入三方成立 ！！
        "化出宮": 命盤.地支宮位[化出宮地支數].宮位,
        "化出宮自化": "",
        "化出宮地支數": 化出宮地支數,
        "祿入地支數": -1,
        "權入地支數": -1,
        "忌入地支數": -1,
        "祿權差距數": -1,
        "祿忌差距數": -1,
        "權忌差距數": -1,
		"祿權": false,
		"祿忌": false,
		"祿權忌": false,
		"四化": "",  // 結論是化祿權、祿忌還是祿權忌
        "借宮": false,
		"三方地支": "",
		"三方宮位": "",
		"三方大限宮位": "",
        "祿入宮": "",
        "祿入宮線": "",
        "忌沖宮": "",
        "忌沖宮線": "",
		"備註": ""
	} // end obj 化入祿權忌


	if(借宮===undefined) 借宮 = false;
    if(tag===undefined) tag = "";  // tag for special calling to ease troubleshooting
    
    //if(tag.substr(0,2) == "本命") console.log(化入祿權忌);
    
	if(isNaN(化出宮地支數)) {
		命盤.ErrorLog.push("化入祿權忌三方: 化出宮的地支數錯誤：" + 化出宮地支數);
		return 化入祿權忌;
	} // end if 

	var 化祿地支 = 命盤.地支宮位[化出宮地支數].宮干四化.祿出.地支數1; 化入祿權忌.祿入地支數 = 化祿地支;
	var 化權地支 = 命盤.地支宮位[化出宮地支數].宮干四化.權出.地支數1; 化入祿權忌.權入地支數 = 化權地支;
	var 化忌地支 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出.地支數1; 化入祿權忌.忌入地支數 = 化忌地支;

	var 祿權差距數 = Math.abs(化祿地支 - 化權地支); 化入祿權忌.祿權差距數 = 祿權差距數;
	var 祿忌差距數 = Math.abs(化祿地支 - 化忌地支); 化入祿權忌.祿忌差距數 = 祿忌差距數;
	var 權忌差距數 = Math.abs(化權地支 - 化忌地支); 化入祿權忌.權忌差距數 = 權忌差距數;

    化入祿權忌.祿入宮 = 命盤.地支宮位[化出宮地支數].宮干四化.祿出.人事宮[0];
    化入祿權忌.祿入宮線 = 宮位轉六線(化入祿權忌.祿入宮);
    化入祿權忌.忌沖宮 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出沖.人事宮[0];
    化入祿權忌.忌沖宮線 = 宮位轉六線(化入祿權忌.忌沖宮);
    
    
	// ---- 檢測祿權 是否三方 ----
	if(祿權差距數==4 || 祿權差距數==8) {
		化入祿權忌.祿權 = true;
		化入祿權忌.四化 = "祿權";
	}

	if(祿忌差距數==4 || 祿忌差距數==8) {
		化入祿權忌.祿忌 = true;
		化入祿權忌.四化 = "祿忌";
	}
    
    //化入祿權忌.祿權 == false && 化入祿權忌.祿忌 == false && 
	if(借宮 && (命盤.地支宮位[化出宮地支數].宮干四化.分析.自化祿 || 命盤.地支宮位[化出宮地支數].宮干四化.分析.自化權 || 命盤.地支宮位[化出宮地支數].宮干四化.分析.自化忌)){
        //要借宮的前提是原本的宮位化祿權、祿忌沒有成立在先，且化出宮有自化
        
        var 對宮地支 = 地支滾動(化出宮地支數, 6);
        var 借宮化祿地支 = -99, 借宮化權地支 = -99, 借宮化忌地支 = -99;
        var 借宮祿權差距數 = -99, 借宮祿忌差距數 = -99, 借宮權忌差距數 = -99;

        if(命盤.地支宮位[化出宮地支數].宮干四化.分析.自化祿 && 命盤.地支宮位[對宮地支].無主星) { 化入祿權忌.化出宮自化 = "自化祿"; 借宮化祿地支 = 對宮地支; }
        if(命盤.地支宮位[化出宮地支數].宮干四化.分析.自化權 && 命盤.地支宮位[對宮地支].無主星) { 化入祿權忌.化出宮自化 = "自化權"; 借宮化權地支 = 對宮地支; }
        if(命盤.地支宮位[化出宮地支數].宮干四化.分析.自化忌 && 命盤.地支宮位[對宮地支].無主星) { 化入祿權忌.化出宮自化 = "自化忌"; 借宮化忌地支 = 對宮地支; }
        
        if(借宮化祿地支>=0 && 借宮化權地支==-99) 借宮祿權差距數 = Math.abs(借宮化祿地支 - 化權地支);
        if(借宮化祿地支==-99 && 借宮化權地支>=0) 借宮祿權差距數 = Math.abs(化祿地支 - 借宮化權地支);
        
        if(借宮祿權差距數==4 || 借宮祿權差距數==8) {
            化入祿權忌.祿權 = true;
            化入祿權忌.四化 = "祿權";
            化入祿權忌.借宮 = true;
            化入祿權忌.祿權差距數 = 借宮祿權差距數 + "*";
	    } // end if 借宮祿權
        
        if(借宮化祿地支>=0 && 借宮化忌地支==-99) 借宮祿忌差距數 = Math.abs(借宮化祿地支 - 化忌地支);
        if(借宮化祿地支==-99 && 借宮化忌地支>=0) 借宮祿忌差距數 = Math.abs(化祿地支 - 借宮化忌地支);
        
        if(借宮祿忌差距數==4 || 借宮祿忌差距數==8) {
            化入祿權忌.祿忌 = true;
            化入祿權忌.四化 = "祿忌";
            化入祿權忌.借宮 = true;
            化入祿權忌.祿忌差距數 = 借宮祿忌差距數 + "*";
	    } // end if 借宮祿忌
        
        if(借宮化權地支>=0 && 借宮化忌地支==-99) { 借宮權忌差距數 = Math.abs(借宮化權地支 - 化忌地支); 化入祿權忌.權忌差距數 = 借宮權忌差距數 + "*"; }
        if(借宮化權地支==-99 && 借宮化忌地支>=0) { 借宮權忌差距數 = Math.abs(化權地支 - 借宮化忌地支); 化入祿權忌.權忌差距數 = 借宮權忌差距數 + "*"; }

    }  //end if 借宮

    
	if(化入祿權忌.祿權 || 化入祿權忌.祿忌){
		化入祿權忌.成立 = true;
		if((化入祿權忌.祿權 && 化入祿權忌.祿忌) || (化入祿權忌.祿權 && (祿忌差距數==0 || 權忌差距數==0)) || (化入祿權忌.祿權 && (借宮祿忌差距數==0 || 借宮權忌差距數==0)) ){
			化入祿權忌.祿權忌 = true;
			化入祿權忌.四化 = "祿權忌";
		}  //end if  四化祿權忌
        
        var 借宮地支 = (借宮化祿地支<0) ? 化祿地支 : 借宮化祿地支;
        
		化入祿權忌.三方地支 = (化入祿權忌.借宮 == false) ? 尋三合方(地支字數轉換(化祿地支)).三合簡短 : 尋三合方(地支字數轉換(借宮地支)).三合簡短;
		化入祿權忌.三方宮位 = (化入祿權忌.借宮 == false) ? 尋三合方(命盤.地支宮位[化祿地支].宮位).三合簡短 : 尋三合方(命盤.地支宮位[借宮地支].宮位).三合簡短;  //借宮化祿地支
	} // end if 化入祿權忌.成立
    
	return 化入祿權忌;
} // end function 化入祿權忌三方


// *********************************************************
function 化入祿權忌一六十(命盤, 化出宮, 對應宮位, 大限數, 借宮){
    // 化出宮可以是本命或是大限，不帶"大限"， 大限數 1 代表本命
    // 化出宮是否有祿權忌入對應宮位的1、6、10，比方大財是否化入財帛宮、田宅宮、兄弟宮
    if(借宮===undefined) 借宮 = false;
    
    	var 化入祿權忌 = {
        "化出宮": "",
        "化出宮重疊": "",
        "對應宮": 對應宮位,
        "大限數": 大限數,
        "借宮": 借宮,
		"成立": false, // 如果化入一六十成立 ！
        "成立條件": "",
        "成立條件附加": "",
        "成立條件結論": "",
		"祿權": false,
		"祿忌": false,
		"祿權忌": false,
        "化入一六": false,
        "化入一十": false,
		"四化": "",  // 結論是化祿權、祿忌還是祿權忌
        "組群": "", //化入1、6，1、10，1、6、10，文字
        "祿入": -1,  //1、6、10
        "忌入": -1,  //1、6、10
        "同類忌入": false,  //是否忌入同類，比方大財忌入財
        "祿入宮": "",  //十二人事宮
        "權入宮": "",  //十二人事宮
        "忌入宮": "",  //十二人事宮
        "忌沖宮": "",  //十二人事宮
        "忌沖宮線": "",  //六線
        "忌沖宮重疊": "",  //重疊的大限宮位
        "忌沖宮線重疊": "",  //重疊的大限宮位線
        "對應宮六線": "",  //對應宮的六線，比方對應宮是財帛宮，對應宮六線，成就線 是指 父疾線 。。。。
        "借宮": false,
		"備註": ""
	} // end obj 化入祿權忌
        
    if(大限數>9) return 化入祿權忌;
    
    化入祿權忌.化出宮 = (大限數 == 1) ? 化出宮 : "大限" + 化出宮;
    
    var 化出宮地支數 = 命盤.大限[大限數].人事宮[化出宮];
    var 對應宮地支數 = 命盤.大限[1].人事宮[對應宮位];
    var 對應宮的六 = 地支滾動(對應宮地支數, 7); var 對應宮的十 = 地支滾動(對應宮地支數, 3);
    var 化出宮化祿地支數 = 命盤.地支宮位[化出宮地支數].宮干四化.祿出.地支數1;
    var 化出宮化權地支數 = 命盤.地支宮位[化出宮地支數].宮干四化.權出.地支數1;
    var 化出宮化忌地支數 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出.地支數1;
    var 化出宮忌沖地支數 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出沖.地支數1;
    
    化入祿權忌.祿入宮 = 命盤.地支宮位[化出宮地支數].宮干四化.祿出.人事宮[0];
    化入祿權忌.權入宮 = 命盤.地支宮位[化出宮地支數].宮干四化.權出.人事宮[0];
    化入祿權忌.忌入宮 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出.人事宮[0];
    化入祿權忌.忌沖宮 = 命盤.地支宮位[化出宮地支數].宮干四化.忌出沖.人事宮[0];
    化入祿權忌.忌沖宮線 = 宮位轉六線(化入祿權忌.忌沖宮);
    if(大限數>1) {
        化入祿權忌.化出宮重疊 = 命盤.地支宮位[化出宮地支數].宮位;
        化入祿權忌.忌沖宮重疊 = 命盤.大限[大限數].地支[化出宮忌沖地支數].人事宮;
        化入祿權忌.忌沖宮線重疊 = 宮位轉六線(化入祿權忌.忌沖宮重疊);
    } //end if
    化入祿權忌.對應宮六線 = 六線宮位光明成就子田分析(化入祿權忌.忌沖宮線, 對應宮位).光明成就子田;
    if(化入祿權忌.對應宮六線 != "") 化入祿權忌.成立條件附加 = "，但忌沖" + 對應宮位 + "的" + 化入祿權忌.對應宮六線;
    if(化入祿權忌.忌沖宮線 == 宮位轉六線(化入祿權忌.對應宮)) 化入祿權忌.同類忌入 = true;

    // --------- 祿權入 1、6 ---------
    if((化出宮化祿地支數 == 對應宮地支數 && 化出宮化權地支數 == 對應宮的六) || (化出宮化祿地支數 == 對應宮的六 && 化出宮化權地支數 == 對應宮地支數)) {
        //console.log(化入祿權忌);
        化入祿權忌.成立 = true;
        化入祿權忌.祿權 = true;
        化入祿權忌.化入一六= true;
        化入祿權忌.四化 = "祿權";
        化入祿權忌.組群 = "1、6";
        化入祿權忌.忌入宮 = 
        化入祿權忌.成立條件 = "化祿入" + 化入祿權忌.祿入宮 + "；化權入" + 化入祿權忌.權入宮 + "，化" + 化入祿權忌.四化 + "入" + 化入祿權忌.對應宮 + "的1、6";

        if(化出宮化祿地支數 == 對應宮地支數) 化入祿權忌.祿入 = 1;
        if(化出宮化祿地支數 == 對應宮的六) 化入祿權忌.祿入 = 6;
    } // end if 祿權入1、6
    
    // --------- 祿忌入 1、6 ---------
    if((化出宮化祿地支數 == 對應宮地支數 && 化出宮化忌地支數 == 對應宮的六) || (化出宮化祿地支數 == 對應宮的六 && 化出宮化忌地支數 == 對應宮地支數)) {
        化入祿權忌.成立 = true;
        化入祿權忌.祿忌 = true;
        化入祿權忌.化入一六= true;
        化入祿權忌.四化 = "祿忌";
        化入祿權忌.組群 = "1、6";
        化入祿權忌.成立條件 = "化祿入" + 化入祿權忌.祿入宮 + "；化忌入" + 化入祿權忌.忌入宮 + "，化" + 化入祿權忌.四化 + "入" + 化入祿權忌.對應宮 + "的" + 化入祿權忌.組群;
        
        if(化出宮化祿地支數 == 對應宮地支數) 化入祿權忌.祿入 = 1;
        if(化出宮化祿地支數 == 對應宮的六) 化入祿權忌.祿入 = 6;
        if(化出宮化忌地支數 == 對應宮地支數) 化入祿權忌.忌入 = 1;
        if(化出宮化忌地支數 == 對應宮的六) 化入祿權忌.忌入 = 6;
    } // end if 祿忌入1、6
    
    if(化入祿權忌.化入一六 && 化入祿權忌.祿權 && 化入祿權忌.祿忌){
        化入祿權忌.祿權忌 = true;
        化入祿權忌.四化 = "祿權忌";
        //化入祿權忌.組群 = "1、6、10";
        化入祿權忌.成立條件 = "化祿入" + 化入祿權忌.祿入宮 + "；化權入" + 化入祿權忌.權入宮 + "；化忌入" + 化入祿權忌.忌入宮 + "，化" + 化入祿權忌.四化 + "入" + 化入祿權忌.對應宮 + "的" + 化入祿權忌.組群;
    } //化入祿權忌

    
    // --------- 祿權入 1、10 ---------
    if((化出宮化祿地支數 == 對應宮地支數 && 化出宮化權地支數 == 對應宮的十) || (化出宮化祿地支數 == 對應宮的十 && 化出宮化權地支數 == 對應宮地支數)) {
        化入祿權忌.成立 = true;
        化入祿權忌.祿權 = true;
        化入祿權忌.化入一十= true;
        化入祿權忌.四化 = "祿權";
        化入祿權忌.組群 = "1、10";
        化入祿權忌.成立條件 = "化祿入" + 化入祿權忌.祿入宮 + "；化權入" + 化入祿權忌.權入宮 + "，化" + 化入祿權忌.四化 + "入" + 化入祿權忌.對應宮 + "的" + 化入祿權忌.組群;
        
        if(化出宮化祿地支數 == 對應宮地支數) 化入祿權忌.祿入 = 1;
        if(化出宮化祿地支數 == 對應宮的十) 化入祿權忌.祿入 = 10;
    } // end if 祿權入1、10
    
    // --------- 祿忌入 1、10 ---------
    if((化出宮化祿地支數 == 對應宮地支數 && 化出宮化忌地支數 == 對應宮的十) || (化出宮化祿地支數 == 對應宮的十 && 化出宮化忌地支數 == 對應宮地支數)) {
        化入祿權忌.成立 = true;
        化入祿權忌.祿忌 = true;
        化入祿權忌.化入一十= true;
        化入祿權忌.四化 = "祿忌";
        化入祿權忌.組群 = "1、10";
        化入祿權忌.成立條件 = "化祿入" + 化入祿權忌.祿入宮 + "；化忌入" + 化入祿權忌.忌入宮 + "，化" + 化入祿權忌.四化 + "入" + 化入祿權忌.對應宮 + "的" + 化入祿權忌.組群;
        
        if(化出宮化祿地支數 == 對應宮地支數) 化入祿權忌.祿入 = 1;
        if(化出宮化祿地支數 == 對應宮的十) 化入祿權忌.祿入 = 10;
        if(化出宮化忌地支數 == 對應宮地支數) 化入祿權忌.忌入 = 1;
        if(化出宮化忌地支數 == 對應宮的十) 化入祿權忌.忌入 = 10;
    } // end if 祿忌入1、10
    
    if(化入祿權忌.化入一十 && 化入祿權忌.祿權 && 化入祿權忌.祿忌){
        化入祿權忌.祿權忌 = true;
        化入祿權忌.四化 = "祿權忌";
        //化入祿權忌.組群 = "1、6、10";
        化入祿權忌.成立條件 = "化祿入" + 化入祿權忌.祿入宮 + "；化權入" + 化入祿權忌.權入宮 + "；化忌入" + 化入祿權忌.忌入宮 + "，化" + 化入祿權忌.四化 + "入" + 化入祿權忌.對應宮 + "的" + 化入祿權忌.組群;
    } //化入祿權忌
    
    
    
    if(化入祿權忌.化入一六 && 化入祿權忌.化入一十){
        化入祿權忌.祿權忌 = true;
        化入祿權忌.四化 = "祿權忌";
        化入祿權忌.組群 = "1、6、10";
        化入祿權忌.成立條件 = "化祿入" + 化入祿權忌.祿入宮 + "；化權入" + 化入祿權忌.權入宮 + "；化忌入" + 化入祿權忌.忌入宮 + "，化" + 化入祿權忌.四化 + "入" + 化入祿權忌.對應宮 + "的" + 化入祿權忌.組群;
    } //化入1、6、10
    
    //if(化入祿權忌.成立) console.log(化入祿權忌);
    //console.log(化出宮 + "地支數：" + 化出宮地支數 + "\n" + 對應宮位 + "地支數：" + 對應宮地支數 + "\n" + 對應宮位 + "的六：" + 對應宮的六  + "\n" + 對應宮位 + "的十：" + 對應宮的十);
    //console.log(化出宮 + "化祿地支數：" + 化出宮化祿地支數 + "， + "化忌地支數：" + 化出宮化忌地支數);
    化入祿權忌.成立條件結論 = 化入祿權忌.化出宮 + "重疊" + 化入祿權忌.化出宮重疊 + 化入祿權忌.成立條件;
    if(化入祿權忌.成立條件附加 !="") 化入祿權忌.成立條件結論 += 化入祿權忌.成立條件附加;
    
    return 化入祿權忌;
    
}  // end function 化入祿權忌一六十




function 尋一六方(化入宮地支數1, 化入宮地支數2){
    // not used  ??
	var 一六共宗地支數 = -1;

	switch(true){
		case ((化入宮地支數1 == 0 && 化入宮地支數2 == 7) || (化入宮地支數1 == 7 && 化入宮地支數2 == 0)): 一六共宗地支數 = 0; break;
		case ((化入宮地支數1 == 1 && 化入宮地支數2 == 8) || (化入宮地支數1 == 8 && 化入宮地支數2 == 1)): 一六共宗地支數 = 1; break;
		case ((化入宮地支數1 == 2 && 化入宮地支數2 == 9) || (化入宮地支數1 == 9 && 化入宮地支數2 == 2)): 一六共宗地支數 = 2; break;
		case ((化入宮地支數1 == 3 && 化入宮地支數2 == 10) || (化入宮地支數1 == 10 && 化入宮地支數2 == 3)): 一六共宗地支數 = 3; break;
		case ((化入宮地支數1 == 4 && 化入宮地支數2 == 11) || (化入宮地支數1 == 11 && 化入宮地支數2 == 4)): 一六共宗地支數 = 4; break;
		case ((化入宮地支數1 == 5 && 化入宮地支數2 == 0) || (化入宮地支數1 == 0 && 化入宮地支數2 == 5)): 一六共宗地支數 = 5; break;
		case ((化入宮地支數1 == 6 && 化入宮地支數2 == 1) || (化入宮地支數1 == 1 && 化入宮地支數2 == 6)): 一六共宗地支數 = 6; break;
		case ((化入宮地支數1 == 7 && 化入宮地支數2 == 2) || (化入宮地支數1 == 2 && 化入宮地支數2 == 7)): 一六共宗地支數 = 7; break;
		case ((化入宮地支數1 == 8 && 化入宮地支數2 == 3) || (化入宮地支數1 == 3 && 化入宮地支數2 == 8)): 一六共宗地支數 = 8; break;
		case ((化入宮地支數1 == 9 && 化入宮地支數2 == 4) || (化入宮地支數1 == 4 && 化入宮地支數2 == 9)): 一六共宗地支數 = 9; break;
		case ((化入宮地支數1 == 10 && 化入宮地支數2 == 5) || (化入宮地支數1 == 5 && 化入宮地支數2 == 10)): 一六共宗地支數 = 10; break;
		case ((化入宮地支數1 == 11 && 化入宮地支數2 == 6) || (化入宮地支數1 == 6 && 化入宮地支數2 == 11)): 一六共宗地支數 = 11; break;
	}  //end switch

	return 一六共宗地支數;
} // end function 尋一六方

// **********************************



// -----------------------------------------------------

function 宮位四化落宮(命盤, 宮位, 大限數){
    var 宮位四化 = {
        "大限數": 大限數,
        "化出宮": "",
        "化出宮干": "",
        "化出重疊宮": "",
        "化出宮地支數": -1,
        "運限": "",
        "化祿": new 飛出四化元件(),
        "化權": new 飛出四化元件(),
        "化科": new 飛出四化元件(),
        "化忌": new 飛出四化元件(),
        "忌沖": new 飛出四化元件(),
        "備註": ""
    };
    
    var 化出宮位 = 宮位分解(宮位, 大限數).宮名;  //不帶大限

    if(大限數<2) 宮位四化.化出宮地支數 = 命盤.人事宮[化出宮位].地支數; //本命宮
    
    if(大限數>1) {
        宮位四化.化出宮地支數 = 命盤.大限[大限數].宮位[化出宮位].地支數;  //大限宮
        宮位四化.運限 = "大限";
        宮位四化.化出重疊宮 = 命盤.地支宮位[宮位四化.化出宮地支數].宮位;
    } // end if if(大限數>1)
    
    宮位四化.化出宮 = 化出宮位;
    宮位四化.化出宮干 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干;
    
    //化祿
    宮位四化.化祿.地支數 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.祿出.地支數1;
    宮位四化.化祿.地支 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.祿出.地支[0];
    宮位四化.化祿.星曜 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.化祿星;
    宮位四化.化祿.宮位 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.祿出.人事宮[0];
    宮位四化.化祿.宮位線 = 宮位轉六線(宮位四化.化祿.宮位);
    宮位四化.化祿.宮位三方 = 尋三合方(宮位四化.化祿.宮位).三合簡短;
    宮位四化.化祿.自化 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.自化祿;
    宮位四化.化祿.流出 =命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.流出祿;
    
    //化權
    宮位四化.化權.地支數 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.權出.地支數1;
    宮位四化.化權.地支 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.權出.地支[0];
    宮位四化.化權.星曜 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.化權星;
    宮位四化.化權.宮位 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.權出.人事宮[0];
    宮位四化.化權.宮位線 = 宮位轉六線(宮位四化.化權.宮位);
    宮位四化.化權.宮位三方 = 尋三合方(宮位四化.化權.宮位).三合簡短;
    宮位四化.化權.自化 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.自化權;
    宮位四化.化權.流出 =命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.流出權;
    
    //化科
    宮位四化.化科.地支數 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.科出.地支數1;
    宮位四化.化科.地支 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.科出.地支[0];
    宮位四化.化科.星曜 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.化科星;
    宮位四化.化科.宮位 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.科出.人事宮[0];
    宮位四化.化科.宮位線 = 宮位轉六線(宮位四化.化科.宮位);
    宮位四化.化科.宮位三方 = 尋三合方(宮位四化.化科.宮位).三合簡短;
    宮位四化.化科.自化 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.自化科;
    宮位四化.化科.流出 =命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.流出科;
    
    //化忌
    宮位四化.化忌.地支數 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.忌出.地支數1;
    宮位四化.化忌.地支 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.忌出.地支[0];
    宮位四化.化忌.星曜 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.化忌星;
    宮位四化.化忌.宮位 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.忌出.人事宮[0];
    宮位四化.化忌.宮位線 = 宮位轉六線(宮位四化.化忌.宮位);
    宮位四化.化忌.宮位三方 = 尋三合方(宮位四化.化忌.宮位).三合簡短;
    宮位四化.化忌.自化 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.自化忌;
    宮位四化.化忌.流出 =命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.流出忌;
    
    //忌沖
    宮位四化.忌沖.地支數 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.忌出沖.地支數1;
    宮位四化.忌沖.地支 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.忌出沖.地支[0];
    宮位四化.忌沖.星曜 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.化忌星;
    宮位四化.忌沖.宮位 = 命盤.地支宮位[宮位四化.化出宮地支數].宮干四化.忌出沖.人事宮[0];
    宮位四化.忌沖.宮位線 = 宮位轉六線(宮位四化.忌沖.宮位);
    
    if(宮位四化.運限 == "大限"){
        宮位四化.化祿.大限宮位 = 命盤.大限[大限數].地支[宮位四化.化祿.地支數].人事宮;
        宮位四化.化祿.大限宮位線 = 宮位轉六線(宮位四化.化祿.大限宮位);
        宮位四化.化祿.大限宮位三方 = 尋三合方(宮位四化.化祿.大限宮位).三合簡短;
        
        宮位四化.化權.大限宮位 = 命盤.大限[大限數].地支[宮位四化.化權.地支數].人事宮;
        宮位四化.化權.大限宮位線 = 宮位轉六線(宮位四化.化權.大限宮位);
        宮位四化.化權.大限宮位三方 = 尋三合方(宮位四化.化權.大限宮位).三合簡短;
        
        宮位四化.化科.大限宮位 = 命盤.大限[大限數].地支[宮位四化.化科.地支數].人事宮;
        宮位四化.化科.大限宮位線 = 宮位轉六線(宮位四化.化科.大限宮位);
        宮位四化.化科.大限宮位三方 = 尋三合方(宮位四化.化科.大限宮位).三合簡短;
        
        宮位四化.化忌.大限宮位 = 命盤.大限[大限數].地支[宮位四化.化忌.地支數].人事宮;
        宮位四化.化忌.大限宮位線 = 宮位轉六線(宮位四化.化忌.大限宮位);
        宮位四化.化忌.大限宮位三方 = 尋三合方(宮位四化.化忌.大限宮位).三合簡短;
        
        宮位四化.忌沖.大限宮位 = 命盤.大限[大限數].地支[宮位四化.忌沖.地支數].人事宮;
        宮位四化.忌沖.大限宮位線 = 宮位轉六線(宮位四化.忌沖.大限宮位);
    } // end if(宮位四化.運限 == "大限")
    
    //console.log(宮位四化);
    return 宮位四化;
} //end function 宮位四化落宮


function 飛出四化元件(){
    this.地支 = "";
    this.地支數 = "";
    this.宮位 = "";
    this.星曜 = "";
    //this.宮位數 = -1;  //命宮=1， 兄弟宮=2 .。。。。。
    this.宮位線 = "";  //化入那個六線
    this.宮位三方 = "";
    this.大限宮位 = "";
    this.大限宮位線 = "";
    this.大限宮位三方 = "";  //化入宮的三方，比方祿入的宮位重疊大限的命宮，為"命財官"
    this.自化 = false;
    this.流出 = false;
} // end function 飛出四化元件





// ---------------------------------------------------------------------
// ****************************************************
function 星曜架構飛四化(命盤, 地支數){
	// ** 固定式 ** predefine, to be deleted !!
	var 飛宮干 = 命盤.地支宮位[地支數].宮干;
	var 紫微地支 = 命盤.紫微位置.地支;
	//var 地支數 = Number(地支輸入);
	var 歸位地支 = -1, 歸位宮位="", 歸位三合="", 破位地支 = -1, 破位宮位="", 四化="", 四化關係="";

	var 化出干支= 地支字數轉換(Number(地支數)) + "位飛" + 飛宮干 + "干";
	var 化出宮="", 飛四化句="", 祿入線="";
	var 架構四化註解 = [];

	架構四化註解.push(化出干支);
	if(命盤.運行.大限) 化出宮 = "大限" + 命盤.大限[命盤.運行.大限數].地支[地支數].人事宮; else 化出宮 = 命盤.地支宮位[地支數].宮位;

	switch(紫微地支) {
		case "子": case "午":
			switch(飛宮干){
				case "甲":
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["廉貞"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "乙":
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["天機"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					四化 = "祿忌"; 
					祿入線 = 宮位轉六線(破位宮位);
					飛四化句 = 化出宮+ "化" + 四化 + "入" + 祿入線 + "，祿逢沖破" + 破位宮位;
					架構四化註解.push(飛四化句);
					break;
				case "丙":
					歸位地支 = 命盤.星曜["天同"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["天同"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "丁":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					break;
				case "戊":
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["貪狼"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "己":
					var 文曲沖祿 = 忌沖祿的六線(命盤, 化出宮, "武曲", "文曲");
					if(文曲沖祿.成立) {
						破位地支 = 命盤.星曜["武曲"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文曲沖祿.沖線;
						架構四化註解.push(文曲沖祿.判斷句);
					}
					
					var 文曲沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文曲"].地支數, "文曲");
					if(文曲沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文曲沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "庚":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係 + "但沖破" + 歸位宮位 + "的「官禄宮」"; 
					架構四化註解.push(飛四化句);
					break;
				case "辛":
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					var 文昌沖祿 = 忌沖祿的六線(命盤, 化出宮, "巨門", "文昌");
					if(文昌沖祿.成立) {
						破位地支 = 命盤.星曜["巨門"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文昌沖祿.沖線;
						架構四化註解.push(文昌沖祿.判斷句);
					}

					var 文昌沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文昌"].地支數, "文昌");
					if(文昌沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文昌沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "壬":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["天梁"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "癸":
					歸位地支 = 命盤.星曜["破軍"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					break;
			} // end switch 飛宮干
			break;
		case "丑": case "未":
			switch(飛宮干){
				case "甲":
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["廉貞"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "乙":
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					break;
				case "丙":
					歸位地支 = 命盤.星曜["天同"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["天同"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "丁":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係 + "但沖破" + 歸位宮位 + "的「財帛宮」"; 
					架構四化註解.push(飛四化句);
					break;
				case "戊":
					歸位地支 = 命盤.星曜["貪狼"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["貪狼"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的光明線";
					架構四化註解.push(飛四化句);
					break;
				case "己":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					var 文曲沖祿 = 忌沖祿的六線(命盤, 化出宮, "武曲", "文曲");
					if(文曲沖祿.成立) {
						破位地支 = 命盤.星曜["武曲"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文曲沖祿.沖線;
						架構四化註解.push(文曲沖祿.判斷句);
					}
					
					var 文曲沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文曲"].地支數, "文曲");
					if(文曲沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文曲沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "庚":				
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係 + "但沖破" + 歸位宮位 + "的「官禄宮」"; 
					架構四化註解.push(飛四化句);
					break;
				case "辛":
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					var 文昌沖祿 = 忌沖祿的六線(命盤, 化出宮, "巨門", "文昌");
					if(文昌沖祿.成立) {
						破位地支 = 命盤.星曜["巨門"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文昌沖祿.沖線;
						架構四化註解.push(文昌沖祿.判斷句);
					}

					var 文昌沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文昌"].地支數, "文昌");
					if(文昌沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文昌沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "壬":
					歸位地支 = 命盤.星曜["紫微"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["天梁"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的光明線";
					架構四化註解.push(飛四化句);
					break;
				case "癸":
					歸位地支 = 命盤.星曜["破軍"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					break;
			} // end switch 飛宮干
			break;
		case "寅": case "申":
			switch(飛宮干){
				case "甲":
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["廉貞"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "乙":
					破位地支 = 命盤.星曜["天機"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的「財帛宮」";
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					祿入線 = 宮位轉六線(歸位宮位);
					四化 = "祿權";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 祿入線;
					架構四化註解.push(飛四化句);
					break;
				case "丙":
					歸位地支 = 命盤.星曜["天同"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["天同"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "丁":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					祿入線 = 宮位轉六線(歸位宮位);
					四化 = "祿權";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 祿入線 + "但沖破" + 歸位宮位 + "的「財帛宮」";
					架構四化註解.push(飛四化句);
					break;
				case "戊":
					破位地支 = 命盤.星曜["貪狼"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "己":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					祿入線 = 宮位轉六線(歸位宮位);
					四化 = "祿權";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 祿入線;
					架構四化註解.push(飛四化句);
					
					var 文曲沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文曲"].地支數, "文曲");
					if(文曲沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文曲沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "庚":				
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化禄入" + 歸位宮位 + "，但沖破它的「官禄宮」"; 
					架構四化註解.push(飛四化句);
					break;
				case "辛":
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					祿入線 = 宮位轉六線(歸位宮位);
					四化 = "祿權";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 祿入線;
					架構四化註解.push(飛四化句);

					var 文昌沖祿 = 忌沖祿的六線(命盤, 化出宮, "巨門", "文昌");
					if(文昌沖祿.成立) {
						破位地支 = 命盤.星曜["巨門"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文昌沖祿.沖線;
						架構四化註解.push(文昌沖祿.判斷句);
					}

					var 文昌沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文昌"].地支數, "文昌");
					if(文昌沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文昌沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "壬":
					歸位地支 = 命盤.星曜["天梁"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["天梁"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "癸":
					歸位地支 = 命盤.星曜["破軍"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					break;
			} // end switch 飛宮干
			break;
		case "卯": case "酉":
			switch(飛宮干){
				case "甲":
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["廉貞"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "乙":
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					四化 = "祿忌"; 四化關係 = "同宮";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					break;
				case "丙":
					歸位地支 = 命盤.星曜["天同"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["天同"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "丁":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係 + "但沖破它的「財帛宮」";
					架構四化註解.push(飛四化句);
					break;
				case "戊":
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["貪狼"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "己":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					var 文曲沖祿 = 忌沖祿的六線(命盤, 化出宮, "武曲", "文曲");
					if(文曲沖祿.成立) {
						破位地支 = 命盤.星曜["武曲"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文曲沖祿.沖線;
						架構四化註解.push(文曲沖祿.判斷句);
					}
					
					var 文曲沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文曲"].地支數, "文曲");
					if(文曲沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文曲沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "庚":
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化禄入" + 歸位宮位 + "，但沖破它的「官禄宮」"; 
					架構四化註解.push(飛四化句);
					break;
				case "辛":
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					var 文昌沖祿 = 忌沖祿的六線(命盤, 化出宮, "巨門", "文昌");
					if(文昌沖祿.成立) {
						破位地支 = 命盤.星曜["巨門"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文昌沖祿.沖線;
						架構四化註解.push(文昌沖祿.判斷句);
					}

					var 文昌沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文昌"].地支數, "文昌");
					if(文昌沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文昌沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "壬":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["天梁"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "癸":
					歸位地支 = 命盤.星曜["破軍"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					break;
			} // end switch 飛宮干
			break;
		case "辰": case "戌":
			switch(飛宮干){
				case "甲":
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					//console.log(飛四化句);

					破位地支 = 命盤.星曜["廉貞"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					//console.log(飛四化句);
					break;
				case "乙":
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					break;
				case "丙":
					歸位地支 = 命盤.星曜["天同"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["天同"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "丁":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";

					var 歸位地支2 = 命盤.星曜["巨門"].地支數;
					var 歸位宮位2 = 命盤.地支宮位[歸位地支2].宮位;
					var 歸位三合2 = 尋三合方(歸位宮位2);
					var 四化2 = "祿忌"; 
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + "，同時也化" + 四化2 + "入" + 歸位三合2.三合簡短+ 四化關係;
					架構四化註解.push(飛四化句);
					break;
				case "戊":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["貪狼"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的光明線";
					架構四化註解.push(飛四化句);
					break;
				case "己":
					var 文曲沖祿 = 忌沖祿的六線(命盤, 化出宮, "武曲", "文曲");
					if(文曲沖祿.成立) {
						破位地支 = 命盤.星曜["武曲"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文曲沖祿.沖線;
						架構四化註解.push(文曲沖祿.判斷句);
					}
					
					var 文曲沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文曲"].地支數, "文曲");
					if(文曲沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文曲沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "庚":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係 + "但沖破" + 歸位宮位 + "的「官禄宮」"; 
					架構四化註解.push(飛四化句);
					break;
				case "辛":
					var 文昌沖祿 = 忌沖祿的六線(命盤, 化出宮, "巨門", "文昌");
					if(文昌沖祿.成立) {
						破位地支 = 命盤.星曜["巨門"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文昌沖祿.沖線;
						架構四化註解.push(文昌沖祿.判斷句);
					}

					var 文昌沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文昌"].地支數, "文昌");
					if(文昌沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文昌沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "壬":
					歸位地支 = 命盤.星曜["天梁"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["天梁"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的光明線";
					架構四化註解.push(飛四化句);
					break;
				case "癸":
					歸位地支 = 命盤.星曜["破軍"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					break;
			} // end switch 飛宮干
			break;
		case "巳": case "亥":
			switch(飛宮干){
				case "甲":
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿忌"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["廉貞"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的成就線";
					架構四化註解.push(飛四化句);
					break;
				case "乙":
					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					四化 = "祿權"; 四化關係 = "同宮";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位;
					架構四化註解.push(飛四化句);

					歸位地支 = 命盤.星曜["天機"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					break;
				case "丙":
					歸位地支 = 命盤.星曜["天同"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿權"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);

					破位地支 = 命盤.星曜["天同"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "丁":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					四化 = "祿權"; 四化關係 = "同宮";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位;
					架構四化註解.push(飛四化句);

					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";

					var 歸位地支2 = 命盤.星曜["巨門"].地支數;
					var 歸位宮位2 = 命盤.地支宮位[歸位地支2].宮位;
					var 歸位三合2 = 尋三合方(歸位宮位2);
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + "與" + 歸位三合2.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);					
					break;
				case "戊":
					歸位地支 = 命盤.星曜["太陰"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["貪狼"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "己":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					四化 = "祿權"; 四化關係 = "同宮";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位;
					架構四化註解.push(飛四化句);

					var 文曲沖祿 = 忌沖祿的六線(命盤, 化出宮, "武曲", "文曲");
					if(文曲沖祿.成立) {
						破位地支 = 命盤.星曜["武曲"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文曲沖祿.沖線;
						架構四化註解.push(文曲沖祿.判斷句);
					}
					
					var 文曲沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文曲"].地支數, "文曲");
					if(文曲沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文曲沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "庚":
					歸位地支 = 命盤.星曜["武曲"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["太陽"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係 + "但沖破" + 歸位宮位 + "的「官禄宮」"; 
					架構四化註解.push(飛四化句);
					break;
				case "辛":
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					四化 = "祿權"; 四化關係 = "同宮";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位;
					架構四化註解.push(飛四化句);

					var 文昌沖祿 = 忌沖祿的六線(命盤, 化出宮, "巨門", "文昌");
					if(文昌沖祿.成立) {
						破位地支 = 命盤.星曜["巨門"].地支數;
						破位宮位=命盤.地支宮位[破位地支].宮位;
						//飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的" + 文昌沖祿.沖線;
						架構四化註解.push(文昌沖祿.判斷句);
					}

					var 文昌沖疾田 = 忌沖疾厄田宅(命盤, 地支數, 命盤.星曜["文昌"].地支數, "文昌");
					if(文昌沖疾田.成立){
						飛四化句 = 化出宮 + "化忌沖自身的" + 文昌沖疾田.沖宮;
						架構四化註解.push(飛四化句);
					}
					break;
				case "壬":
					歸位地支 = 命盤.星曜["天梁"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					
					破位地支 = 命盤.星曜["天梁"].地支數;
					破位宮位=命盤.地支宮位[破位地支].宮位;
					飛四化句 = 化出宮 + "祿入" + 破位宮位 + "但沖破它的子田線";
					架構四化註解.push(飛四化句);
					break;
				case "癸":
					歸位地支 = 命盤.星曜["破軍"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位;
					歸位三合 = 尋三合方(歸位宮位);
					四化 = "祿忌"; 四化關係 = "三合";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位三合.三合簡短 + 四化關係;
					架構四化註解.push(飛四化句);
					
					歸位地支 = 命盤.星曜["巨門"].地支數;
					歸位宮位 = 命盤.地支宮位[歸位地支].宮位
					四化 = "祿權"; 四化關係 = "1、6";
					飛四化句 = 化出宮 + "化" + 四化 + "入" + 歸位宮位 + "的" + 四化關係;
					架構四化註解.push(飛四化句);
					break;
			} // end switch 飛宮干
			break;
		
	} //switch 紫微地支

	命盤.運行.架構飛四化分析 = 架構四化註解.join("<br><br>");
	//return 架構四化註解.join("<br><br>");
} //end function 星曜架構飛四化