// ****


function 宮位轉換含義(宮位, 行運順逆, 流運宮位){
	// 流運宮位 是重疊的宮位，比方大運重疊的宮位

	//if(流運宮位===undefined) 流運宮位="";
	var 轉換含義=[], 轉換含義字串;
    //console.log(宮位 + "/" + 流運宮位 + "/"  + 行運順逆);
    
	switch(宮位){
		case "命宮": 
			轉換含義.push("運作資金（官之財）");
            轉換含義.push("海外地產（子[遷之田]之田）");
			轉換含義.push("友之疾");
			轉換含義.push("子之田");
			轉換含義.push("夫之福");
			break;
		case "兄弟宮":
            轉換含義.push("事業狀況（官之疾）");
			轉換含義.push("兄弟、母親");
			轉換含義.push("家庭開銷、房地產錢財（田之財）");
			轉換含義.push("財庫（財之田）");
            轉換含義.push("嗜好、精神桃花（福之夫）");
			轉換含義.push("被撞（友之遷）");
			break;
		case "夫妻宮":
            轉換含義.push("外在、驛馬事業（遷之官）");
            轉換含義.push("偏財（福之財）");
			轉換含義.push("血光（疾之田）");
			轉換含義.push("田之疾");
			break;
		case "子女宮":
            轉換含義.push("合夥、同事（官之友）");
			轉換含義.push("父母錢財、遺產（父之財）");
            轉換含義.push("身體享受、性愛（疾之疾）");
            轉換含義.push("福之疾");
			轉換含義.push("遷之田");
			break;
		case "財帛宮": 
			轉換含義.push("父之疾");
			轉換含義.push("婚後感情（夫之疾之田）");
			轉換含義.push("房地產買賣（友之田）");
			break;
		case "疾厄宮": 
			轉換含義.push("辦公室、公司擴充（官之田）");
            轉換含義.push("房地產事業（田之官）");
			轉換含義.push("兄弟的錢財（兄之財）");
            轉換含義.push("交通官非（父之遷）");
			break;
		case "遷移宮": 
			轉換含義.push("母親健康（兄之疾）");
			轉換含義.push("配偶的財（夫之財）");
			轉換含義.push("慈善、五術事業（福之官）");
			轉換含義.push("長輩（父之友）");
			轉換含義.push("田之田");
			break;
		case "交友宮": 
			轉換含義.push("上司（官之父）");
            轉換含義.push("父親事業（父之官）");
			轉換含義.push("母親健康（夫之疾）");
			轉換含義.push("子女開銷（子之財）");
			轉換含義.push("潛意識（福之田）");
            轉換含義.push("穿著打扮（疾之夫）");
			break;
		case "官祿宮": 
			轉換含義.push("祖業（父之田）");
			轉換含義.push("孩子健康（子之疾）");
			break;
		case "田宅宮": 
			//轉換含義.push("命之田");
            轉換含義.push("公司錢財（疾[官之田]之財）");
			轉換含義.push("儲蓄（財之疾）");
			轉換含義.push("他人之子（父之友之子）");
			轉換含義.push("三角關係（友之夫妻）");
			break;
		case "福德宮": 
            轉換含義.push("夫妻事業（夫之官）");
			轉換含義.push("健康生死（疾之疾）");
			轉換含義.push("旅行花費（遷之財）");
			轉換含義.push("義子（友之子）");
            轉換含義.push("憲法（父之父）");
            轉換含義.push("他鄉工作地點（夫[官之遷]之官）");
			//轉換含義.push("異性同事（友之子女，官之夫妻）");
			break;
		case "父母宮": 
			轉換含義.push("夫之田");
			轉換含義.push("手下（官之子）");
            轉換含義.push("孩子事業（子之官）");
			轉換含義.push("朋友的錢財（友之財）");
            轉換含義.push("傳染病（遷之疾）");
			break;
	} //end switch

	轉換含義字串=轉換含義.join("；");
	return 轉換含義字串;
} //end function 宮位轉換含義


// -----------------------------------

function 地支含義提示(地支){
	var 地支含義=[];
	switch(地支){
		case "子": 
			地支含義.push("卦位：坎");
			地支含義.push("方位：北，345 - 15");
			地支含義.push("五行：陽水");
			地支含義.push("卦位生肖：豬");
			地支含義.push("先天卦數：6，後天卦數：1");
			地支含義.push("身體：心、大腦、耳、腎、血、尿、乳、膀胱、陰部");
			地支含義.push("疾病：貧血、畏寒、耳疾、梅毒、直腸癌、痔漏、不孕、腎結石、泌尿");
			地支含義.push("人物：中男、小人、盜賊、業務員、五術中人");
			地支含義.push("處所：附近有酒店、港口、泳池、餐飲店、澡堂");
			地支含義.push("月份：十一月");
			break;
		case "丑": 
			地支含義.push("卦位：-");
			地支含義.push("方位：東北北，15 - 45");
			地支含義.push("五行：陰土");
			地支含義.push("卦位生肖：-");
			地支含義.push("卦數：-");
			地支含義.push("身體：-");
			地支含義.push("疾病：-");
			地支含義.push("人物：-");
			地支含義.push("處所：-");
			地支含義.push("月份：十二月");
			break;
		case "寅": 
			地支含義.push("卦位：艮");
			地支含義.push("方位：東東北，45 - 75");
			地支含義.push("五行：陽木");
			地支含義.push("卦位生肖：鼠");
			地支含義.push("先天卦數：7，後天卦數：8");
			地支含義.push("身體：手指、鼻、肋骨、背腰、脾胃、消化系統");
			地支含義.push("疾病：結石、腫瘤、瘡毒、癡呆症、坐骨神經痛");
			地支含義.push("人物：少男、閒人、囚犯、擔保人");
			地支含義.push("處所：附近有山門、旅館、寺廟");
			地支含義.push("月份：正月");
			break;
		case "卯": 
			地支含義.push("卦位：震");
			地支含義.push("方位：東，75 - 105");
			地支含義.push("五行：陰木");
			地支含義.push("卦位生肖：龍");
			地支含義.push("先天卦數：4，後天卦數：3");
			地支含義.push("身體：足、筋骨、肝膽、頭髮、咽喉、聲帶、神經系統");
			地支含義.push("疾病：口吃、骨折、肝膽病、胃痙攣、腳氣病、五十肩");
			地支含義.push("人物：長男、工匠、繼承人、運動員、大元帥");
			地支含義.push("處所：附近有高樓、山林、木屋、修行或運動場地");
			地支含義.push("月份：二月");
			break;
		case "辰": 
			地支含義.push("卦位：-");
			地支含義.push("方位：東東南，105 - 135");
			地支含義.push("五行：陽土");
			地支含義.push("卦位生肖：-");
			地支含義.push("卦數：-");
			地支含義.push("身體：-");
			地支含義.push("疾病：-");
			地支含義.push("人物：-");
			地支含義.push("處所：-");
			地支含義.push("月份：三月");
			break;
		case "巳": 
			地支含義.push("卦位：巽");
			地支含義.push("方位：東南南，135 - 165");
			地支含義.push("五行：陰火");
			地支含義.push("卦位生肖：雞");
			地支含義.push("先天卦數：5，後天卦數：4");
			地支含義.push("身體：肱股、大腿、鬢髮、腋部、肝膽、左手");
			地支含義.push("疾病：風邪、禿頭、中風、肱股之疾、風濕、腸胃脹風");
			地支含義.push("人物：長女、寡婦、文人、醫生、仙道、僧尼");
			地支含義.push("處所：附近有寺廟、道場、公園、木屋、菜園");
			地支含義.push("月份：四月");
			break;
		case "午": 
			地支含義.push("卦位：離");
			地支含義.push("方位：南，165 - 195");
			地支含義.push("五行：陽火");
			地支含義.push("卦位生肖：雞");
			地支含義.push("先天卦數：3，後天卦數：9");
			地支含義.push("身體：眼睛、腹部、心臟、小腸、舌、肩、指甲");
			地支含義.push("疾病：灼傷、眼疾、下痢、血崩、高血壓、赤白帶、心臟病");
			地支含義.push("人物：中女、文人、軍人、法官、狀元、仙佛");
			地支含義.push("處所：附近有寺廟、法院、百貨商店、燈塔");
			地支含義.push("月份：五月");
			break;
		case "未": 
			地支含義.push("卦位：-");
			地支含義.push("方位：西南南，195 - 225");
			地支含義.push("五行：陰土");
			地支含義.push("卦位生肖：-");
			地支含義.push("卦數：-");
			地支含義.push("身體：-");
			地支含義.push("疾病：-");
			地支含義.push("人物：-");
			地支含義.push("處所：-");
			地支含義.push("月份：六月");
			break;
		case "申": 
			地支含義.push("卦位：坤");
			地支含義.push("方位：西西南，225 - 255");
			地支含義.push("五行：陽金");
			地支含義.push("卦位生肖：牛、猴");
			地支含義.push("先天卦數：8，後天卦數：2");
			地支含義.push("身體：腹部、胸肋、任脈、脾胃、子宮、生殖器官");
			地支含義.push("疾病：腸胃病、婦女病、不孕、子宮癌、消化不良");
			地支含義.push("人物：妻母、秘書、農夫、孕婦、吝嗇人、皇后、僧儒、刑犯");
			地支含義.push("處所：附近有農村、田野、禮堂、廣場、車站、倉庫");
			地支含義.push("月份：七月");
			break;
		case "酉": 
			地支含義.push("卦位：兌");
			地支含義.push("方位：西，255 - 285");
			地支含義.push("五行：陰金");
			地支含義.push("卦位生肖：羊");
			地支含義.push("先天卦數：2，後天卦數：7");
			地支含義.push("身體：口舌、唇、痰、涎、肺、大腸、女性生殖器官");
			地支含義.push("疾病：口吃、啞、牙痛、口臭、性病、結核病、支氣管炎、咽喉發炎、酒精中毒");
			地支含義.push("人物：少女、律師、婢女、藝人、小妾、媒婆、巫師");
			地支含義.push("處所：附近有沼澤、律師樓、娛樂場所、祈禱堂、會議廳、戲院");
			地支含義.push("月份：八月");
			break;
		case "戌": 
			地支含義.push("卦位：-");
			地支含義.push("方位：西西北，285 - 315");
			地支含義.push("五行：陽土");
			地支含義.push("卦位生肖：-");
			地支含義.push("卦數：-");
			地支含義.push("身體：-");
			地支含義.push("疾病：-");
			地支含義.push("人物：-");
			地支含義.push("處所：-");
			地支含義.push("月份：九月");
			break;
		case "亥": 
			地支含義.push("卦位：乾");
			地支含義.push("方位：西北北，315 - 345");
			地支含義.push("五行：陰水");
			地支含義.push("卦位生肖：狗、馬");
			地支含義.push("先天卦數：1，後天卦數：6");
			地支含義.push("身體：頭面、督脈、頸部、胸肺、骨骼");
			地支含義.push("疾病：頭疾、肺病、高血壓、腦溢血、骨質疏鬆、坐骨神經、三叉神經、中風");
			地支含義.push("人物：君父、長輩、名人、主席、公門中人");
			地支含義.push("處所：附近有法院、寺廟、車站、大廈、皇府、軍校");
			地支含義.push("月份：十月");
			break;
	} //end switch

	return 地支含義.join("<br>");
} //end function 地支含義提示

// -----------------------------------

function 星曜含義提示(星曜矩陣, 星曜, 地支, 版本){
	if(地支===undefined) 地支=-1;
    if(版本===undefined) 版本= "江氏";
    //console.log(星曜矩陣);
	var 星曜含義=[];
	switch(星曜){
		case "紫微": 
			星曜含義.push("北斗，己土，坤卦");
			星曜含義.push("主司：官祿主，主權力");
            星曜含義.push("廟陷：" + 星曜矩陣["紫微"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化權（壬：火生土），利於權利行使發揮）<br>化科（乙：木剋土），變成有風度，不利權利行使");
			break;
		case "天機": 
			星曜含義.push("南斗，乙木，巽卦");
			星曜含義.push("主司：兄弟主，化氣曰善，益壽之星");
            星曜含義.push("廟陷：" + 星曜矩陣["天機"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化祿（乙：金剋木），失去仁性<br>化權（丙：火洩木），付出仁性<br>化科（丁：增強木）增強仁性<br>化忌（戊：水生木）仁性得以發揮");
			break;
		case "太陽": 
			星曜含義.push("中天，丙火，離卦");
			星曜含義.push("主司：官祿主，創業、競爭、貴氣、名譽");
            星曜含義.push("廟陷：" + 星曜矩陣["太陽"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化祿（庚：火剋金）火的貴氣被洩<br>化權（辛：增強火）增強貴氣<br>化忌（甲：水剋火）貴氣、名譽受損");	
			break;
		case "武曲": 
			星曜含義.push("北斗，辛金，乾卦");
			星曜含義.push("主司：財帛主，化氣為財，孤剋");
            星曜含義.push("廟陷：" + 星曜矩陣["天機"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化祿（己：增強金）財氣旺<br>化權（庚：火剋金）受火煉，財氣得以發揮<br>化科（甲：金剋木）財氣變弱<br>化忌（壬：水洩金）財氣受損");	
			break;
		case "天同": 
			星曜含義.push("南斗，壬水，坎卦");
			星曜含義.push("主司：福德主，孩子氣、享樂、不積極");
            星曜含義.push("廟陷：" + 星曜矩陣["天機"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化祿（丙：金生水），快樂不積極<br>化權（丁：水剋火）打拼，辛苦<br>化忌（庚：增強水）五音不全");	
			break;
		case "廉貞": 
			星曜含義.push("北斗，丁火，離卦");
			星曜含義.push("主司：官祿主，化氣為囚，司權令，靜態");
            星曜含義.push("廟陷：" + 星曜矩陣["廉貞"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化祿（甲：火剋金），受火煉，權令得以發揮<br>化忌（丙：水剋火）權令受困，易犯官司");	
			break;
		case "天府": 
			星曜含義.push("南斗，戊土，坤卦");
			星曜含義.push("主司：田宅、財帛主，為祿庫之星");
            星曜含義.push("廟陷：" + 星曜矩陣["天府"].廟陷.度);
			星曜含義.push("-");	
			break;
		case "太陰": 
			星曜含義.push("中天，癸水，坎卦");
			星曜含義.push("主司：田宅主、女、母性、保護、靜態");
            星曜含義.push("廟陷：" + 星曜矩陣["太陰"].廟陷.度);
			星曜含義.push("化祿（丁：金生水）田宅、母性之氣增加<br>化權（戊：火剋水）變成動態、煩惱<br>化科（庚、癸：木洩水）智力、母性得以發揮<br>化忌（乙：增強水）");	
			break;
		case "貪狼": 
			星曜含義.push("北斗，甲木，震卦");
			星曜含義.push("主司：禍福主，財星、壽星");
            星曜含義.push("廟陷：" + 星曜矩陣["貪狼"].廟陷.度);
			星曜含義.push("化祿（戊：金剋木）木的仁性被剋，變成喜歡吃喝玩樂<br>化權（己：木生火）仁性得以發揮<br>化忌（癸：水生木）仁性得以增長，財官問題不大，但健康不佳");	
			break;
		case "巨門": 
			星曜含義.push("北斗，癸水，坎卦");
			星曜含義.push("主司：主是非，化氣為暗、喜找捷徑");
            星曜含義.push("廟陷：" + 星曜矩陣["巨門"].廟陷.度);
			星曜含義.push("化祿（辛：金生水）增強暗的特性<br>化權（癸：火剋水）削弱暗的特性，屬吉<br>化忌（丁：增強水）增強暗的特性，多口舌是非");	
			break;
		case "天相": 
			星曜含義.push("南斗，壬水，坎卦");
			星曜含義.push("主司：衣食，化氣為印");
            星曜含義.push("廟陷：" + 星曜矩陣["天相"].廟陷.度);
			星曜含義.push("-");	
			break;
		case "天梁": 
			星曜含義.push("南斗，戊土，艮卦");
			星曜含義.push("主司：化氣為蔭，名為延壽");
            星曜含義.push("廟陷：" + 星曜矩陣["天梁"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化祿（壬：土生金）蔭性得以發揮，延壽<br>化權（乙：火生土）蔭氣增強<br>化科（己：木剋土）蔭性被剋，要人照顧");	
			break;
		case "七殺": 
			星曜含義.push("南斗，庚金，兌卦");
			星曜含義.push("主司：主孤剋，化氣為殺");
            星曜含義.push("廟陷：" + 星曜矩陣["七殺"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("-");	
			break;
		case "破軍": 
			星曜含義.push("北斗，癸水，坎卦");
			星曜含義.push("主司：主耗、孤剋，先破後成");
            星曜含義.push("廟陷：" + 星曜矩陣["破軍"].廟陷.度);
			if(版本 == "江氏") 星曜含義.push("化祿（癸：金生水）有建設性的破壞，減輕耗散<br>化權（甲：水剋火）形成耗散");
			break;
		default:
			星曜含義.push("-");
	} //end switch

	return 星曜含義.join("<br>");
} //end function 地支含義提示


//***************************************************
function 運限宮位重疊含義(本命宮位, 順逆, 運限數, 地支數){
	//alert(本命宮位+順逆+運限數+地支數);
	var 宮位轉換註解, 六線重疊註解, 宮位重疊形式;
    
	宮位轉換註解=宮位轉換含義(本命宮位, 順逆, 運限數);

	switch(運限數){
		case 0:
			六線重疊註解=宮位轉六線(本命宮位);
			break;
		case 1:
			六線重疊註解=宮位轉六線(本命宮位);
			break;
		case 2:
            宮位重疊形式 = "";
            宮位重疊註解 = "";
			switch(本命宮位){
                case "命宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "命宮重疊大兄";
                        六線重疊註解 = "交友、兄弟：光明線重疊<br>命宮、遷移：成就線重疊<br>福子、財田：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "命宮重疊大父";
                        六線重疊註解 = "命宮、遷移：光明線重疊<br>父母、疾厄：成就線重疊<br>子女宮、田宅宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "兄弟宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "兄弟宮重疊大夫";
                        六線重疊註解 = "夫妻、官祿：光明線重疊<br>兄弟、交友：成就線重疊<br>父財、疾福：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "兄弟宮重疊大命";
                        六線重疊註解 = "兄弟、交友：光明線重疊<br>命宮、遷移：成就線重疊<br>福德宮、財帛宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "夫妻宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "夫妻宮重疊大子";
                        六線重疊註解 = "子女、田宅：光明線重疊<br>夫妻、交友：成就線重疊<br>命疾、遷父：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "夫妻宮重疊大兄";
                        六線重疊註解 = "官祿、夫妻：光明線重疊<br>兄弟、交友：成就線重疊<br>父母宮、疾厄宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "子女宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "子女宮重疊大財";
                        六線重疊註解 = "財帛、福德：光明線重疊<br>子女、田宅：成就線重疊<br>兄遷、友命：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "子女宮重疊大夫";
                        六線重疊註解 = "田宅、子女：光明線重疊<br>夫妻、官祿：成就線重疊<br>命宮、遷移宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "財帛宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "財帛宮重疊大疾";
                        六線重疊註解 = "疾厄、父母：光明線重疊<br>福德、財帛：成就線重疊<br>夫友、官兄：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "財帛宮重疊大子";
                        六線重疊註解 = "財帛、福德：光明線重疊<br>子女、田宅：成就線重疊<br>交友宮、兄弟宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "疾厄宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "疾厄宮重疊大遷";
                        六線重疊註解 = "遷移、命宮：光明線重疊<br>父母、疾厄：成就線重疊<br>子命、田夫：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "疾厄宮重疊大財";
                        六線重疊註解 = "疾厄、父母：光明線重疊<br>財帛、福德：成就線重疊<br>夫妻宮、官祿宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "遷移宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "遷移宮重疊大友";
                        六線重疊註解 = "交友、兄弟：光明線重疊<br>命宮、遷移：成就線重疊<br>福子、財田：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "遷移宮重疊大疾";
                        六線重疊註解 = "命宮、遷移：光明線重疊<br>父母、疾厄：成就線重疊<br>子女宮、田宅宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "交友宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "交友宮重疊大官";
                        六線重疊註解 = "夫妻、官祿：光明線重疊<br>兄弟、交友：成就線重疊<br>父財、疾福：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "交友宮重疊大遷";
                        六線重疊註解 = "兄弟、交友：光明線重疊<br>命宮、遷移：成就線重疊<br>福德宮、財帛宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "官祿宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "官祿宮重疊大田";
                        六線重疊註解 = "子女、田宅：光明線重疊<br>夫妻、交友：成就線重疊<br>命疾、遷父：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "官祿宮重疊大友";
                        六線重疊註解 = "官祿、夫妻：光明線重疊<br>兄弟、交友：成就線重疊<br>父母宮、疾厄宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "田宅宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "田宅宮重疊大福";
                        六線重疊註解 = "財帛、福德：光明線重疊<br>子女、田宅：成就線重疊<br>兄遷、友命：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "田宅宮重疊大官";
                        六線重疊註解 = "田宅、子女：光明線重疊<br>夫妻、官祿：成就線重疊<br>命宮、遷移宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "福德宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "福德宮重疊大父";
                        六線重疊註解 = "疾厄、父母：光明線重疊<br>福德、財帛：成就線重疊<br>夫友、官兄：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "福德宮重疊大田";
                        六線重疊註解 = "財帛、福德：光明線重疊<br>子女、田宅：成就線重疊<br>交友宮、兄弟宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "父母宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "父母宮重疊大命";
                        六線重疊註解 = "遷移、命宮：光明線重疊<br>父母、疾厄：成就線重疊<br>子命、田夫：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "父母宮重疊大福";
                        六線重疊註解 = "疾厄、父母：光明線重疊<br>財帛、福德：成就線重疊<br>夫妻宮、官祿宮的子田線重疊自身疾厄宮的子田線";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
			} // end switch 本命宮位
			break; //2
		case 3:
            宮位重疊形式 = "";
            宮位重疊註解 = "";
			switch(本命宮位){  
                case "命宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "命宮重疊大夫";
                        六線重疊註解 = "交友、兄弟的光明、成就線重疊<br>子女、田宅的光明、子田線重疊<br>父母、疾厄的成就、子田線重疊";
                        宮位重疊註解 = "婚姻對象問題。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "命宮重疊大福";
                        六線重疊註解 = "父母、疾厄的光明、成就線重疊<br>交友、兄弟的光明、子田線重疊<br>子女、田宅的成就、子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "兄弟宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "兄弟宮重疊大子";
                        六線重疊註解 = "官祿、夫妻的光明、成就線重疊<br>財帛、福德的光明、子田線重疊<br>命宮、遷移的成就、子田線重疊";
                        宮位重疊註解 = "兄弟重疊兄弟的兄弟";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "兄弟宮重疊大父";
                        六線重疊註解 = "命宮、遷移的光明、成就線重疊<br>官祿、夫妻的光明、子田線重疊<br>財帛、福德的成就、子田線重疊";
                        宮位重疊註解 = "父母的夫妻重疊父母，父母感情問題。";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "夫妻宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "夫妻宮重疊大財";
                        六線重疊註解 = "田宅、子女的光明、成就線重疊<br>疾厄、父母的光明、子田線重疊<br>兄弟、交友的成就、子田線重疊";
                        宮位重疊註解 = "福德的財重疊財，偏財；夫妻重疊夫妻的夫妻，婚後感情問題。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "夫妻宮重疊大命";
                        六線重疊註解 = "兄弟、交友的光明、成就線重疊<br>田宅、子女的光明、子田線重疊<br>疾厄、父母的成就、子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "子女宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "子女宮重疊大疾";
                        六線重疊註解 = "財帛、福德的光明、成就線重疊<br>命宮、遷移的光明、子田線重疊<br>官祿、夫妻的成就、子田線重疊";
                        宮位重疊註解 = "福德宮的疾厄重疊疾厄，健康問題。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "子女宮重疊大兄";
                        六線重疊註解 = "官祿、夫妻的光明、成就線重疊<br>財帛、福德的光明、子田線重疊<br>命宮、遷移的成就、子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "財帛宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "財帛宮重疊大遷";
                        六線重疊註解 = "疾厄、父母的光明、成就線重疊<br>兄弟、交友的光明、子田線重疊<br>田宅、子女的成就、子田線重疊";
                        宮位重疊註解 = "財重疊夫妻的財，夫妻錢財問題。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "財帛宮重疊大夫";
                        六線重疊註解 = "田宅、子女的光明、成就線重疊<br>疾厄、父母的光明、子田線重疊<br>兄弟、交友的成就、子田線重疊";
                        宮位重疊註解 = "財重疊福德的財，偏財；夫妻的夫妻重疊夫妻，婚後感情問題。";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "疾厄宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "疾厄宮重疊大友";
                        六線重疊註解 = "命宮、遷移的光明、成就線重疊<br>官祿、夫妻的光明、子田線重疊<br>財帛、福德的成就、子田線重疊";
                        宮位重疊註解 = "疾厄重疊夫妻的疾厄，夫妻交集、桃花問題。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "疾厄宮重疊大子";
                        六線重疊註解 = "福德、財帛的光明、成就線重疊<br>遷移、命宮的光明、子田線重疊<br>夫妻、官祿的成就、子田線重疊";
                        宮位重疊註解 = "夫妻的子重疊子，孩子問題；疾厄重疊福德的疾厄。";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "遷移宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "遷移宮重疊大官";
                        六線重疊註解 = "交友、兄弟的光明、成就線重疊<br>子女、田宅的光明、子田線重疊<br>父母、疾厄的成就、子田線重疊";
                        宮位重疊註解 = "驛馬事業；福德的官重疊官，五術、慈善事業。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "遷移宮重疊大財";
                        六線重疊註解 = "父母、疾厄的光明、成就線重疊<br>交友、兄弟的光明、子田線重疊<br>子女、田宅的成就、子田線重疊";
                        宮位重疊註解 = "夫妻的財重疊財，夫妻錢財問題。";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "交友宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "交友宮重疊大田";
                        六線重疊註解 = "官祿、夫妻的光明、成就線重疊<br>財帛、福德的光明、子田線重疊<br>命宮、遷移的成就、子田線重疊";
                        宮位重疊註解 = "交友重疊夫妻的交友，感情對像失婚、已婚。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "交友宮重疊大疾";
                        六線重疊註解 = "命宮、遷移的光明、成就線重疊<br>官祿、夫妻的光明、子田線重疊<br>財帛、福德的成就、子田線重疊";
                        宮位重疊註解 = "夫妻的疾厄重疊疾厄，夫妻交集、桃花問題。";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "官祿宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "官祿宮重疊大福";
                        六線重疊註解 = "田宅、子女的光明、成就線重疊<br>疾厄、父母的光明、子田線重疊<br>兄弟、交友的成就、子田線重疊";
                        宮位重疊註解 = "官重疊夫妻的官，夫妻檔。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "官祿宮重疊大遷";
                        六線重疊註解 = "兄弟、交友的光明、成就線重疊<br>田宅、子女的光明、子田線重疊<br>疾厄、父母的成就、子田線重疊";
                        宮位重疊註解 = "驛馬事業；官重疊福德的官，五術、慈善事業。";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "田宅宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "田宅宮重疊大父";
                        六線重疊註解 = "財帛、福德的光明、成就線重疊<br>命宮、遷移的光明、子田線重疊<br>官祿、夫妻的成就、子田線重疊";
                        宮位重疊註解 = "田重疊夫妻的田，夫妻聚散問題。";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "田宅宮重疊大友";
                        六線重疊註解 = "官祿、夫妻的光明、成就線重疊<br>財帛、福德的光明、子田線重疊<br>命宮、遷移的成就、子田線重疊";
                        宮位重疊註解 = "夫妻的交友重疊交友，感情對像失婚、已婚。";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "福德宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "福德宮重疊大命";
                        六線重疊註解 = "疾厄、父母的光明、成就線重疊<br>兄弟、交友的光明、子田線重疊<br>田宅、子女的成就、子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "福德宮重疊大官";
                        六線重疊註解 = "田宅、子女的光明、成就線重疊<br>疾厄、父母的光明、子田線重疊<br>兄弟、交友的成就、子田線重疊";
                        宮位重疊註解 = "夫妻的官重疊官，夫妻檔。";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "父母宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "父母宮重疊大兄";
                        六線重疊註解 = "命宮、遷移的光明、成就線重疊<br>官祿、夫妻的光明、子田線重疊<br>財帛、福德的成就、子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "父母宮重疊大田";
                        六線重疊註解 = "福德、財帛的光明、成就線重疊<br>遷移、命宮的光明、子田線重疊<br>夫妻、官祿的成就、子田線重疊";
                        宮位重疊註解 = "夫妻的田重疊田，夫妻聚散問題。";
                    }  //end if(順逆=="逆行")
					break;
			} // end switch 本命宮位
			break;  //3

		case 4:
            宮位重疊形式 = "";
            宮位重疊註解 = "";
			switch(本命宮位){
                case "命宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "命宮重疊大子";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "命宮重疊大田";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "兄弟宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "兄弟宮重疊大財";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "兄弟宮重疊大福";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "夫妻宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "夫妻宮重疊大疾";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "夫妻宮重疊大父";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "子女宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "子女宮重疊大遷";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "子女宮重疊大命";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "財帛宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "財帛宮重疊大友";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "財帛宮重疊大兄";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "疾厄宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "疾厄宮重疊大官";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "疾厄宮重疊大夫";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "遷移宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "遷移宮重疊大田";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "遷移宮重疊大子";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "交友宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "交友宮重疊大福";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "交友宮重疊大財";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "官祿宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "官祿宮重疊大父";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "官祿宮重疊大疾";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "田宅宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "田宅宮重疊大命";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "田宅宮重疊大遷";
                        六線重疊註解 = "命宮、遷移：子田線重疊<br>田宅、子女：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "福德宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "福德宮重疊大兄";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "福德宮重疊大友";
                        六線重疊註解 = "財帛、福德：子田線重疊<br>兄弟、交友：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "父母宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "父母宮重疊大夫";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "父母宮重疊大官";
                        六線重疊註解 = "夫妻、官祿：子田線重疊<br>疾厄、父母：子田線重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
			} // end switch 本命宮位
			break;  //4

		case 5:
			switch(本命宮位){
				case "命宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "命宮重疊大財";
                        六線重疊註解 = "交友、兄弟：光明、子田線重疊<br>子女、田宅：成就、子田線重疊";
                        宮位重疊註解 ="命宮重疊財，事業錢財問題；交友宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "命宮重疊大官";
                        六線重疊註解 = "子女、田宅：光明、子田線重疊<br>疾厄、父母：成就、子田線重疊";
                        宮位重疊註解 ="命宮重疊官，事業錢財；子女宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
				case "兄弟宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "兄弟宮重疊大疾";
                        六線重疊註解 = "官祿、夫妻：光明、子田線重疊<br>財帛、福德：成就、子田線重疊";
                        宮位重疊註解 = "兄弟宮重疊財；官祿宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "兄弟宮重疊大田";
                        六線重疊註解 = "財帛、福德：光明、子田線重疊<br>命宮、遷移：成就、子田線重疊";
                        宮位重疊註解 = "兄弟宮重疊官，家庭開銷，房地產的金錢；財帛宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
				case "夫妻宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "夫妻宮重疊大遷";
                        六線重疊註解 = "田宅、子女：光明、子田線重疊<br>疾厄、父母：成就、子田線重疊";
                        宮位重疊註解 = "夫妻宮重疊財，配偶的錢財問題，副業、海外事業；田宅宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "夫妻宮重疊大福";
                        六線重疊註解 = "疾厄、父母：光明、子田線重疊<br>交友、兄弟：成就、子田線重疊";
                        宮位重疊註解 = "夫妻宮重疊官，配偶的事業，享受的金錢；疾厄宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
				case "子女宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "子女宮重疊大友";
                        六線重疊註解 = "財帛、福德：光明、子田線重疊<br>命宮、遷移：成就、子田線重疊";
                        宮位重疊註解 = "子女宮重疊財，孩子相關的錢財問題，上司、同事、合夥；福德宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "子女宮重疊大父";
                        六線重疊註解 = "命宮、遷移：光明、子田線重疊<br>官祿、夫妻：成就、子田線重疊";
                        宮位重疊註解 = "子女宮重疊官，孩子的事業，父母的錢財；遷移宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
				case "財帛宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "財帛宮重疊大官";
                        六線重疊註解 = "疾厄、父母：光明、子田線重疊<br>兄弟、交友：成就、子田線重疊";
                        宮位重疊註解 = "財帛宮重疊財，事業錢財，投資；父母宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "財帛宮重疊大命";
                        六線重疊註解 = "兄弟、交友：光明、子田線重疊<br>田宅、子女：成就、子田線重疊";
                        宮位重疊註解 = "財帛宮重疊官，事業錢財、投資；交友宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
				case "疾厄宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "疾厄宮重疊大田";
                        六線重疊註解 = "命宮、遷移：光明、子田線重疊<br>官祿、夫妻：成就、子田線重疊";
                        宮位重疊註解 = "疾厄宮重疊財，房地產事業，血液；命宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "疾厄宮重疊大兄";
                        六線重疊註解 = "官祿、夫妻：光明、子田線重疊<br>財帛、福德：成就、子田線重疊";
                        宮位重疊註解 = "疾厄宮重疊官；官祿宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
                case "遷移宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "遷移宮重疊大福";
                        六線重疊註解 = "交友、兄弟：光明、子田線重疊<br>子女、田宅：成就、子田線重疊";
                        宮位重疊註解 = "遷移宮重疊財，外在的資金，偏財；福德宮重疊官，五術事業；兄弟宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "遷移宮重疊大夫";
                        六線重疊註解 = "子女、田宅：光明、子田線重疊<br>疾厄、父母：成就、子田線重疊";
                        宮位重疊註解 = "遷移宮重疊官，驛馬、海外事業，配偶的錢財；田宅宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
                case "交友宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "交友宮重疊大父";
                        六線重疊註解 = "官祿、夫妻：光明、子田線重疊<br>財帛、福德：成就、子田線重疊";
                        宮位重疊註解 = "交友宮重疊財，朋友大眾的金錢，父親的事業；夫妻宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "交友宮重疊大子";
                        六線重疊註解 = "財帛、福德：光明、子田線重疊<br>命宮、遷移：成就、子田線重疊";
                        宮位重疊註解 = "交友宮重疊官，上司，同事，孩子的錢財；福德宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
                case "官祿宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "官祿宮重疊大命";
                        六線重疊註解 = "田宅、子女：光明、子田線重疊<br>疾厄、父母：成就、子田線重疊";
                        宮位重疊註解 = "官祿宮重疊財，事業運作資金；子女宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "官祿宮重疊大財";
                        六線重疊註解 = "疾厄、父母：光明、子田線重疊<br>交友、兄弟：成就、子田線重疊";
                        宮位重疊註解 = "官祿宮重疊官；父母宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
                case "田宅宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "田宅宮重疊大兄";
                        六線重疊註解 = "財帛、福德：光明、子田線重疊<br>命宮、遷移：成就、子田線重疊";
                        宮位重疊註解 = "田宅宮重疊財，房地產投資，家庭開銷；財帛宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "田宅宮重疊大疾";
                        六線重疊註解 = "命宮、遷移：光明、子田線重疊<br>官祿、夫妻：成就、子田線重疊";
                        宮位重疊註解 = "田宅宮重疊官，房地產事業，血液；命宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
                case "福德宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "福德宮重疊大夫";
                        六線重疊註解 = "疾厄、父母：光明、子田線重疊<br>兄弟、交友：成就、子田線重疊";
                        宮位重疊註解 = "福德宮重疊財，享受的錢財，配偶事業；疾厄宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "福德宮重疊大遷";
                        六線重疊註解 = "兄弟、交友：光明、子田線重疊<br>田宅、子女：成就、子田線重疊";
                        宮位重疊註解 = "福德宮重疊官，偏財；兄弟宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
                case "父母宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "父母宮重疊大子";
                        六線重疊註解 = "命宮、遷移：光明、子田線重疊<br>官祿、夫妻：成就、子田線重疊";
                        宮位重疊註解 = "父母宮重疊財，遺產，孩子的事業；遷移宮的6、10重疊";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "父母宮重疊大友";
                        六線重疊註解 = "官祿、夫妻：光明、子田線重疊<br>財帛、福德：成就、子田線重疊";
                        宮位重疊註解 = "父母宮重疊官，父親的事業，交友的錢財；夫妻宮的6、10重疊";
                    }  //end if(順逆=="逆行")
					break;
                    
			} // end switch 本命宮位
			break;  //5

		case 6:
            宮位重疊形式 = "";
            宮位重疊註解 = "";
			switch(本命宮位){
                case "命宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "命宮重疊大x";
                        六線重疊註解 = "命宮、遷移1、6重疊<br>田夫、子官：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "命宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "兄弟宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "兄弟宮重疊大x";
                        六線重疊註解 = "兄弟、交友1、6重疊<br>福子、財田：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "兄弟宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "夫妻宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "夫妻宮重疊大x";
                        六線重疊註解 = "夫妻、官祿1、6重疊<br>疾福、父財：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "夫妻宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "子女宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "子女宮重疊大x";
                        六線重疊註解 = "子女、田宅1、6重疊<br>命疾、遷父：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "子女宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "財帛宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "財帛宮重疊大x";
                        六線重疊註解 = "財帛、福德1、6重疊<br>友命、兄遷：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "財帛宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "疾厄宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "疾厄宮重疊大x";
                        六線重疊註解 = "疾厄、父母1、6重疊<br>官兄、夫友：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "疾厄宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "遷移宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "遷移宮重疊大x";
                        六線重疊註解 = "命宮、遷移1、6重疊<br>田夫、子官：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "遷移宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "交友宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "交友宮重疊大x";
                        六線重疊註解 = "兄弟、交友1、6重疊<br>福子、財田：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "交友宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "官祿宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "官祿宮重疊大x";
                        六線重疊註解 = "夫妻、官祿1、6重疊<br>疾福、父財：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "官祿宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "田宅宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "田宅宮重疊大x";
                        六線重疊註解 = "子女、田宅1、6重疊<br>命疾、遷父：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "田宅宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "福德宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "福德宮重疊大x";
                        六線重疊註解 = "財帛、福德1、6重疊<br>友命、兄遷：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "福德宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "父母宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "父母宮重疊大x";
                        六線重疊註解 = "疾厄、父母1、6重疊<br>官兄、夫友：子田重疊";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "父母宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
			} // end switch 本命宮位
			break;  //6

		case 7:
			switch(本命宮位){
				case "命宮": case "遷移宮":
					if(順逆=="順行") 六線重疊註解 = "";
					if(順逆=="逆行") 六線重疊註解 = "";
					break;
				case "兄弟宮": case "交友宮":
					if(順逆=="順行") 六線重疊註解 = "";
					if(順逆=="逆行") 六線重疊註解 = "";
					break;
				case "夫妻宮": case "官祿宮":
					if(順逆=="順行") 六線重疊註解 = "";
					if(順逆=="逆行") 六線重疊註解 = "";
					break;
				case "子女宮": case "田宅宮":
					if(順逆=="順行") 六線重疊註解 = "";
					if(順逆=="逆行") 六線重疊註解 = "";
					break;
				case "財帛宮": case "福德宮":
					if(順逆=="順行") 六線重疊註解 = "";
					if(順逆=="逆行") 六線重疊註解 = "";
					break;
				case "疾厄宮": case "父母宮":
					if(順逆=="順行") 六線重疊註解 = "";
					if(順逆=="逆行") 六線重疊註解 = "";
					break;
                
                /*
                case "命宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "命宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "命宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "兄弟宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "兄弟宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "兄弟宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "夫妻宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "夫妻宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "夫妻宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "子女宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "子女宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "子女宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "財帛宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "財帛宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "財帛宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
				case "疾厄宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "疾厄宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "疾厄宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "遷移宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "遷移宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "遷移宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "交友宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "交友宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "交友宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "官祿宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "官祿宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "官祿宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "田宅宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "田宅宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "田宅宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "福德宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "福德宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "福德宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                    
                case "父母宮":
                    if(順逆=="順行") {
                        宮位重疊形式 = "父母宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="順行")
                    
                    if(順逆=="逆行") {
                        宮位重疊形式 = "父母宮重疊大x";
                        六線重疊註解 = "";
                        宮位重疊註解 = "";
                    }  //end if(順逆=="逆行")
					break;
                */
			} // end switch 本命宮位
			break;  //7
	} // end switch 運限數
	
	var 宮位轉換重疊提示 = {
		"宮位": 本命宮位,
		"宮位轉換": 宮位轉換註解,
        "宮位重疊形式": 宮位重疊形式,
        "宮位重疊": 宮位重疊註解,
		"六線重疊": 六線重疊註解
	};
	
	return 宮位轉換重疊提示;
	//alert(宮位轉換註解 +"\n" + 六線重疊註解);
} // end fuction


