function 地支宮位元件(地支數) {
	this.宮位數 = -1; //1： 命宮 2： 兄弟宮 。。。
	this.宮位 = ""; //命宮、兄弟宮 。。。
	this.六線 = ""; //命遷線、兄友線 。。。
    //this.輔佐星 = []; //文昌、文曲、左輔、右弼
	this.星曜 = []; //所有星曜
	this.地支數 = 地支數; //  ......................... 填寫地支數
	this.地支 = 地支字數轉換(地支數);  //  ......................... 填寫地支
	this.宮干數 = -1;  //0：癸，1：甲， 2：乙
	this.宮干 = "";
    this.無主星 = false;
	this.空宮 = false;
	this.對應地支 = new 地支對應宮();  //對應的地支宮位，比方丑宮2的子女宮為戌，11
	this.宮干四化 = new 宮干四化元件();

	this.大限歲數段 = "";
	this.大限數 = -1;
	this.大限宮位 = "";

	this.流年歲數 = -1; //歲數
	this.流年宮位數 = -1; //1： 流年命宮 2： 流年兄弟宮 。。。
	this.流年宮位 = "";
}  //end function 宮位元件


function 尋行運順逆(陽男陰女){
    if(陽男陰女=="陽男" || 陽男陰女=="陰女") return "順行";
    if(陽男陰女=="陰男" || 陽男陰女=="陽女") return "逆行";
}



function 宮干四化元件(){

	this.化祿星 = "";
	this.化權星 = "";
	this.化科星 = "";
	this.化忌星 = "";
	
	this.祿出 = new 化進元件();
	this.權出 = new 化進元件();
	this.科出 = new 化進元件();
	this.忌出 = new 化進元件();
	this.忌出沖 = new 化進元件();
	
	this.祿進 = new 化進元件();
	this.權進 = new 化進元件();
	this.科進 = new 化進元件();
	this.忌進 = new 化進元件();
	this.忌進沖 = new 化進元件();
	
    /*
	this.自化祿 = false;
	this.自化權 = false;
	this.自化科 = false;
	this.自化忌 = false;

	this.流出祿 = false;
	this.流出權 = false;
	this.流出科 = false;
	this.流出忌 = false;
    
	this.流出矩陣 = [];  // 歸納流出的四化以便顯示
    
    this.沖光明線 = false;
    this.沖成就線 = false;
    this.沖子田線 = false;
    this.一六互沖 = false;
    */

    this.分析 = new 祿權忌位置();
} // end function 宮干四化元件


function 化進元件(){
	this.地支數1 = -1;
	this.地支數2 = -1;  //借宮形成的地支
	this.地支數 = [];
	this.地支 = [];
	this.人事宮 = [];
	this.宮干 = [];
} // end function 化進元件()


function 地支對應宮() {
    // may be not used !!
	this.命宮 = -1;
	this.兄弟宮 = -1;
	this.夫妻宮 = -1;
	this.子女宮 = -1;
	this.財帛宮 = -1;
	this.疾厄宮 = -1;
	this.遷移宮 = -1;  //對宮
	this.交友宮 = -1;
	this.官祿宮 = -1;
	this.田宅宮 = -1;
	this.福德宮 = -1;
	this.父母宮 = -1;
} // end function 地支對應宮


function 祿權忌位置() {
    // 宮干四化分析的元件
    this.殺破狼 = false;
    this.機月同梁 = false;
    this.府相朝垣 = false;
    
	this.自化祿 = false;
	this.自化權 = false;
	this.自化科 = false;
	this.自化忌 = false;

	this.流出祿 = false;
	this.流出權 = false;
	this.流出科 = false;
	this.流出忌 = false;
    this.流出矩陣 = [];  // 歸納流出的四化以便命盤顯示
    
    this.祿忌同宮 = false;
    this.祿忌對宮 = false;
    this.祿權同宮 = false;
    this.祿權對宮 = false;
    
    this.化入三方 = false;
    this.化入三方四化 = "";
    this.化入三方地支 = "";
    this.化入三方宮位 = "";
    
    this.祿入六 = false;
    this.忌入六 = false;
    this.祿入十 = false;
    this.忌入十 = false;
    
    this.一沖六 = false;
    this.六沖一 = false;
    this.六祿一 = false;
    this.一六互沖 = false;
    this.一六互沖線 = "";
    
    this.一沖十 = false;
    this.十沖一 = false;
    
    this.祿三方 = false;
    this.沖三方 = false;
    
    this.忌沖光明線 = false;
    this.忌沖成就線 = false;
    this.忌沖子田線 = false;
    
    this.祿入光明線 = false;
    this.祿入成就線 = false;
    this.祿入子田線 = false;
} //end function 祿權忌位置
// **************************************************

function 宮位初始(){
	this.本命 = new 十二人事宮位();
	this.大限 = new 十二人事宮位();
	this.流年 = new 十二人事宮位();
}

function 十二人事宮位(){
	this.命宮 = new 人事宮位元件(1);
	this.兄弟宮 = new 人事宮位元件(2);
	this.夫妻宮 = new 人事宮位元件(3);
	this.子女宮 = new 人事宮位元件(4);
	this.財帛宮 = new 人事宮位元件(5);
	this.疾厄宮 = new 人事宮位元件(6);
	this.遷移宮 = new 人事宮位元件(7);
	this.交友宮 = new 人事宮位元件(8);
	this.官祿宮 = new 人事宮位元件(9);
	this.田宅宮 = new 人事宮位元件(10);
	this.福德宮 = new 人事宮位元件(11);
	this.父母宮 = new 人事宮位元件(0);
}

function 人事宮位元件(宮位數) {
	this.天干數 = -1;
	this.天干 = "";
	this.地支數 = -1;
	this.地支 = "";
	this.宮位數 = 宮位數; //命宮：1，兄弟：2 ...... 父母官：0
    this.無主星 = false;
    this.空宮 = false;
	this.分析 = [];
    this.主星 = [];
    this.星曜 = [];
}  //end function 宮位元件

// **************************************************
function 星曜初始(){
	this.紫微 = new 星曜元件();
	this.天機 = new 星曜元件();
	this.太陽 = new 星曜元件();
	this.武曲 = new 星曜元件();
	this.天同 = new 星曜元件();
	this.廉貞 = new 星曜元件();

	this.天府 = new 星曜元件();
	this.太陰 = new 星曜元件();
	this.貪狼 = new 星曜元件();
	this.巨門 = new 星曜元件();
	this.天相 = new 星曜元件();
	this.天梁 = new 星曜元件();
	this.七殺 = new 星曜元件();
	this.破軍 = new 星曜元件();

	this.左輔 = new 星曜元件();
	this.右弼 = new 星曜元件();

	this.文昌 = new 星曜元件();
	this.文曲 = new 星曜元件();

	// **** 星曜基礎含義 ****
	this.紫微.星曜 = "紫微";
	this.紫微.星斗 = "北斗";
	this.紫微.星系 = "紫微";
	this.紫微.五行 = "己土";
	this.紫微.主司 = "官祿主";
	this.紫微.後天卦 = "坤";
	this.紫微.分類 = "主星";
	this.紫微.拼音 = "zǐ wēi";

	this.天機.星曜 = "天機";
	this.天機.星斗 = "南斗";
	this.紫微.星系 = "紫微";
	this.天機.五行 = "乙木";
	this.天機.主司 = "兄弟主";
	this.天機.後天卦 = "巽";
	this.天機.分類 = "主星";
	this.天機.備註 = "化氣曰善，益壽之星";
	this.天機.拼音 = "tiān jī";

	this.太陽.星曜 = "太陽";
	this.太陽.星斗 = "中天";
	this.太陽.星系 = "紫微";
	this.太陽.五行 = "丙火";
	this.太陽.主司 = "官祿主";
	this.太陽.後天卦 = "離";
	this.太陽.分類 = "主星";
	this.太陽.備註 = "正官祿主，動態、競爭行業";
	this.太陽.拼音 = "tài yáng";

	this.武曲.星曜 = "武曲";
	this.武曲.星斗 = "北斗";
	this.武曲.星系 = "紫微";
	this.武曲.五行 = "丙火";
	this.武曲.主司 = "財帛主";
	this.武曲.後天卦 = "乾";
	this.武曲.分類 = "主星";
	this.武曲.備註 = "化氣為財，正財星，但必需挖掘，冶煉才能發揮功用。所以武曲必須先有事業才能進財。財多人散，故武曲星主孤寡。";
	this.武曲.拼音 = "wǔ qū";

	this.天同.星曜 = "天同";
	this.天同.星斗 = "南斗";
	this.天同.星系 = "紫微";
	this.天同.五行 = "壬水";
	this.天同.主司 = "福德主";
	this.天同.後天卦 = "坎";
	this.天同.分類 = "主星";
	this.天同.備註 = "主福報，少積極";
	this.天同.拼音 = "tiān tóng";

	this.廉貞.星曜 = "廉貞";
	this.廉貞.星斗 = "北斗";
	this.廉貞.星系 = "紫微";
	this.廉貞.五行 = "丁火";
	this.廉貞.主司 = "官祿主";
	this.廉貞.後天卦 = "";
	this.廉貞.分類 = "主星";
	this.廉貞.備註 = "官祿主，司權令，執法，靜態、非競爭行業";
	this.廉貞.拼音 = "lián zhēn";

	this.天府.星曜 = "天府";
	this.天府.星斗 = "南斗";
	this.天府.星系 = "天府";
	this.天府.五行 = "戊土";
	this.天府.主司 = "田宅主";
	this.天府.後天卦 = "坤";
	this.天府.分類 = "主星";
	this.天府.備註 = "田宅、財帛主，祿庫之星";
	this.天府.拼音 = "tiān fǔ";

	this.太陰.星曜 = "太陰";
	this.太陰.星斗 = "中天";
	this.太陰.星系 = "天府";
	this.太陰.五行 = "癸水";
	this.太陰.主司 = "田宅主";
	this.太陰.後天卦 = "坎";
	this.太陰.分類 = "主星";
	this.太陰.備註 = "田宅主，有保護作用，為母星、妻星";
	this.太陰.拼音 = "tài yīn";

	this.貪狼.星曜 = "貪狼";
	this.貪狼.星斗 = "北斗";
	this.貪狼.星系 = "天府";
	this.貪狼.五行 = "甲木";
	this.貪狼.主司 = "禍福主";
	this.貪狼.後天卦 = "";
	this.貪狼.分類 = "主星";
	this.貪狼.備註 = "禍福主，財星、壽星";
	this.貪狼.拼音 = "tān láng";

	this.巨門.星曜 = "巨門";
	this.巨門.星斗 = "北斗";
	this.巨門.星系 = "天府";
	this.巨門.五行 = "癸水";
	this.巨門.主司 = "主暗、是非";
	this.巨門.後天卦 = "";
	this.巨門.分類 = "主星";
	this.巨門.備註 = "";
	this.巨門.拼音 = "jù mén";

	this.天相.星曜 = "天相";
	this.天相.星斗 = "南斗";
	this.天相.星系 = "天府";
	this.天相.五行 = "壬水";
	this.天相.主司 = "化氣為印，司衣食";
	this.天相.後天卦 = "";
	this.天相.分類 = "主星";
	this.天相.備註 = "";
	this.天相.拼音 = "tiān xiāng";

	this.天梁.星曜 = "天梁";
	this.天梁.星斗 = "南斗";
	this.天梁.星系 = "天府";
	this.天梁.五行 = "戊土";
	this.天梁.主司 = "化氣為蔭，主延壽";
	this.天梁.後天卦 = "坤";
	this.天梁.分類 = "主星";
	this.天梁.備註 = "";
	this.天梁.拼音 = "tiān liáng";

	this.七殺.星曜 = "七殺";
	this.七殺.星斗 = "南斗";
	this.七殺.星系 = "天府";
	this.七殺.五行 = "庚金";
	this.七殺.主司 = "化氣為殺，主刑孤";
	this.七殺.後天卦 = "坤";
	this.七殺.分類 = "主星";
	this.七殺.備註 = "";
	this.七殺.拼音 = "qī shā";

	this.破軍.星曜 = "破軍";
	this.破軍.星斗 = "南斗";
	this.破軍.星系 = "天府";
	this.破軍.五行 = "癸水";
	this.破軍.主司 = "化氣為耗，司夫、子、奴、孤剋";
	this.破軍.後天卦 = "坤";
	this.破軍.分類 = "主星";
	this.破軍.備註 = "先敗後成、先男後女";
	this.破軍.拼音 = "pò jūn";

	this.左輔.星曜 = "左輔";
	this.左輔.星斗 = "";
	this.左輔.星系 = "";
	this.左輔.五行 = "";
	this.左輔.主司 = "";
	this.左輔.後天卦 = "";
	this.左輔.分類 = "副星";
	this.左輔.備註 = "";
	this.左輔.拼音 = "zuǒ fǔ";

	this.右弼.星曜 = "右弼";
	this.右弼.星斗 = "";
	this.右弼.星系 = "";
	this.右弼.五行 = "";
	this.右弼.主司 = "";
	this.右弼.後天卦 = "";
	this.右弼.分類 = "副星";
	this.右弼.備註 = "";
	this.右弼.拼音 = "yòu bì";

	this.文昌.星曜 = "文昌";
	this.文昌.星斗 = "";
	this.文昌.星系 = "";
	this.文昌.五行 = "";
	this.文昌.主司 = "";
	this.文昌.後天卦 = "";
	this.文昌.分類 = "副星";
	this.文昌.備註 = "";
	this.文昌.拼音 = "wén chāng";

	this.文曲.星曜 = "文曲";
	this.文曲.星斗 = "";
	this.文曲.星系 = "";
	this.文曲.五行 = "";
	this.文曲.主司 = "";
	this.文曲.後天卦 = "";
	this.文曲.分類 = "副星";
	this.文曲.備註 = "";
	this.文曲.拼音 = "wén qū";

	// *** test **
	//var 星曜名 = "破軍";
	//console.log(this[星曜名].備註);
} // end function 星曜初始()

function 星曜元件() {
	this.星曜數 = -1;
	this.星曜 = ""; //紫微、天機 。。。
	this.地支 = "";
	this.地支數 = -1;
    this.廟陷 = "";
	this.星斗 = ""; //北斗、南斗、中天
	this.星系 = ""; //紫微、天府
	this.五行 = "";
	this.主司 = "";
	this.後天卦 = "";
	this.分類 = ""; //主星、副星、神煞
	this.吉凶 = ""; //吉星、凶星 。。。。
	this.生年四化 = "";
	this.生年祿 = false;
	this.生年權 = false;
	this.生年科 = false;
	this.生年忌 = false;
	this.自化 = "";
	this.流出 = "";
	this.命盤位置 = "";
	this.備註 = "";
}  //end function 宮位元件


function 大限元件(大限數) {
	this.大限數 = 大限數; // 0 reserved for 童限
	this.歲數段 = ""; // 13 - 22
	this.限始歲 = -1;
	this.限終歲 = -1;
	this.地支數 = -1;
	this.宮位干支 = "";  //比方 壬辰大限，以該大限宮的宮位干支判斷
	this.大限名 = ""; //比方 第5大限
	this.流年 = [];
	this.地支 = [];
	this.人事宮 = new 初始大限人事宮位();
    this.宮位 = new 初始大限宮位();
	for(var j=0; j< 10; j++){
		this.流年[j] = new 大限流年元件();
	} // end for j
	
	
	for(var j=0; j< 12; j++){
		this.地支[j] = new 大限地支元件();
	} // end for j
	
}  //end function 大限元件

function 初始大限人事宮位() {
	//填寫大限人事宮位的地支數
	this.父母宮 = -1;
	this.命宮 = -1;
	this.兄弟宮 = -1;
	this.夫妻宮 = -1;
	this.子女宮 = -1;
	this.財帛宮 = -1;
	this.疾厄宮 = -1;
	this.遷移宮 = -1;
	this.交友宮 = -1;
	this.官祿宮 = -1;
	this.田宅宮 = -1;
	this.福德宮 = -1;
} // end function 初始大限人事宮位

function 初始大限宮位() {
	//填寫大限人事宮位的地支數
	this.父母宮 = new 初始大限宮位元件();
	this.命宮 = new 初始大限宮位元件();
	this.兄弟宮 = new 初始大限宮位元件();
	this.夫妻宮 = new 初始大限宮位元件();
	this.子女宮 = new 初始大限宮位元件();
	this.財帛宮 = new 初始大限宮位元件();
	this.疾厄宮 = new 初始大限宮位元件();
	this.遷移宮 = new 初始大限宮位元件();
	this.交友宮 = new 初始大限宮位元件();
	this.官祿宮 = new 初始大限宮位元件();
	this.田宅宮 = new 初始大限宮位元件();
	this.福德宮 = new 初始大限宮位元件();
} // end function 初始大限宮位


function 初始大限宮位元件() {
    //this.宮名 = "";
    this.地支數 = -1;
    this.地支 = "";
    this.本命宮名 = "";
    this.宮位重疊 = "";
} // end function 初始大限人事宮位


function 大限流年元件() {
	this.西曆年 = -1;
	this.大限流年數 = -1; // 該大限的第幾個流年
	this.歲數 = -1;
	this.地支數 = -1;
	this.地支 = "";
	this.流年干支 = "";
	this.流年天干十神 = "";
	this.流年地支十神 = "";  //地支主氣的十神
}  //end function 大限流年元件


function 大限地支元件() {
	this.人事宮 = "";
    this.本命人事宮 = "";
	this.六線 = ""; //命遷線、兄友線 。。。
    this.三方 = "";
    this.本命三方 = "";
	this.大限流年數 = -1; // 該大限的第幾個流年
	this.歲數 = -1;
	this.西曆年 = -1;
}  //end function 大限地支元件



function 命局元件(){
    this.局數=0;
    this.命宮 = new 命局人事宮元件();
    this.兄弟宮 = new 命局人事宮元件();
    this.夫妻宮 = new 命局人事宮元件();
    this.子女宮 = new 命局人事宮元件();
    this.財帛宮 = new 命局人事宮元件();
    this.疾厄宮 = new 命局人事宮元件();
    this.遷移宮 = new 命局人事宮元件();
    this.交友宮 = new 命局人事宮元件();
    this.官祿宮 = new 命局人事宮元件();
    this.田宅宮 = new 命局人事宮元件();
    this.福德宮 = new 命局人事宮元件();
    this.父母宮 = new 命局人事宮元件();
} // end function 命局元件


function 命局人事宮元件(){
    this.地支數 = -1;
    this.主星矩陣 = [];
    this.主星 = "";
    this.空宮 = false;
}// end function 命局人事宮元件



// ----------------------------------------


function 尋命宮地支數(陰曆月數, 陰曆時辰){
    var 陰曆時數 = 地支字數轉換(陰曆時辰);
    var 命宮位置 = 3; //先寅宮起命宮
    var 命宮地支數;

    命宮地支數 = 地支滾動(命宮位置, 陰曆月數);
    命宮地支數 = 地支滾動(命宮地支數, (-1)*陰曆時數);

    return 命宮地支數;
}  // end function 尋命宮地支數


function 尋身宮地支數(陰曆月數, 陰曆時辰){
    var 陰曆時數 = 地支字數轉換(陰曆時辰);
    var 身宮位置 = 3; //先寅宮起身宮
    var 身宮地支數;

    身宮地支數 = 地支滾動(身宮位置, 地支滾動(陰曆月數, -1));
    身宮地支數 = 地支滾動(身宮地支數, 地支滾動(陰曆時數, -1));

    return 身宮地支數;
} // end function 尋身宮地支數


function 填寫宮干四化(地支矩陣, 生年天干數) {
    // 生年天干數: 甲: 1, 乙：2 ..... 癸：0
    var 寅宮天干數 = (2 * 生年天干數 + 1) % 10;
    var 寅宮數 = 3;

    for(var i=0; i<12; i++){
        地支矩陣[地支滾動(寅宮數, i)].宮干數 = 天干滾動(寅宮天干數, i);
        地支矩陣[地支滾動(寅宮數, i)].宮干 = 天干字數轉換(地支矩陣[地支滾動(寅宮數, i)].宮干數);
    }  // end for
} // end function 填寫宮干四化


function 填寫人事宮位(地支矩陣, 人事宮元件, 命宮地支數) {
    var 宮名;
    for(var i=0; i<12; i++){
        地支矩陣[地支滾動(命宮地支數, (-1) * i)].宮位數  = 地支滾動(1, i);
        宮名 = 人事宮字數轉換(地支矩陣[地支滾動(命宮地支數, (-1) * i)].宮位數);
        地支矩陣[地支滾動(命宮地支數, (-1) * i)].宮位 = 宮名;
        地支矩陣[地支滾動(命宮地支數, (-1) * i)].六線 = 宮位轉六線(宮名);

        人事宮元件[宮名].地支數 = 地支滾動(命宮地支數, (-1) * i);
        人事宮元件[宮名].地支 = 地支字數轉換(人事宮元件[宮名].地支數);
		人事宮元件[宮名].天干數 = 地支矩陣[地支滾動(命宮地支數, (-1) * i)].宮干數;
        人事宮元件[宮名].天干 = 天干字數轉換(人事宮元件[宮名].天干數);
        
        
    }  // end for
} // end function 填寫人事宮位


function 尋五行局(命宮宮干, 命宮地支) {
    var 命宮干支 = 天干字數轉換(命宮宮干) + 地支字數轉換(命宮地支);
    var 五行局數, 五行局名;

    switch(命宮干支) {
        case "丙子": case "丁丑": case "甲寅": case "乙卯": case "壬辰": case "癸巳": case "丙午": case "丁未": case "甲申": case "乙酉": case "壬戌": case "癸亥": 
            五行局數 = 2;
            五行局名 = "水二局";
            break;
        case "壬子": case "癸丑": case "庚寅": case "辛卯": case "戊辰": case "己巳": case "壬午": case "癸未": case "庚申": case "辛酉": case "戊戌": case "己亥": 
            五行局數 = 3;
            五行局名 = "木三局";
            break;
        case "甲子": case "乙丑": case "壬寅": case "癸卯": case "庚辰": case "辛巳": case "甲午": case "乙未": case "壬申": case "癸酉": case "庚戌": case "辛亥": 
            五行局數 = 4;
            五行局名 = "金四局";
            break;
        case "庚子": case "辛丑": case "戊寅": case "己卯": case "丙辰": case "丁巳": case "庚午": case "辛未": case "戊申": case "己酉": case "丙戌": case "丁亥": 
            五行局數 = 5;
            五行局名 = "土五局";
            break;
        case "戊子": case "己丑": case "丙寅": case "丁卯": case "甲辰": case "乙巳": case "戊午": case "己未": case "丙申": case "丁酉": case "甲戌": case "乙亥": 
            五行局數 = 6;
            五行局名 = "火六局";
            break;
		default:
			alert(命宮干支 + "：命宮干支 出現問題");
            五行局數 = 0;
            五行局名 = "";			
    } // end switch
	var 五行局元件 = {
		"干支": 命宮干支,
		"局數": 五行局數,
		"局名": 五行局名
	};
	return 五行局元件;	
} // end function 尋五行局


// ----------------------------------------

function 十干四化(天干, 四化派別){
	var 四化星 = {"化祿": "", "化權": "", "化科": "", "化忌": ""};
    if(四化派別 === undefined) 四化派別 = "紫微斗數全集";
    
	switch(天干){
		case "甲":
			四化星.化祿 = "廉貞";
			四化星.化權 = "破軍";
			四化星.化科 = "武曲";
			四化星.化忌 = "太陽";
			break;
		case "乙":
			四化星.化祿 = "天機";
			四化星.化權 = "天梁";
			四化星.化科 = "紫微";
			四化星.化忌 = "太陰";
			break;
		case "丙":
			四化星.化祿 = "天同";
			四化星.化權 = "天機";
			四化星.化科 = "文昌";
			四化星.化忌 = "廉貞";
			break;
		case "丁":
			四化星.化祿 = "太陰";
			四化星.化權 = "天同";
			四化星.化科 = "天機";
			四化星.化忌 = "巨門";
			break;
		case "戊":
			四化星.化祿 = "貪狼";
			四化星.化權 = "太陰";
			四化星.化科 = "右弼";
			四化星.化忌 = "天機";
			break;
		case "己":
			四化星.化祿 = "武曲";
			四化星.化權 = "貪狼";
			四化星.化科 = "天梁";
			四化星.化忌 = "文曲";
			break;
		case "庚":
			四化星.化祿 = "太陽";
			四化星.化權 = "武曲";
			四化星.化科 = "太陰";
			四化星.化忌 = "天同";
			break;
		case "辛":
			四化星.化祿 = "巨門";
			四化星.化權 = "太陽";
			四化星.化科 = "文曲";
			四化星.化忌 = "文昌";
			break;
		case "壬":
			四化星.化祿 = "天梁";
			四化星.化權 = "紫微";
			四化星.化科 = "左輔";
			四化星.化忌 = "武曲";
			break;
		case "癸":
			四化星.化祿 = "破軍";
			四化星.化權 = "巨門";
			四化星.化科 = "太陰";
			四化星.化忌 = "貪狼";
			break;
		default:
			alert(天干 + "：十干四化 輸入錯誤！")
	} // end switch
	return 四化星;
} // end function 十干四化

function 星曜分類(星曜){
	//分辨星曜是主星、六吉、六兇
	var 級別;
	if(星曜=="紫微" || 星曜=="天機" || 星曜=="太陽" || 星曜=="武曲" || 星曜=="天同" || 星曜=="廉貞" || 星曜=="天府" || 星曜=="太陰" || 星曜=="貪狼" || 星曜=="巨門" || 星曜=="天相" || 星曜=="天梁" || 星曜=="七殺" || 星曜=="破軍" ) 級別="主星";
	if(星曜=="左輔" || 星曜=="右弼" || 星曜=="文昌" || 星曜=="文曲") 級別="六吉";

	return 級別;
} // end 


function 四化顏色選擇器(四化){
    var 字體, 背景;
    
        switch(四化){
            case "祿":
                字體 = "化祿字體顏色";
                背景 = "化祿背景顏色";
                break;
            case "權":
                字體 = "化權字體顏色";
                背景 = "化權背景顏色";
                break;
            case "科":
                字體 = "化科字體顏色";
                背景 = "化科背景顏色";
                break;
            case "忌":
                字體 = "化忌字體顏色";
                背景 = "化忌背景顏色";
                break;
            case "<br>":
            	break;  //do nothing !!
            default:
               alert(四化 + "：四化顏色選擇器 輸入的四化錯誤 ！");
            //    return "";
        }  // end switch
    
        var 四化顏色 = {"字體": 字體, "背景": 背景};

        return 四化顏色;
}  // end 四化顏色選擇器



function 地支參考元件(地支數, 選項){
	if(選項 === undefined) 選項 = "斗數地支參考"; 
	var 地支參考 = "";
	
	var 地支參考數據 = [
				  
		{"地支": "亥", "後天卦": "乾", "方位": "西北北", "方位數": "315-345", "五行": "水"},
		{"地支": "子", "後天卦": "坎", "方位": "北", "方位數": "345-15", "五行": "水"},
		{"地支": "丑", "後天卦": "", "方位": "東北北", "方位數": "15-45", "五行": "土"},
		{"地支": "寅", "後天卦": "艮", "方位": "東東北", "方位數": "45-75", "五行": "木"},
		{"地支": "卯", "後天卦": "震", "方位": "東", "方位數": "75-105", "五行": "木"},
		{"地支": "辰", "後天卦": "", "方位": "東東南", "方位數": "105-135", "五行": "土"},
		{"地支": "巳", "後天卦": "巽", "方位": "東南南", "方位數": "135-165", "五行": "火"},
		{"地支": "午", "後天卦": "離", "方位": "南", "方位數": "165-195", "五行": "火"},
		{"地支": "未", "後天卦": "", "方位": "西南南", "方位數": "195-225", "五行": "土"},
		{"地支": "申", "後天卦": "坤", "方位": "西西南", "方位數": "225-255", "五行": "金"},
		{"地支": "酉", "後天卦": "兌", "方位": "西", "方位數": "255-285", "五行": "金"},
		{"地支": "戌", "後天卦": "", "方位": "西西北", "方位數": "285-315", "五行": "土"}
	];
	
	if(地支數 >=0 && 地支數 <=11) 地支參考 = "卦位：" + 地支參考數據[地支數].後天卦 + "<br>" + "方位：" + 地支參考數據[地支數].方位 + "<br>" + "五行：" + 地支參考數據[地支數].五行;
	
	return 地支參考;
}  // end function 地支參考元件


function 宮位地支轉換(宮位, 地支矩陣){
    var 宮位地支數;
    for(var i=0; i < 12; i++){
        if(宮位 == 地支矩陣[i].宮位) 宮位地支數 = i;
    } // end for
    
    if(宮位地支數>=0 && 宮位地支數<12) {
        var 宮位地支 = {"地支數": 宮位地支數, "地支": 地支字數轉換(宮位地支數)};
        return 宮位地支;
    } // end if
} // end function 宮位地支轉換


function 人事宮字數轉換(人事宮){
    var 輸入數字=(isNaN(人事宮))? "字" : "數";  //輸入的是數還是字

    switch(輸入數字){
        case "字":
            switch(人事宮){
                case "父母宮": return 0;
                case "命宮": return 1;
                case "兄弟宮": return 2;
                case "夫妻宮": return 3;
                case "子女宮": return 4;
                case "財帛宮": return 5;
                case "疾厄宮": return 6;
                case "遷移宮": return 7;
                case "交友宮": return 8;
                case "官祿宮": return 9;
                case "田宅宮": return 10;
                case "福德宮": return 11;
                default:
                    alert(人事宮+"：人事宮字數轉換 錯誤");
                    return "";
            }  // end switch 字
        break;
        
        case "數":
            switch(人事宮){
                case 0: return "父母宮";
                case 1: return "命宮";
                case 2: return "兄弟宮";
                case 3: return "夫妻宮";
                case 4: return "子女宮";
                case 5: return "財帛宮";
                case 6: return "疾厄宮";
                case 7: return "遷移宮";
                case 8: return "交友宮";
                case 9: return "官祿宮";
                case 10: return "田宅宮";
                case 11: return "福德宮";
                default:
                    alert(人事宮+"：人事宮字數轉換 錯誤");
                    return "";
            }  // end switch 數    

    } // end switch 輸入數字
}  //function 人事宮字數轉換


function 大限人事宮字數轉換(大限序){
    switch(大限序){
        case 0: return "大 父";
        case 1: return "大 命";
        case 2: return "大 兄";
        case 3: return "大 夫";
        case 4: return "大 子";
        case 5: return "大 財";
        case 6: return "大 疾";
        case 7: return "大 遷";
        case 8: return "大 友";
        case 9: return "大 官";
        case 10: return "大 田";
        case 11: return "大 福";
        default:
            alert(大限序 + "：大限人事宮字數轉換 輸入錯誤");
            return "";
    }  // end switch 數 
} //end function 大限人事宮字數轉換


function 流年人事宮字數轉換(流年序, 單字){
    if(單字 === undefined) 單字 = true;
    var 流年宮名;
    
    switch(流年序){
        case 0: 流年宮名 = "流父"; break;
        case 1: 流年宮名 = "流命"; break;
        case 2: 流年宮名 = "流兄"; break;
        case 3: 流年宮名 = "流夫"; break;
        case 4: 流年宮名 = "流子"; break;
        case 5: 流年宮名 = "流財"; break;
        case 6: 流年宮名 = "流疾"; break;
        case 7: 流年宮名 = "流遷"; break;
        case 8: 流年宮名 = "流友"; break;
        case 9: 流年宮名 = "流官"; break;
        case 10: 流年宮名 = "流田"; break;
        case 11: 流年宮名 = "流福"; break;
        default:
            alert(流年序 + "：流年人事宮字數轉換 輸入錯誤");
            return "";
    }  // end switch 流年序
    
    if(單字) return 流年宮名.substr(1,1); else return 流年宮名;
} //end function 流年人事宮字數轉換


// ----------------------------------------------------
function 宮位轉六線(宮位){
	switch(宮位){
		case "命宮": case "遷移宮": return "命遷線";
		case "兄弟宮": case "交友宮": return "兄友線";
		case "夫妻宮": case "官祿宮": return "夫官線";
		case "子女宮": case "田宅宮": return "子田線";
		case "財帛宮": case "福德宮": return "財福線";
		case "疾厄宮": case "父母宮": return "父疾線";
		default: return "";
	} //end switch
} //end function 宮位轉六線


function 六線轉宮位(六線){
	var 宮位1;

	switch(六線){
		case "命遷線":
			宮位1 = "命宮";
			break;
		case "兄友線":
			宮位1 = "兄弟宮";
			break;
		case "夫官線":
			宮位1 = "夫妻宮";
			break;
		case "子田線":
			宮位1 = "子女宮";
			break;
		case "財福線":
			宮位1 = "財帛宮";
			break;
		case "父疾線":
			宮位1 = "父母宮";
			break;
		default:
			宮位1 = "";
	} // end switch

	var 宮位數2 = 人事宮字數轉換(宮位1); //宮位數2 = 地支滾動(宮位數2, -6);
	var 宮位2 = 人事宮字數轉換(地支滾動(宮位數2, 6));
	var 六線雙宮 = {"宮位1": 宮位1, "宮位2": 宮位2};
	
	//console.log(六線雙宮);
	return 六線雙宮;
} // end function 六線轉宮位


function 人事宮位挪移(參照宮位, 對應宮位){
    // 比方尋夫妻宮的田宅宮
	var 參照宮數 = 人事宮字數轉換(參照宮位);
	var 對應宮數 = 人事宮字數轉換(對應宮位);
	var 對應宮調整數 =  對應宮數 - 1;
	if (對應宮調整數 < 0) 對應宮調整數 = 11; //父母官

	var 挪移宮位數 = 地支滾動(參照宮數, 對應宮調整數);
	var 挪移宮位 = 人事宮字數轉換(挪移宮位數);

	return 挪移宮位;
}  // end function 人事宮位挪移


function 六線宮位光明成就子田分析(六線, 宮位){
    // 比方 父疾線是官祿宮的子田線
    
    var 六線宮位光明成就子田 = {
        "宮位": 宮位,
        "六線": 六線,
        "光明成就子田": ""
    };

	switch(六線){
		case "命遷線":
			switch(宮位){
                case "兄弟宮": case "交友宮":
                    六線宮位光明成就子田.光明成就子田 = "光明線";
                    break;
                case "父母宮": case "疾厄宮":
                    六線宮位光明成就子田.光明成就子田 = "成就線";
                    break;
                case "子女宮": case "田宅宮":
                    六線宮位光明成就子田.光明成就子田 = "子田線";
                    break;
            }  // end switch(宮位)
			break;
		case "兄友線":
			switch(宮位){
                case "夫妻宮": case "官祿宮":
                    六線宮位光明成就子田.光明成就子田 = "光明線";
                    break;
                case "命宮": case "遷移宮":
                    六線宮位光明成就子田.光明成就子田 = "成就線";
                    break;
                case "財帛宮": case "福德宮":
                    六線宮位光明成就子田.光明成就子田 = "子田線";
                    break;
            }  // end switch(宮位)
			break;
		case "夫官線":
			switch(宮位){
                case "子女宮": case "田宅宮":
                    六線宮位光明成就子田.光明成就子田 = "光明線";
                    break;
                case "兄弟宮": case "交友宮":
                    六線宮位光明成就子田.光明成就子田 = "成就線";
                    break;
                case "父母宮": case "疾厄宮":
                    六線宮位光明成就子田.光明成就子田 = "子田線";
                    break;
            }  // end switch(宮位)
			break;
		case "子田線":
			switch(宮位){
                case "財帛宮": case "福德宮":
                    六線宮位光明成就子田.光明成就子田 = "光明線";
                    break;
                case "夫妻宮": case "官祿宮":
                    六線宮位光明成就子田.光明成就子田 = "成就線";
                    break;
                case "命宮": case "遷移宮":
                    六線宮位光明成就子田.光明成就子田 = "子田線";
                    break;
            }  // end switch(宮位)
			break;
		case "財福線":
			switch(宮位){
                case "父母宮": case "疾厄宮":
                    六線宮位光明成就子田.光明成就子田 = "光明線";
                    break;
                case "子女宮": case "田宅宮":
                    六線宮位光明成就子田.光明成就子田 = "成就線";
                    break;
                case "兄弟宮": case "交友宮":
                    六線宮位光明成就子田.光明成就子田 = "子田線";
                    break;
            }  // end switch(宮位)
			break;
		case "父疾線":
			switch(宮位){
                case "命宮": case "遷移宮":
                    六線宮位光明成就子田.光明成就子田 = "光明線";
                    break;
                case "財帛宮": case "福德宮":
                    六線宮位光明成就子田.光明成就子田 = "成就線";
                    break;
                case "夫妻宮": case "官祿宮":
                    六線宮位光明成就子田.光明成就子田 = "子田線";
                    break;
            }  // end switch(宮位)
			break;
	} // end switch(六線)
	
	//console.log(六線宮位光明成就子田);
	return 六線宮位光明成就子田;
} // end function 六線宮位光明成就子田分析


function 人事宮位轉換(參照宮位, 轉換宮位, 命盤, 大限數){
    // check why this is needed in "function 宮位單向四化"
	// return 人事宮的地支數

	var 參照宮位地支數 = {"地支1": -1, "地支2": -1};
	var 參照人事宮位, 參照宮位命限="";
	var 參照人事宮位1 = "",   參照人事宮位2 = "";
	var 參照轉換人事宮位 = ""; 參照轉換宮位命限 = ""; 
	var 四化宮用線=false, 四化相對宮用線=false, 四化相對宮線字=""; 六線人事宮="";
	var 宮位名稱1="", 宮位名稱2="";
	var err;

	var 轉換的宮位={
		"地支數1": -1,
		"地支數2": -1,
		"地支1": "",
		"地支2": "",
		"宮位1": "",
		"宮位2": "",
		"參照宮位": 參照宮位,
		"轉換宮位": 轉換宮位
	};

	if(大限數 === undefined) 大限數 = 命盤.運行.大限數;
	if(轉換宮位 === undefined || 轉換宮位=="") 轉換宮位="命宮";
	
	var 檢查輸入宮位 = 檢查宮位線(參照宮位, true);
	if(檢查輸入宮位.正確){
		參照宮位命限 = 檢查輸入宮位.命限;
		參照人事宮位 = 檢查輸入宮位.人事宮;
		四化宮用線 = 檢查輸入宮位.六線;
	} else {
		alert(參照宮位+"：輸入的宮位線 錯誤！");
		return 轉換的宮位;
	}  // end if
	
	//console.log(檢查輸入宮位);
	
	var 檢查轉換宮位 = 檢查宮位線(轉換宮位, false);
	if(檢查轉換宮位.正確){
		參照轉換宮位命限 = 檢查轉換宮位.命限;
		參照轉換人事宮位 = 檢查轉換宮位.人事宮;
		四化相對宮用線 = 檢查轉換宮位.六線;
	} else {
		alert(轉換宮位+"：輸入的宮位線 錯誤！");
		return 轉換的宮位;
	} // end if
	//console.log(檢查轉換宮位);
	
    
	if(!四化宮用線 && !四化相對宮用線) { //參照宮位是宮位
		參照宮位地支數.地支1 = 人事宮位挪移地支數(參照宮位, 轉換宮位, 命盤, 大限數, 0);
		參照宮位地支數.地支2 = -1;

		宮位名稱1=人事宮位挪移(參照人事宮位, 轉換宮位);

	}  // end if(!四化宮用線 && !四化相對宮用線) 


	if(!四化宮用線 && 四化相對宮用線) { //參照宮位是宮位, 但是轉換的是線，比方化入子女的子田線
        // ----
	}  // end if(!四化宮用線 && 四化相對宮用線) 

    
	if(四化宮用線) { //參照宮位是線
		轉換宮位 = "命宮"; // 如果參照宮位是線，就不能再轉換宮位，比方化入兄友線，就沒有兄友線的財帛宮這回事
		六線人事宮 = 六線轉宮位(參照人事宮位);

		參照人事宮位1 = 參照宮位命限 + 六線人事宮.宮位1;
		參照人事宮位2 = 參照宮位命限 + 六線人事宮.宮位2;

		宮位名稱1 = 參照人事宮位1;
		宮位名稱2 = 參照人事宮位2;

		參照宮位地支數.地支1 = 人事宮位挪移地支數(參照人事宮位1, 轉換宮位, 命盤, 大限數, 0);
		參照宮位地支數.地支2 = 人事宮位挪移地支數(參照人事宮位2, 轉換宮位, 命盤, 大限數, 0);

	}  // end if(!四化宮用線 && !四化相對宮用線) 


	if(四化相對宮用線) { //參照宮位是宮位+先對線
		//console.log("參照宮位是宮位+先對線");
		六線人事宮 = 六線轉宮位(參照轉換人事宮位);

		//參照人事宮位1 = 六線人事宮.宮位1;
		//參照人事宮位2 = 六線人事宮.宮位2;

		宮位名稱1 = 參照宮位命限 + 人事宮位挪移(參照人事宮位, 六線人事宮.宮位1);
		宮位名稱2 = 參照宮位命限 + 人事宮位挪移(參照人事宮位, 六線人事宮.宮位2);

		參照宮位地支數.地支1 = 人事宮位挪移地支數(參照宮位, 六線人事宮.宮位1, 命盤, 大限數, 0);
		參照宮位地支數.地支2 = 人事宮位挪移地支數(參照宮位, 六線人事宮.宮位2, 命盤, 大限數, 0);
		//console.log("用線，" + "地支1：" + 參照宮位地支數.地支1 + "地支2：" + 參照宮位地支數.地支2);
	}  // end if(!四化宮用線 && !四化相對宮用線) 

	/*
	if(!(參照宮位地支數.地支1 >=0 && 參照宮位地支數.地支1 < 12)){
		console.log("宮位轉換錯誤："+參照宮位+"的"+轉換宮位+"轉換出來的地支為："+參照宮位地支數);
		return -1;
	} //end if 參照宮位地支數 error
	*/

	轉換的宮位.地支數1 = 參照宮位地支數.地支1;
	轉換的宮位.地支數2 = 參照宮位地支數.地支2;
	轉換的宮位.地支1 = 地支字數轉換(參照宮位地支數.地支1);
	轉換的宮位.地支2 = (轉換的宮位.地支數2 >=0) ? 地支字數轉換(參照宮位地支數.地支2) : "";
	轉換的宮位.宮位1 = 宮位名稱1;
	轉換的宮位.宮位2 = 宮位名稱2;

	return 轉換的宮位;
}  //end function 人事宮位轉換


function 檢查宮位線(輸入宮位線, 運限){
    
	//檢查輸入的宮位是否是人事12宮或六線，而且是否可以帶運限
    //may be not used !!, just to support "單向四化 function"
	if(運限 === undefined) 運限 = true;
	var 命限 = "", 人事宮位 = "", 輸入宮位線字 ="";
	//var 輸入六線 = false, 輸入宮位 = false;
	
	var 確認輸入宮位線 = {
		"輸入宮位線": 輸入宮位線,
		"輸入運限": 運限,
		"命限": "",
		"正確": false,
		"宮位": false,
		"六線": false,
		"人事宮": ""
	};
	
	if(輸入宮位線.length>3 && 運限) {
		命限 = 輸入宮位線.substr(0,2);
		人事宮位 = 輸入宮位線.substr(2, 輸入宮位線.length-2);
	} else 人事宮位 = 輸入宮位線;
	
	if(輸入宮位線.length>3 && !運限) {
		alert(輸入宮位線 + "：輸入不協調，說明不含運限，但輸入卻帶運限");
		console.log(確認輸入宮位線);
		return 確認輸入宮位線;
	}
	
	/*
	輸入宮位線字 = 人事宮位.substr(人事宮位.length - 1, 1);
	if(輸入宮位線字 == "宮") 確認輸入宮位線.宮位 = true;
	if(輸入宮位線字 == "線") 確認輸入宮位線.六線 = true;
	*/
	
	var 命限正確 = false;
	if(命限 == "" || 命限 == "大限" || 命限 == "流年") {
		命限正確 = true;
		確認輸入宮位線.命限 = 命限;
	} else {
		alert(輸入宮位線 + "：輸入的命限字錯誤 ！");
		return 確認輸入宮位線;
	}
	
	if(人事宮位 == "命宮" || 人事宮位 == "兄弟宮" || 人事宮位 == "夫妻宮" || 人事宮位 == "子女宮" || 人事宮位 == "財帛宮" || 人事宮位 == "疾厄宮" || 人事宮位 == "遷移宮" || 人事宮位 == "交友宮" || 人事宮位 == "官祿宮" || 人事宮位 == "田宅宮" || 人事宮位 == "福德宮" || 人事宮位 == "父母宮") {
		確認輸入宮位線.宮位 = true;
		確認輸入宮位線.人事宮 = 人事宮位;
	}  //end if 人事宮位 is 宮 and correct
	
	if(人事宮位 == "命遷線" || 人事宮位 == "兄友線" || 人事宮位 == "夫官線" || 人事宮位 == "子田線" || 人事宮位 == "財福線" || 人事宮位 == "父疾線"){
		確認輸入宮位線.六線 = true;
		確認輸入宮位線.人事宮 = 人事宮位;
	} //end if 人事宮位 is 線 and correct

	
	if((確認輸入宮位線.宮位 || 確認輸入宮位線.六線) && 命限正確) {
		確認輸入宮位線.正確 = true;
	} else {
		alert(輸入宮位線 + "：輸入宮位或六線名稱錯誤 ！！");
	} // end else
	
	return 確認輸入宮位線;
} // end function 檢查宮位線


function 人事宮位挪移地支數(參照宮位, 對應宮位, 命盤, 大限數, 大限流年數){
    // may be not used !! just to support "function 單向四化"
	var 參照宮位命限="", 參照人事宮位="";
	var 參照宮位地支數; if(大限數===undefined) 大限數=命盤.運行.大限數;

	if(大限流年數===undefined) 大限流年數=0;

	if(參照宮位.length>3){
		參照宮位命限=參照宮位.substr(0,2);
		參照人事宮位=參照宮位.substr(2,參照宮位.length-2);}
		else 參照人事宮位=參照宮位;

		if(參照宮位命限=="大限" || 參照宮位命限=="流年") {
			if(參照宮位命限=="大限") 參照宮位地支數=命盤.大限[大限數].人事宮[參照人事宮位];
			//if(參照宮位命限=="流年") 
		} 	else 參照宮位地支數=命盤.人事宮[參照人事宮位].地支數;

		var 對應宮數= 人事宮字數轉換(對應宮位);
		var 對應宮調整數= 對應宮數-1;
		if(對應宮調整數<0) 對應宮調整數=11;
		var 挪移宮位數=地支滾動(參照宮位地支數,(-1) * 對應宮調整數);

		return 挪移宮位數;
}  //end function 人事宮位挪移地支數


function 檢測單向四化(單向四化, 命盤){
    // may be not used !! just to support "function 單向四化"
	var 單向四化成立 = false, 化出宮重疊成立 = false, 化入宮重疊成立 = false;
	單向四化.成立 = false;
	單向四化.星曜 = "";
	
	//console.log(單向四化);

	switch(單向四化.四化){
		case "化祿":
			var 祿入宮=命盤.地支宮位[單向四化.化出宮地支數].宮干四化.祿出.地支數;
			for (var i=0; i<祿入宮.length; i++){
				if(祿入宮[i] == 單向四化.化入宮地支數1 || 祿入宮[i] == 單向四化.化入宮地支數2){
					單向四化成立 = true;
					單向四化.星曜 = 命盤.地支宮位[單向四化.化出宮地支數].宮干四化.化祿星;
				}
			} // end for
			break;

		case "化權":
			var 權入宮=命盤.地支宮位[單向四化.化出宮地支數].宮干四化.權出.地支數;
			for (var i=0; i<權入宮.length; i++){
				if(權入宮[i] == 單向四化.化入宮地支數1 || 權入宮[i] == 單向四化.化入宮地支數2){
					單向四化成立 = true;
					單向四化.星曜 = 命盤.地支宮位[單向四化.化出宮地支數].宮干四化.化權星;
				}
			} // end for
			break;

		case "化科":
			var 科入宮=命盤.地支宮位[單向四化.化出宮地支數].宮干四化.科出.地支數;
			for (var i=0; i<科入宮.length; i++){
				if(科入宮[i] == 單向四化.化入宮地支數1 || 科入宮[i] == 單向四化.化入宮地支數2){
					單向四化成立 = true;
					單向四化.星曜 = 命盤.地支宮位[單向四化.化出宮地支數].宮干四化.化科星;
				}
			} // end for
			break;

		case "化忌":
			var 忌入宮=命盤.地支宮位[單向四化.化出宮地支數].宮干四化.忌出.地支數;
			for (var i=0; i<忌入宮.length; i++){
				if(忌入宮[i] == 單向四化.化入宮地支數1 || 忌入宮[i] == 單向四化.化入宮地支數2){
					單向四化成立 = true;
					單向四化.星曜 = 命盤.地支宮位[單向四化.化出宮地支數].宮干四化.化忌星;
				}
			} // end for
			break;

		case "忌沖":
			var 忌沖宮=命盤.地支宮位[單向四化.化出宮地支數].宮干四化.忌出沖.地支數;
			//console.log("忌沖宮：" + 忌沖宮);
			for (var i=0; i<忌沖宮.length; i++){
				if(忌沖宮[i] == 單向四化.化入宮地支數1 || 忌沖宮[i] == 單向四化.化入宮地支數2){
					單向四化成立 = true;
					單向四化.星曜 = 命盤.地支宮位[單向四化.化出宮地支數].宮干四化.化忌星;
				}
				
			} // end for
			break;


	} //end switch

	// ******************************************************************************************
	if(單向四化.化出宮重疊 !=""){
		var 重疊宮線 = 檢查宮位線(單向四化.化出宮重疊, true);

		if(重疊宮線.正確) {
			if(重疊宮線.六線) {
				var 重疊六線人事宮 = 六線轉宮位(重疊宮線.人事宮);
				if(重疊宮線.命限==""){  //重疊本命六線
					var 重疊地支1 = 命盤.人事宮[重疊六線人事宮.宮位1].地支數;
					var 重疊地支2 = 命盤.人事宮[重疊六線人事宮.宮位2].地支數;

					if(單向四化.化出宮地支數 == 重疊地支1 || 單向四化.化出宮地支數 == 重疊地支2) 化出宮重疊成立 = true;
				} //end if 重疊宮線.命限

				if(重疊宮線.命限=="大限"){  //重疊大限六線
					var 重疊地支1 = 命盤.大限[單向四化.大限數].人事宮[重疊六線人事宮.宮位1];
					var 重疊地支2 = 命盤.大限[單向四化.大限數].人事宮[重疊六線人事宮.宮位2];

					if(單向四化.化出宮地支數 == 重疊地支1 || 單向四化.化出宮地支數 == 重疊地支2) 化出宮重疊成立 = true;
				} //end if 重疊宮線.命限
			}  //if 重疊宮線.六線

			if(重疊宮線.宮位) {  //重疊本命宮位
				if(重疊宮線.命限==""){  //重疊本命六線
					var 重疊地支1 = 命盤.人事宮[重疊宮線.人事宮].地支數;
					if(單向四化.化出宮地支數 == 重疊地支1) 化出宮重疊成立 = true;
				} //end if 重疊宮線.命限
				if(重疊宮線.命限=="大限"){  //重疊大限六線
					var 重疊地支1 = 命盤.大限[單向四化.大限數].人事宮[重疊宮線.人事宮];
					if(單向四化.化出宮地支數 == 重疊地支1) 化出宮重疊成立 = true;
				} //end if 重疊宮線.命限			
			} //end if 重疊宮線.宮位
		} //end if 重疊宮線.正確
		else {
			console.log(單向四化.化出宮重疊 + "：輸入的化出宮位重疊錯誤，程式不考慮重疊宮位的條件！！");
			單向四化.化出宮重疊 ="";
		}  //end else
	}  // end if 單向四化.化出宮重疊

	// ------------------------------------------------------------------------------------------
	if(單向四化.化入宮重疊 !=""){
		var 化入宮重疊宮線 = 檢查宮位線(單向四化.化入宮重疊, true);
		//console.log(化入宮重疊宮線);
		if(化入宮重疊宮線.正確) {
			if(化入宮重疊宮線.六線) {
				if(化入宮重疊宮線.命限==""){  //重疊本命六線
					if(命盤.地支宮位[單向四化.化入宮地支數1].六線 == 化入宮重疊宮線.人事宮) 化入宮重疊成立 = true;
				} // end if 化入宮重疊宮線.命限

				if(化入宮重疊宮線.命限=="大限"){  //重疊大限六線
					if(命盤.大限[單向四化.大限數].地支[單向四化.化入宮地支數1].六線 == 化入宮重疊宮線.人事宮) 化入宮重疊成立 = true;
				} // end if 化入宮重疊宮線.命限
			}  // end if 化入宮重疊宮線.六線

			if(化入宮重疊宮線.宮位) {
				if(化入宮重疊宮線.命限==""){  //重疊本命六線
					if(命盤.地支宮位[單向四化.化入宮地支數1].宮位 == 化入宮重疊宮線.人事宮) 化入宮重疊成立 = true;
				} // end if 化入宮重疊宮線.命限

				if(化入宮重疊宮線.命限=="大限"){  //重疊大限六線
					//console.log(化入宮重疊宮線.人事宮);
					//console.log(命盤.大限[單向四化.大限數].地支[單向四化.化入宮地支數1].人事宮);
					if(命盤.大限[單向四化.大限數].地支[單向四化.化入宮地支數1].人事宮 == 化入宮重疊宮線.人事宮) 化入宮重疊成立 = true;
				} // end if 化入宮重疊宮線.命限
			}  // end if 化入宮重疊宮線.宮位
		}  // end if 化入宮重疊宮線.正確
		else {
			console.log(單向四化.化入宮重疊 + "：輸入的化入宮位重疊錯誤，程式不考慮重疊宮位的條件！！");
			單向四化.化入宮重疊 ="";
		}  //end else
	} // end if 單向四化.化入宮重疊

	// ------------------------------------------------------------------------------------------

	if(單向四化.化出宮重疊 =="") 化出宮重疊成立=true;
	if(單向四化.化入宮重疊 =="") 化入宮重疊成立=true;
	// ******************************************************************************************
	//console.log("單向四化成立：" + 單向四化成立 + "\n化出宮重疊成立：" + 化出宮重疊成立 + "\n化入宮重疊成立：" + 化入宮重疊成立);
	if(單向四化成立 && 化出宮重疊成立 && 化入宮重疊成立) 單向四化.成立 = true;

} //end function 檢測單向四化


// ----------------------------------------------------

function 尋三合方(輸入宮位地支){
	var category = "";
	var 三合組 = {
		"三合簡短": "",
		"三合": "",
		"三合矩陣": []
	};

	if(輸入宮位地支 == "命宮" || 輸入宮位地支 == "兄弟宮" || 輸入宮位地支 == "夫妻宮" || 輸入宮位地支 == "子女宮" || 輸入宮位地支 == "財帛宮" || 輸入宮位地支 == "疾厄宮" || 輸入宮位地支 == "遷移宮" || 輸入宮位地支 == "交友宮" || 輸入宮位地支 == "官祿宮" || 輸入宮位地支 == "田宅宮" || 輸入宮位地支 == "福德宮" || 輸入宮位地支 == "父母宮") category = "人事宮";
	if(輸入宮位地支 == "命" || 輸入宮位地支 == "兄" || 輸入宮位地支 == "夫" || 輸入宮位地支 == "子" || 輸入宮位地支 == "財" || 輸入宮位地支 == "疾" || 輸入宮位地支 == "遷" || 輸入宮位地支 == "友" || 輸入宮位地支 == "官" || 輸入宮位地支 == "田" || 輸入宮位地支 == "福" || 輸入宮位地支 == "父") category = "人事宮";
    if(輸入宮位地支 == "子" || 輸入宮位地支 == "丑" || 輸入宮位地支 == "寅" || 輸入宮位地支 == "卯" || 輸入宮位地支 == "辰" || 輸入宮位地支 == "巳" || 輸入宮位地支 == "午" || 輸入宮位地支 == "未" || 輸入宮位地支 == "申" || 輸入宮位地支 == "酉" || 輸入宮位地支 == "戌" || 輸入宮位地支 == "亥") category = "地支";

	switch(category){
		case "人事宮":
			switch(輸入宮位地支){
				case "命宮": case "財帛宮": case "官祿宮": case "命": case "財": case "官": 
					三合組.三合簡短 = "命財官";
					三合組.三合 = "命宮、財帛宮、官祿宮";
					三合組.三合矩陣.push("命宮"); 三合組.三合矩陣.push("財帛宮"); 三合組.三合矩陣.push("官祿宮"); 
					break;
				case "田宅宮": case "疾厄宮": case "兄弟宮": case "田": case "疾": case "兄":
					三合組.三合簡短 = "田疾兄";
					三合組.三合 = "田宅宮、疾厄宮、兄弟宮";
					三合組.三合矩陣.push("田宅宮"); 三合組.三合矩陣.push("疾厄宮"); 三合組.三合矩陣.push("兄弟宮"); 
					break;
				case "夫妻宮": case "遷移宮": case "福德宮": case "夫": case "遷": case "福":
					三合組.三合簡短 = "夫遷福";
					三合組.三合 = "夫妻宮、遷移宮、福德宮";
					三合組.三合矩陣.push("夫妻宮"); 三合組.三合矩陣.push("遷移宮"); 三合組.三合矩陣.push("福德宮"); 
					break;
				case "父母宮": case "子女宮": case "交友宮": case "父": case "子": case "友": 
					三合組.三合簡短 = "父子友";
					三合組.三合 = "父母宮、子女宮、交友宮";
					三合組.三合矩陣.push("父母宮"); 三合組.三合矩陣.push("子女宮"); 三合組.三合矩陣.push("交友宮"); 
					break;
			} // end switch 人事宮
			break;

		case "地支":
			switch(輸入宮位地支){
				case "申": case "子": case "辰": 
					三合組.三合簡短 = "申子辰";
					三合組.三合 = "申子辰三合水";
					三合組.三合矩陣.push("申"); 三合組.三合矩陣.push("子"); 三合組.三合矩陣.push("辰"); 
					break;
				case "亥": case "卯": case "未": 
					三合組.三合簡短 = "亥卯未";
					三合組.三合 = "亥卯未三合木";
					三合組.三合矩陣.push("亥"); 三合組.三合矩陣.push("卯"); 三合組.三合矩陣.push("未"); 
					break;
				case "寅": case "午": case "戌": 
					三合組.三合簡短 = "寅午戌";
					三合組.三合 = "寅午戌三合火";
					三合組.三合矩陣.push("寅"); 三合組.三合矩陣.push("午"); 三合組.三合矩陣.push("戌"); 
					break;
				case "巳": case "酉": case "丑": 
					三合組.三合簡短 = "巳酉丑";
					三合組.三合 = "巳酉丑三合金";
					三合組.三合矩陣.push("巳"); 三合組.三合矩陣.push("酉"); 三合組.三合矩陣.push("丑"); 
					break;
			} // end switch 地支
			break;
	} // end switch category
	return 三合組;
} // end function 尋三合方



// -------------------------------------------------------------------------------

function 宮位分解(輸入的人事宮位, 大限數){
	//看輸入的宮位的流運，本命宮位，是否正確
	//比方輸入: "大限財帛宮"，則流運="大限"，人事宮="財帛宮", 正確=True
	var 流運="", 宮名="", 地支數 = -1, 流運正確 = false, 宮名正確 = false;

	if(輸入的人事宮位.length>3) {
		流運 = 輸入的人事宮位.substr(0,2);
		if(流運=="大限" || 流運=="流年" || 流運=="流月") 流運正確=true;
		宮名 = 輸入的人事宮位.substr(2,輸入的人事宮位.length-2);
	} else {
		流運正確=true;
		宮名 = 輸入的人事宮位;
	}

	if(宮名 == "命宮" || 宮名 == "兄弟宮" || 宮名 == "夫妻宮" || 宮名 == "子女宮" || 宮名 == "財帛宮" || 宮名 == "疾厄宮" || 宮名 == "遷移宮" || 宮名 == "交友宮" || 宮名 == "官祿宮" || 宮名 == "田宅宮" || 宮名 == "福德宮" || 宮名 == "父母宮") 宮名正確 = true;

	var 宮位解析 = {
		"流運": 流運,
		"宮名": 宮名,
		"正確": 流運正確 && 宮名正確
	};

	//console.log(宮位解析);
	return 宮位解析;
}  //end function 宮位分解


//-----------------------------------------------------------------------------