function 斗數命盤架構(輸入資料, 系統設定){
    //this.運行參數=new 系統參數設定();

    var 輸入生日 = new 日期格式(輸入資料.西曆日期);
    var 干支曆 = 西曆轉換干支曆(輸入資料);
    var 農曆 = 西曆轉換農曆(輸入資料.西曆日期, "", true, false, false, false, false);
    var 陰曆 = 農曆轉換陰曆(農曆);
    var ErrorLog = [];

    var 曆法={
        "干支曆": 干支曆,
        "農曆": 農曆,
        "陰曆": 陰曆,
        "備註": ""
    } // end 曆法 obj

    //console.log(曆法.陰曆);
    //***************************** 生日 *****************************
    //this.姓名=輸入資料.姓名;
    this.輸入資料 = 輸入資料;
    this.曆法 = 曆法;
    this.運行 = {
        "大限數": -1,
        "流年數": -1,
        "流年地支數": -1,
        "流年十神": "",
        "大限流年矩陣數": -1,
        "大限": false,  // 是否顯示了大限
        "流年": false,
        "流年干支": "",
        "中宮菜單": 1,  //center court menu
        "宮干MouseDown": -1,  // 那個地支的宮干是mousedown
        "架構飛四化分析": ""
    }; // end this.運行

    var 調整陰曆時 = (曆法.陰曆.時.length > 1) ? 曆法.陰曆.時.substr(1,1) : 曆法.陰曆.時;  //去掉早子夜子
    
    this.生日 = {
        "西曆生日": 輸入資料.西曆日期,
        "運算生日": 曆法.干支曆.運算的西曆,
        "西曆生日格式": new 日期格式(輸入資料.西曆日期),
        "西曆年": 輸入生日.Year,
        "生日年": (曆法.陰曆.騎年) ? 輸入生日.Year - 1 : 輸入生日.Year,
        "西曆月": 輸入生日.Month,
        "西曆日": 輸入生日.Day,
        "西曆時": 輸入生日.Hour,
        "西曆分": 輸入生日.Minute,
        "西曆中文": (輸入資料.西曆日期.getSeconds()==1) ? 輸入生日.西曆日期 : 輸入生日.西曆, //西曆顯示, //輸入生日.西曆,
        "西曆英文": 輸入生日.MalaysiaDate,
        "性別": 輸入資料.性別,
        "星座": 尋星座(輸入生日.Month, 輸入生日.Day, 1),
        "星座代號": 尋星座(輸入生日.Month, 輸入生日.Day, 3), //zodiac sign
        "陰曆": 曆法.陰曆.陰曆日期,
        "陰曆年": 曆法.陰曆.干支年,
        "陰曆月": 曆法.陰曆.月,
        "陰曆閏月": 曆法.陰曆.閏月,
        "陰曆日": 曆法.陰曆.日,
        "陰曆時": 調整陰曆時,
        "陰曆時數": 地支字數轉換(調整陰曆時),
        "生肖": 曆法.陰曆.生肖,
        "閏年": 曆法.陰曆.閏年,
        "備註": ""
    };  //end this.生日

    this.八字 = 曆法.干支曆.四柱;
    this.日主 = 曆法.干支曆.四柱.substr(4,1);
    this.命局 = new 命局元件();
    this.生年天干 = this.生日.陰曆年.substr(0,1);
    this.生年天干數 = 天干字數轉換(this.生年天干);
    this.陽男陰女 = 尋陽男陰女(this.生日.性別, this.生日.陰曆年.substr(1,1));
    this.行運順逆=尋行運順逆(this.陽男陰女);
    this.命宮地支數 = 尋命宮地支數(this.生日.陰曆月, this.生日.陰曆時);

    this.人事宮 = new 十二人事宮位();
    this.星曜 = new 星曜初始();
    
    this.地支宮位 = [];  // 12 地支宮位的矩陣
    for(var i=0; i<12; i++){
        this.地支宮位.push(new 地支宮位元件(i));
    }  // end for i

    填寫宮干四化(this.地支宮位, this.生年天干數);  // 填寫12地支宮位的宮干
    填寫人事宮位(this.地支宮位, this.人事宮, this.命宮地支數);

    this.五行局 = 尋五行局(this.人事宮.命宮.天干數, this.人事宮.命宮.地支數);
	//console.log(this.生日.陰曆月 + "" + this.生日.陰曆日);
    this.紫微位置 = 尋紫微地支(this.生日.陰曆日, this.五行局.局名);

    //DSIntegrityAudit(this);
    //shhpIntegrityAudit(this.設定.hash, this.設定.imghash, this.設定.橫盤橫幅, 安星元件, 系統.設定.運行狀態);
    
    安十四主星(this.紫微位置.地支, this.地支宮位, this.星曜);
    
    安輔弼(this.生日.陰曆月, this.地支宮位, this.星曜);
    安昌曲(this.生日.陰曆時數, this.地支宮位, this.星曜);
    尋空宮(this.地支宮位);
	
    // 更新星曜落在的宮位

    刷新星曜宮位(this.星曜, this.地支宮位);
    
    安生年四化(this.生年天干, this.地支宮位, this.人事宮, this.星曜);
    尋宮干四化(this.地支宮位, this.星曜);
    
    刷新宮位(this.人事宮, this.地支宮位);
    
    宮位四化分析(this);
    
	//尋自化流出(this.地支宮位, this.星曜);
    //尋沖自身六線(this.地支宮位);
    //尋自身一六互沖(this.地支宮位);
    
    
    this.大限 = []; 
    for(var i=0; i<13; i++){
        this.大限.push(new 大限元件(i));
    }  // end for i
	
    安大限(this.大限, this.生日.陰曆年, this.命宮地支數, this.五行局.局數, this.陽男陰女, this.地支宮位);
    安流年(this.大限, this.生日.生日年, this.生日.陰曆年, this.五行局.局數, this.日主, this.生日.騎年);
	
    計算當下大限流年(this.生日.生日年, this.五行局.局數, this.運行, this.大限);
    
    // **** 填寫命局 *****
    var 紫微基數 = (this.紫微位置.地支數 !=0) ? (this.紫微位置.地支數 - 1) * 12 : 11 * 12;
    var 命盤基數 = (this.命宮地支數 !=0) ? this.命宮地支數 : 12;
    this.命局.局數 = 紫微基數 + 命盤基數;

} // end function 斗數命盤架構


// ------------------------------





function 尋紫微地支(陰曆生日, 五行局) {
    var 紫微地支矩陣 = [
        { "生日": 1, "水二局": "丑", "木三局": "辰", "金四局": "亥", "土五局": "午", "火六局": "酉"},
        { "生日": 2, "水二局": "寅", "木三局": "丑", "金四局": "辰", "土五局": "亥", "火六局": "午"},
        { "生日": 3, "水二局": "寅", "木三局": "寅", "金四局": "丑", "土五局": "辰", "火六局": "亥"},
        { "生日": 4, "水二局": "卯", "木三局": "巳", "金四局": "寅", "土五局": "丑", "火六局": "辰"},
        { "生日": 5, "水二局": "卯", "木三局": "寅", "金四局": "子", "土五局": "寅", "火六局": "丑"},
        { "生日": 6, "水二局": "辰", "木三局": "卯", "金四局": "巳", "土五局": "未", "火六局": "寅"},
        { "生日": 7, "水二局": "辰", "木三局": "午", "金四局": "寅", "土五局": "子", "火六局": "戌"},
        { "生日": 8, "水二局": "巳", "木三局": "卯", "金四局": "卯", "土五局": "巳", "火六局": "未"},
        { "生日": 9, "水二局": "巳", "木三局": "辰", "金四局": "丑", "土五局": "寅", "火六局": "子"},
        { "生日": 10, "水二局": "午", "木三局": "未", "金四局": "午", "土五局": "卯", "火六局": "巳"},
        { "生日": 11, "水二局": "午", "木三局": "辰", "金四局": "卯", "土五局": "申", "火六局": "寅"},
        { "生日": 12, "水二局": "未", "木三局": "巳", "金四局": "辰", "土五局": "丑", "火六局": "卯"},
        { "生日": 13, "水二局": "未", "木三局": "申", "金四局": "寅", "土五局": "午", "火六局": "亥"},
        { "生日": 14, "水二局": "申", "木三局": "巳", "金四局": "未", "土五局": "卯", "火六局": "申"},
        { "生日": 15, "水二局": "申", "木三局": "午", "金四局": "辰", "土五局": "辰", "火六局": "丑"},
        { "生日": 16, "水二局": "酉", "木三局": "酉", "金四局": "巳", "土五局": "酉", "火六局": "午"},
        { "生日": 17, "水二局": "酉", "木三局": "午", "金四局": "卯", "土五局": "寅", "火六局": "卯"},
        { "生日": 18, "水二局": "戌", "木三局": "未", "金四局": "申", "土五局": "未", "火六局": "辰"},
        { "生日": 19, "水二局": "戌", "木三局": "戌", "金四局": "巳", "土五局": "辰", "火六局": "子"},
        { "生日": 20, "水二局": "亥", "木三局": "未", "金四局": "午", "土五局": "巳", "火六局": "酉"},
        { "生日": 21, "水二局": "亥", "木三局": "申", "金四局": "辰", "土五局": "戌", "火六局": "寅"},
        { "生日": 22, "水二局": "子", "木三局": "亥", "金四局": "酉", "土五局": "卯", "火六局": "未"},
        { "生日": 23, "水二局": "子", "木三局": "申", "金四局": "午", "土五局": "申", "火六局": "辰"},
        { "生日": 24, "水二局": "丑", "木三局": "酉", "金四局": "未", "土五局": "巳", "火六局": "巳"},
        { "生日": 25, "水二局": "丑", "木三局": "子", "金四局": "巳", "土五局": "午", "火六局": "丑"},
        { "生日": 26, "水二局": "寅", "木三局": "酉", "金四局": "戌", "土五局": "亥", "火六局": "戌"},
        { "生日": 27, "水二局": "寅", "木三局": "戌", "金四局": "未", "土五局": "辰", "火六局": "卯"},
        { "生日": 28, "水二局": "卯", "木三局": "丑", "金四局": "申", "土五局": "酉", "火六局": "申"},
        { "生日": 29, "水二局": "卯", "木三局": "戌", "金四局": "午", "土五局": "午", "火六局": "巳"},
        { "生日": 30, "水二局": "辰", "木三局": "亥", "金四局": "亥", "土五局": "未", "火六局": "午"}
    ];

    var 資料索引=_.findIndex(紫微地支矩陣, {生日: 陰曆生日});
    if (資料索引 != -1) {
        var 紫微地支 = 紫微地支矩陣[資料索引][五行局];
        var 紫微地支元件 = {
            "地支": 紫微地支,
            "地支數": 地支字數轉換(紫微地支),
            "五行局": 五行局,
            "生日": 陰曆生日
        };
        return 紫微地支元件;
    }  //end if
    else alert(陰曆生日 + "，" + 五行局 + "紫微地支計算錯誤！");
}  //end function 尋紫微地支


function 安十四主星(紫微地支, 地支矩陣, 星曜) {
    //紫微地支: 子、丑，寅、卯 .......
    //console.log(地支矩陣);
    
    switch(紫微地支) {
        case "子":
            //亥宮
            地支矩陣[0].星曜.push("天機");
            星曜["天機"].地支數 = 0; 星曜["天機"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("紫微");
            星曜["紫微"].地支數 = 1; 星曜["紫微"].地支 = "子";

            //丑宮
            地支矩陣[2].無主星 = true;

            //寅宮
            地支矩陣[3].星曜.push("破軍");
            星曜["破軍"].地支數 = 3; 星曜["破軍"].地支 = "寅";          

            //卯宮
            地支矩陣[4].無主星 = true;

            //辰宮
            地支矩陣[5].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 5; 星曜["廉貞"].地支 = "辰";
            地支矩陣[5].星曜.push("天府");
            星曜["天府"].地支數 = 5; 星曜["天府"].地支 = "辰"; 

            //巳宮
            地支矩陣[6].星曜.push("太陰");
            星曜["太陰"].地支數 = 6; 星曜["太陰"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 7; 星曜["貪狼"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("天同");
            星曜["天同"].地支數 = 8; 星曜["天同"].地支 = "未";
            地支矩陣[8].星曜.push("巨門");
            星曜["巨門"].地支數 = 8; 星曜["巨門"].地支 = "未";

            //申宮
            地支矩陣[9].星曜.push("武曲");
            星曜["武曲"].地支數 = 9; 星曜["武曲"].地支 = "申";
            地支矩陣[9].星曜.push("天相");
            星曜["天相"].地支數 = 9; 星曜["天相"].地支 = "申";

            //酉宮
            地支矩陣[10].星曜.push("太陽");
            星曜["太陽"].地支數 = 10; 星曜["太陽"].地支 = "酉";
            地支矩陣[10].星曜.push("天梁");
            星曜["天梁"].地支數 = 10; 星曜["天梁"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("七殺");
            星曜["七殺"].地支數 = 11; 星曜["七殺"].地支 = "戌";
            break;

        case "丑":
            //亥宮
            地支矩陣[0].無主星 = true;

            //子宮
            地支矩陣[1].星曜.push("天機");
            星曜["天機"].地支數 = 1; 星曜["天機"].地支 = "子";

            //丑宮
			地支矩陣[2].星曜.push("紫微");
            星曜["紫微"].地支數 = 2; 星曜["紫微"].地支 = "丑";
            地支矩陣[2].星曜.push("破軍");
            星曜["破軍"].地支數 = 2; 星曜["破軍"].地支 = "丑";

            //寅宮
            地支矩陣[3].無主星 = true;          

            //卯宮
            地支矩陣[4].星曜.push("天府");
            星曜["天府"].地支數 = 4; 星曜["天府"].地支 = "卯";

            //辰宮
            地支矩陣[5].星曜.push("太陰");
            星曜["太陰"].地支數 = 5; 星曜["太陰"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 6; 星曜["廉貞"].地支 = "巳";
			地支矩陣[6].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 6; 星曜["貪狼"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("巨門");
            星曜["巨門"].地支數 = 7; 星曜["巨門"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("天相");
            星曜["天相"].地支數 = 8; 星曜["天相"].地支 = "未";

            //申宮
            地支矩陣[9].星曜.push("天同");
            星曜["天同"].地支數 = 9; 星曜["天同"].地支 = "申";
            地支矩陣[9].星曜.push("天梁");
            星曜["天梁"].地支數 = 9; 星曜["天梁"].地支 = "申";

            //酉宮
            地支矩陣[10].星曜.push("武曲");
            星曜["武曲"].地支數 = 10; 星曜["武曲"].地支 = "酉";
            地支矩陣[10].星曜.push("七殺");
            星曜["七殺"].地支數 = 10; 星曜["七殺"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("太陽");
            星曜["太陽"].地支數 = 11; 星曜["太陽"].地支 = "戌";
            break;
			
        case "寅":
            //亥宮
            地支矩陣[0].星曜.push("太陽");
            星曜["太陽"].地支數 = 0; 星曜["太陽"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("破軍");
            星曜["破軍"].地支數 = 1; 星曜["破軍"].地支 = "子";

            //丑宮
			地支矩陣[2].星曜.push("天機");
            星曜["天機"].地支數 = 2; 星曜["天機"].地支 = "丑";

            //寅宮
            地支矩陣[3].星曜.push("紫微");
            星曜["紫微"].地支數 = 3; 星曜["紫微"].地支 = "寅";
			地支矩陣[3].星曜.push("天府");
            星曜["天府"].地支數 = 3; 星曜["天府"].地支 = "寅";

            //卯宮
            地支矩陣[4].星曜.push("太陰");
            星曜["太陰"].地支數 = 4; 星曜["太陰"].地支 = "卯";

            //辰宮
            地支矩陣[5].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 5; 星曜["貪狼"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("巨門");
            星曜["巨門"].地支數 = 6; 星曜["巨門"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 7; 星曜["廉貞"].地支 = "午";
			地支矩陣[7].星曜.push("天相");
            星曜["天相"].地支數 = 7; 星曜["天相"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("天梁");
            星曜["天梁"].地支數 = 8; 星曜["天梁"].地支 = "未";

            //申宮
            地支矩陣[9].星曜.push("七殺");
            星曜["七殺"].地支數 = 9; 星曜["七殺"].地支 = "申";

            //酉宮
            地支矩陣[10].星曜.push("天同");
            星曜["天同"].地支數 = 10; 星曜["天同"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("武曲");
            星曜["武曲"].地支數 = 11; 星曜["武曲"].地支 = "戌";
            break;

        case "卯":
            //亥宮
            地支矩陣[0].星曜.push("武曲");
            星曜["武曲"].地支數 = 0; 星曜["武曲"].地支 = "亥";
			地支矩陣[0].星曜.push("破軍");
            星曜["破軍"].地支數 = 0; 星曜["破軍"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("太陽");
            星曜["太陽"].地支數 = 1; 星曜["太陽"].地支 = "子";

            //丑宮
			地支矩陣[2].星曜.push("天府");
            星曜["天府"].地支數 = 2; 星曜["天府"].地支 = "丑";

            //寅宮
            地支矩陣[3].星曜.push("天機");
            星曜["天機"].地支數 = 3; 星曜["天機"].地支 = "寅";
			地支矩陣[3].星曜.push("太陰");
            星曜["太陰"].地支數 = 3; 星曜["太陰"].地支 = "寅";

            //卯宮
            地支矩陣[4].星曜.push("紫微");
            星曜["紫微"].地支數 = 4; 星曜["紫微"].地支 = "卯";
			地支矩陣[4].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 4; 星曜["貪狼"].地支 = "卯";

            //辰宮
            地支矩陣[5].星曜.push("巨門");
            星曜["巨門"].地支數 = 5; 星曜["巨門"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("天相");
            星曜["天相"].地支數 = 6; 星曜["天相"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("天梁");
            星曜["天梁"].地支數 = 7; 星曜["天梁"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 8; 星曜["廉貞"].地支 = "未";
			地支矩陣[8].星曜.push("七殺");
            星曜["七殺"].地支數 = 8; 星曜["七殺"].地支 = "未";

            //申宮
            地支矩陣[9].無主星 = true;

            //酉宮
            地支矩陣[10].無主星 = true;

            //戌宮
            地支矩陣[11].星曜.push("天同");
            星曜["天同"].地支數 = 11; 星曜["天同"].地支 = "戌";
            break;
			
        case "辰":
            //亥宮
            地支矩陣[0].星曜.push("天同");
            星曜["天同"].地支數 = 0; 星曜["天同"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("武曲");
            星曜["武曲"].地支數 = 1; 星曜["武曲"].地支 = "子";
            地支矩陣[1].星曜.push("天府");
            星曜["天府"].地支數 = 1; 星曜["天府"].地支 = "子";

            //丑宮
            地支矩陣[2].星曜.push("太陽");
            星曜["太陽"].地支數 = 2; 星曜["太陽"].地支 = "丑";
            地支矩陣[2].星曜.push("太陰");
            星曜["太陰"].地支數 = 2; 星曜["太陰"].地支 = "丑";

            //寅宮
            地支矩陣[3].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 3; 星曜["貪狼"].地支 = "寅";          

            //卯宮
            地支矩陣[4].星曜.push("天機");
            星曜["天機"].地支數 = 4; 星曜["天機"].地支 = "卯";
            地支矩陣[4].星曜.push("巨門");
            星曜["巨門"].地支數 = 4; 星曜["巨門"].地支 = "卯"; 

            //辰宮
            地支矩陣[5].星曜.push("紫微");
            星曜["紫微"].地支數 = 5; 星曜["紫微"].地支 = "辰";
            地支矩陣[5].星曜.push("天相");
            星曜["天相"].地支數 = 5; 星曜["天相"].地支 = "辰"; 

            //巳宮
            地支矩陣[6].星曜.push("天梁");
            星曜["天梁"].地支數 = 6; 星曜["天梁"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("七殺");
            星曜["七殺"].地支數 = 7; 星曜["七殺"].地支 = "午";

            //未宮
            地支矩陣[8].無主星 = true;

            //申宮
            地支矩陣[9].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 9; 星曜["廉貞"].地支 = "申";

            //酉宮
            地支矩陣[10].無主星 = true;

            //戌宮
            地支矩陣[11].星曜.push("破軍");
            星曜["破軍"].地支數 = 11; 星曜["破軍"].地支 = "戌";
            break;

        case "巳":
            //亥宮
            地支矩陣[0].星曜.push("天府");
            星曜["天府"].地支數 = 0; 星曜["天府"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("天同");
            星曜["天同"].地支數 = 1; 星曜["天同"].地支 = "子";
			地支矩陣[1].星曜.push("太陰");
            星曜["太陰"].地支數 = 1; 星曜["太陰"].地支 = "子";

            //丑宮
			地支矩陣[2].星曜.push("武曲");
            星曜["武曲"].地支數 = 2; 星曜["武曲"].地支 = "丑";
			地支矩陣[2].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 2; 星曜["貪狼"].地支 = "丑";

            //寅宮
            地支矩陣[3].星曜.push("太陽");
            星曜["太陽"].地支數 = 3; 星曜["太陽"].地支 = "寅";
			地支矩陣[3].星曜.push("巨門");
            星曜["巨門"].地支數 = 3; 星曜["巨門"].地支 = "寅";

            //卯宮
            地支矩陣[4].星曜.push("天相");
            星曜["天相"].地支數 = 4; 星曜["天相"].地支 = "卯";

            //辰宮
            地支矩陣[5].星曜.push("天機");
            星曜["天機"].地支數 = 5; 星曜["天機"].地支 = "辰";
			地支矩陣[5].星曜.push("天梁");
            星曜["天梁"].地支數 = 5; 星曜["天梁"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("紫微");
            星曜["紫微"].地支數 = 6; 星曜["紫微"].地支 = "巳";
			地支矩陣[6].星曜.push("七殺");
            星曜["七殺"].地支數 = 6; 星曜["七殺"].地支 = "巳";

            //午宮
            地支矩陣[7].無主星 = true;

            //未宮
            地支矩陣[8].無主星 = true;

            //申宮
            地支矩陣[9].無主星 = true;

            //酉宮
            地支矩陣[10].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 10; 星曜["廉貞"].地支 = "酉";
			地支矩陣[10].星曜.push("破軍");
            星曜["破軍"].地支數 = 10; 星曜["破軍"].地支 = "酉";

            //戌宮
            地支矩陣[11].無主星 = true;
            break;

        case "午":
            //亥宮
            地支矩陣[0].星曜.push("太陰");
            星曜["太陰"].地支數 = 0; 星曜["太陰"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 1; 星曜["貪狼"].地支 = "子";

            //丑宮
            地支矩陣[2].星曜.push("天同");
            星曜["天同"].地支數 = 2; 星曜["天同"].地支 = "丑";
            地支矩陣[2].星曜.push("巨門");
            星曜["巨門"].地支數 = 2; 星曜["巨門"].地支 = "丑";

            //寅宮
            地支矩陣[3].星曜.push("武曲");
            星曜["武曲"].地支數 = 3; 星曜["武曲"].地支 = "寅";
            地支矩陣[3].星曜.push("天相");
            星曜["天相"].地支數 = 3; 星曜["天相"].地支 = "寅";         

            //卯宮
            地支矩陣[4].星曜.push("太陽");
            星曜["太陽"].地支數 = 4; 星曜["太陽"].地支 = "卯";
            地支矩陣[4].星曜.push("天梁");
            星曜["天梁"].地支數 = 4; 星曜["天梁"].地支 = "卯"; 

            //辰宮
            地支矩陣[5].星曜.push("七殺");
            星曜["七殺"].地支數 = 5; 星曜["七殺"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("天機");
            星曜["天機"].地支數 = 6; 星曜["天機"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("紫微");
            星曜["紫微"].地支數 = 7; 星曜["紫微"].地支 = "午";

            //未宮
            地支矩陣[8].無主星 = true;

            //申宮
            地支矩陣[9].星曜.push("破軍");
            星曜["破軍"].地支數 = 9; 星曜["破軍"].地支 = "申";

            //酉宮
            地支矩陣[10].無主星 = true;

            //戌宮
            地支矩陣[11].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 11; 星曜["廉貞"].地支 = "戌";
            地支矩陣[11].星曜.push("天府");
            星曜["天府"].地支數 = 11; 星曜["天府"].地支 = "戌";
            break;

        case "未":
            //亥宮
            地支矩陣[0].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 0; 星曜["廉貞"].地支 = "亥";
            地支矩陣[0].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 0; 星曜["貪狼"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("巨門");
            星曜["巨門"].地支數 = 1; 星曜["巨門"].地支 = "子";

            //丑宮
            地支矩陣[2].星曜.push("天相");
            星曜["天相"].地支數 = 2; 星曜["天相"].地支 = "丑";

            //寅宮
            地支矩陣[3].星曜.push("天同");
            星曜["天同"].地支數 = 3; 星曜["天同"].地支 = "寅";
            地支矩陣[3].星曜.push("天梁");
            星曜["天梁"].地支數 = 3; 星曜["天梁"].地支 = "寅";         

            //卯宮
            地支矩陣[4].星曜.push("武曲");
            星曜["武曲"].地支數 = 4; 星曜["武曲"].地支 = "卯";
            地支矩陣[4].星曜.push("七殺");
            星曜["七殺"].地支數 = 4; 星曜["七殺"].地支 = "卯"; 

            //辰宮
            地支矩陣[5].星曜.push("太陽");
            星曜["太陽"].地支數 = 5; 星曜["太陽"].地支 = "辰";

            //巳宮
            地支矩陣[6].無主星 = true;

            //午宮
            地支矩陣[7].星曜.push("天機");
            星曜["天機"].地支數 = 7; 星曜["天機"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("紫微");
            星曜["紫微"].地支數 = 8; 星曜["紫微"].地支 = "未";
            地支矩陣[8].星曜.push("破軍");
            星曜["破軍"].地支數 = 8; 星曜["破軍"].地支 = "未";

            //申宮
            地支矩陣[9].無主星 = true;

            //酉宮
            地支矩陣[10].星曜.push("天府");
            星曜["天府"].地支數 = 10; 星曜["天府"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("太陰");
            星曜["太陰"].地支數 = 11; 星曜["太陰"].地支 = "戌";
            break;

        case "申":
            //亥宮
            地支矩陣[0].星曜.push("巨門");
            星曜["巨門"].地支數 = 0; 星曜["巨門"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 1; 星曜["廉貞"].地支 = "子";
            地支矩陣[1].星曜.push("天相");
            星曜["天相"].地支數 = 1; 星曜["天相"].地支 = "子";

            //丑宮
            地支矩陣[2].星曜.push("天梁");
            星曜["天梁"].地支數 = 2; 星曜["天梁"].地支 = "丑";

            //寅宮
            地支矩陣[3].星曜.push("七殺");
            星曜["七殺"].地支數 = 3; 星曜["七殺"].地支 = "寅";        

            //卯宮
            地支矩陣[4].星曜.push("天同");
            星曜["天同"].地支數 = 4; 星曜["天同"].地支 = "卯";

            //辰宮
            地支矩陣[5].星曜.push("武曲");
            星曜["武曲"].地支數 = 5; 星曜["武曲"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("太陽");
            星曜["太陽"].地支數 = 6; 星曜["太陽"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("破軍");
            星曜["破軍"].地支數 = 7; 星曜["破軍"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("天機");
            星曜["天機"].地支數 = 8; 星曜["天機"].地支 = "未";

            //申宮
            地支矩陣[9].星曜.push("紫微");
            星曜["紫微"].地支數 = 9; 星曜["紫微"].地支 = "申";
            地支矩陣[9].星曜.push("天府");
            星曜["天府"].地支數 = 9; 星曜["天府"].地支 = "申";

            //酉宮
            地支矩陣[10].星曜.push("太陰");
            星曜["太陰"].地支數 = 10; 星曜["太陰"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 11; 星曜["貪狼"].地支 = "戌";
            break;

        case "酉":
            //亥宮
            地支矩陣[0].星曜.push("天相");
            星曜["天相"].地支數 = 0; 星曜["天相"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("天梁");
            星曜["天梁"].地支數 = 1; 星曜["天梁"].地支 = "子";

            //丑宮
            地支矩陣[2].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 2; 星曜["廉貞"].地支 = "丑";
            地支矩陣[2].星曜.push("七殺");
            星曜["七殺"].地支數 = 2; 星曜["七殺"].地支 = "丑";

            //寅宮
            地支矩陣[3].無主星 = true;       

            //卯宮
            地支矩陣[4].無主星 = true;

            //辰宮
            地支矩陣[5].星曜.push("天同");
            星曜["天同"].地支數 = 5; 星曜["天同"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("武曲");
            星曜["武曲"].地支數 = 6; 星曜["武曲"].地支 = "巳";
            地支矩陣[6].星曜.push("破軍");
            星曜["破軍"].地支數 = 6; 星曜["破軍"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("太陽");
            星曜["太陽"].地支數 = 7; 星曜["太陽"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("天府");
            星曜["天府"].地支數 = 8; 星曜["天府"].地支 = "未";

            //申宮
            地支矩陣[9].星曜.push("天機");
            星曜["天機"].地支數 = 9; 星曜["天機"].地支 = "申";
            地支矩陣[9].星曜.push("太陰");
            星曜["太陰"].地支數 = 9; 星曜["太陰"].地支 = "申";

            //酉宮
            地支矩陣[10].星曜.push("紫微");
            星曜["紫微"].地支數 = 10; 星曜["紫微"].地支 = "酉";
            地支矩陣[10].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 10; 星曜["貪狼"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("巨門");
            星曜["巨門"].地支數 = 11; 星曜["巨門"].地支 = "戌";
            break;

        case "戌":
            //亥宮
            地支矩陣[0].星曜.push("天梁");
            星曜["天梁"].地支數 = 0; 星曜["天梁"].地支 = "亥";

            //子宮
            地支矩陣[1].星曜.push("七殺");
            星曜["七殺"].地支數 = 1; 星曜["七殺"].地支 = "子";

            //丑宮
            地支矩陣[2].無主星 = true;

            //寅宮
            地支矩陣[3].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 3; 星曜["廉貞"].地支 = "寅";

            //卯宮
            地支矩陣[4].無主星 = true;

            //辰宮
            地支矩陣[5].星曜.push("破軍");
            星曜["破軍"].地支數 = 5; 星曜["破軍"].地支 = "辰";

            //巳宮
            地支矩陣[6].星曜.push("天同");
            星曜["天同"].地支數 = 6; 星曜["天同"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("武曲");
            星曜["武曲"].地支數 = 7; 星曜["武曲"].地支 = "午";
            地支矩陣[7].星曜.push("天府");
            星曜["天府"].地支數 = 7; 星曜["天府"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("太陽");
            星曜["太陽"].地支數 = 8; 星曜["太陽"].地支 = "未";
            地支矩陣[8].星曜.push("太陰");
            星曜["太陰"].地支數 = 8; 星曜["太陰"].地支 = "未";

            //申宮
            地支矩陣[9].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 9; 星曜["貪狼"].地支 = "申";

            //酉宮
            地支矩陣[10].星曜.push("天機");
            星曜["天機"].地支數 = 10; 星曜["天機"].地支 = "酉";
            地支矩陣[10].星曜.push("巨門");
            星曜["巨門"].地支數 = 10; 星曜["巨門"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("紫微");
            星曜["紫微"].地支數 = 11; 星曜["紫微"].地支 = "戌";
            地支矩陣[11].星曜.push("天相");
            星曜["天相"].地支數 = 11; 星曜["天相"].地支 = "戌";
            break;

        case "亥":
            //亥宮
            地支矩陣[0].星曜.push("紫微");
            星曜["紫微"].地支數 = 0; 星曜["紫微"].地支 = "亥";
            地支矩陣[0].星曜.push("七殺");
            星曜["七殺"].地支數 = 0; 星曜["七殺"].地支 = "亥";

            //子宮
            地支矩陣[1].無主星 = true;

            //丑宮
            地支矩陣[2].無主星 = true;

            //寅宮
            地支矩陣[3].無主星 = true;

            //卯宮
            地支矩陣[4].星曜.push("廉貞");
            星曜["廉貞"].地支數 = 4; 星曜["廉貞"].地支 = "卯";
            地支矩陣[4].星曜.push("破軍");
            星曜["破軍"].地支數 = 4; 星曜["破軍"].地支 = "卯";

            //辰宮
            地支矩陣[5].無主星 = true;

            //巳宮
            地支矩陣[6].星曜.push("天府");
            星曜["天府"].地支數 = 6; 星曜["天府"].地支 = "巳";

            //午宮
            地支矩陣[7].星曜.push("天同");
            星曜["天同"].地支數 = 7; 星曜["天同"].地支 = "午";
            地支矩陣[7].星曜.push("太陰");
            星曜["太陰"].地支數 = 7; 星曜["太陰"].地支 = "午";

            //未宮
            地支矩陣[8].星曜.push("武曲");
            星曜["武曲"].地支數 = 8; 星曜["武曲"].地支 = "未";
            地支矩陣[8].星曜.push("貪狼");
            星曜["貪狼"].地支數 = 8; 星曜["貪狼"].地支 = "未";

            //申宮
            地支矩陣[9].星曜.push("太陽");
            星曜["太陽"].地支數 = 9; 星曜["太陽"].地支 = "申";
            地支矩陣[9].星曜.push("巨門");
            星曜["巨門"].地支數 = 9; 星曜["巨門"].地支 = "申";

            //酉宮
            地支矩陣[10].星曜.push("天相");
            星曜["天相"].地支數 = 10; 星曜["天相"].地支 = "酉";

            //戌宮
            地支矩陣[11].星曜.push("天機");
            星曜["天機"].地支數 = 11; 星曜["天機"].地支 = "戌";
            地支矩陣[11].星曜.push("天梁");
            星曜["天梁"].地支數 = 11; 星曜["天梁"].地支 = "戌";
            break;
    } // end switch 紫微地支
    
    for(var i=0; i<12; i++) 地支矩陣[i].主星 = 地支矩陣[i].星曜.slice(0);  //duplicate into 主星
} //end function 安十四主星


function 安輔弼(生月, 地支矩陣, 星曜) {
    if(生月 == 0) 生月=12;

    地支矩陣[地支滾動(5, (生月-1))].星曜.push("左輔");
    地支矩陣[地支滾動(11, (-1) * (生月-1))].星曜.push("右弼");

    星曜["左輔"].地支數 = 地支滾動(5, (生月-1)); 星曜["左輔"].地支 = 地支字數轉換(地支滾動(5, (生月-1)));
    星曜["右弼"].地支數 = 地支滾動(11, (-1) * (生月-1)); 星曜["右弼"].地支 = 地支字數轉換(地支滾動(11, (-1) * (生月-1)));
} //end function 安輔弼


function 安昌曲(生時, 地支矩陣, 星曜) {
    if(生時 == 0) 生時=12;
    
    地支矩陣[地支滾動(5, (生時-1))].星曜.push("文曲");
    地支矩陣[地支滾動(11, (-1) * (生時-1))].星曜.push("文昌");

    星曜["文曲"].地支數 = 地支滾動(5, (生時-1)); 星曜["文曲"].地支 = 地支字數轉換(地支滾動(5, (生時-1)));
    星曜["文昌"].地支數 = 地支滾動(11, (-1) * (生時-1)); 星曜["文昌"].地支 = 地支字數轉換(地支滾動(11, (-1) * (生時-1)));
} //end function 安輔弼


function 安生年四化(生年干, 地支矩陣, 人事宮位, 星曜) {
    var 生年四化 =  十干四化(生年干);

    //console.log(this[生年四化.化祿].宮位);
    星曜[生年四化.化祿].生年祿 = true; 星曜[生年四化.化祿].生年四化 = "祿";
    星曜[生年四化.化權].生年權 = true; 星曜[生年四化.化權].生年四化 = "權";
    星曜[生年四化.化科].生年科 = true; 星曜[生年四化.化科].生年四化 = "科";
    星曜[生年四化.化忌].生年忌 = true; 星曜[生年四化.化忌].生年四化 = "忌";

    地支矩陣[星曜[生年四化.化祿].地支數].生年祿 = true; 地支矩陣[星曜[生年四化.化祿].地支數].生年祿權忌 = true;
    地支矩陣[星曜[生年四化.化權].地支數].生年權 = true; 地支矩陣[星曜[生年四化.化權].地支數].生年祿權忌 = true;
    地支矩陣[星曜[生年四化.化科].地支數].生年科 = true; //地支矩陣[星曜[生年四化.化科].地支數].生年祿權忌 = true;
    地支矩陣[星曜[生年四化.化忌].地支數].生年忌 = true; 地支矩陣[星曜[生年四化.化忌].地支數].生年祿權忌 = true;
} //end function 安生年四化


function 尋宮干四化(地支矩陣, 星曜) {
    var 宮干, 四化, 對宮地支;
    var 化祿對宮, 化權對宮, 化科對宮, 化忌對宮;
    for(var i=0; i<12; i++) {
        宮干 = 地支矩陣[i].宮干;
        四化 = 十干四化(宮干);
        對宮地支 = 地支滾動(i, 6);

        地支矩陣[i].宮干四化.化祿星 = 四化.化祿;
        地支矩陣[i].宮干四化.化權星 = 四化.化權;
        地支矩陣[i].宮干四化.化科星 = 四化.化科;
        地支矩陣[i].宮干四化.化忌星 = 四化.化忌;

        // 飛出四化
        化祿對宮 = 地支滾動(星曜[四化.化祿].地支數, 6);
        化權對宮 = 地支滾動(星曜[四化.化權].地支數, 6);
        化科對宮 = 地支滾動(星曜[四化.化科].地支數, 6);
        化忌對宮 = 地支滾動(星曜[四化.化忌].地支數, 6);

        地支矩陣[i].宮干四化.祿出.地支數.push(星曜[四化.化祿].地支數);
        地支矩陣[i].宮干四化.祿出.地支數1 = 星曜[四化.化祿].地支數;
        if(地支矩陣[化祿對宮].空宮 && 星曜[四化.化祿].地支數 !=i && 化祿對宮 !=i) 地支矩陣[i].宮干四化.祿出.地支數2 = 地支滾動(地支矩陣[i].宮干四化.祿出.地支數1, 6);

        地支矩陣[i].宮干四化.權出.地支數.push(星曜[四化.化權].地支數);
        地支矩陣[i].宮干四化.權出.地支數1 = 星曜[四化.化權].地支數;
        if(地支矩陣[化權對宮].空宮 && 星曜[四化.化權].地支數 !=i && 化權對宮 !=i) 地支矩陣[i].宮干四化.權出.地支數2 = 地支滾動(地支矩陣[i].宮干四化.權出.地支數1, 6);


        地支矩陣[i].宮干四化.科出.地支數.push(星曜[四化.化科].地支數);
        地支矩陣[i].宮干四化.科出.地支數1 = 星曜[四化.化科].地支數;
        if(地支矩陣[化科對宮].空宮 && 星曜[四化.化科].地支數 !=i && 化科對宮 !=i) 地支矩陣[i].宮干四化.科出.地支數2 = 地支滾動(地支矩陣[i].宮干四化.科出.地支數1, 6);

        地支矩陣[i].宮干四化.忌出.地支數.push(星曜[四化.化忌].地支數);
        地支矩陣[i].宮干四化.忌出.地支數1 = 星曜[四化.化忌].地支數;
        if(地支矩陣[化忌對宮].空宮 && 星曜[四化.化忌].地支數 !=i && 化忌對宮 !=i) 地支矩陣[i].宮干四化.忌出.地支數2 = 地支滾動(地支矩陣[i].宮干四化.忌出.地支數1, 6);

        地支矩陣[i].宮干四化.忌出沖.地支數.push(地支滾動(星曜[四化.化忌].地支數, 6));
        地支矩陣[i].宮干四化.忌出沖.地支數1 = 地支滾動(星曜[四化.化忌].地支數, 6);
        if(地支矩陣[i].宮干四化.忌出.地支數2 != -1) 地支矩陣[i].宮干四化.忌出沖.地支數2 = 地支矩陣[i].宮干四化.忌出.地支數1;

		地支矩陣[i].宮干四化.祿出.地支.push(地支字數轉換(星曜[四化.化祿].地支數));
        地支矩陣[i].宮干四化.權出.地支.push(地支字數轉換(星曜[四化.化權].地支數));
        地支矩陣[i].宮干四化.科出.地支.push(地支字數轉換(星曜[四化.化科].地支數));
        地支矩陣[i].宮干四化.忌出.地支.push(地支字數轉換(星曜[四化.化忌].地支數));
        地支矩陣[i].宮干四化.忌出沖.地支.push(地支字數轉換(地支滾動(星曜[四化.化忌].地支數, 6))); 
		
        地支矩陣[i].宮干四化.祿出.人事宮.push(地支矩陣[星曜[四化.化祿].地支數].宮位);
        地支矩陣[i].宮干四化.權出.人事宮.push(地支矩陣[星曜[四化.化權].地支數].宮位);
        地支矩陣[i].宮干四化.科出.人事宮.push(地支矩陣[星曜[四化.化科].地支數].宮位);
        地支矩陣[i].宮干四化.忌出.人事宮.push(地支矩陣[星曜[四化.化忌].地支數].宮位);
        地支矩陣[i].宮干四化.忌出沖.人事宮.push(地支矩陣[地支滾動(星曜[四化.化忌].地支數, 6)].宮位);

        // 飛入四化
        地支矩陣[星曜[四化.化祿].地支數].宮干四化.祿進.地支數.push(i);
        地支矩陣[星曜[四化.化權].地支數].宮干四化.權進.地支數.push(i);
        地支矩陣[星曜[四化.化科].地支數].宮干四化.科進.地支數.push(i);
        地支矩陣[星曜[四化.化忌].地支數].宮干四化.忌進.地支數.push(i);
        地支矩陣[地支滾動(星曜[四化.化忌].地支數, 6)].宮干四化.忌進沖.地支數.push(i);

        地支矩陣[星曜[四化.化祿].地支數].宮干四化.祿進.地支.push(地支字數轉換(i));
        地支矩陣[星曜[四化.化權].地支數].宮干四化.權進.地支.push(地支字數轉換(i));
        地支矩陣[星曜[四化.化科].地支數].宮干四化.科進.地支.push(地支字數轉換(i));
        地支矩陣[星曜[四化.化忌].地支數].宮干四化.忌進.地支.push(地支字數轉換(i));
        地支矩陣[地支滾動(星曜[四化.化忌].地支數, 6)].宮干四化.忌進沖.地支.push(地支字數轉換(i));

        地支矩陣[星曜[四化.化祿].地支數].宮干四化.祿進.人事宮.push(地支矩陣[i].宮位);
        地支矩陣[星曜[四化.化權].地支數].宮干四化.權進.人事宮.push(地支矩陣[i].宮位);
        地支矩陣[星曜[四化.化科].地支數].宮干四化.科進.人事宮.push(地支矩陣[i].宮位);
        地支矩陣[星曜[四化.化忌].地支數].宮干四化.忌進.人事宮.push(地支矩陣[i].宮位);
        地支矩陣[地支滾動(星曜[四化.化忌].地支數, 6)].宮干四化.忌進沖.人事宮.push(地支矩陣[i].宮位);

        地支矩陣[星曜[四化.化祿].地支數].宮干四化.祿進.宮干.push(地支矩陣[i].宮干);
        地支矩陣[星曜[四化.化權].地支數].宮干四化.權進.宮干.push(地支矩陣[i].宮干);
        地支矩陣[星曜[四化.化科].地支數].宮干四化.科進.宮干.push(地支矩陣[i].宮干);
        地支矩陣[星曜[四化.化忌].地支數].宮干四化.忌進.宮干.push(地支矩陣[i].宮干);
        地支矩陣[地支滾動(星曜[四化.化忌].地支數, 6)].宮干四化.忌進沖.宮干.push(地支矩陣[i].宮干);
    } // end for
} // end function 尋宮干四化


function 尋空宮(地支矩陣, 選項){
	//選項：0 - 沒有十四主星， 1 - 沒有十八飛星
	if(選項===undefined)選項 = 1; //沒有十八飛星
	
	if(選項 == 1){
		for(var i=0; i<12; i++){
			if(地支矩陣[i].星曜.length==0) 地支矩陣[i].空宮 = true;
		} // end for
	}
} // end function 尋空宮




function 安大限(大限, 生年干支, 命宮地支數, 五行局數, 男女, 地支矩陣){
    //var 命宮地支數 = 命盤.命宮地支數;
    //var 五行局數 = 命盤.五行局.局數;
    var 順逆 = (男女 == "陽男" || 男女 == "陰女") ? 1 : -1;
    var 歲數句 = "", 地支數;
    var 歲數分段;

    for(var i=1; i<13; i++){
        歲數句 = (五行局數 + (i-1)*10).toString() + " - " + ((五行局數 + 9) + (i-1)*10).toString();
        歲數分段 = 歲數句.split(" - ");
        大限[i].歲數段 = 歲數句;
        大限[i].限始歲 = Number(歲數分段[0]);
        大限[i].限終歲 = Number(歲數分段[1]);
        大限[i].地支數 = 地支滾動(命宮地支數, (i-1) * 順逆);
		大限[i].大限名 = "第" + i + "大限";
		大限[i].宮位干支 = 地支矩陣[大限[i].地支數].宮干 + 地支矩陣[大限[i].地支數].地支;
		
        // *** 移植到地支宮位矩陣 ***
        地支矩陣[大限[i].地支數].大限數 = 大限[i].大限數;
        地支矩陣[大限[i].地支數].大限歲數段 = 大限[i].歲數段;
		
		// 填寫大限的宮位地支數 --- to remove later on
		大限[i].人事宮.命宮 = 大限[i].地支數;
		大限[i].人事宮.兄弟宮 = 地支滾動(大限[i].地支數, -1);
		大限[i].人事宮.夫妻宮 = 地支滾動(大限[i].地支數, -2);
		大限[i].人事宮.子女宮 = 地支滾動(大限[i].地支數, -3);
		大限[i].人事宮.財帛宮 = 地支滾動(大限[i].地支數, -4);
		大限[i].人事宮.疾厄宮 = 地支滾動(大限[i].地支數, -5);
		大限[i].人事宮.遷移宮 = 地支滾動(大限[i].地支數, -6);
		大限[i].人事宮.交友宮 = 地支滾動(大限[i].地支數, -7);
		大限[i].人事宮.官祿宮 = 地支滾動(大限[i].地支數, -8);
		大限[i].人事宮.田宅宮 = 地支滾動(大限[i].地支數, -9);
		大限[i].人事宮.福德宮 = 地支滾動(大限[i].地支數, -10);
		大限[i].人事宮.父母宮 = 地支滾動(大限[i].地支數, -11);
        
        // 填寫大限的宮位資料
        大限[i].宮位.命宮.地支數 = 大限[i].地支數;
        大限[i].宮位.命宮.本命宮名 = 地支矩陣[大限[i].宮位.命宮.地支數].宮位;
        大限[i].宮位.命宮.宮位重疊 = "大限命宮重疊" + 地支矩陣[大限[i].宮位.命宮.地支數].宮位;
        
        大限[i].宮位.兄弟宮.地支數 = 地支滾動(大限[i].地支數, -1);;
        大限[i].宮位.兄弟宮.本命宮名 = 地支矩陣[大限[i].宮位.兄弟宮.地支數].宮位;
        大限[i].宮位.兄弟宮.宮位重疊 = "大限兄弟宮重疊" + 地支矩陣[大限[i].宮位.兄弟宮.地支數].宮位;
        
        大限[i].宮位.夫妻宮.地支數 = 地支滾動(大限[i].地支數, -2);;
        大限[i].宮位.夫妻宮.本命宮名 = 地支矩陣[大限[i].宮位.夫妻宮.地支數].宮位;
        大限[i].宮位.夫妻宮.宮位重疊 = "大限夫妻宮重疊" + 地支矩陣[大限[i].宮位.夫妻宮.地支數].宮位;
        
        大限[i].宮位.子女宮.地支數 = 地支滾動(大限[i].地支數, -3);;
        大限[i].宮位.子女宮.本命宮名 = 地支矩陣[大限[i].宮位.子女宮.地支數].宮位;
        大限[i].宮位.子女宮.宮位重疊 = "大限子女宮重疊" + 地支矩陣[大限[i].宮位.子女宮.地支數].宮位;
        
        大限[i].宮位.財帛宮.地支數 = 地支滾動(大限[i].地支數, -4);;
        大限[i].宮位.財帛宮.本命宮名 = 地支矩陣[大限[i].宮位.財帛宮.地支數].宮位;
        大限[i].宮位.財帛宮.宮位重疊 = "大限財帛宮重疊" + 地支矩陣[大限[i].宮位.財帛宮.地支數].宮位;
        
        大限[i].宮位.疾厄宮.地支數 = 地支滾動(大限[i].地支數, -5);;
        大限[i].宮位.疾厄宮.本命宮名 = 地支矩陣[大限[i].宮位.疾厄宮.地支數].宮位;
        大限[i].宮位.疾厄宮.宮位重疊 = "大限疾厄宮重疊" + 地支矩陣[大限[i].宮位.疾厄宮.地支數].宮位;
        
        大限[i].宮位.遷移宮.地支數 = 地支滾動(大限[i].地支數, -6);;
        大限[i].宮位.遷移宮.本命宮名 = 地支矩陣[大限[i].宮位.遷移宮.地支數].宮位;
        大限[i].宮位.遷移宮.宮位重疊 = "大限遷移宮重疊" + 地支矩陣[大限[i].宮位.遷移宮.地支數].宮位;
        
        大限[i].宮位.交友宮.地支數 = 地支滾動(大限[i].地支數, -7);;
        大限[i].宮位.交友宮.本命宮名 = 地支矩陣[大限[i].宮位.交友宮.地支數].宮位;
        大限[i].宮位.交友宮.宮位重疊 = "大限交友宮重疊" + 地支矩陣[大限[i].宮位.交友宮.地支數].宮位;
        
        大限[i].宮位.官祿宮.地支數 = 地支滾動(大限[i].地支數, -8);;
        大限[i].宮位.官祿宮.本命宮名 = 地支矩陣[大限[i].宮位.官祿宮.地支數].宮位;
        大限[i].宮位.官祿宮.宮位重疊 = "大限官祿宮重疊" + 地支矩陣[大限[i].宮位.官祿宮.地支數].宮位;
        
        大限[i].宮位.田宅宮.地支數 = 地支滾動(大限[i].地支數, -9);;
        大限[i].宮位.田宅宮.本命宮名 = 地支矩陣[大限[i].宮位.田宅宮.地支數].宮位;
        大限[i].宮位.田宅宮.宮位重疊 = "大限田宅宮重疊" + 地支矩陣[大限[i].宮位.田宅宮.地支數].宮位;
        
        大限[i].宮位.福德宮.地支數 = 地支滾動(大限[i].地支數, -10);;
        大限[i].宮位.福德宮.本命宮名 = 地支矩陣[大限[i].宮位.福德宮.地支數].宮位;
        大限[i].宮位.福德宮.宮位重疊 = "大限福德宮重疊" + 地支矩陣[大限[i].宮位.福德宮.地支數].宮位;
        
        大限[i].宮位.父母宮.地支數 = 地支滾動(大限[i].地支數, -11);;
        大限[i].宮位.父母宮.本命宮名 = 地支矩陣[大限[i].宮位.父母宮.地支數].宮位;
        大限[i].宮位.父母宮.宮位重疊 = "大限父母宮重疊" + 地支矩陣[大限[i].宮位.父母宮.地支數].宮位;
        
        
    // *********** 填寫大限地支資料 ***********
        var 人事宮名 = "", 人事宮地支 = -1;
        for(var j=0; j<12; j++){
            人事宮名 = 人事宮字數轉換(j);
            人事宮地支 = 大限[i].人事宮[人事宮名];

            大限[i].地支[人事宮地支].人事宮 = 人事宮名;
            大限[i].地支[人事宮地支].本命人事宮 = 地支矩陣[人事宮地支].宮位;
            大限[i].地支[人事宮地支].六線 = 宮位轉六線(人事宮名);
            大限[i].地支[人事宮地支].三方 = 尋三合方(人事宮名).三合簡短;
            大限[i].地支[人事宮地支].本命三方 = 尋三合方(地支矩陣[人事宮地支].宮位).三合簡短;
        }  // end for j
    } // end for i


    // **** 填補尚未開運的童限資料 ****
    var 生年地支數 = 地支字數轉換(生年干支.substr(1,1));
    大限[0].地支數 = 生年地支數;
    大限[0].大限名 = "童限";
    大限[0].宮位干支 = 地支矩陣[生年地支數].宮干 + 地支矩陣[生年地支數].地支;
    
	大限[0].宮位.命宮.地支數 = 大限[0].地支數;
    大限[0].宮位.命宮.本命宮名 = 地支矩陣[大限[0].宮位.命宮.地支數].宮位;
    大限[0].宮位.命宮.宮位重疊 = "童限命宮重疊" + 地支矩陣[大限[0].宮位.命宮.地支數].宮位;
    
	大限[0].宮位.兄弟宮.地支數 = 地支滾動(大限[0].地支數, -1);
    大限[0].宮位.兄弟宮.本命宮名 = 地支矩陣[大限[0].宮位.兄弟宮.地支數].宮位;
    大限[0].宮位.兄弟宮.宮位重疊 = "童限兄弟宮重疊" + 地支矩陣[大限[0].宮位.兄弟宮.地支數].宮位;
    
	大限[0].宮位.夫妻宮.地支數 = 地支滾動(大限[0].地支數, -2);
    大限[0].宮位.夫妻宮.本命宮名 = 地支矩陣[大限[0].宮位.夫妻宮.地支數].宮位;
    大限[0].宮位.夫妻宮.宮位重疊 = "童限夫妻宮重疊" + 地支矩陣[大限[0].宮位.夫妻宮.地支數].宮位;
    
	大限[0].宮位.子女宮.地支數 = 地支滾動(大限[0].地支數, -3);
    大限[0].宮位.子女宮.本命宮名 = 地支矩陣[大限[0].宮位.子女宮.地支數].宮位;
    大限[0].宮位.子女宮.宮位重疊 = "童限子女宮重疊" + 地支矩陣[大限[0].宮位.子女宮.地支數].宮位;
    
	大限[0].宮位.財帛宮.地支數 = 地支滾動(大限[0].地支數, -4);
    大限[0].宮位.財帛宮.本命宮名 = 地支矩陣[大限[0].宮位.財帛宮.地支數].宮位;
    大限[0].宮位.財帛宮.宮位重疊 = "童限財帛宮重疊" + 地支矩陣[大限[0].宮位.財帛宮.地支數].宮位;
    
	大限[0].宮位.疾厄宮.地支數 = 地支滾動(大限[0].地支數, -5);
    大限[0].宮位.疾厄宮.本命宮名 = 地支矩陣[大限[0].宮位.疾厄宮.地支數].宮位;
    大限[0].宮位.疾厄宮.宮位重疊 = "童限疾厄宮重疊" + 地支矩陣[大限[0].宮位.疾厄宮.地支數].宮位;
    
	大限[0].宮位.遷移宮.地支數 = 地支滾動(大限[0].地支數, -6);
    大限[0].宮位.遷移宮.本命宮名 = 地支矩陣[大限[0].宮位.遷移宮.地支數].宮位;
    大限[0].宮位.遷移宮.宮位重疊 = "童限遷移宮重疊" + 地支矩陣[大限[0].宮位.遷移宮.地支數].宮位;
    
	大限[0].宮位.交友宮.地支數 = 地支滾動(大限[0].地支數, -7);
    大限[0].宮位.交友宮.本命宮名 = 地支矩陣[大限[0].宮位.交友宮.地支數].宮位;
    大限[0].宮位.交友宮.宮位重疊 = "童限交友宮重疊" + 地支矩陣[大限[0].宮位.交友宮.地支數].宮位;
    
	大限[0].宮位.官祿宮.地支數 = 地支滾動(大限[0].地支數, -8);
    大限[0].宮位.官祿宮.本命宮名 = 地支矩陣[大限[0].宮位.官祿宮.地支數].宮位;
    大限[0].宮位.官祿宮.宮位重疊 = "童限官祿宮重疊" + 地支矩陣[大限[0].宮位.官祿宮.地支數].宮位;
    
	大限[0].宮位.田宅宮.地支數 = 地支滾動(大限[0].地支數, -9);
    大限[0].宮位.田宅宮.本命宮名 = 地支矩陣[大限[0].宮位.田宅宮.地支數].宮位;
    大限[0].宮位.田宅宮.宮位重疊 = "童限田宅宮重疊" + 地支矩陣[大限[0].宮位.田宅宮.地支數].宮位;
    
	大限[0].宮位.福德宮.地支數 = 地支滾動(大限[0].地支數, -10);
    大限[0].宮位.福德宮.本命宮名 = 地支矩陣[大限[0].宮位.福德宮.地支數].宮位;
    大限[0].宮位.福德宮.宮位重疊 = "童限福德宮重疊" + 地支矩陣[大限[0].宮位.福德宮.地支數].宮位;
    
	大限[0].宮位.父母宮.地支數 = 地支滾動(大限[0].地支數, -11);
    大限[0].宮位.父母宮.本命宮名 = 地支矩陣[大限[0].宮位.父母宮.地支數].宮位;
    大限[0].宮位.父母宮.宮位重疊 = "童限父母宮重疊" + 地支矩陣[大限[0].宮位.父母宮.地支數].宮位;

} //end function 安大限


function 安流年(大限矩陣, 出生年份, 生年干支, 五行局數, 日主, 騎年){
	var 生年地支數 = 地支字數轉換(生年干支.substr(1,1));
	var 起運地支數 = 地支滾動(生年地支數, 五行局數 -2);
	var 起歲 = 五行局數; 
	var 起運年 = 出生年份 + 五行局數 - 1;
    //if(騎年) 起運年--;
	var 流年西曆;
	
	for(var i=1; i<12; i++){ // 從第1大限排起，排12個大限。0為童限
		for(var j=0; j<10; j++){
			流年西曆 = 起運年++;
			起運地支數 = 地支滾動(起運地支數, 1);
			大限矩陣[i].流年[j].歲數 = 起歲++;
			大限矩陣[i].流年[j].地支數 = 起運地支數;
			大限矩陣[i].流年[j].地支 = 地支字數轉換(起運地支數);
			大限矩陣[i].流年[j].西曆年 = 流年西曆;
			大限矩陣[i].流年[j].大限流年數 = j+1;
			大限矩陣[i].流年[j].流年干支 = 六十干支屬性((流年西曆 - 1923) % 60, "干支");
            大限矩陣[i].流年[j].流年天干十神 = 尋十神(大限矩陣[i].流年[j].流年干支.substr(0,1), 日主);
		}  // end for j, 流年數
	} // end for i, 大限數
	

    for(var i=0; i<五行局數; i++){
        大限矩陣[0].流年[i].歲數 = i+1;
        大限矩陣[0].流年[i].地支數 = 地支滾動(生年地支數, i);
        大限矩陣[0].流年[i].地支 = 地支字數轉換(大限矩陣[0].流年[i].地支數);
        大限矩陣[0].流年[i].西曆年 = 出生年份 + i;
        大限矩陣[0].流年[i].大限流年數 = i+1;
        大限矩陣[0].流年[i].流年干支 = 六十干支屬性((大限矩陣[0].流年[i].西曆年 - 1923) % 60, "干支");
        大限矩陣[0].流年[i].流年天干十神 = 尋十神(大限矩陣[0].流年[i].流年干支.substr(0,1), 日主);
    } // end for 童限
} // end for function 安流年


function 計算當下大限流年(出生年份, 五行局數, 運行元件, 大限元件){
    var 現在日期 = new Date();
    var 當下歲數 = 現在日期.getFullYear() - 出生年份 + 1;
    var StartAge, EndAge;
	
	//console.log(五行局數 + ", " + 當下歲數);
	
    for(var i=1; i < 13; i++){
        StartAge = (五行局數) + ((i-1) * 10);
		EndAge = (五行局數-1) + (i * 10);
		//console.log(i + ": Age:" + StartAge + " - " + EndAge);
        if (當下歲數 >= StartAge && 當下歲數 <= EndAge) {
            運行元件.大限數 = i;
            break;
        }  // end if 正常大限

        if(當下歲數 > 0 || 當下歲數 < 五行局數) {
            運行元件.大限數 = 0;  // 尚未開運
        }  // end if 童限

    }  // end for

    運行元件.流年數 = 現在日期.getFullYear();
    運行元件.歲數 = 當下歲數;
	//console.log(運行元件.大限數);
	//console.log(運行元件.流年數 + ", " +運行元件.歲數);
	
    for(var i=0; i < 10; i++){  //流年地支數
        if(大限元件[運行元件.大限數].流年[i].西曆年 == 運行元件.流年數) {
            運行元件.大限流年矩陣數 = i;
            break;
        }  // end if
    }  // end for 流年地支數

    //console.log(當下歲數);
    if (當下歲數>0) { // 尚未開運

		//console.log(運行元件.大限流年矩陣數);
		運行元件.流年干支 = 大限元件[運行元件.大限數].流年[運行元件.大限流年矩陣數].流年干支;
        運行元件.流年十神 = 大限元件[運行元件.大限數].流年[運行元件.大限流年矩陣數].流年天干十神;
		//console.log(運行元件.流年干支);
	}
    else {
        //console.log(運行元件.流年數);
        var 立春干支曆 = 萬年曆("立春干支曆", Number(運行元件.流年數));
        //console.log(立春干支曆);
        運行元件.流年干支 = 立春干支曆.substr(0,2);
        }

    運行元件.流年地支數 = 地支字數轉換(運行元件.流年干支.substr(1,1));
}  // end function 計算當下大限流年



// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
function 刷新星曜宮位(星曜, 地支宮位){
    //讀取星曜的地支數，然後從地支宮位導出人事宮位
    Object.keys(星曜).forEach(function (key) {
            //console.log(星曜[key].星曜 + ":"+ 星曜[key]['地支數']);
            星曜[key]['宮位'] = 地支宮位[星曜[key]['地支數']].宮位;
            星曜[key]['廟陷'] = 尋星曜廟陷(星曜[key]['星曜'], 地支字數轉換(星曜[key]['地支數']));
        });
}  //end function 尋星曜宮位


function 刷新宮位(人事宮, 地支宮位){
    //讀取星曜的地支數，然後從地支宮位導出人事宮位
    Object.keys(人事宮).forEach(function (key) {
            人事宮[key]['主星'] = 地支宮位[人事宮[key]['地支數']].主星;
            人事宮[key]['星曜'] = 地支宮位[人事宮[key]['地支數']].星曜;
            人事宮[key]['無主星'] = 地支宮位[人事宮[key]['地支數']].無主星;
            人事宮[key]['空宮'] = 地支宮位[人事宮[key]['地支數']].空宮;
        
            人事宮[key]['分析'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            //人事宮[key]['自化權'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            //人事宮[key]['自化科'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            //人事宮[key]['自化忌'] = 地支宮位[人事宮[key]['地支數']].宮干四化.分析;
            人事宮[key]['自化'] = 人事宮[key]['自化祿'] || 人事宮[key]['自化權'] || 人事宮[key]['自化忌']; //不納入自化科
        
        });
}  //end function 刷新宮位



function 尋星曜廟陷(星曜名稱, 星曜地支){
    var 星曜廟陷矩陣 = [
        { "星曜": "紫微", "子": "平", "丑": "廟", "寅": "廟", "卯": "旺", "辰": "陷", "巳": "旺", "午": "廟", "未": "廟", "申": "旺", "酉": "平", "戌": "閑", "亥": "旺"},
        { "星曜": "天機", "子": "廟", "丑": "陷", "寅": "旺", "卯": "旺", "辰": "廟", "巳": "平", "午": "廟", "未": "陷", "申": "平", "酉": "旺", "戌": "廟", "亥": "平"},
        { "星曜": "太陽", "子": "陷", "丑": "陷", "寅": "旺", "卯": "廟", "辰": "旺", "巳": "旺", "午": "陷", "未": "平", "申": "閑", "酉": "閑", "戌": "陷", "亥": "陷"},
        { "星曜": "武曲", "子": "旺", "丑": "廟", "寅": "閑", "卯": "陷", "辰": "廟", "巳": "平", "午": "旺", "未": "廟", "申": "平", "酉": "旺", "戌": "廟", "亥": "平"},
        { "星曜": "天同", "子": "旺", "丑": "陷", "寅": "閑", "卯": "廟", "辰": "平", "巳": "廟", "午": "陷", "未": "陷", "申": "旺", "酉": "平", "戌": "平", "亥": "廟"},
        { "星曜": "廉貞", "子": "平", "丑": "旺", "寅": "廟", "卯": "閑", "辰": "旺", "巳": "陷", "午": "平", "未": "廟", "申": "旺", "酉": "平", "戌": "旺", "亥": "陷"},
        { "星曜": "天府", "子": "廟", "丑": "廟", "寅": "廟", "卯": "平", "辰": "廟", "巳": "平", "午": "旺", "未": "廟", "申": "平", "酉": "陷", "戌": "廟", "亥": "旺"},
        { "星曜": "太陰", "子": "廟", "丑": "廟", "寅": "閑", "卯": "陷", "辰": "閑", "巳": "陷", "午": "閑", "未": "平", "申": "平", "酉": "旺", "戌": "旺", "亥": "廟"},
        { "星曜": "貪狼", "子": "旺", "丑": "廟", "寅": "平", "卯": "地", "辰": "廟", "巳": "陷", "午": "旺", "未": "廟", "申": "平", "酉": "平", "戌": "廟", "亥": "陷"},
        { "星曜": "巨門", "子": "旺", "丑": "旺", "寅": "廟", "卯": "廟", "辰": "平", "巳": "平", "午": "旺", "未": "陷", "申": "廟", "酉": "廟", "戌": "旺", "亥": "旺"},
        { "星曜": "天相", "子": "廟", "丑": "廟", "寅": "廟", "卯": "陷", "辰": "旺", "巳": "平", "午": "旺", "未": "閑", "申": "廟", "酉": "陷", "戌": "閑", "亥": "平"},
        { "星曜": "天梁", "子": "廟", "丑": "旺", "寅": "廟", "卯": "廟", "辰": "旺", "巳": "陷", "午": "廟", "未": "旺", "申": "陷", "酉": "地", "戌": "旺", "亥": "陷"},
        { "星曜": "七殺", "子": "旺", "丑": "廟", "寅": "廟", "卯": "陷", "辰": "旺", "巳": "平", "午": "旺", "未": "旺", "申": "廟", "酉": "閑", "戌": "廟", "亥": "平"},
        { "星曜": "破軍", "子": "廟", "丑": "旺", "寅": "陷", "卯": "旺", "辰": "旺", "巳": "閑", "午": "廟", "未": "廟", "申": "陷", "酉": "陷", "戌": "旺", "亥": "平"},
        { "星曜": "左輔", "子": "旺", "丑": "廟", "寅": "廟", "卯": "陷", "辰": "廟", "巳": "平", "午": "旺", "未": "廟", "申": "平", "酉": "陷", "戌": "廟", "亥": "閑"},
        { "星曜": "右弼", "子": "廟", "丑": "廟", "寅": "旺", "卯": "陷", "辰": "廟", "巳": "平", "午": "旺", "未": "廟", "申": "閑", "酉": "陷", "戌": "廟", "亥": "平"},
        { "星曜": "文昌", "子": "旺", "丑": "廟", "寅": "陷", "卯": "平", "辰": "旺", "巳": "廟", "午": "陷", "未": "平", "申": "旺", "酉": "廟", "戌": "陷", "亥": "旺"},
        { "星曜": "文曲", "子": "廟", "丑": "廟", "寅": "平", "卯": "旺", "辰": "廟", "巳": "廟", "午": "陷", "未": "旺", "申": "平", "酉": "廟", "戌": "陷", "亥": "旺"},
        { "星曜": "天魁", "子": "旺", "丑": "旺", "寅": "", "卯": "廟", "辰": "", "巳": "", "午": "廟", "未": "", "申": "", "酉": "", "戌": "", "亥": "旺"},
        { "星曜": "天鉞", "子": "", "丑": "", "寅": "旺", "卯": "", "辰": "", "巳": "旺", "午": "", "未": "旺", "申": "廟", "酉": "廟", "戌": "", "亥": ""},
        { "星曜": "祿存", "子": "旺", "丑": "", "寅": "廟", "卯": "旺", "辰": "", "巳": "廟", "午": "旺", "未": "", "申": "廟", "酉": "旺", "戌": "", "亥": "廟"},
        { "星曜": "天馬", "子": "", "丑": "", "寅": "旺", "卯": "", "辰": "", "巳": "平", "午": "", "未": "", "申": "旺", "酉": "", "戌": "", "亥": "平"},
        { "星曜": "羊刃", "子": "陷", "丑": "廟", "寅": "", "卯": "陷", "辰": "廟", "巳": "", "午": "平", "未": "廟", "申": "", "酉": "陷", "戌": "廟", "亥": ""},
        { "星曜": "陀羅", "子": "", "丑": "廟", "寅": "陷", "卯": "", "辰": "廟", "巳": "陷", "午": "", "未": "廟", "申": "陷", "酉": "", "戌": "廟", "亥": "陷"},
        { "星曜": "火星", "子": "平", "丑": "旺", "寅": "廟", "卯": "平", "辰": "閑", "巳": "旺", "午": "廟", "未": "閑", "申": "陷", "酉": "陷", "戌": "廟", "亥": "平"},
        { "星曜": "鈴星", "子": "陷", "丑": "陷", "寅": "廟", "卯": "廟", "辰": "旺", "巳": "旺", "午": "廟", "未": "旺", "申": "旺", "酉": "陷", "戌": "廟", "亥": "廟"},
        { "星曜": "地空", "子": "平", "丑": "陷", "寅": "陷", "卯": "平", "辰": "陷", "巳": "廟", "午": "廟", "未": "平", "申": "廟", "酉": "廟", "戌": "陷", "亥": "陷"},
        { "星曜": "地劫", "子": "陷", "丑": "陷", "寅": "平", "卯": "平", "辰": "陷", "巳": "閑", "午": "廟", "未": "平", "申": "廟", "酉": "平", "戌": "平", "亥": "旺"}
    ];
    
    var 廟陷 = {"度": "", "數": 0, "備註": ""};
    var 資料索引=_.findIndex(星曜廟陷矩陣, {星曜: 星曜名稱});
    
    if (資料索引 != -1) 廟陷.度 = 星曜廟陷矩陣[資料索引][星曜地支];
    
    switch(廟陷.度){
        case "旺": 廟陷.數 = 5; break;
        case "廟": 廟陷.數 = 4; break;
        case "地": 廟陷.數 = 3; break;
        case "平": 廟陷.數 = 2; break;
        case "陷": 廟陷.數 = 1; break;
    } // end switch 廟陷.度
    
    return 廟陷;
} // end function 星曜廟陷