// 斗數命盤分析



function 本命宮位破六線(命盤){
    var 成立條件 = "";
    var 判斷句 = "";
    var 輸出宮位分類 = "";
	var 本命破六線註解 =[];
	var 形式註解="";
	var 附加註解="";

	// ×××××××××××××× 命宮 ×××××××××××××××××
    
    輸出宮位分類 = "命宮";
    var 命宮飛四化 = 宮位四化落宮(命盤, "命宮", 0);
    
    /*
	var 命宮破六線 = new 宮位飛四化元件();
	命宮破六線.化出宮 = "命宮";
	命宮破六線.化出相對宮 = "";
	命宮破六線.四化 ="忌沖";
	命宮破六線.化入宮線 ="命宮";


    // ***** 命宮破六親子田 *****
    
    if(命宮飛四化.忌沖.宮位=="兄弟宮") {
        成立條件 = "命宮沖兄弟宮，為沖自身的成就線，也是官祿宮的光明線、財帛宮的子田線，";
        判斷句 = "比較不容易得到賞識，也不宜創業，最好靠專業技能謀生。也不利投資，克應於大財、大官重疊命宮的運限（5）。";
        命盤.人事宮.命宮.分析.push(成立條件 + 判斷句);
    } //end if
    
    if(命宮飛四化.忌沖.宮位=="疾厄宮") {
        成立條件 = "命宮沖疾厄宮，為沖自身的光明線，也是財帛宮的成就線、官祿宮的子田線，，";
        判斷句 = "事業機遇差，克應於大官、大財重疊命宮的運限（5）。";
        命盤.人事宮.命宮.分析.push(成立條件 + 判斷句);
    } //end if
    
    if(命宮飛四化.忌沖.宮位線=="子田線") {
        成立條件 = "命宮沖"+ 命宮飛四化.忌沖.宮位 + "，為沖自身的子田線，也是官祿宮的成就線、財帛宮的光明線，根基浮。";
        if(命宮飛四化.忌沖.宮位=="子女宮") 判斷句 = "忌入田宅宮也是父母官的交友宮的子女宮，會有成為義子的可能性（認乾爹、或給別人帶大、過契給神明等）。";
        if(命宮飛四化.忌沖.宮位=="田宅宮") 判斷句 = "忌沖自身田宅宮，愛往外跑，或早年離家。";
        命盤.人事宮.命宮.分析.push(成立條件 + 判斷句);
    } //end if
    */
    
    /*
	命宮破六線.化入相對宮 = "子田線";
	宮位單向四化(命宮破六線, 命盤);
	if(命宮破六線.成立) {
		//本命破六線註解.push(單向四化分析句(命宮破六線));
		命宮破六線.註解 = "沖自身的子田線，也是官祿宮的成就線、財帛宮的光明線，。。。。。。";
		本命破六線註解.push("命宮" + 命宮破六線.星曜 + 命宮破六線.註解);
		命盤.人事宮.命宮.分析.push("命宮" + 命宮破六線.星曜 + 命宮破六線.註解);
	}
    
	命宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(命宮破六線, 命盤);
	if(命宮破六線.成立) {
		命宮破六線.註解 = "沖自身的成就線，也是官祿宮的光明線、財帛宮的子田線，比較不容易得到賞識，也不宜創業。最好靠專業技能謀生。";
		本命破六線註解.push("命宮" + 命宮破六線.星曜 + 命宮破六線.註解);
		命盤.人事宮.命宮.分析.push("命宮" + 命宮破六線.星曜 + 命宮破六線.註解);
	}

	命宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(命宮破六線, 命盤);
	if(命宮破六線.成立) {
		命宮破六線.註解 = "沖自身的光明線，也是財帛宮的成就線、官祿宮的子田線，事業機遇差，在第五大限大官、大財重疊命宮克應。";
		本命破六線註解.push("命宮" + 命宮破六線.星曜 + 命宮破六線.註解);
		命盤.人事宮.命宮.分析.push("命宮" + 命宮破六線.星曜 + 命宮破六線.註解);
	}
    */
    
    /*
	// -------------- 三合方 -------------------
	var 命宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.命宮.地支數, false);
	if(命宮化入三方.成立) {
		//本命破六線註解.push("命宮化" + 命宮化入三方.四化 + "入" + 命宮化入三方.三方宮位 + "三合");
		命盤.人事宮.命宮.分析.push("命宮化" + 命宮化入三方.四化 + "入" + 命宮化入三方.三方宮位 + "三合");
	}
    */
    
	// -------------- 一六方 -------------------
	var 命宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.命宮.地支數, false);
	if(命宮化入一六.成立) {
		命盤.人事宮.命宮.分析.push("命宮化" + 命宮化入一六.四化 + "入" + 命宮化入一六.一六宮位 + "的一、六");
	}

	// -------------- 一六互沖 -------------------
	var 命宮一六相沖 = 一六互沖(命盤, "命宮");
	if(命宮一六相沖.成立) 命盤.人事宮.命宮.分析.push("命宮與" + 命宮一六相沖.六人事宮 + "（一、六）相互沖破");	

    
    /*
	// -------------- 互沖六線 -------------------
	var 命宮疾厄互沖子田 = 宮位互沖六線(命盤, "命宮", "疾厄宮", "子田線");
	if(命宮疾厄互沖子田.成立) 命盤.人事宮.命宮.分析.push(命宮疾厄互沖子田.條件 + "。。。。");

	var 命宮夫妻互沖子田 = 宮位互沖六線(命盤, "命宮", "夫妻宮", "子田線");
	if(命宮夫妻互沖子田.成立) 命盤.人事宮.命宮.分析.push(命宮夫妻互沖子田.條件 + "。。。。");
    */

	// ------------ 命宮其他 ---------------
	/*
    var 命宮飛四化 = new 宮位飛四化元件();
    
	命宮飛四化.化出宮 = "命宮";
	命宮飛四化.化出相對宮 = "";
	命宮飛四化.化入相對宮 = "";
    

	命宮飛四化.四化 ="化忌";
	命宮飛四化.化入宮線 ="田宅宮";
	宮位單向四化(命宮飛四化, 命盤);
	if(命宮飛四化.成立) {
		命宮飛四化.註解 = "忌入田宅宮，沖自身子田線，根基浮。田宅宮也是父母官的交友宮的子女宮，會有成為義子的可能性（認乾爹、或給別人帶大、過契給神明等）。";
		本命破六線註解.push("命宮" + 命宮飛四化.星曜 + 命宮飛四化.註解);
		命盤.人事宮.命宮.分析.push("命宮" + 命宮飛四化.星曜 + 命宮飛四化.註解);
	}  // end if 命宮飛四化.成立


	命宮飛四化.四化 ="化忌";
	命宮飛四化.化入宮線 ="子女宮";
	宮位單向四化(命宮飛四化, 命盤);
	if(命宮飛四化.成立) {
		命宮飛四化.註解 = "忌入子女宮，";
		本命破六線註解.push("命宮" + 命宮飛四化.星曜 + 命宮飛四化.註解);
		命盤.人事宮.命宮.分析.push("命宮" + 命宮飛四化.星曜 + 命宮飛四化.註解);
	}  // end if 命宮飛四化.成立	
	

	命宮飛四化.四化 ="化祿";
	命宮飛四化.化入宮線 ="遷移宮";
	宮位單向四化(命宮飛四化, 命盤);
	if(命宮飛四化.成立) {
		命宮飛四化.註解 = "忌入遷移宮，為祿入父母的交友宮，小時候是給別人帶大的";
		本命破六線註解.push("命宮" + 命宮飛四化.星曜 + 命宮飛四化.註解);
		命盤.人事宮.命宮.分析.push("命宮" + 命宮飛四化.星曜 + 命宮飛四化.註解);
	}  // end if 命宮飛四化.成立

    */

    /*
    // -------------- 其他 -------------------
    if(命宮飛四化.忌沖.宮位=="兄弟宮") {
        成立條件 = "命宮沖兄弟宮，為沖自身的成就線，也是官祿宮的光明線、財帛宮的子田線，";
        判斷句 = "比較不容易得到賞識，也不宜創業，最好靠專業技能謀生。也不利投資，克應於大財、大官重疊命宮的運限（5）。";
        命盤.人事宮.命宮.分析.push(成立條件 + 判斷句);
    } //end if
    
    if(命宮飛四化.忌沖.宮位=="疾厄宮") {
        成立條件 = "命宮沖疾厄宮，為沖自身的光明線，也是財帛宮的成就線、官祿宮的子田線，，";
        判斷句 = "事業機遇差，克應於大官、大財重疊命宮的運限（5）。";
        命盤.人事宮.命宮.分析.push(成立條件 + 判斷句);
    } //end if
    
    if(命宮飛四化.忌沖.宮位線=="子田線") {
        成立條件 = "命宮沖"+ 命宮飛四化.忌沖.宮位 + "，為沖自身的子田線，也是官祿宮的成就線、財帛宮的光明線，根基浮。";
        if(命宮飛四化.忌沖.宮位=="子女宮") 判斷句 = "忌入田宅宮也是父母官的交友宮的子女宮，會有成為義子的可能性（認乾爹、或給別人帶大、過契給神明等）。";
        if(命宮飛四化.忌沖.宮位=="田宅宮") 判斷句 = "忌沖自身田宅宮，愛往外跑，或早年離家。";
        命盤.人事宮.命宮.分析.push(成立條件 + 判斷句);
    } //end if
    */
    
	// ×××××××××××××× 兄弟宮 ×××××××××××××××××
    /*
	var 兄弟宮破六線 = new 宮位飛四化元件();
	兄弟宮破六線.化出宮 = "兄弟宮";
	兄弟宮破六線.化出相對宮 = "";
	兄弟宮破六線.四化 ="忌沖";
	兄弟宮破六線.化入宮線 ="兄弟宮";
	
	兄弟宮破六線.化入相對宮 = "子田線";
	宮位單向四化(兄弟宮破六線, 命盤);
	if(兄弟宮破六線.成立) {
		兄弟宮破六線.註解 = "沖自身的子田線，也是田宅宮的成就線、疾厄宮的光明線，與母親緣薄";
		本命破六線註解.push("兄弟宮" + 兄弟宮破六線.星曜 + 兄弟宮破六線.註解);
		命盤.人事宮.兄弟宮.分析.push("兄弟宮" + 兄弟宮破六線.星曜 + 兄弟宮破六線.註解);
	}
	
	兄弟宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(兄弟宮破六線, 命盤);
	if(兄弟宮破六線.成立) {
		兄弟宮破六線.註解 = "沖自身的成就線，也是疾厄宮的子田線、田宅宮的光明線，。。。。。。";
		本命破六線註解.push("兄弟宮" + 兄弟宮破六線.星曜 + 兄弟宮破六線.註解);
		命盤.人事宮.兄弟宮.分析.push("兄弟宮" + 兄弟宮破六線.星曜 + 兄弟宮破六線.註解);
	}
	

	兄弟宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(兄弟宮破六線, 命盤);
	if(兄弟宮破六線.成立) {
		兄弟宮破六線.註解 = "沖自身的光明線，也是疾厄宮的成就線、田宅宮的子田線，。。。。。。";
		本命破六線註解.push("兄弟宮" + 兄弟宮破六線.星曜 + 兄弟宮破六線.註解);
		命盤.人事宮.兄弟宮.分析.push("兄弟宮" + 兄弟宮破六線.星曜 + 兄弟宮破六線.註解);
	}
    
    
	// -------------- 三合方 -------------------
	var 兄弟宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.兄弟宮.地支數, false);
	if(兄弟宮化入三方.成立) {
		本命破六線註解.push("兄弟宮化" + 兄弟宮化入三方.四化 + "入" + 兄弟宮化入三方.三方宮位 + "三合");
		命盤.人事宮.兄弟宮.分析.push("兄弟宮化" + 兄弟宮化入三方.四化 + "入" + 兄弟宮化入三方.三方宮位 + "三合");
	}
    */

	// -------------- 一六方 -------------------
	var 兄弟宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.兄弟宮.地支數, false);
	if(兄弟宮化入一六.成立) {
		附加註解="";
		形式註解="兄弟宮化" + 兄弟宮化入一六.四化 + "入" + 兄弟宮化入一六.一六宮位 + "的一、六";
		if(兄弟宮化入一六.一六宮位 == "財帛宮" || 兄弟宮化入一六.一六宮位 == "田宅宮" ) 附加註解 = "，可以賺到房地產的錢財";
		命盤.人事宮.兄弟宮.分析.push(形式註解 + 附加註解);
	}

	// -------------- 一六互沖 -------------------
	var 兄弟宮一六相沖 = 一六互沖(命盤, "兄弟宮");
	if(兄弟宮一六相沖.成立) 命盤.人事宮.兄弟宮.分析.push("兄弟宮與" + 兄弟宮一六相沖.六人事宮 + "（一、六）相互沖破");	


    /*
	// -------------- 互沖六線 -------------------
	var 兄弟遷移互沖子田 = 宮位互沖六線(命盤, "兄弟宮", "遷移宮", "子田線");
	if(兄弟遷移互沖子田.成立) 命盤.人事宮.兄弟宮.分析.push(兄弟遷移互沖子田.條件 + "母親宮破。。。。");


	// -------------- 其他 -------------------
	var 兄弟宮其他論斷 = new 宮位飛四化元件();
	兄弟宮其他論斷.化出宮 = "兄弟宮";
	兄弟宮其他論斷.化出相對宮 = "";
	兄弟宮其他論斷.四化 ="忌沖";
	兄弟宮其他論斷.化入宮線 ="命宮";
	兄弟宮其他論斷.化入相對宮 = "";

	
	宮位單向四化(兄弟宮其他論斷, 命盤);
	if(兄弟宮其他論斷.成立) {
		兄弟宮其他論斷.註解 = "沖命宮，為沖田宅宮的子田線，與母親緣薄";
		命盤.人事宮.兄弟宮.分析.push("兄弟宮" + 兄弟宮其他論斷.星曜 + 兄弟宮其他論斷.註解);
	}
	

	兄弟宮其他論斷.四化 ="忌沖";
	兄弟宮其他論斷.化入宮線 ="夫官線";
	宮位單向四化(兄弟宮其他論斷, 命盤);
	if(兄弟宮其他論斷.成立) {
		兄弟宮其他論斷.註解 = "沖夫官線，為沖父母宮的子田線，父母感情不好";
		命盤.人事宮.父母宮.分析.push("兄弟宮" + 兄弟宮其他論斷.星曜 + 兄弟宮其他論斷.註解);
	}
    */

	// ×××××××××××××× 夫妻宮 ×××××××××××××××××
    /*
	var 夫妻宮破六線 = new 宮位飛四化元件();
	夫妻宮破六線.化出宮 = "夫妻宮";
	夫妻宮破六線.化出相對宮 = "";
	夫妻宮破六線.四化 ="忌沖";
	夫妻宮破六線.化入宮線 ="夫妻宮";
	
	夫妻宮破六線.化入相對宮 = "子田線";
	宮位單向四化(夫妻宮破六線, 命盤);
	if(夫妻宮破六線.成立) {
		夫妻宮破六線.註解 = "沖自身的子田線，也是福德宮的成就線、遷移宮的光明線，夫妻緣薄";
		本命破六線註解.push("夫妻宮" + 夫妻宮破六線.星曜 + 夫妻宮破六線.註解);
		命盤.人事宮.夫妻宮.分析.push("夫妻宮" + 夫妻宮破六線.星曜 + 夫妻宮破六線.註解);
	}
	
	夫妻宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(夫妻宮破六線, 命盤);
	if(夫妻宮破六線.成立) {
		夫妻宮破六線.註解 = "沖自身的成就線，也是福德宮的光明線、遷移宮的子田線，。。。。。。";
		本命破六線註解.push("夫妻宮" + 夫妻宮破六線.星曜 + 夫妻宮破六線.註解);
		命盤.人事宮.夫妻宮.分析.push("夫妻宮" + 夫妻宮破六線.星曜 + 夫妻宮破六線.註解);
	}


	夫妻宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(夫妻宮破六線, 命盤);
	if(夫妻宮破六線.成立) {
		夫妻宮破六線.註解 = "沖自身的光明線，也是福德宮的子田線、遷移宮的成就線，。。。。。。";
		本命破六線註解.push("夫妻宮" + 夫妻宮破六線.星曜 + 夫妻宮破六線.註解);
		命盤.人事宮.夫妻宮.分析.push("夫妻宮" + 夫妻宮破六線.星曜 + 夫妻宮破六線.註解);
	}
    
    
	// -------------- 三合方 -------------------
	var 夫妻宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.夫妻宮.地支數, false);
	if(夫妻宮化入三方.成立) {
		本命破六線註解.push("夫妻宮化" + 夫妻宮化入三方.四化 + "入" + 夫妻宮化入三方.三方宮位 + "三合");
		命盤.人事宮.夫妻宮.分析.push("夫妻宮化" + 夫妻宮化入三方.四化 + "入" + 夫妻宮化入三方.三方宮位 + "三合");	
	} 
    */

	// -------------- 一六方 -------------------
	var 夫妻宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.夫妻宮.地支數, false);
	if(夫妻宮化入一六.成立) {
		附加註解="";
		形式註解="夫妻宮化" + 夫妻宮化入一六.四化 + "入" + 夫妻宮化入一六.一六宮位 + "的一、六";
		//if(夫妻宮化入一六.一六宮位 == "" || 夫妻宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.夫妻宮.分析.push(形式註解 + 附加註解);
	}


	// -------------- 一六互沖 -------------------
	var 夫妻宮一六相沖 = 一六互沖(命盤, "夫妻宮");
	if(夫妻宮一六相沖.成立) 命盤.人事宮.夫妻宮.分析.push("夫妻宮與" + 夫妻宮一六相沖.六人事宮 + "（一、六）相互沖破");

    /*
	// -------------- 互沖六線 -------------------
	var 夫妻交友互沖子田 = 宮位互沖六線(命盤, "夫妻宮", "交友宮", "子田線");
	if(夫妻交友互沖子田.成立) 命盤.人事宮.夫妻宮.分析.push(夫妻交友互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
	var 夫妻宮其他論斷 = new 宮位飛四化元件();
	夫妻宮其他論斷.化出宮 = "夫妻宮";
	夫妻宮其他論斷.化出相對宮 = "";
	夫妻宮其他論斷.四化 ="忌沖";
	夫妻宮其他論斷.化入宮線 ="命宮";
	夫妻宮其他論斷.化入相對宮 = "";


	宮位單向四化(夫妻宮其他論斷, 命盤);
	if(夫妻宮其他論斷.成立) {
		夫妻宮其他論斷.註解 = "沖命宮，為沖田宅宮的子田線，夫妻緣薄";
		命盤.人事宮.夫妻宮.分析.push("夫妻宮" + 夫妻宮其他論斷.星曜 + 夫妻宮其他論斷.註解);
	}

	// -------------- 其他 -------------------
	var 夫妻宮其他論斷 = new 宮位飛四化元件();
	夫妻宮其他論斷.化出宮 = "夫妻宮";
	夫妻宮其他論斷.化出相對宮 = "";
	夫妻宮其他論斷.四化 ="忌沖";
	夫妻宮其他論斷.化入宮線 ="財福線";
	夫妻宮其他論斷.化入相對宮 = "";	

	宮位單向四化(夫妻宮其他論斷, 命盤);
	if(夫妻宮其他論斷.成立) {
		夫妻宮其他論斷.註解 = "忌沖財福線，為忌沖交友宮的子田線，容易離異";
		命盤.人事宮.夫妻宮.分析.push("夫妻宮" + 夫妻宮其他論斷.星曜 + 夫妻宮其他論斷.註解);
	}


	夫妻宮其他論斷.四化 ="化忌";
	夫妻宮其他論斷.化入宮線 ="田宅宮";

	宮位單向四化(夫妻宮其他論斷, 命盤);
	if(夫妻宮其他論斷.成立) {
		夫妻宮其他論斷.註解 = "忌入田宅宮，即沖破遷移宮（夫之財）的子田線，配偶賺錢能力比較弱";
		命盤.人事宮.夫妻宮.分析.push("夫妻宮" + 夫妻宮其他論斷.星曜 + 夫妻宮其他論斷.註解);
	}
    */

	// ×××××××××××××× 子女宮 ×××××××××××××××××
    輸出宮位分類 = "子女宮";
    
    var 子女宮飛四化 = 宮位四化落宮(命盤, "子女宮", 0);
    /*
	var 子女宮破六線 = new 宮位飛四化元件();
	子女宮破六線.化出宮 = "子女宮";
	子女宮破六線.化出相對宮 = "";
	子女宮破六線.四化 ="忌沖";
	子女宮破六線.化入宮線 ="子女宮";
	
	子女宮破六線.化入相對宮 = "子田線";
	宮位單向四化(子女宮破六線, 命盤);
	if(子女宮破六線.成立) {
		子女宮破六線.註解 = "沖自身的子田線，也是父母宮的成就線、交友宮的光明線，子女緣薄";
		本命破六線註解.push("子女宮" + 子女宮破六線.星曜 + 子女宮破六線.註解);
		命盤.人事宮.子女宮.分析.push("子女宮" + 子女宮破六線.星曜 + 子女宮破六線.註解);
	}
	

	子女宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(子女宮破六線, 命盤);
	if(子女宮破六線.成立) {
		子女宮破六線.註解 = "沖自身的成就線，也是父母宮的光明線、交友宮的子田線，。。。。。。";
		本命破六線註解.push("子女宮" + 子女宮破六線.星曜 + 子女宮破六線.註解);
		命盤.人事宮.子女宮.分析.push("子女宮" + 子女宮破六線.星曜 + 子女宮破六線.註解);
	}


	子女宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(子女宮破六線, 命盤);
	if(子女宮破六線.成立) {
		子女宮破六線.註解 = "沖自身的光明線，也是父母宮的子田線、交友宮的成就線，。。。。。。";
		本命破六線註解.push("子女宮" + 子女宮破六線.星曜 + 子女宮破六線.註解);
		命盤.人事宮.子女宮.分析.push("子女宮" + 子女宮破六線.星曜 + 子女宮破六線.註解);
	}

	// -------------- 三合方 -------------------
	var 子女宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.子女宮.地支數, false);
	if(子女宮化入三方.成立) {

		本命破六線註解.push("子女宮化" + 子女宮化入三方.四化 + "入" + 子女宮化入三方.三方宮位 + "三合");
		命盤.人事宮.子女宮.分析.push("子女宮化" + 子女宮化入三方.四化 + "入" + 子女宮化入三方.三方宮位 + "三合");	
	} 
    */

	// -------------- 一六方 -------------------
	var 子女宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.子女宮.地支數, false);
	if(子女宮化入一六.成立) {
		附加註解="";
		形式註解="子女宮化" + 子女宮化入一六.四化 + "入" + 子女宮化入一六.一六宮位 + "的一、六";
		//if(子女宮化入一六.一六宮位 == "" || 子女宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.子女宮.分析.push(形式註解 + 附加註解);
	}


	// -------------- 一六互沖 -------------------
	var 子女宮一六相沖 = 一六互沖(命盤, "子女宮");
	if(子女宮一六相沖.成立) 命盤.人事宮.子女宮.分析.push("子女宮與" + 子女宮一六相沖.六人事宮 + "（一、六）相互沖破");	


    /*
	// -------------- 互沖六線 -------------------
	var 子女官祿互沖子田 = 宮位互沖六線(命盤, "子女宮", "官祿宮", "子田線");
	if(子女官祿互沖子田.成立) 命盤.人事宮.子女宮.分析.push(子女官祿互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
    
    if(子女宮飛四化.化祿.宮位 =="財帛宮") {
        成立條件 = "祿入財帛宮，為父母宮的財帛宮祿入財帛宮，";
        判斷句 = "容易得到父母的錢財。";
        命盤.人事宮.官祿宮.分析.push(成立條件 + 判斷句);
    } //end if
    
    if(子女宮飛四化.忌沖.宮位線=="父疾線") {
        成立條件 = "子女宮（交友的官祿宮）忌沖父疾線，";
        判斷句 = "不利合夥，克應於大限命宮重疊的運限（4）。";
        命盤.人事宮.官祿宮.分析.push(成立條件 + 判斷句);
    } //end if
    
    // -------------- 多向四化 -------------------
    if(子女宮飛四化.化祿.宮位=="兄弟宮" && 子女宮飛四化.化忌.宮位=="財帛宮") {
        成立條件 = "子女宮（父母的財帛宮）祿入兄弟宮，忌入財帛宮";
        判斷句 = "，父母會給錢命主";
        命盤.人事宮.財帛宮.分析.push(成立條件 + 判斷句);
    } // end if

    */
    
	// ×××××××××××××× 財帛宮 ×××××××××××××××××
    輸出宮位分類 = "財帛宮";
    var 財帛宮飛四化 = 宮位四化落宮(命盤, "財帛宮", 0);
    
    /*
	var 財帛宮破六線 = new 宮位飛四化元件();
	財帛宮破六線.化出宮 = "財帛宮";
	財帛宮破六線.化出相對宮 = "";
	財帛宮破六線.四化 ="忌沖";
	財帛宮破六線.化入宮線 ="財帛宮";
	
	財帛宮破六線.化入相對宮 = "子田線";
	宮位單向四化(財帛宮破六線, 命盤);
	if(財帛宮破六線.成立) {
		財帛宮破六線.註解 = "沖自身的子田線，也是命宮的成就線、官祿宮的光明線，。。。。。。";
		本命破六線註解.push("財帛宮" + 財帛宮破六線.星曜 + 財帛宮破六線.註解);
		命盤.人事宮.財帛宮.分析.push("財帛宮" + 財帛宮破六線.星曜 + 財帛宮破六線.註解);
	}
	
	
	財帛宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(財帛宮破六線, 命盤);
	if(財帛宮破六線.成立) {
		財帛宮破六線.註解 = "沖自身的成就線，也是命宮的光明線、官祿宮的子田線，事業賺錢困難。";
		本命破六線註解.push("財帛宮" + 財帛宮破六線.星曜 + 財帛宮破六線.註解);
		命盤.人事宮.財帛宮.分析.push("財帛宮" + 財帛宮破六線.星曜 + 財帛宮破六線.註解);
	}


	財帛宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(財帛宮破六線, 命盤);
	if(財帛宮破六線.成立) {
		財帛宮破六線.註解 = "沖自身的光明線，也是命宮的子田線、官祿宮的成就線，錢財不易累積。";
		本命破六線註解.push("財帛宮" + 財帛宮破六線.星曜 + 財帛宮破六線.註解);
		命盤.人事宮.財帛宮.分析.push("財帛宮" + 財帛宮破六線.星曜 + 財帛宮破六線.註解);
	}

	// -------------- 三合方 -------------------
	var 財帛宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.財帛宮.地支數, false);
	if(財帛宮化入三方.成立) {
		本命破六線註解.push("財帛宮化" + 財帛宮化入三方.四化 + "入" + 財帛宮化入三方.三方宮位 + "三合");
		命盤.人事宮.財帛宮.分析.push("財帛宮化" + 財帛宮化入三方.四化 + "入" + 財帛宮化入三方.三方宮位 + "三合");
	} 

    */
    
	// -------------- 一六方 -------------------
	var 財帛宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.財帛宮.地支數, false);
	if(財帛宮化入一六.成立) {
		附加註解="";
		形式註解="財帛宮化" + 財帛宮化入一六.四化 + "入" + 財帛宮化入一六.一六宮位 + "的一、六";
		//if(財帛宮化入一六.一六宮位 == "" || 財帛宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.財帛宮.分析.push(形式註解 + 附加註解);
	}

	// -------------- 一六互沖 -------------------
	var 財帛宮一六相沖 = 一六互沖(命盤, "財帛宮");
	if(財帛宮一六相沖.成立) 命盤.人事宮.財帛宮.分析.push("財帛宮與" + 財帛宮一六相沖.六人事宮 + "（一、六）相互沖破");

    /*
	// -------------- 互沖六線 -------------------
	var 財帛田宅互沖子田 = 宮位互沖六線(命盤, "財帛宮", "田宅宮", "子田線");
	if(財帛田宅互沖子田.成立) 命盤.人事宮.財帛宮.分析.push(財帛田宅互沖子田.條件 + "。。。。");


	var 財帛官祿互沖子田 = 宮位互沖六線(命盤, "財帛宮", "官祿宮", "子田線");
	if(財帛官祿互沖子田.成立) 命盤.人事宮.財帛宮.分析.push(財帛官祿互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
	var 財帛宮其他論斷 = new 宮位飛四化元件();
	財帛宮其他論斷.化出宮 = "財帛宮";
	財帛宮其他論斷.化出相對宮 = "";
	財帛宮其他論斷.四化 ="忌沖";
	財帛宮其他論斷.化入宮線 ="夫妻宮";
	財帛宮其他論斷.化入相對宮 = "";	

	宮位單向四化(財帛宮其他論斷, 命盤);
	if(財帛宮其他論斷.成立) {
		財帛宮其他論斷.註解 = "忌沖夫妻宮，為父母官的疾厄宮忌沖疾厄宮的田宅宮，父緣薄";
		命盤.人事宮.父母宮.分析.push("財帛宮" + 財帛宮其他論斷.星曜 + 財帛宮其他論斷.註解);
	}

	財帛宮其他論斷.四化 ="化忌";
	財帛宮其他論斷.化入宮線 ="子女宮";
	宮位單向四化(財帛宮其他論斷, 命盤);
	if(財帛宮其他論斷.成立) {
		財帛宮其他論斷.註解 = "忌入子女宮，為忌入父母宮的財帛宮，需要逢養父母";
		命盤.人事宮.父母宮.分析.push("財帛宮" + 財帛宮其他論斷.星曜 + 財帛宮其他論斷.註解);
	}


	財帛宮其他論斷.四化 ="化權";
	財帛宮其他論斷.化入宮線 ="子女宮";
	宮位單向四化(財帛宮其他論斷, 命盤);
	if(財帛宮其他論斷.成立) {
		財帛宮其他論斷.註解 = "權入子女宮，為權入父母宮的財帛宮，需要逢養父母";
		命盤.人事宮.父母宮.分析.push("財帛宮" + 財帛宮其他論斷.星曜 + 財帛宮其他論斷.註解);
	}


	財帛宮其他論斷.四化 ="化祿";
	財帛宮其他論斷.化入宮線 ="田宅宮";
	宮位單向四化(財帛宮其他論斷, 命盤);
	if(財帛宮其他論斷.成立) {
		財帛宮其他論斷.註解 = "祿入田宅宮，喜歡投資房地產";
		命盤.人事宮.父母宮.分析.push("財帛宮" + 財帛宮其他論斷.星曜 + 財帛宮其他論斷.註解);
	}
    */
    
    // -------------- 多向四化 -------------------
    if(財帛宮飛四化.化祿.宮位=="父母宮" && 財帛宮飛四化.化忌.宮位=="遷移宮") {
        成立條件 = "財帛宮祿入父母宮（夫妻宮的田宅宮）；忌入遷移宮（夫妻宮的財帛宮）";
        判斷句 = "，會給錢妻子*";
        命盤.人事宮.財帛宮.分析.push(成立條件 + 判斷句);
    } // end if
    
    if(財帛宮飛四化.化祿.宮位=="官祿宮" && 財帛宮飛四化.化忌.宮位=="子女宮") {
        成立條件 = "財帛宮祿入官祿宮（父母宮的宅宮）；忌入子女宮（父母宮的財帛宮）";
        判斷句 = "，會給錢父母*";
        命盤.人事宮.財帛宮.分析.push(成立條件 + 判斷句);
    } // end if
    
    if(財帛宮飛四化.化祿.宮位=="命宮" && 財帛宮飛四化.化忌.宮位=="交友宮") {
        成立條件 = "財帛宮祿入命宮宮（子女宮的田宅宮）；忌入交友宮（子女宮的財帛宮）";
        判斷句 = "，會給錢孩子*";
        命盤.人事宮.財帛宮.分析.push(成立條件 + 判斷句);
    } // end if
    
    
    
    
	// ×××××××××××××× 疾厄宮 ×××××××××××××××××
    輸出宮位分類 = "疾厄宮";
    var 疾厄宮飛四化 = 宮位四化落宮(命盤, "疾厄宮", 0);
    
    /*
    var 疾厄宮沖光明成就子田 = 六線宮位光明成就子田分析(疾厄宮飛四化.忌沖.宮位線, "疾厄宮").光明成就子田;
    //console.log(疾厄宮飛四化.忌沖.宮位線 + " / " + 疾厄宮沖光明成就子田);
    
    // -------------- 沖六線 -------------------
    switch(疾厄宮飛四化.忌沖.宮位線) {
        case "命遷線":
            成立條件 = "疾厄宮沖命遷線，為沖自身的成就線，也是兄弟宮的光明線、子女宮、田宅宮的子田線，";
            判斷句 = "子女緣差*";
            命盤.人事宮.疾厄宮.分析.push(成立條件 + 判斷句);
            break;
        case "兄友線":
            成立條件 = "疾厄宮沖父疾線，為夫妻宮的子田線，";
            判斷句 = "婚姻欠佳*";
            命盤.人事宮.疾厄宮.分析.push(成立條件 + 判斷句);
            break;
        case "夫官線":
            成立條件 = "疾厄宮沖夫官線，為沖自身的子田線，也是兄弟宮的成就線、田宅宮的光明線，";
            判斷句 = "健康不好，容易有意外；父緣差";
            命盤.人事宮.疾厄宮.分析.push(成立條件 + 判斷句);
            break;
        case "子田線":
            //成立條件 = "";
            //判斷句 = "";
            //命盤.人事宮.疾厄宮.分析.push(成立條件 + 判斷句);
            break;
        case "財福線":
            成立條件 = "疾厄宮沖財福線，為沖自身的光明線，也是兄弟宮、交友宮的子田線、田宅宮的成就線，";
            判斷句 = "社交緣差或與母緣薄*";
            命盤.人事宮.疾厄宮.分析.push(成立條件 + 判斷句);
            break;
        case "父疾線":
            成立條件 = "疾厄宮沖父疾線，為夫妻宮的子田線，";
            判斷句 = "婚姻欠佳*";
            命盤.人事宮.疾厄宮.分析.push(成立條件 + 判斷句);
            break;
    }  // end switch 疾厄宮飛四化.忌沖.宮位線
        
	var 疾厄宮破六線 = new 宮位飛四化元件();
	疾厄宮破六線.化出宮 = "疾厄宮";
	疾厄宮破六線.化出相對宮 = "";
	疾厄宮破六線.四化 ="忌沖";
	疾厄宮破六線.化入宮線 ="疾厄宮";
	
    
	疾厄宮破六線.化入相對宮 = "子田線";
	宮位單向四化(疾厄宮破六線, 命盤);
	if(疾厄宮破六線.成立) {
		疾厄宮破六線.註解 = "沖自身的子田線，也是兄弟宮的成就線、田宅宮的光明線，健康不好，容易有意外";
		本命破六線註解.push("疾厄宮" + 疾厄宮破六線.星曜 + 疾厄宮破六線.註解);
		命盤.人事宮.疾厄宮.分析.push("疾厄宮" + 疾厄宮破六線.星曜 + 疾厄宮破六線.註解);
	}
	
	疾厄宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(疾厄宮破六線, 命盤);
	if(疾厄宮破六線.成立) {
		疾厄宮破六線.註解 = "沖自身的成就線，也是兄弟宮的光明線、田宅宮的子田線，。。。。。。";
		本命破六線註解.push("疾厄宮" + 疾厄宮破六線.星曜 + 疾厄宮破六線.註解);
		命盤.人事宮.疾厄宮.分析.push("疾厄宮" + 疾厄宮破六線.星曜 + 疾厄宮破六線.註解);
	}

	
	疾厄宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(疾厄宮破六線, 命盤);
	if(疾厄宮破六線.成立) {
		疾厄宮破六線.註解 = "沖自身的光明線，也是兄弟宮的子田線、田宅宮的成就線，。。。。。。";
		本命破六線註解.push("疾厄宮" + 疾厄宮破六線.星曜 + 疾厄宮破六線.註解);
		命盤.人事宮.疾厄宮.分析.push("疾厄宮" + 疾厄宮破六線.星曜 + 疾厄宮破六線.註解);
	}

    
	// -------------- 三合方 -------------------
	var 疾厄宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.疾厄宮.地支數, false);
	if(疾厄宮化入三方.成立) {
		本命破六線註解.push("疾厄宮化" + 疾厄宮化入三方.四化 + "入" + 疾厄宮化入三方.三方宮位 + "三合");
		命盤.人事宮.疾厄宮.分析.push("疾厄宮化" + 疾厄宮化入三方.四化 + "入" + 疾厄宮化入三方.三方宮位 + "三合");
	} 
    */

	// -------------- 一六方 -------------------
	var 疾厄宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.疾厄宮.地支數, false);
	if(疾厄宮化入一六.成立) {
		附加註解="";
		形式註解="疾厄宮化" + 疾厄宮化入一六.四化 + "入" + 疾厄宮化入一六.一六宮位 + "的一、六";
		//if(疾厄宮化入一六.一六宮位 == "" || 疾厄宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.疾厄宮.分析.push(形式註解 + 附加註解);
	}


	// -------------- 一六互沖 -------------------
	var 疾厄宮一六相沖 = 一六互沖(命盤, "疾厄宮");
	if(疾厄宮一六相沖.成立) 命盤.人事宮.疾厄宮.分析.push("疾厄宮與" + 疾厄宮一六相沖.六人事宮 + "（一、六）相互沖破");	

    /*
    // -------------- 疾厄宮對六親 -------------------
    var 疾厄宮六親論斷 = new 宮位飛四化元件();
    疾厄宮六親論斷.化出宮 = "疾厄宮";
    疾厄宮六親論斷.化出相對宮 = "";
	疾厄宮六親論斷.四化 ="忌沖";
	疾厄宮六親論斷.化入相對宮 = "子田線";
    疾厄宮六親論斷.化入宮線 ="子女宮";  // 2010-1-2，戌時
    形式註解 = 疾厄宮六親論斷.星曜 + 疾厄宮六親論斷.四化 + 疾厄宮六親論斷.化入宮線; if (疾厄宮六親論斷.化入相對宮 !="") 形式註解 =  形式註解 + "的" + 疾厄宮六親論斷.化入相對宮;
    
    宮位單向四化(疾厄宮六親論斷, 命盤);
	if(疾厄宮六親論斷.成立) {
        疾厄宮六親論斷.註解 = 形式註解 + "，與孩子緣薄";
		命盤.人事宮.子女宮.分析.push("疾厄宮" + 疾厄宮六親論斷.註解);
	} // end if(疾厄宮六親論斷.成立) 
    

    疾厄宮六親論斷.化入宮線 ="父母宮";  
    形式註解 = 疾厄宮六親論斷.星曜 + 疾厄宮六親論斷.四化 + 疾厄宮六親論斷.化入宮線; if (疾厄宮六親論斷.化入相對宮 !="") 形式註解 =  形式註解 + "的" + 疾厄宮六親論斷.化入相對宮;
    
    宮位單向四化(疾厄宮六親論斷, 命盤);
	if(疾厄宮六親論斷.成立) {
        疾厄宮六親論斷.註解 = 形式註解 + "，與父親緣薄";
		命盤.人事宮.父母宮.分析.push("疾厄宮" + 疾厄宮六親論斷.註解);
	} // end if(疾厄宮六親論斷.成立) 

    
    疾厄宮六親論斷.化入宮線 ="兄弟宮";  // 2014-12-27，戌時
    形式註解 = 疾厄宮六親論斷.星曜 + 疾厄宮六親論斷.四化 + 疾厄宮六親論斷.化入宮線; if (疾厄宮六親論斷.化入相對宮 !="") 形式註解 =  形式註解 + "的" + 疾厄宮六親論斷.化入相對宮;
    
    宮位單向四化(疾厄宮六親論斷, 命盤);
	if(疾厄宮六親論斷.成立) {
        疾厄宮六親論斷.註解 = 形式註解 + "，與母親或兄弟緣薄";
		命盤.人事宮.兄弟宮.分析.push("疾厄宮" + 疾厄宮六親論斷.註解);
	} // end if(疾厄宮六親論斷.成立) 


    疾厄宮六親論斷.化入宮線 ="夫妻宮";  
    形式註解 = 疾厄宮六親論斷.星曜 + 疾厄宮六親論斷.四化 + 疾厄宮六親論斷.化入宮線; if (疾厄宮六親論斷.化入相對宮 !="") 形式註解 =  形式註解 + "的" + 疾厄宮六親論斷.化入相對宮;
    
    宮位單向四化(疾厄宮六親論斷, 命盤);
	if(疾厄宮六親論斷.成立) {
        疾厄宮六親論斷.註解 = 形式註解 + "，與配偶緣薄";
		命盤.人事宮.夫妻宮.分析.push("疾厄宮" + 疾厄宮六親論斷.註解);
	} // end if(疾厄宮六親論斷.成立) 
    
    
	// -------------- 其他 -------------------
	var 疾厄宮其他論斷 = new 宮位飛四化元件();
	疾厄宮其他論斷.化出宮 = "疾厄宮";
	疾厄宮其他論斷.化出相對宮 = "";
	疾厄宮其他論斷.四化 ="化祿";  //祿入
	疾厄宮其他論斷.化入宮線 ="遷移宮";
	疾厄宮其他論斷.化入相對宮 = "";	

	宮位單向四化(疾厄宮其他論斷, 命盤);
	if(疾厄宮其他論斷.成立) {
		疾厄宮其他論斷.註解 = "祿入遷移宮，為祿入父母宮的交友宮，可能成為別人養子，或是別人帶大的";
		命盤.人事宮.財帛宮.分析.push("疾厄宮" + 疾厄宮其他論斷.星曜 + 疾厄宮其他論斷.註解);
	}


	疾厄宮其他論斷.四化 ="忌沖";
	疾厄宮其他論斷.化入宮線 ="命宮";

	宮位單向四化(疾厄宮其他論斷, 命盤);
	if(疾厄宮其他論斷.成立 && 命盤.生日.性別=="女") {
		疾厄宮其他論斷.註解 = "忌沖命宮，為忌沖子女宮的子田線，生體不好而無法生育";
		命盤.人事宮.子女宮.分析.push("疾厄宮" + 疾厄宮其他論斷.星曜 + 疾厄宮其他論斷.註解);
	}	

    */

	// ×××××××××××××× 遷移宮 ×××××××××××××××××
    輸出宮位分類 = "遷移宮";
    var 遷移宮飛四化 = 宮位四化落宮(命盤, "遷移宮", 0);

    /*
	var 遷移宮破六線 = new 宮位飛四化元件();
	遷移宮破六線.化出宮 = "遷移宮";
	遷移宮破六線.化出相對宮 = "";
	遷移宮破六線.四化 ="忌沖";
	遷移宮破六線.化入宮線 ="遷移宮";
	
	遷移宮破六線.化入相對宮 = "子田線";
	宮位單向四化(遷移宮破六線, 命盤);
	if(遷移宮破六線.成立) {
		遷移宮破六線.註解 = "沖自身的子田線，也是福德宮的光明線、夫妻宮的成就線，。。。。。。";
		本命破六線註解.push("遷移宮" + 遷移宮破六線.星曜 + 遷移宮破六線.註解);
		命盤.人事宮.遷移宮.分析.push("遷移宮" + 遷移宮破六線.星曜 + 遷移宮破六線.註解);
	}
	

	遷移宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(遷移宮破六線, 命盤);
	if(遷移宮破六線.成立) {
		遷移宮破六線.註解 = "沖自身的成就線，也是福德宮的子田線、夫妻宮的光明線，。。。。。。";
		本命破六線註解.push("遷移宮" + 遷移宮破六線.星曜 + 遷移宮破六線.註解);
		命盤.人事宮.遷移宮.分析.push("遷移宮" + 遷移宮破六線.星曜 + 遷移宮破六線.註解);
	}


	遷移宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(遷移宮破六線, 命盤);
	if(遷移宮破六線.成立) {
		遷移宮破六線.註解 = "沖自身的光明線，也是福德宮的成就線、夫妻宮的子田線，。。。。。。";
		本命破六線註解.push("遷移宮" + 遷移宮破六線.星曜 + 遷移宮破六線.註解);
		命盤.人事宮.遷移宮.分析.push("遷移宮" + 遷移宮破六線.星曜 + 遷移宮破六線.註解);
	}

	// -------------- 三合方 -------------------
	var 遷移宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.遷移宮.地支數, false);
	if(遷移宮化入三方.成立) {
		本命破六線註解.push("遷移宮化" + 遷移宮化入三方.四化 + "入" + 遷移宮化入三方.三方宮位 + "三合");
		命盤.人事宮.遷移宮.分析.push("遷移宮化" + 遷移宮化入三方.四化 + "入" + 遷移宮化入三方.三方宮位 + "三合");
	} 
    */

	// -------------- 一六方 -------------------
	var 遷移宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.遷移宮.地支數, false);
	if(遷移宮化入一六.成立) {
		附加註解="";
		形式註解="遷移宮化" + 遷移宮化入一六.四化 + "入" + 遷移宮化入一六.一六宮位 + "的一、六";
		//if(遷移宮化入一六.一六宮位 == "" || 遷移宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.遷移宮.分析.push(形式註解 + 附加註解);
	}

	// -------------- 一六互沖 -------------------
	var 遷移宮一六相沖 = 一六互沖(命盤, "遷移宮");
	if(遷移宮一六相沖.成立) 命盤.人事宮.遷移宮.分析.push("遷移宮與" + 遷移宮一六相沖.六人事宮 + "（一、六）相互沖破");

    /*
	// -------------- 互沖六線 -------------------
	var 遷移父母互沖子田 = 宮位互沖六線(命盤, "遷移宮", "父母宮", "子田線");
	if(遷移父母互沖子田.成立) 命盤.人事宮.遷移宮.分析.push(遷移父母互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
	var 遷移宮其他論斷 = new 宮位飛四化元件();
	遷移宮其他論斷.化出宮 = "遷移宮";
	遷移宮其他論斷.化出相對宮 = "";
	遷移宮其他論斷.四化 ="化祿";
	遷移宮其他論斷.化入宮線 ="財帛宮";
	遷移宮其他論斷.化入相對宮 = "";	

	宮位單向四化(遷移宮其他論斷, 命盤);
	if(遷移宮其他論斷.成立) {
		遷移宮其他論斷.註解 = "祿入財帛宮，為夫妻宮的財帛宮祿入財帛宮，容易得到配偶的錢財，夫憑妻貴";
		命盤.人事宮.財帛宮.分析.push("遷移宮" + 遷移宮其他論斷.星曜 + 遷移宮其他論斷.註解);
	}


	遷移宮其他論斷.四化 ="化權";
	遷移宮其他論斷.化入宮線 ="命宮";
	宮位單向四化(遷移宮其他論斷, 命盤);
	if(遷移宮其他論斷.成立) {
		遷移宮其他論斷.註解 = "權入命宮，為父母宮的交友宮權入命，可能有雙重父母";
		命盤.人事宮.命宮.分析.push("遷移宮" + 遷移宮其他論斷.星曜 + 遷移宮其他論斷.註解);
	}

	遷移宮其他論斷.四化 ="化忌";
	//遷移宮其他論斷.化入宮線 ="命宮";
	宮位單向四化(遷移宮其他論斷, 命盤);
	if(遷移宮其他論斷.成立) {
		遷移宮其他論斷.註解 = "忌入命宮，為父母宮的交友宮忌入命，可能有雙重父母";
		命盤.人事宮.命宮.分析.push("遷移宮" + 遷移宮其他論斷.星曜 + 遷移宮其他論斷.註解);
	}

	遷移宮其他論斷.四化 ="忌沖";
	遷移宮其他論斷.化入宮線 ="夫妻宮";
	宮位單向四化(遷移宮其他論斷, 命盤);
	if(遷移宮其他論斷.成立) {
		遷移宮其他論斷.註解 = "忌沖命宮，為兄弟宮的疾厄宮忌沖疾厄宮的田宅宮，與母緣薄**";
		命盤.人事宮.命宮.分析.push("遷移宮" + 遷移宮其他論斷.星曜 + 遷移宮其他論斷.註解);
	}
	
    // -------------- 多向四化 -------------------
    if(遷移宮飛四化.化祿.宮位=="兄弟宮" && 遷移宮飛四化.化忌.宮位=="財帛宮") {
        成立條件 = "遷移宮（夫妻宮的財帛宮)祿入兄弟宮；忌入財帛宮";
        判斷句 = "，配偶會給錢命主";
        命盤.人事宮.夫妻宮.分析.push(成立條件 + 判斷句);
    } // end if
    
    */
    
    
	// ×××××××××××××× 交友宮 ×××××××××××××××××
    輸出宮位分類 = "交友宮";
    
    /*
	var 交友宮破六線 = new 宮位飛四化元件();
    
	交友宮破六線.化出宮 = "交友宮";
	交友宮破六線.化出相對宮 = "";
	交友宮破六線.四化 ="忌沖";
	交友宮破六線.化入宮線 ="交友宮";
	
	交友宮破六線.化入相對宮 = "子田線";
	宮位單向四化(交友宮破六線, 命盤);
	if(交友宮破六線.成立) {
		交友宮破六線.註解 = "沖自身的子田線，也是父母宮的光明線、子女宮的成就線，多人事是非。一般上是交友對方的問題。";
		本命破六線註解.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
		命盤.人事宮.交友宮.分析.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
	}
	

	交友宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(交友宮破六線, 命盤);
	if(交友宮破六線.成立) {
		交友宮破六線.註解 = "沖自身的成就線，也是父母宮的子田線、子女宮的光明線，。。。。。。";
		本命破六線註解.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
		命盤.人事宮.交友宮.分析.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
	}


	交友宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(交友宮破六線, 命盤);
	if(交友宮破六線.成立) {
		交友宮破六線.註解 = "沖自身的光明線，也是父母宮的成就線、子女宮的子田線，。。。。。。";
		本命破六線註解.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
		命盤.人事宮.交友宮.分析.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
	}


	交友宮破六線.化入宮線 ="父疾線";
	交友宮破六線.化入相對宮 = "";
	宮位單向四化(交友宮破六線, 命盤);
	if(交友宮破六線.成立) {
		交友宮破六線.註解 = "沖父疾線，為官祿宮的父母官（上司）沖官祿宮的子田線，打工沒有前途，宜自由業。";
		本命破六線註解.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
		命盤.人事宮.官祿宮.分析.push("交友宮" + 交友宮破六線.星曜 + 交友宮破六線.註解);
	}

	// -------------- 三合方 -------------------
	var 交友宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.交友宮.地支數, false);
	if(交友宮化入三方.成立) {
        成立條件 = "交友宮化" + 交友宮化入三方.四化 + "入" + 交友宮化入三方.三方宮位 + "三合，";
        switch(交友宮化入三方.三方宮位){
            case "命財官":
                輸出宮位分類 = "官祿宮";
                判斷句 = "父母的官化入命財官，繼承父母事業；或朋友資助創業，克應在大父重疊交友宮的大限。"
                break;
            case "夫遷福":
                輸出宮位分類 = "夫妻宮";
                判斷句 = "多桃花。"
                break;
            default:
                判斷句 = ""
        } // end switch
		//本命破六線註解.push();
		命盤.人事宮[輸出宮位分類].分析.push(成立條件 + 判斷句);
	} 

    */
    
    
	// -------------- 一六方 -------------------
	var 交友宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.交友宮.地支數, false);
	if(交友宮化入一六.成立) {
		附加註解="";
		形式註解="交友宮化" + 交友宮化入一六.四化 + "入" + 交友宮化入一六.一六宮位 + "的一、六";
		//if(交友宮化入一六.一六宮位 == "" || 交友宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.交友宮.分析.push(形式註解 + 附加註解);
	}


	// -------------- 一六互沖 -------------------
	var 交友宮一六相沖 = 一六互沖(命盤, "交友宮");
	if(交友宮一六相沖.成立) 命盤.人事宮.交友宮.分析.push("交友宮與" + 交友宮一六相沖.六人事宮 + "（一、六）相互沖破");	

    /*
	// -------------- 互沖六線 -------------------
	var 交友命宮互沖子田 = 宮位互沖六線(命盤, "交友宮", "命宮", "子田線");
	if(交友命宮互沖子田.成立) 命盤.人事宮.交友宮.分析.push(交友命宮互沖子田.條件 + "。。。。");
    */


	// ×××××××××××××× 官祿宮 ×××××××××××××××××
    輸出宮位分類 = "官祿宮";
    
    /*
	var 官祿宮破六線 = new 宮位飛四化元件();
	官祿宮破六線.化出宮 = "官祿宮";
	官祿宮破六線.化出相對宮 = "";
	官祿宮破六線.四化 ="忌沖";
	官祿宮破六線.化入宮線 ="官祿宮";
	
	官祿宮破六線.化入相對宮 = "子田線";
	宮位單向四化(官祿宮破六線, 命盤);
	if(官祿宮破六線.成立) {
		官祿宮破六線.註解 = "沖自身的子田線，也是命宮的光明線、財帛宮的成就線，事業不穩定。";
		本命破六線註解.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
		命盤.人事宮.官祿宮.分析.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
	}
	

	官祿宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(官祿宮破六線, 命盤);
	if(官祿宮破六線.成立) {
		官祿宮破六線.註解 = "沖自身的成就線，也是命宮的子田線、財帛宮的光明線，事業上賺錢辛苦。當老闆的不宜，事業賺不到錢";
		本命破六線註解.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
		命盤.人事宮.官祿宮.分析.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
	}


	官祿宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(官祿宮破六線, 命盤);
	if(官祿宮破六線.成立) {
		官祿宮破六線.註解 = "沖自身的光明線，也是命宮的成就線、財帛宮的子田線，打工比較沒有前途，容易與上司起衝突，書也念得比較差、學歷不高。沖父母為沖交友的財，難賺大眾的錢財；沖疾厄宮為工作地點不賺錢。當老闆的容易得罪客戶";
		本命破六線註解.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
		命盤.人事宮.官祿宮.分析.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
	}

	官祿宮破六線.化入宮線 ="財福線";
	官祿宮破六線.化入相對宮 = "";
	宮位單向四化(官祿宮破六線, 命盤);
	if(官祿宮破六線.成立) {
		官祿宮破六線.註解 = "沖財福線，為交友宮（上司）的子田線，與上司無緣，難得提拔，宜自由行業。";
		本命破六線註解.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
		命盤.人事宮.官祿宮.分析.push("官祿宮" + 官祿宮破六線.星曜 + 官祿宮破六線.註解);
	}	

	// -------------- 三合方 -------------------
	var 官祿宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.官祿宮.地支數, false);
	if(官祿宮化入三方.成立) {
        成立條件 = "官祿宮化" + 官祿宮化入三方.四化 + "入" + 官祿宮化入三方.三方宮位 + "三合，";
        switch(官祿宮化入三方.三方宮位){
            case "命財官":
                判斷句 = "創業。"
                break;
            case "夫遷福":
                判斷句 = "驛馬事業。"
                break;
            case "田疾兄":
                判斷句 = "父母的田宅宮化入田宅宮三方，得父母財產之象，大父或大子重疊時克應；大命重疊時宜從事房地產事業。"
                break;
            default:
                判斷句 = ""
        } // end switch
		//本命破六線註解.push();
		命盤.人事宮[輸出宮位分類].分析.push(成立條件 + 判斷句);
	}  // end if 化入三方

    */
    
    
	// -------------- 一六方 -------------------
	var 官祿宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.官祿宮.地支數, false);
	if(官祿宮化入一六.成立) {
		附加註解="";
		形式註解="官祿宮化" + 官祿宮化入一六.四化 + "入" + 官祿宮化入一六.一六宮位 + "的一、六";
		//if(官祿宮化入一六.一六宮位 == "" || 官祿宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.官祿宮.分析.push(形式註解 + 附加註解);
	}

	// -------------- 一六互沖 -------------------
	var 官祿宮一六相沖 = 一六互沖(命盤, "官祿宮");
	if(官祿宮一六相沖.成立) 命盤.人事宮.官祿宮.分析.push("官祿宮與" + 官祿宮一六相沖.六人事宮 + "（一、六）相互沖破");	

    /*
	// -------------- 互沖六線 -------------------
	var 官祿兄弟互沖子田 = 宮位互沖六線(命盤, "官祿宮", "兄弟宮", "子田線");
	if(官祿兄弟互沖子田.成立) 命盤.人事宮.官祿宮.分析.push(官祿兄弟互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
	var 官祿宮其他論斷 = new 宮位飛四化元件();
	官祿宮其他論斷.化出宮 = "官祿宮";
	官祿宮其他論斷.化出相對宮 = "";
	官祿宮其他論斷.四化 ="忌沖";
	官祿宮其他論斷.化入宮線 ="田宅宮";
	官祿宮其他論斷.化入相對宮 = "";	

	宮位單向四化(官祿宮其他論斷, 命盤);
	if(官祿宮其他論斷.成立) {
		官祿宮其他論斷.註解 = "忌沖田宅宮，為忌沖父母官的田宅宮沖田宅宮，早年離家**";
		命盤.人事宮.官祿宮.分析.push("官祿宮" + 官祿宮其他論斷.星曜 + 官祿宮其他論斷.註解);
	}  // end if
    */
    

	// ×××××××××××××× 田宅宮 ×××××××××××××××××
    
    /*
	var 田宅宮破六線 = new 宮位飛四化元件();
	田宅宮破六線.化出宮 = "田宅宮";
	田宅宮破六線.化出相對宮 = "";
	田宅宮破六線.四化 ="忌沖";
	田宅宮破六線.化入宮線 ="田宅宮";
	
	田宅宮破六線.化入相對宮 = "子田線";
	宮位單向四化(田宅宮破六線, 命盤);
	if(田宅宮破六線.成立) {
		田宅宮破六線.註解 = "沖自身的子田線，也是疾厄宮的成就線、兄弟宮的光明線，容易有意外";
		本命破六線註解.push("田宅宮" + 田宅宮破六線.星曜 + 田宅宮破六線.註解);
		命盤.人事宮.田宅宮.分析.push("田宅宮" + 田宅宮破六線.星曜 + 田宅宮破六線.註解);
	}
	

	田宅宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(田宅宮破六線, 命盤);
	if(田宅宮破六線.成立) {
		田宅宮破六線.註解 = "沖自身的成就線，也是疾厄宮的光明線、兄弟宮的子田線，。。。。。。";
		本命破六線註解.push("田宅宮" + 田宅宮破六線.星曜 + 田宅宮破六線.註解);
		命盤.人事宮.田宅宮.分析.push("田宅宮" + 田宅宮破六線.星曜 + 田宅宮破六線.註解);
	}

	田宅宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(田宅宮破六線, 命盤);
	if(田宅宮破六線.成立) {
		田宅宮破六線.註解 = "沖自身的光明線，也是疾厄宮的子田線、兄弟宮的成就線，。。。。。。";
		本命破六線註解.push("田宅宮" + 田宅宮破六線.星曜 + 田宅宮破六線.註解);
		命盤.人事宮.田宅宮.分析.push("田宅宮" + 田宅宮破六線.星曜 + 田宅宮破六線.註解);
	}

	// -------------- 三合方 -------------------
	var 田宅宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.田宅宮.地支數, false);
	if(田宅宮化入三方.成立) {
		本命破六線註解.push("田宅宮化" + 田宅宮化入三方.四化 + "入" + 田宅宮化入三方.三方宮位 + "三合");
		命盤.人事宮.田宅宮.分析.push("田宅宮化" + 田宅宮化入三方.四化 + "入" + 田宅宮化入三方.三方宮位 + "三合");
	}  // end if 化入三方

    */
    
	// -------------- 一六方 -------------------
	var 田宅宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.田宅宮.地支數, false);
	if(田宅宮化入一六.成立) {
		附加註解="";
		形式註解="田宅宮化" + 田宅宮化入一六.四化 + "入" + 田宅宮化入一六.一六宮位 + "的一、六";
		//if(田宅宮化入一六.一六宮位 == "" || 田宅宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.田宅宮.分析.push(形式註解 + 附加註解);
	}

	// -------------- 一六互沖 -------------------
	var 田宅宮一六相沖 = 一六互沖(命盤, "田宅宮");
	if(田宅宮一六相沖.成立) 命盤.人事宮.田宅宮.分析.push("田宅宮與" + 田宅宮一六相沖.六人事宮 + "（一、六）相互沖破");	

    /*
	// -------------- 互沖六線 -------------------
	var 田宅夫妻互沖子田 = 宮位互沖六線(命盤, "田宅宮", "夫妻宮", "子田線");
	if(田宅夫妻互沖子田.成立) 命盤.人事宮.田宅宮.分析.push(田宅夫妻互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
	var 田宅宮其他論斷 = new 宮位飛四化元件();
	田宅宮其他論斷.化出宮 = "田宅宮";
	田宅宮其他論斷.化出相對宮 = "";
	田宅宮其他論斷.四化 ="忌沖";
	田宅宮其他論斷.化入宮線 ="官祿宮";
	田宅宮其他論斷.化入相對宮 = "";	

	宮位單向四化(田宅宮其他論斷, 命盤);
	if(田宅宮其他論斷.成立) {
		田宅宮其他論斷.註解 = "忌沖官祿宮，為忌沖父母官的田宅宮，早年離家";
		命盤.人事宮.田宅宮.分析.push("田宅宮" + 田宅宮其他論斷.星曜 + 田宅宮其他論斷.註解);
	}

	田宅宮其他論斷.四化 ="化忌";
	田宅宮其他論斷.化入宮線 ="夫妻宮";
	宮位單向四化(田宅宮其他論斷, 命盤);
	if(田宅宮其他論斷.成立) {
		田宅宮其他論斷.註解 = "忌入夫妻宮，為交友的夫妻宮忌入夫妻宮，配偶是已婚/離婚人士";
		命盤.人事宮.田宅宮.分析.push("田宅宮" + 田宅宮其他論斷.星曜 + 田宅宮其他論斷.註解);
	}
    */

	// ×××××××××××××× 福德宮 ×××××××××××××××××
    
    /*
	var 福德宮破六線 = new 宮位飛四化元件();
	福德宮破六線.化出宮 = "福德宮";
	福德宮破六線.化出相對宮 = "";
	福德宮破六線.四化 ="忌沖";
	福德宮破六線.化入宮線 ="福德宮";
	
	福德宮破六線.化入相對宮 = "子田線";
	宮位單向四化(福德宮破六線, 命盤);
	if(福德宮破六線.成立) {
		福德宮破六線.註解 = "沖自身的子田線，也是夫妻宮的光明線、遷移宮的成就線，沒有福氣，脾气古怪，或修行人。";
		本命破六線註解.push("福德宮" + 福德宮破六線.星曜 + 福德宮破六線.註解);
		命盤.人事宮.福德宮.分析.push("福德宮" + 福德宮破六線.星曜 + 福德宮破六線.註解);
	}
	

	福德宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(福德宮破六線, 命盤);
	if(福德宮破六線.成立) {
		福德宮破六線.註解 = "沖自身的光明線，也是夫妻宮的成就線、遷移宮的子田線，。。。。。。";
		本命破六線註解.push("福德宮" + 福德宮破六線.星曜 + 福德宮破六線.註解);
		命盤.人事宮.福德宮.分析.push("福德宮" + 福德宮破六線.星曜 + 福德宮破六線.註解);
	}


	福德宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(福德宮破六線, 命盤);
	if(福德宮破六線.成立) {
		福德宮破六線.註解 = "沖自身的光明線，也是夫妻宮的子田線、遷移宮的成就線，。。。。。。";
		本命破六線註解.push("福德宮" + 福德宮破六線.星曜 + 福德宮破六線.註解);
		命盤.人事宮.福德宮.分析.push("福德宮" + 福德宮破六線.星曜 + 福德宮破六線.註解);
	}

	// -------------- 三合方 -------------------
	var 福德宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.福德宮.地支數, false);
	if(福德宮化入三方.成立) {
		本命破六線註解.push("福德宮化" + 福德宮化入三方.四化 + "入" + 福德宮化入三方.三方宮位 + "三合");
		命盤.人事宮.福德宮.分析.push("福德宮化" + 福德宮化入三方.四化 + "入" + 福德宮化入三方.三方宮位 + "三合");
	}  

    */
    
	// -------------- 一六方 -------------------
	var 福德宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.福德宮.地支數, false);
	if(福德宮化入一六.成立) {
		附加註解="";
		形式註解="福德宮化" + 福德宮化入一六.四化 + "入" + 福德宮化入一六.一六宮位 + "的一、六";
		//if(福德宮化入一六.一六宮位 == "" || 福德宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.福德宮.分析.push(形式註解 + 附加註解);
	}


	// -------------- 一六互沖 -------------------
	var 福德宮一六相沖 = 一六互沖(命盤, "福德宮");
	if(福德宮一六相沖.成立) 命盤.人事宮.福德宮.分析.push("福德宮與" + 福德宮一六相沖.六人事宮 + "（一、六）相互沖破");	

    /*
	// -------------- 互沖六線 -------------------
	var 福德子女互沖子田 = 宮位互沖六線(命盤, "福德宮", "子女宮", "子田線");
	if(福德子女互沖子田.成立) 命盤.人事宮.福德宮.分析.push(福德子女互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
	var 福德宮其他論斷 = new 宮位飛四化元件();
	福德宮其他論斷.化出宮 = "福德宮";
	福德宮其他論斷.化出相對宮 = "";
	福德宮其他論斷.四化 ="化忌";  //忌入
	福德宮其他論斷.化入宮線 ="子女宮";
	福德宮其他論斷.化入相對宮 = "";	

	宮位單向四化(福德宮其他論斷, 命盤);
	if(福德宮其他論斷.成立) {
		福德宮其他論斷.註解 = "忌入子女宮，為交友的子女忌入子女，會領養別人的孩子或收義子";
		命盤.人事宮.子女宮.分析.push("福德宮" + 福德宮其他論斷.星曜 + 福德宮其他論斷.註解);
	}

	福德宮其他論斷.四化 ="化祿";  //祿入
	宮位單向四化(福德宮其他論斷, 命盤);
	if(福德宮其他論斷.成立) {
		福德宮其他論斷.註解 = "祿入子女宮，為交友的子女祿入子女，會領養別人的孩子或收義子";
		命盤.人事宮.子女宮.分析.push("福德宮" + 福德宮其他論斷.星曜 + 福德宮其他論斷.註解);
	}

	福德宮其他論斷.四化 ="化科";
	宮位單向四化(福德宮其他論斷, 命盤);
	if(福德宮其他論斷.成立) {
		福德宮其他論斷.註解 = "科入子女宮，為交友的子女科入子女，會領養別人的孩子，收義子或是試管嬰兒產子";
		命盤.人事宮.子女宮.分析.push("福德宮" + 福德宮其他論斷.星曜 + 福德宮其他論斷.註解);
	}

	福德宮其他論斷.四化 ="忌沖";
	福德宮其他論斷.化入宮線 ="子田線";
	宮位單向四化(福德宮其他論斷, 命盤);
	if(福德宮其他論斷.成立) {
		福德宮其他論斷.註解 = "忌沖子田線，為沖破命財官的六線，對物慾淡薄，適合修行**";
		命盤.人事宮.福德宮.分析.push("福德宮" + 福德宮其他論斷.星曜 + 福德宮其他論斷.註解);
	}

	福德宮其他論斷.四化 ="忌沖";
	福德宮其他論斷.化入宮線 ="命宮";
	宮位單向四化(福德宮其他論斷, 命盤);
	if(福德宮其他論斷.成立) {
		福德宮其他論斷.註解 = "忌沖命宮，不宜賭博";
		if(福德宮其他論斷.星曜=="貪狼") 福德宮其他論斷.註解 = 福德宮其他論斷.註解 + "，但又偏偏喜歡賭博";
		命盤.人事宮.福德宮.分析.push("福德宮" + 福德宮其他論斷.星曜 + 福德宮其他論斷.註解);
	}
    */
    

	// ×××××××××××××× 父母宮 ×××××××××××××××××
    輸出宮位分類 = "父母宮";
    
    /*
	var 父母宮破六線 = new 宮位飛四化元件();
	父母宮破六線.化出宮 = "父母宮";
	父母宮破六線.化出相對宮 = "";
	父母宮破六線.四化 ="忌沖";
	父母宮破六線.化入宮線 ="父母宮";
	父母宮破六線.註解 = "";
	
	父母宮破六線.化入相對宮 = "子田線";
	宮位單向四化(父母宮破六線, 命盤);
	if(父母宮破六線.成立) {
		父母宮破六線.註解 = "沖自身的子田線，也是子女宮的光明線、交友宮的成就線，與父親缘薄。";
		本命破六線註解.push("父母宮" + 父母宮破六線.星曜 + 父母宮破六線.註解);
		命盤.人事宮.父母宮.分析.push("父母宮" + 父母宮破六線.星曜 + 父母宮破六線.註解);
	}
	

	父母宮破六線.化入相對宮 = "兄友線";
	宮位單向四化(父母宮破六線, 命盤);
	if(父母宮破六線.成立) {
		父母宮破六線.註解 = "沖自身的成就線，也是子女宮的子田線、交友宮的光明線，。。。。。。";
		本命破六線註解.push("父母宮" + 父母宮破六線.星曜 + 父母宮破六線.註解);
		命盤.人事宮.父母宮.分析.push("父母宮" + 父母宮破六線.星曜 + 父母宮破六線.註解);
	}


	父母宮破六線.化入相對宮 = "父疾線";
	宮位單向四化(父母宮破六線, 命盤);
	if(父母宮破六線.成立) {
		父母宮破六線.註解 = "沖自身的光明線，也是子女宮的成就線、交友宮的子田線，。。。。。。";
		本命破六線註解.push("父母宮" + 父母宮破六線.星曜 + 父母宮破六線.註解);
		命盤.人事宮.父母宮.分析.push("父母宮" + 父母宮破六線.星曜 + 父母宮破六線.註解);
	}

	// -------------- 三合方 -------------------
	var 父母宮化入三方 = 化入祿權忌三方(命盤, 命盤.人事宮.父母宮.地支數, false);
	if(父母宮化入三方.成立) {
        成立條件 = "父母宮化" + 父母宮化入三方.四化 + "入" + 父母宮化入三方.三方宮位 + "三合，";
        switch(父母宮化入三方.三方宮位){
            case "命財官":
                輸出宮位分類 = "官祿宮";
                判斷句 = "交友的財化入命財官，得交友投資、資助創業，或賺到錢財，克應在大友重疊的大限。"
                break;
            case "田疾兄":
                輸出宮位分類 = "財帛宮";
                判斷句 = "交友的財化入田宅宮三方，賺到錢財，克應在大友重疊的大限。"
                break;
            default:
                判斷句 = ""
        } // end switch
		//本命破六線註解.push();
		命盤.人事宮[輸出宮位分類].分析.push(成立條件 + 判斷句);
	}  // end if 化入三方

    */
    
    
	// -------------- 一六方 -------------------
	var 父母宮化入一六 = 化入祿權忌一六(命盤, 命盤.人事宮.父母宮.地支數, false);
	if(父母宮化入一六.成立) {
		附加註解="";
		形式註解="父母宮化" + 父母宮化入一六.四化 + "入" + 父母宮化入一六.一六宮位 + "的一、六";
		//if(父母宮化入一六.一六宮位 == "" || 父母宮化入一六.一六宮位 == "" ) 附加註解 = "，";
		命盤.人事宮.父母宮.分析.push(形式註解 + 附加註解);
	}

	
	// -------------- 一六互沖 -------------------
	var 父母宮一六相沖 = 一六互沖(命盤, "父母宮");
	if(父母宮一六相沖.成立) 命盤.人事宮.父母宮.分析.push("父母宮與" + 父母宮一六相沖.六人事宮 + "（一、六）相互沖破");	
    
    /*

	// -------------- 互沖六線 -------------------
	var 父母財帛互沖子田 = 宮位互沖六線(命盤, "父母宮", "財帛宮", "子田線");
	if(父母財帛互沖子田.成立) 命盤.人事宮.父母宮.分析.push(父母財帛互沖子田.條件 + "。。。。");

	var 父母兄弟互沖子田 = 宮位互沖六線(命盤, "父母宮", "兄弟宮", "子田線");
	if(父母兄弟互沖子田.成立) 命盤.人事宮.父母宮.分析.push(父母兄弟互沖子田.條件 + "。。。。");


	// -------------- 其他 -------------------
	var 父母宮其他論斷 = new 宮位飛四化元件();
	父母宮其他論斷.化出宮 = "父母宮";
	父母宮其他論斷.化出相對宮 = "";
	父母宮其他論斷.四化 ="忌沖";
	父母宮其他論斷.化入宮線 ="命宮";
	父母宮其他論斷.化入相對宮 = "";

	宮位單向四化(父母宮其他論斷, 命盤);
	if(父母宮其他論斷.成立) {
		父母宮其他論斷.註解 = "沖命宮，為沖田宅宮的子田線，與父親緣薄";
		命盤.人事宮.父母宮.分析.push("父母宮" + 父母宮其他論斷.星曜 + 父母宮其他論斷.註解);
	}


	父母宮其他論斷.四化 ="忌沖";
	父母宮其他論斷.化入宮線 ="財福線";
	宮位單向四化(父母宮其他論斷, 命盤);
	if(父母宮其他論斷.成立) {
		父母宮其他論斷.註解 = "沖財福線，為沖兄弟宮的子田線，父母感情不好**";
		命盤.人事宮.父母宮.分析.push("父母宮" + 父母宮其他論斷.星曜 + 父母宮其他論斷.註解);
	}


	父母宮其他論斷.四化 ="忌沖";
	父母宮其他論斷.化入宮線 ="田宅宮";
	宮位單向四化(父母宮其他論斷, 命盤);
	if(父母宮其他論斷.成立) {
		父母宮其他論斷.註解 = "沖田宅宮，為沖夫妻宮的田宅宮沖田宅宮，夫妻容易分居**";
		命盤.人事宮.夫妻宮.分析.push("父母宮" + 父母宮其他論斷.星曜 + 父母宮其他論斷.註解);
	}


	父母宮其他論斷.四化 ="化祿";
	父母宮其他論斷.化入宮線 ="財帛宮";
	宮位單向四化(父母宮其他論斷, 命盤);
	if(父母宮其他論斷.成立) {
		父母宮其他論斷.註解 = "祿入財帛宮，為交友宮的財帛宮祿入財帛宮，容易到大眾的錢財";
		命盤.人事宮.財帛宮.分析.push("子女宮" + 父母宮其他論斷.星曜 + 父母宮其他論斷.註解);
	}
    */

	// *********** testing **************
	/*
	var 大限測試  = new 宮位飛四化元件();
	大限測試.化出宮 = "大限財帛宮";
	大限測試.化出相對宮 = "";
	大限測試.化出宮重疊 = "";
	大限測試.大限數 = 3;
	大限測試.化出相對宮 = "";
	大限測試.四化 ="忌沖";
	大限測試.化入宮線 ="命遷線";
	大限測試.化入宮重疊 = "大限夫官線";
	
	宮位單向四化(大限測試, 命盤);
	console.log(大限測試);
	if(大限測試.成立) {
		console.log("大財沖命遷線");
	}
	

	*/
	
	return 本命破六線註解.join("<br>");
} // end function 斗數本命分析模塊