function 本命化祿權忌入三方論斷(命盤, 分析矩陣){
    // required function 化入祿權忌三方 (斗數分析配件)
    
    var 成立條件="", 判斷句="", 宮位地支數, 運算宮位="", 沖線="", 忌沖宮="", 化忌星="", 性別=命盤.生日.性別, 行運順逆=命盤.行運順逆, 本命人事宮化入三方;
    var 人事宮位 = ["命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮", "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮"];
    var 宮位祿忌關係矩陣;
    var 宮位tag = "";
    // **************** 簡單格局 **********************
    if(命盤.地支宮位[命盤.人事宮["命宮"].地支數].宮干四化.分析.府相朝垣) 分析矩陣.命宮.push("命財官三方為府相朝垣格最好打工，而且是服務業，不宜合夥，自己做生意也只能單打獨鬥。");
    if(命盤.地支宮位[命盤.人事宮["命宮"].地支數].宮干四化.分析.殺破狼) 分析矩陣.命宮.push("命財官三方為殺破狼格適合自由行业，創新，赶流行的行業。");
    
    // **************** 空宮 **********************
    if(命盤.人事宮.官祿宮.無主星 && 命盤.人事宮.財帛宮.無主星) {
        分析矩陣.命宮.push("官祿宮與財帛宮皆無主星，可以考慮到遠方他鄉發展事業。");
    }
    
    // **************** 化入三方 **********************
    for(var i=0; i<12; i++){
        宮位tag = "本命" + 人事宮位[i];
        運算宮位 = 人事宮位[i]; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 本命人事宮化入三方 = 化入祿權忌三方(命盤, 宮位地支數, true, 宮位tag);
        
        //if(宮位tag == "本命夫妻宮") console.log(本命人事宮化入三方);
        
        宮位祿忌關係矩陣 = 命盤.地支宮位[宮位地支數].宮干四化.分析;
        忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星;
        
        if(本命人事宮化入三方.成立) {
            成立條件 = 運算宮位 + "化" + 本命人事宮化入三方.四化 + "入" + 本命人事宮化入三方.三方宮位 + "三方，";
            宮位祿忌關係矩陣.化入三方 = true;
            宮位祿忌關係矩陣.化入三方四化 = 本命人事宮化入三方.四化;
            宮位祿忌關係矩陣.化入三方宮位 = 本命人事宮化入三方.三方宮位;
            宮位祿忌關係矩陣.化入三方地支 = 本命人事宮化入三方.三方地支;
            判斷句="";
            
            switch(本命人事宮化入三方.三方宮位) {
                case "命財官":
                    switch(運算宮位){
                        case "命宮":
                            判斷句="喜歡自己開創事業。";
                            break;
                            
                        case "兄弟宮":
                            判斷句="為田宅宮的財帛宮，適合房地產賺錢或收租金。";
                            if(行運順逆 == "順行") 判斷句 += "剋應於第三大限大財重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "剋應於第五大限大田重疊之時。";
                            break;
                            
                        case "夫妻宮":
                            判斷句="為遷移宮的官祿宮化入命財官，驛馬行業。同時也是福德宮的財帛宮，也可能從事偏財行業或得到偏財。";
                            if(行運順逆 == "順行") 判斷句 += "於第三大限大財重疊之時得偏財；第五大限大遷重疊之時得配偶的錢財。";
                            if(行運順逆 == "逆行") 判斷句 += "剋應於第五大限大福重疊之時。";
                            break;
                            
                        case "子女宮":
                            判斷句 = "為交友宮的官祿宮化入命財官，與朋友合夥或打工事業。同時也是父母宮的財帛宮，也可以幫父親工作或容易得到父母的錢財。";
                            if(行運順逆 == "順行") 判斷句 += "剋應於第五大限大友，或第六大限大官重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "剋應於第五大限大父重疊之時。";
                            break;
                            
                        case "財帛宮":
                            判斷句 = "多賺錢機遇，尤其是在第五大限，大官、大命重疊之時。";
                            break;
                            
                        case "疾厄宮":
                            判斷句 = "為田宅宮的官祿宮化入命財官，從事房地產相關行業，如中介等。同時也是兄弟宮的財帛宮，也可以幫兄弟工作。";
                            if(行運順逆 == "順行") 判斷句 += "剋應於第四大限大官，或第五大限大田重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "";
                            break;
                            
                        case "遷移宮":
                            判斷句 = "為福德宮的官祿宮化入命財官，可從事五術、心靈、輔導、瑜伽教學，慈善團體等工作。因也是夫妻宮的財帛宮，也適合幫配偶工作。";
                            if(行運順逆 == "順行") 判斷句 += "剋應於第三大限大官或第五大限大福重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "剋應於第三大限大財或第五大限大夫重疊之時";
                            break;
                            
                        case "交友宮":
                            判斷句 = "為父母宮的官祿宮化入命財官，從事家族事業或繼承父母的事業。同時也是子女宮的財帛宮，也適合從事教學或賺晚輩錢財的事業。";
                            if(行運順逆 == "順行") 判斷句 += "從事家族事業一般剋應於第二大限大官重疊，或第五大限大父重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "從事家教學事業一般剋應於第四、五大限大財、大子重疊之時。";
                            break;
                            
                        case "官祿宮":
                            判斷句 = "";
                            if(行運順逆 == "順行") 判斷句 += "於第三大限重疊大父（子女宮的官祿宮）；於第六大限重疊大夫（遷移宮的官祿宮）。";
                            if(行運順逆 == "逆行") 判斷句 += "於第三大限重疊大疾（田宅宮的官祿宮）；於第六大限重疊大子（交友宮的官祿宮）。";
                            break;
                            
                        case "田宅宮":
                            判斷句 = "適合房地產相關事業，如發展商、裝修，建材、地產中介、房地產投資事業。";
                            if(忌沖宮 == "兄弟宮") 判斷句 += "但因忌沖兄弟宮，因此房地產投資無法賺錢。";
                            
                            if(行運順逆 == "順行") 判斷句 += "剋應於第四大限大命、第五大限大兄重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "於第二大限大友重疊之時會從事房地產行業。";
                            break;
                            
                        case "福德宮":
                            判斷句 = "為夫妻宮的官祿宮化入命財官，與配偶打工、創業。也是遷移宮的財帛宮，適合驛馬行業；也可以是嗜好、五術生財。";
                            if(行運順逆 == "順行") 判斷句 += "剋應於第四大限大財、第五大限大子重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "剋應於第三大限大官、第四大限大友重疊之時。第五大限大遷重疊福德之時也適合五術行業。";
                            break;
                            
                        case "父母宮":
                            判斷句 = "為子女宮的官祿宮化入命財官，從事賺晚輩的錢財行業，如教育等。同時也是交友宮的財帛宮，也適合從事大眾服務、零售等行業，或父母、朋友出資創業。";
                            if(行運順逆 == "順行") 判斷句 += "剋應於第四大限大夫、第六大限大財重疊之時。";
                            if(行運順逆 == "逆行") 判斷句 += "剋應於第三大限大官、第五大限大遷重疊之時";
                            break;
                    } // switch 運算宮位
                    
                    break;
                 case "夫遷福":
                    switch(運算宮位){
                        case "命宮":
                            判斷句="";
                            break;
                            
                        case "兄弟宮":
                            判斷句="";
                            break;
                            
                        case "夫妻宮":
                            判斷句="";
                            break;
                            
                        case "子女宮":
                            判斷句="";
                            break;
                            
                        case "財帛宮":
                            判斷句 = "錢財去了配偶、旅行、享受之處。";
                            break;
                            
                        case "疾厄宮":
                            判斷句="";
                            break;
                            
                        case "遷移宮":
                            判斷句="";
                            break;
                            
                        case "交友宮":
                            判斷句="人緣好，多桃花。";
                            break;
                            
                        case "官祿宮":
                            判斷句="驛馬事業。";
                            if(行運順逆 == "順行") 判斷句 += "於第五大限大命重疊之時剋應。";
                            if(行運順逆 == "逆行") 判斷句 += "於第三大限大遷，或第五大限大財重疊之時剋應。";
                            break;
                            
                        case "田宅宮":
                            判斷句="為交友宮的夫妻宮化入夫妻宮，配偶可能是已婚或失婚人士。";
                            if(行運順逆 == "順行") 判斷句 += "於第六大限可能會再有黃昏之戀。";
                            if(行運順逆 == "逆行") 判斷句 += "尤其是在第三大限大友重疊之時的交友對象。";
                            break;
                            
                        case "福德宮":
                            判斷句="";
                            break;
                            
                        case "父母宮":
                            判斷句="";
                            break;
                    } // switch 運算宮位
                    break;
                case "田疾兄":
                    switch(運算宮位){
                        case "命宮":
                            判斷句="喜歡投資房地產。";
                            break;
                            
                        case "兄弟宮":
                            判斷句="有利於房地產投資。";
                            if(行運順逆 == "順行") 判斷句 += "於第四大限大財重疊之時可從事、投資房地產獲利。";
                            if(行運順逆 == "逆行") 判斷句 += "";
                            break;
                            
                        case "夫妻宮":
                            判斷句="為福德宮的財帛宮化入田疾兄，有偏財機遇。";
                            if(行運順逆 == "順行") 判斷句 += "於第三大限大財重疊之時得偏財；第五大限大遷重疊之時得配偶的錢財。";
                            if(行運順逆 == "逆行") 判斷句 += "剋應於第五大限大福重疊之時。";
                            break;
                            
                        case "子女宮":
                            判斷句="";
                            break;
                            
                        case "財帛宮":
                            判斷句 = "因財帛宮也是交友宮的田宅宮，適合房地產投資。也可以論為富命，因為錢財能夠累積。";
                            if(行運順逆 == "順行") 判斷句 += "於第四大限大友重疊之時會有房地產買賣的機遇。（流父重疊大友時為賣，有賺錢之意；流友重疊大友為買房地產）；第五大限大遷重疊之時得配偶的錢財。"; else 判斷句 += "";
                            break;
                            
                        case "疾厄宮":
                            判斷句 = "因疾厄宮也是田宅宮的官祿宮，可從事房地產行業。";
                            break;
                            
                        case "遷移宮":
                            判斷句 = "有機遇得到偏財或配偶的錢財。";
                                if(行運順逆 == "順行") 判斷句 += "於第五大限大福重疊之時有偏財運或賺五術的錢財；於第八大限大夫重疊之時得配偶的錢財。"; else 判斷句 += "於第五大限大夫重疊之時得配偶的錢財。";
                            break;
                            
                        case "交友宮":
                            判斷句="";
                            break;
                            
                        case "官祿宮":
                            判斷句 = "可從事房地產行業。";
                            break;
                            
                        case "田宅宮":
                            判斷句="";
                            break;
                            
                        case "福德宮":
                            判斷句="";
                            break;
                            
                        case "父母宮":
                            判斷句="";
                            break;
                    } // switch 運算宮位
                    break;
                case "父子友":
                    switch(運算宮位){
                        case "命宮":
                            判斷句="個性外向，注重子女。";
                            break;
                            
                        case "兄弟宮":
                            判斷句="";
                            break;
                            
                        case "夫妻宮":
                            判斷句 = "";
                            if(行運順逆 == "順行") 判斷句 += "";
                            if(行運順逆 == "逆行") 判斷句 += "於第四大限，大限父母宮重疊之時形成大父（交友宮的財帛宮）化入交友三方重疊大限命財官，會有借貸行為。";
                            break;
                            
                        case "子女宮":
                            判斷句="";
                            break;
                            
                        case "財帛宮":
                            判斷句="";
                            break;
                            
                        case "疾厄宮":
                            判斷句="";
                            break;
                            
                        case "遷移宮":
                            判斷句="";
                            break;
                            
                        case "交友宮":
                            判斷句="";
                            break;
                            
                        case "官祿宮":
                            判斷句="打工仔格。";
                            if(行運順逆 == "順行") 判斷句 += "";
                            if(行運順逆 == "逆行") 判斷句 += "於第五大限，大限財帛宮重疊之時形成，大財化入交友三方重疊大限交友三方，有可能會借錢或投資朋友的生意。";
                            break;
                            
                        case "田宅宮":
                            判斷句="";
                            break;
                            
                        case "福德宮":
                            判斷句="";
                            break;
                            
                        case "父母宮":
                            判斷句="";
                            if(行運順逆 == "順行") 判斷句 += "";
                            if(行運順逆 == "逆行") 判斷句 += "於第四大限，大限官祿宮重疊之時形成，大官化入交友三方重疊大限命財官，合夥機遇，投資朋友的事業。";
                            break;
                    } // switch 運算宮位
                    break;
            } // end switch 本命人事宮化入三方.三方宮位

            if(判斷句!="") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
        } // end if 化入三方.成立        
    } // end for
}  // end function 本命化祿權忌入三方論斷



// -----------------------------------------------------------

function 本命化祿權忌入一六十論斷(命盤, 分析矩陣){
    // required function 化入祿權忌一六十 (斗數分析配件)
    
    var 成立條件="", 判斷句="", 性別=命盤.生日.性別, 行運順逆=命盤.行運順逆, 本命人事宮化入一六十;
    var 人事宮位 = ["命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮", "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮"];
    var 運算宮位, 對應宮, 忌沖宮, 忌沖宮線;
    
    for(var i=0; i<12; i++){
        var 運算宮位 = 人事宮位[i];
            for(var j=0; j<12; j++){
                對應宮 = 人事宮位[j];
                本命人事宮化入一六十 = 化入祿權忌一六十(命盤, 運算宮位, 對應宮, 1, false);
                if(本命人事宮化入一六十.成立) {
                    成立條件 = 本命人事宮化入一六十.化出宮 + 本命人事宮化入一六十.成立條件
                    忌沖宮 = 本命人事宮化入一六十.忌沖宮; 忌沖宮線 = 本命人事宮化入一六十.忌沖宮線;
                    判斷句="";
                    //console.log(本命人事宮化入一六十);
                    switch(運算宮位){
                        case "命宮":
                            判斷句="";
                            
                            if(對應宮 == "命宮") 判斷句 = "，有權勢，為人不易妥協。";
                            if(對應宮 == "官祿宮") 判斷句 = "，事業心重。";
                            if(對應宮 == "交友宮") 判斷句 = "，容易給朋友影響，沒有立場。";
                            break;

                        case "兄弟宮":
                            判斷句="";
                            switch(對應宮){
                                case "命宮":
                                    判斷句 = "，容易賺到房地產的錢。";
                                    if(行運順逆 == "順行") 判斷句 += "於第四大限大財重疊時剋應。";
                                    if(行運順逆 == "逆行") 判斷句 += "於第五大限大田重疊時剋應。";
                                    break;
                                case "財帛宮":
                                    判斷句 = "，容易賺到房地產的錢。";
                                    if(行運順逆 == "順行") 判斷句 += "於第四大限大財重疊時剋應。";
                                    if(行運順逆 == "逆行") 判斷句 += "於第三大限大父重疊時容易賺到朋友大眾的錢財；於第五大限大田重疊時容易賺到房地產的錢財。";
                                    break;
                            } //end switch
                            break;

                        case "夫妻宮":
                            判斷句="";
                            switch(對應宮){
                                case "命宮":
                                    判斷句 = "，桃花命。";
                                    //if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    break;
                                    
                                case "財帛宮":
                                    判斷句 = "，偏財命。";
                                    //console.log(本命人事宮化入一六十);
                                    if(本命人事宮化入一六十.化入一六 && 本命人事宮化入一六十.忌入 == 1) 判斷句 = "，因祿入田宅宮，忌入財帛宮，屬於尚好的偏財命。";
                                    if(本命人事宮化入一六十.化入一六 && 本命人事宮化入一六十.忌入 == 6) 判斷句 = "，因祿入財帛宮，忌入田宅宮，有偏財命但帶破，不宜從事偏門行業。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入 == 1) 判斷句 = "，因祿入兄弟宮，忌入財帛宮，屬於很好的偏財命。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入 == 10) 判斷句 = "，因祿入財帛宮，忌入兄弟宮，有偏財命但帶破，不宜從事偏門行業。";

                                    if(行運順逆 == "順行") 判斷句 += "於第二大限大財重疊時剋應。"; else 判斷句 += "於第五大限大福重疊時剋應。";
                            } // end switch 財帛宮
                            
                            break;

                        case "子女宮":
                            判斷句="";
                            switch(對應宮){
                                case "財帛宮":
                                    判斷句 = "，得到父母錢財之象。";
                                    if(忌沖宮 != "田宅宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易得到父母的錢財。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "財帛宮") 判斷句 = "，得到父錢財的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += "於第五大限大父重疊時剋應。"; else 判斷句 += "";
                                    break;
                                case "疾厄宮":
                                    判斷句 = "，注重身體享受，好色。";
                                    if(性別 == "女") 判斷句 += "女命容易懷孕、多子之象。";
                                    break;
                                case "官祿宮":
                                    判斷句 = "，與朋友合夥之象。";
                                    if(忌沖宮 != "疾厄宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，多合夥機遇。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "官祿宮") 判斷句 = "，合夥事業的最佳組合。";
                                    break;
                            } // end switch 子女宮
                            break;

                        case "財帛宮":
                            判斷句="";
                            switch(對應宮){
                                case "財帛宮":
                                    判斷句 = "，能賺錢、喜投資。";
                                    break;
                                case "官祿宮":
                                    判斷句 = "，喜投資、創業。";
                                    break;
                                case "兄弟宮":
                                    判斷句 = "，能積存錢財。";
                                    break;
                                case "交友宮":
                                    判斷句 = "，錢財去了交友處。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "財帛宮") 判斷句 = "，因忌入財帛宮為交友的田宅，故為投資房地產。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "於第五大限大命重疊時剋應。";
                                    break;
                                case "田宅宮":
                                    判斷句 = "，喜歡投資房地產。";
                                    break;
                                case "子女宮":
                                    判斷句 = "，賺錢給父母、為父母工作、家族事業；或是合夥事業。";
                                    break;
                                case "遷移宮":
                                    判斷句 = "，賺錢給配偶，捨得為配偶花錢。";
                                    break;
                            } //end switch 財帛宮
                            break;

                        case "疾厄宮":
                            判斷句="";
                            switch(對應宮){
                                case "官祿宮":
                                    判斷句 = "，適合從事房地產賺錢。";
                                    if(忌沖宮 != "疾厄宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易從事房地產賺錢。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "官祿宮") 判斷句 = "，因祿入疾厄宮，忌入官祿宮，從事房地產事業的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += "於第四大限大官重疊時剋應。"; else 判斷句 += "";
                                    break;
                                case "財帛宮":
                                    判斷句 = "，適合從事房地產賺錢。";
                                    if(忌沖宮 != "田宅宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易從事房地產賺錢。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "財帛宮") 判斷句 = "，因祿入兄弟宮，忌入財帛宮，從事房地產事業的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += "於第四大限大官重疊時剋應。"; else 判斷句 += "";
                                    break;
                                case "夫妻宮":
                                    判斷句 = "";
                                    if(行運順逆 == "順行") 判斷句 += "，於第三大限大友重疊之時桃花運旺盛。"; else 判斷句 += "";
                                    break;
                            } //end switch 疾厄宮

                            break;

                        case "遷移宮":
                            判斷句="";
                            switch(對應宮){
                                case "官祿宮":
                                    判斷句 = "，驛馬或從事五術事業。";
                                    if(行運順逆 == "順行") 判斷句 += "於第三大限大官重疊時剋應。"; else 判斷句 += "";
                                    break;
                                case "財帛宮":
                                    if(忌沖宮 != "田宅宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易得到配偶的錢財。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "財帛宮") 判斷句 = "，因祿入兄弟宮，忌入財帛宮，得到配偶錢財的最佳組合。";
                                    break;
                                case "命宮":
                                    判斷句 = "，多驛馬，或有機遇得到偏財、配偶的錢財。";
                                    if(行運順逆 == "順行") 判斷句 += "於第五大限大福重疊之時有偏財運或賺五術的錢財；於第八大限大夫重疊之時得配偶的錢財。"; else 判斷句 += "於第五大限大夫重疊之時得配偶的錢財。";
                                    break;
                            } // end switch 遷移宮
                            break;

                        case "交友宮":
                            判斷句="";
                            switch(對應宮){
                                case "命宮":
                                    判斷句 = "，容易得到朋友大眾的幫助、眷顧。";
                                    if(行運順逆 == "順行") 判斷句 += "於第五大限大父重疊時容易賺到朋友大眾的錢財。"; else 判斷句 += "";
                                    break;
                                case "夫妻宮":
                                    判斷句 = "，多桃花。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "於第五大限大夫重疊時易有黃昏之戀。";
                                    break;
                                case "財帛宮":
                                    判斷句 = "，會得到子女的奉養。";
                                    if(忌沖宮 != "田宅宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易得到子女的錢財、奉養。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "財帛宮") 判斷句 = "，因祿入兄弟宮，忌入財帛宮，得到子女錢財、奉養的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    break;
                            } // end switch 交友宮
                            
                            break;

                        case "官祿宮":
                            判斷句="";
                            switch(對應宮){
                                case "官祿宮":
                                    判斷句 = "，得到父母事業之象。";
                                    if(忌沖宮 != "疾厄宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易得到父母事業。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "官祿宮") 判斷句 = "，得到父母事業的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    break;
                                    
                                case "交友宮":
                                    判斷句 = "，打工仔，或是政府公職人員。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    break;
                                    
                                case "田宅宮":
                                    判斷句 = "，適合房地產、酒店事業。";
                                    if(行運順逆 == "順行") 判斷句 += "於第五大限大命重疊時剋應。"; else 判斷句 += "於第五大限大財重疊時剋應。";
                                    break;
                                case "福德宮":
                                    判斷句 = "，有夫妻檔、或投資配偶創業可能性。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    break;
                            } // end switch 官祿宮
                            break;

                        case "田宅宮":
                            判斷句="";
                            switch(對應宮){
                                case "命宮":
                                    判斷句 = "，得到，或從事房地產之象。";
                                    if(忌沖宮 != "田宅宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易從事房地產事業。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "命宮") 判斷句 = "，從事房地產事業的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += "於第五大限大兄重疊時剋應。"; else 判斷句 += "";
                                    break;
                                case "夫妻宮":
                                    判斷句 = "，配偶可能是已混失混人士或三角戀情。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "夫妻宮") 判斷句 = "，配偶容易是已混失混人士或三角戀情。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "尤其是第三大限大友重疊之時。";
                                    break;
                                case "官祿宮":
                                    判斷句 = "，從事房地產事業之象。";
                                    if(忌沖宮 != "疾厄宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易從事房地產事業。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "官祿宮") 判斷句 = "，從事房地產事業的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    break;
                                case "財帛宮":
                                    判斷句 = "，房地產賺錢事業之象。";
                                    if(忌沖宮 != "田宅宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易在房地產賺錢。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "官祿宮") 判斷句 = "在房地產賺錢的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    break;
                                case "交友宮":
                                    判斷句 = "";
                                    if(本命人事宮化入一六十.化入一十) {
                                        判斷句 = "，賣房地產之象。";
                                        if(本命人事宮化入一六十.忌入宮 == "交友宮") 判斷句 += "因忌沖兄弟宮，可能是虧錢或價格不佳的變賣房地產。";
                                    }
                                    if(行運順逆 == "順行") 判斷句 += "剋應於第四大限，大命重疊田宅宮之時。"; else 判斷句 += "";
                                    break;
                            } // end switch 田宅宮
                            
                            break;

                        case "福德宮":
                            判斷句="";
                            switch(對應宮){
                                case "官祿宮":
                                    判斷句 = "，夫妻合作事業或從事五術事業之象。";
                                    if(忌沖宮 != "疾厄宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易夫妻合作事業或從事五術事業。";
                                    if(本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "官祿宮") 判斷句 = "，夫妻合作事業或從事五術事業的最佳組合。";
                                    if(行運順逆 == "順行") 判斷句 += ""; else 判斷句 += "";
                                    
                                    break;
                            } // end switch 福德宮
                            
                            break;

                        case "父母宮":
                            判斷句="";
                            
                            if(對應宮 == "財帛宮" && 忌沖宮 != "田宅宮" && 忌沖宮 != "兄弟宮") 判斷句 = "，容易賺到大眾的錢財。";
                            if(對應宮 == "財帛宮" && 本命人事宮化入一六十.化入一十 && 本命人事宮化入一六十.忌入宮 == "財帛宮") 判斷句 = "，因祿入兄弟宮，忌入財帛宮，得到大眾錢財的最佳組合。";
                            
                            break;
                    } // end switch
                    
                    if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                } // end if 成立
            } // end for j
    } // end for i
    
} // end function 本命化祿權忌入一六十論斷


function 本命一六祿忌論斷(命盤, 分析矩陣){
    // required 地支宮位[].宮干四化.分析 (祿權忌位置)
    
    var 成立條件="", 判斷句="", 性別 = 命盤.生日.性別, 行運順逆 = 命盤.行運順逆;
    var 人事宮位 = ["命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮", "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮"];
    var 運算宮位, 運算宮位六, 運算宮位地支, 化祿星, 化忌星;
    
    for(var i=0; i<12; i++){
        運算宮位 = 人事宮位[i];
        運算宮位六 = 人事宮位[地支滾動(i,5)];
        運算宮位地支 = 命盤.人事宮[運算宮位].地支數;
        化忌星 = 命盤.地支宮位[運算宮位地支].宮干四化.化忌星;
        化祿星 = 命盤.地支宮位[運算宮位地支].宮干四化.化祿星;
        
        if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一 || 命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一 || 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖) {
            
            switch(運算宮位){
                case "命宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "容易發生意外。因疾厄宮沖命宮也是疾厄宮沖子女宮的田宅宮，與孩子緣分較薄。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "兄弟宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "夫妻宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        判斷句 = "多桃花之象。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "戀愛容易失敗之象。";
                        //收錄在交友宮沖成就線
                        //if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        判斷句 = "感情婚姻容易失敗，遲婚、失婚之象。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    
                    break;

                case "子女宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "子女緣薄。";
                        if(性別 == "女") 判斷句 = "子女緣薄，易流產之象。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        判斷句 = "子女緣薄。";
                        if(性別 == "女") 判斷句 = "子女緣薄，易流產之象。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "財帛宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="賺房地產的錢財，賺錢比較輕鬆。**";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "疾厄宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "遷移宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "交友宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "社交差，與友人多衝突。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        判斷句 = "社交差，與友人多衝突。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "官祿宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "事業不穩定，多轉換行業。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        判斷句 = "事業不穩定，多轉換行業。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "田宅宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "家宅不穩定，多搬家。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        判斷句 = "家宅不穩定，多搬家。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "福德宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "精神生活不佳。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        判斷句 = "精神生活不佳。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;

                case "父母宮":
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六祿一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化祿星 + "化祿入自身，";
                        判斷句="";
                        
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六祿一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.六沖一){
                        成立條件 = 運算宮位 + "的6（" + 運算宮位六 + "）" + 化忌星 + "化忌沖自身，";
                        判斷句="";
                        判斷句 = "父緣薄。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 六沖一
                    
                    
                    if(命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖){
                        成立條件 = 運算宮位 + "與自身的6（" + 運算宮位六 + "）" + "互沖於" + 命盤.地支宮位[運算宮位地支].宮干四化.分析.一六互沖線 + "，";
                        判斷句="";
                        判斷句 = "父緣薄。";
                        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
                    } // end if 一六互沖
                    break;
            
            } // end switch 運算人事宮位
        } // end if 六祿一 or 六沖一 or 一六互沖
    } // end for i

} // end function 本命一六祿忌論斷


// -----------------------------------------------------------

function 本命宮位沖六線論斷(命盤, 分析矩陣){
    var 成立條件="", 判斷句="", 宮位地支數, 運算宮位="", 沖線="", 化忌星="", 性別=命盤.生日.性別, 行運順逆=命盤.行運順逆;
    
    // ------------ 命宮 ------------
    運算宮位 = "命宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);

    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的子田線，";
        判斷句 = "也是沖官祿宮的成就線、財帛宮的光明線，根基浮。";
        if(忌沖宮 == "子女宮") 判斷句 = 判斷句 + "因忌入的田宅宮也是父母官的交友宮的子女宮，會有成為義子的可能性（認乾爹、或給別人帶大、過契給神明等）。";
        if(忌沖宮 == "田宅宮") 判斷句 = 判斷句 + "因忌沖自身田宅宮，愛往外跑，或早年離家。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的成就線，也是沖官祿宮的光明線、財帛宮的子田線，";
        判斷句 = "比較不容易得到賞識，也不宜創業。最好靠專業技能謀生。";
        if(行運順逆 == "順行" && 忌沖宮 == "兄弟宮") 判斷句 = 判斷句 + "因忌沖兄弟宮，於第五大限大財重疊，錢財投資容易損失。";
        if(行運順逆 == "順行" && 忌沖宮 == "交友宮") 判斷句 = 判斷句 + "因忌入兄弟宮，於第五大限大財重疊，事業上或投資都容易賺到錢。";
        if(行運順逆 == "逆行" && 忌沖宮 == "兄弟宮") 判斷句 = 判斷句 + "因忌入交友宮，於第四大限大田重疊，有虧錢變賣房地產之象（大田忌入交友重疊交友的田，且忌沖兄弟宮）。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的光明線，也是沖財帛宮的成就線、官祿宮的子田線，";
        判斷句 = "事業機遇差。在第五大限大官、大財重疊命宮克應。";
        if(行運順逆 == "順行") 判斷句 = 判斷句 + "於第五大限，大財重疊時形成大財忌沖自身的光明線重疊成就線，錢財投資容易損失。";
        if(行運順逆 == "逆行") 判斷句 = 判斷句 + "於第五大限，大官重疊時形成大官忌沖自身的子田線重疊成就線，嚴重的事業挫敗，倒閉、失業等。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線

    
    // ------------ 兄弟宮 ------------
    運算宮位 = "兄弟宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的子田線，也是沖田宅宮的成就線、疾厄宮的光明線，";
        判斷句 = "與母親緣薄。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的成就線，也是沖疾厄宮的子田線、田宅宮的光明線，";
        判斷句 = "也是母親沖父母宮的子田線，父母緣薄、不和、聚少離多。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的光明線，也是沖疾厄宮的成就線、田宅宮的子田線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 夫妻宮 ------------
    運算宮位 = "夫妻宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的子田線，也是沖福德宮的成就線、遷移宮的光明線，";
        判斷句 = "夫妻緣薄，不婚、遲婚或夫妻容易離異。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖福德宮的光明線、遷移宮的子田線，";
        判斷句 = "";
        if(行運順逆 == "順行") 判斷句 = 判斷句 + "";
        if(行運順逆 == "逆行") 判斷句 = 判斷句 + "於第四大限，大父重疊時形成大父（夫妻宮的田宅宮）重疊夫妻宮忌沖田宅宮，夫妻分居或聚少離多。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖福德宮的子田線、遷移宮的成就線，";
        判斷句 = "";
        
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 子女宮 ------------
    運算宮位 = "子女宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的子田線，也是沖父母宮的成就線、交友宮的光明線，";
        判斷句 = "子女緣薄。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖父母宮的光明線、交友宮的子田線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖父母宮的子田線、交友宮的成就線，";
        判斷句 = "";
        
        if(忌沖宮 == "官祿宮") {
            判斷句 = "為交友宮的官祿宮化忌沖官祿宮，不宜合夥，打工的也較不得賞識。";
            if(行運順逆 == "順行") 判斷句 += "於第四大限大友重疊之時形成大友化忌沖官祿宮，事業不佳。";
            if(行運順逆 == "逆行") 判斷句 += "";
        } //end if 忌沖宮 == "官祿宮"
        
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 財帛宮 ------------
    運算宮位 = "財帛宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的子田線，也是沖命宮的成就線、官祿宮的光明線，";
        判斷句 = "";
        if(忌沖宮=="兄弟宮") {
            if(行運順逆 == "順行") 判斷句 += "於第四大限大友重疊之時形成，大友化忌沖兄弟宮重疊大限財帛宮，嚴重人事損財。";
            if(行運順逆 == "逆行") 判斷句 += "";
        } //if(忌沖宮=="兄弟宮")
        
        if(忌沖宮=="交友宮") {
            if(行運順逆 == "順行") 判斷句 += "於第四大限大友重疊之時形成，大友化忌入兄弟宮重疊大限財帛宮，賺到朋友大眾的錢財。";
            if(行運順逆 == "逆行") 判斷句 += "";
        } //if(忌沖宮=="兄弟宮")
        
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖命宮的光明線、官祿宮的子田線，";
        判斷句 = "事業賺錢困難。";
        if(行運順逆 == "順行") 判斷句 += "於第五大限大官重疊之時形成，大官化忌沖子父疾線（官祿宮的子田線）重疊大限子田線（官祿宮的成就線），事業嚴重潰敗。";
        if(行運順逆 == "逆行") 判斷句 += "於第五大限命重疊之時形成，大命重疊財帛宮化忌沖子父疾線（財帛宮的成就線）重疊大限兄友線（財帛宮的子田線），賺錢困難。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖命宮的子田線、官祿宮的成就線，";
        判斷句 = "錢財不易累積。";
        if(行運順逆 == "順行") 判斷句 += "於第五大限大官重疊之時形成，大官化忌沖子田線（官的成就線）重疊大限兄友線（官的光明線），事業發展困難。";
        if(行運順逆 == "逆行") 判斷句 += "於第四大限大兄重疊之時形成，大兄重疊田宅宮（田宅宮的財）化忌沖子田線重疊大限命遷線（田宅宮的子田線），難賺房地產的錢財。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 疾厄宮 ------------
    運算宮位 = "疾厄宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的子田線，也是沖兄弟宮的成就線、田宅宮的光明線，";
        判斷句 = "健康不好，容易有意外，父緣差。";
        if(行運順逆 == "順行") 判斷句 += "於第四大限大官重疊之時形成，大官化忌沖夫官線重疊大限父疾線（官祿宮的子田線），事業容易遭受潰敗。";
        if(行運順逆 == "逆行") 判斷句 += "於第三大限大夫重疊之時形成，大夫化忌沖夫官線重疊大限父疾線（夫妻宮的子田線)，婚姻容易出現狀況。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的成就線，也是沖兄弟宮的光明線、子女宮、田宅宮的子田線，";
        判斷句 = "子女緣差。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的光明線，也是沖兄弟宮、交友宮的子田線、田宅宮的成就線，";
        判斷句 = "社交緣差或與母緣薄。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 遷移宮 ------------
    運算宮位 = "遷移宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的子田線，也是沖福德宮的光明線、夫妻宮的成就線，";
        判斷句 = "多奔波、驛馬，交通意外。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖福德宮的子田線、夫妻宮的光明線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖福德宮的成就線、夫妻宮的子田線，";
        判斷句 = "";
        if(行運順逆 == "順行") 判斷句 += "於第三大限大官重疊之時形成大夫忌沖子田線重疊光明線，事業遭遇失敗、失業的狀況。";
        if(行運順逆 == "逆行") 判斷句 += "於第四大限大子重疊之時形成大子忌沖父疾線重疊大限夫官線，合夥事業或打工會遭遇失敗、失業的狀況。於第五大限大夫重疊之時形成大夫忌沖子田線重疊光明線，婚姻出現問題。";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖光明線
    
    
    // ------------ 交友宮 ------------
    運算宮位 = "交友宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的子田線，也是沖父母宮的光明線、子女宮的成就線，";
        判斷句 = "多人事是非，一般上是交友對方的問題。";
        分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖父母宮的子田線、子女宮的光明線，";
        判斷句 = "";
        if(忌沖宮 == "夫妻宮") 判斷句 = "為夫妻宮的六沖一，容易失戀，或遇人不淑。";
        
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖父母宮的成就線、子女宮的子田線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 官祿宮 ------------
    運算宮位 = "官祿宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的子田線，也是沖命宮的光明線、財帛宮的成就線，";
        判斷句 = "事業不穩定。";
        if(忌沖宮 == "父母宮") 判斷句 = 判斷句 + "因沖父母為沖交友的財，難賺大眾的錢財。";
        if(忌沖宮 == "沖疾宮") 判斷句 = 判斷句 + "因沖疾厄宮為工作地點不賺錢，當老闆的容易得罪客戶。";
        
        if(行運順逆 == "順行") 判斷句 += "於第五大限大命重疊之時剋應。";
        if(行運順逆 == "逆行") 判斷句 += "於第五大限大財重疊之時剋應。";
        分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖命宮的子田線、財帛宮的光明線，";
        判斷句 = "事業上賺錢辛苦，當老闆的不宜，事業賺不到錢。";
        分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖命宮的成就線、財帛宮的子田線，";
        判斷句 = "打工比較沒有前途，容易與上司起衝突，書也念得比較差、學歷不高。";
        if(行運順逆 == "順行") 判斷句 += "於第五大限大命重疊之時形成，大命重疊官祿宮，忌沖官祿宮的光明線重疊子田線，事業每況益下。";
        if(行運順逆 == "逆行") 判斷句 += "於第五大限大財重疊之時形成，大財重疊官祿宮，忌沖財帛宮的子田線重疊光明線，嚴重錢財損失。";
        
        分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖光明線
    
    
    // ------------ 田宅宮 ------------
    運算宮位 = "田宅宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的子田線，也是沖疾厄宮的成就線、兄弟宮的光明線，";
        判斷句 = "容易有意外、搬家。";
        if(行運順逆 == "順行") 判斷句 += "於第四大限大命重疊之時剋應。";
        if(行運順逆 == "逆行") 判斷句 += "";
        分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖疾厄宮的光明線、兄弟宮的子田線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖疾厄宮的子田線、兄弟宮的成就線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 福德宮 ------------
    運算宮位 = "福德宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的子田線，也是沖夫妻宮的光明線、遷移宮的成就線，";
        判斷句 = "多官司、違憲事故；沒有福氣，脾气古怪，或修行人。";
        分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，為沖自身的成就線，也是沖夫妻宮的成就線、遷移宮的子田線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖夫妻宮的子田線、遷移宮的成就線，";
        判斷句 = "思想比較負面**。";
        if(行運順逆 == "順行" && 忌沖宮 == "子女宮") 判斷句 += "於第六大限形成大子忌沖子女宮重疊大限官祿宮，事業、合夥有問題。";
        if(行運順逆 == "逆行") 判斷句 += "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
    
    // ------------ 父母宮 ------------
    運算宮位 = "父母宮"; 宮位地支數 = 命盤.人事宮[運算宮位].地支數; 化忌星 = 命盤.地支宮位[宮位地支數].宮干四化.化忌星; 忌沖宮 = 命盤.地支宮位[宮位地支數].宮干四化.忌出沖.人事宮[0]; 忌沖線 = 宮位轉六線(忌沖宮);
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖子田線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的子田線，也是沖子女宮的光明線、交友宮的成就線，";
        判斷句 = "與父親缘薄。";
        分析矩陣[運算宮位].push(成立條件 + 判斷句);
    } // end if 沖子田線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖成就線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的成就線，也是沖子女宮的子田線、交友宮的光明線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖成就線
    
    if(命盤.地支宮位[宮位地支數].宮干四化.分析.忌沖光明線){
        成立條件 = 運算宮位 + 化忌星 + "化忌沖" + 忌沖宮 + "，沖自身的光明線，也是沖子女宮的成就線、交友宮的子田線，";
        判斷句 = "";
        if(判斷句 != "") 分析矩陣[運算宮位].push(成立條件 + 判斷句); else 分析矩陣.無分類.push(成立條件);
    } // end if 沖光明線
    
} // end function 本命宮位沖六線論斷


function 本命自化流出論斷(命盤, 分析矩陣){
    // require function 宮位自化流出判斷(命盤, 宮位, 大限數, 自化流出, 四化) （file：大限分析配件）
    // 大限數 set to 1 for 本命
    // 分析矩陣 就是人事12宮
    
    var 成立條件="", 判斷句="", 輸出宮位 = "";
    
    // ------------ 命宮 ------------
    var 命宮流出祿 = 宮位自化流出判斷(命盤, "命宮", 1, "流出", "化祿");
    if(命宮流出祿.成立) {
        判斷句 = "祿入遷移宮為父母的交友宮，小時候是給別人帶大的。";
        if(判斷句 != "") 分析矩陣.命宮.push(命宮流出祿.成立條件 + 判斷句);
    } //end if 命宮流出祿
    
    var 命宮流出忌 = 宮位自化流出判斷(命盤, "命宮", 1, "流出", "化忌");
    if(命宮流出忌.成立) {
        判斷句 = "忌入遷移宮為父母的交友宮，小時候是給別人帶大的。";
        if(判斷句 != "") 分析矩陣.命宮.push(命宮流出忌.成立條件 + 判斷句);
    } //end if 命宮流出忌
    
    // ------------ 兄弟宮 ------------
    
    var 兄弟宮自化忌 = 宮位自化流出判斷(命盤, "兄弟宮", 1, "自化", "化忌");
    if(兄弟宮自化忌.成立) {
        成立條件=兄弟宮自化忌.成立條件;
        if(兄弟宮自化忌.行運順逆=="順行") 判斷句 = "於第四大限，大財重疊忌入兄弟宮，忌沖交友宮時賺錢。*";
        if(兄弟宮自化忌.行運順逆=="逆行") 判斷句 = "";
        if(判斷句 != "") 分析矩陣.兄弟宮.push(兄弟宮自化忌.成立條件 + 判斷句);
        //console.log(兄弟宮自化忌.成立條件 + 判斷句);
    } //end if(兄弟宮自化忌.成立)
    
    var 兄弟宮流出忌 = 宮位自化流出判斷(命盤, "兄弟宮", 1, "流出", "化忌");
    if(兄弟宮流出忌.成立) {
        成立條件=兄弟宮流出忌.成立條件;
        if(兄弟宮流出忌.行運順逆=="順行") 判斷句 = "於第四大限，大財重疊忌入交友宮，忌沖大財重疊兄弟宮時損財。";
        if(兄弟宮流出忌.行運順逆=="逆行") 判斷句 = "";
        if(判斷句 != "") 分析矩陣.兄弟宮.push(兄弟宮流出忌.成立條件 + 判斷句);
    } //end if(兄弟宮流出忌.成立)
    
    // ------------ 夫妻宮 ------------
    var 夫妻宮流出忌 = 宮位自化流出判斷(命盤, "夫妻宮", 1, "流出", "化忌");
    if(夫妻宮流出忌.成立) {
        成立條件=夫妻宮流出忌.成立條件;
        if(夫妻宮流出忌.行運順逆=="順行") 判斷句 = "於第四大限，大疾忌沖夫官線（疾厄宮的子田線），容易發生意外或健康不佳。";
        if(夫妻宮流出忌.行運順逆=="逆行") 判斷句 = "";
        分析矩陣.夫妻宮.push(夫妻宮流出忌.成立條件 + 判斷句);
    } //end if(夫妻宮流出忌.成立)
    
    
    var 夫妻宮自化忌 = 宮位自化流出判斷(命盤, "夫妻宮", 1, "自化", "化忌");
    if(夫妻宮自化忌.成立) {
        成立條件=夫妻宮自化忌.成立條件;
        if(夫妻宮自化忌.行運順逆=="順行") 判斷句 = "於第四大限，大疾忌沖夫官線（疾厄宮的子田線），健康不佳。";
        if(夫妻宮自化忌.行運順逆=="逆行") 判斷句 = "";
        分析矩陣.夫妻宮.push(夫妻宮自化忌.成立條件 + 判斷句);
    } //end if(夫妻宮自化忌.成立)
    
    // ------------ 子女宮 ------------
    
    var 子女宮自化忌 = 宮位自化流出判斷(命盤, "子女宮", 1, "自化", "化忌");
    if(子女宮自化忌.成立) {
        成立條件=子女宮自化忌.成立條件;
        if(子女宮自化忌.行運順逆=="順行") 判斷句 = "於第五大限，大友（子女宮的財帛宮）重疊子女宮忌沖田宅宮，因子女開銷而耗財。也是交友重疊交友的官祿宮忌沖命主官祿宮的成就線，事業成就不高。<br>於第六大限，大官自化忌入子女宮，會找人合夥，但因忌沖田宅宮，故不宜從事房地產相關合作。";
        if(子女宮自化忌.行運順逆=="逆行") 判斷句 = "";
        分析矩陣.子女宮.push(子女宮自化忌.成立條件 + 判斷句);
    } //end if(子女宮自化忌.成立)
    
    
    // ------------ 財帛宮 ------------
    
    // ------------ 疾厄宮 ------------
    
    var 疾厄宮自化忌 = 宮位自化流出判斷(命盤, "疾厄宮", 1, "自化", "化忌");
    if(疾厄宮自化忌.成立) {
        成立條件=疾厄宮自化忌.成立條件;
        if(疾厄宮自化忌.行運順逆=="順行") 判斷句 = "於第四大限，形成大官忌沖官祿宮的子田線，事業波折。";
        if(疾厄宮自化忌.行運順逆=="逆行") 判斷句 = "於第四大限，形成大夫忌沖父母宮（夫妻宮的田宅宮），婚姻波折。";
        分析矩陣.疾厄宮.push(疾厄宮自化忌.成立條件 + 判斷句);
        //console.log(疾厄宮自化忌.成立條件 + 判斷句);
    } //end if(疾厄宮自化忌.成立)
    
    var 疾厄宮流出忌 = 宮位自化流出判斷(命盤, "疾厄宮", 1, "流出", "化忌");
    if(疾厄宮流出忌.成立) {
        成立條件=疾厄宮流出忌.成立條件;
        if(疾厄宮流出忌.行運順逆=="順行") 判斷句 = "於第四大限，形成大官忌沖官祿宮的子田線，事業波折。";
        if(疾厄宮流出忌.行運順逆=="逆行") 判斷句 = "於第四大限，形成大夫忌沖夫妻宮的子田線，婚姻波折。";
        分析矩陣.疾厄宮.push(疾厄宮流出忌.成立條件 + 判斷句);
        //console.log(疾厄宮流出忌.成立條件 + 判斷句);
    } //end if(疾厄宮流出忌.成立)
    
    // ------------ 遷移宮 ------------
    var 遷移宮自化忌 = 宮位自化流出判斷(命盤, "遷移宮", 1, "自化", "化忌");
    if(遷移宮自化忌.成立) {
        成立條件=遷移宮自化忌.成立條件;
        if(遷移宮自化忌.行運順逆=="順行") 判斷句 = "於第四大限，大田重疊遷移宮時形成大田自化忌沖命宮，搬家之象。";
        if(遷移宮自化忌.行運順逆=="逆行") 判斷句 = "";
        if(判斷句 != "") 分析矩陣.遷移宮.push(遷移宮自化忌.成立條件 + 判斷句);
    } //end if(遷移宮自化忌.成立)
    
    // ------------ 交友宮 ------------
    
    var 交友宮流出祿 = 宮位自化流出判斷(命盤, "交友宮", 1, "流出", "化祿");
    if(交友宮流出祿.成立) {
        成立條件=交友宮流出祿.成立條件;
        if(交友宮流出祿.行運順逆=="順行") 判斷句 = "於第五大限，大父（交友宮的財帛宮）重疊祿入兄弟宮（財帛宮的田宅宮）時賺到大眾的錢財。";
        if(交友宮流出祿.行運順逆=="逆行") 判斷句 = "於第四大限，大財重疊祿入兄弟宮時賺到大眾的錢財；第五大限子女宮重疊，有利於賺子女、晚輩的錢財。";
        分析矩陣.交友宮.push(交友宮流出祿.成立條件 + 判斷句);
    } //end if(交友宮流出祿.成立)

    var 交友宮自化忌 = 宮位自化流出判斷(命盤, "交友宮", 1, "自化", "化忌");
    if(交友宮自化忌.成立) {
        成立條件=交友宮自化忌.成立條件;
        if(交友宮自化忌.行運順逆=="順行") 判斷句 = "於第五大限，大父（交友宮的財帛宮）重疊忌沖兄弟宮（財帛宮的田宅宮）時損財。";
        if(交友宮自化忌.行運順逆=="逆行") 判斷句 = "於第四大限，大財重疊忌沖兄弟宮時損財；第五大限子女宮重疊，難賺到子女、晚輩的錢財。";
        分析矩陣.交友宮.push(交友宮自化忌.成立條件 + 判斷句);
        //console.log(交友宮自化忌.成立條件 + 判斷句);
    } //end if(交友宮自化忌.成立)
    
    var 交友宮流出忌 = 宮位自化流出判斷(命盤, "交友宮", 1, "流出", "化忌");
    if(交友宮流出忌.成立) {
        成立條件=交友宮流出忌.成立條件;
        if(交友宮流出忌.行運順逆=="順行") 判斷句 = "於第五大限，大父（交友宮的財帛宮）重疊忌入兄弟宮（財帛宮的田宅宮）時賺到大眾的錢財。";
        if(交友宮流出忌.行運順逆=="逆行") 判斷句 = "於第四大限，大財重疊忌入兄弟宮時賺到大眾的錢財；第五大限子女宮重疊，有利於賺子女、晚輩的錢財。";
        分析矩陣.交友宮.push(交友宮流出忌.成立條件 + 判斷句);
    } //end if(交友宮流出忌.成立)
    
    // ------------ 官祿宮 ------------
    
    var 官祿宮自化忌 = 宮位自化流出判斷(命盤, "官祿宮", 1, "自化", "化忌");
    if(官祿宮自化忌.成立) {
        成立條件=官祿宮自化忌.成立條件;
        if(官祿宮自化忌.行運順逆=="順行") {
            判斷句 = "於第二大限，大田重疊父母的田宅宮，化忌沖夫妻宮（田宅宮的疾厄）時有搬家機遇。於第五大限，大命重疊官祿宮時，因沖破父母宮的子田線，容易惹官非。";
            //console.log(官祿宮自化忌);
            if(官祿宮自化忌.星曜 == "太陽") 判斷句 += "因化忌星為太陽（官祿主），主事業造成的官非。";
        } // end if
        if(官祿宮自化忌.行運順逆=="逆行") 判斷句 = "於第四大限，大疾重疊忌沖夫妻宮（疾厄宮的田宅宮）時健康、意外問題。第五大限財帛宮重疊，大財忌沖大福重疊夫妻宮，偏財運差。第七大限夫妻宮重疊，大夫忌沖夫妻宮，配偶婚姻問題。";
        分析矩陣.官祿宮.push(官祿宮自化忌.成立條件 + 判斷句);
    } //end if(官祿宮自化忌.成立)
    
    var 官祿宮流出忌 = 宮位自化流出判斷(命盤, "官祿宮", 1, "流出", "化忌");
    if(官祿宮流出忌.成立) {
        成立條件=官祿宮流出忌.成立條件;
        if(官祿宮流出忌.行運順逆=="順行") 判斷句 = "於第二大限，大父重疊化忌入夫妻宮時有搬家機遇。";
        if(官祿宮流出忌.行運順逆=="逆行") 判斷句 = "於第二大限，大遷重疊化忌入夫妻宮時驛馬事業。第五大限財帛宮重疊，大財化忌入大福重疊夫妻宮，投資偏財。第七大限夫妻宮重疊，大夫化忌入夫妻宮，配偶婚姻問題。";
        分析矩陣.官祿宮.push(官祿宮自化忌.成立條件 + 判斷句);
    } //end if(官祿宮流出忌.成立)
    
    
    // ------------ 田宅宮 ------------
    
    // ------------ 福德宮 ------------
    
    // ------------ 父母宮 ------------
    var 父母宮自化忌 = 宮位自化流出判斷(命盤, "父母宮", 1, "自化", "化忌");
    if(父母宮自化忌.成立) {
        成立條件=父母宮自化忌.成立條件;
        if(父母宮自化忌.行運順逆=="順行") 判斷句 = "";
        if(父母宮自化忌.行運順逆=="逆行") 判斷句 = "於第四大限，大官重疊父母宮，容易惹官非。";
        
        if(判斷句 != "") {
            if(父母宮自化忌.星曜 == "太陽") 判斷句 += "因化忌星為太陽（官祿主），因事業造成的官非。";
            if(父母宮自化忌.星曜 == "武曲") 判斷句 += "因化忌星為武曲（財帛主），因錢財造成的官非。";
        } // end if
        分析矩陣.父母宮.push(父母宮自化忌.成立條件 + 判斷句);
    } //end if(父母宮自化忌.成立)
    
    var 父母宮流出忌 = 宮位自化流出判斷(命盤, "父母宮", 1, "流出", "化忌");
    if(父母宮流出忌.成立) {
        成立條件=父母宮流出忌.成立條件;
        if(父母宮流出忌.行運順逆=="順行") 判斷句 = "";
        if(父母宮流出忌.行運順逆=="逆行") 判斷句 = "於第四大限，大官重疊父母宮，容易惹官非。";
        
        if(判斷句 != "") {
            if(父母宮自化忌.星曜 == "太陽") 判斷句 += "因化忌星為太陽（官祿主），因事業造成的官非。";
            if(父母宮自化忌.星曜 == "武曲") 判斷句 += "因化忌星為武曲（財帛主），因錢財造成的官非。";
        } // end if
        //分析矩陣.父母宮.push(父母宮流出忌.成立條件 + 判斷句);
    } //end if(父母宮流出忌.成立)
    
}  // end function 本命自化流出論斷


// ---------------------------------------------------------------------

function 本命人事宮論斷(命盤, 分析矩陣){
    var 成立條件="", 成立條件附加="", 判斷句="";
    var 行運順逆 = 命盤.行運順逆; 性別 = 命盤.生日.性別;
    
    // ------------ 命宮 ------------
    var 命宮飛四化 = 宮位四化落宮(命盤, "命宮", 1);
    
        // ------------ 化祿 ------------

        // ------------ 化忌 ------------
        if(命宮飛四化.忌沖.宮位線 == "財福線") {
            成立條件 = "命宮" + 命宮飛四化.化忌.星曜 + "化忌沖" + 命宮飛四化.忌沖.宮位線 + "，";
            判斷句 = "";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "於第四大限大子重疊命宮時形成大子（交友宮的官祿宮）忌沖財福線（交友宮的子田線）重疊大限兄友線，亦是自身的錢財線重疊。會因為工作問題而導致錢財問題，如公司運營出現問題而導致事業等狀況。";
            if(判斷句 != "") 分析矩陣.命宮.push(成立條件+ 判斷句);
        } //end if
    
        if(命宮飛四化.忌沖.宮位 == "官祿宮") {
            成立條件 = "命宮" + 命宮飛四化.化忌.星曜 + "化忌沖" + 命宮飛四化.忌沖.宮位 + "，";
            判斷句 = "";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "第四大限大子重疊命宮指示形成大子忌沖官祿宮重疊大限父母宮（事業的子田線），合夥、工作失敗。";
            if(判斷句 != "") 分析矩陣.命宮.push(成立條件+ 判斷句);
        } //end if
    
        if(命宮飛四化.忌沖.宮位 == "疾厄宮") {
            成立條件 = "命宮" + 命宮飛四化.化忌.星曜 + "化忌沖" + 命宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為交友宮的疾厄宮沖疾厄宮，多人事糾紛。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.命宮.push(成立條件+ 判斷句);
        } //end if
    
        if(命宮飛四化.忌沖.宮位 == "田宅宮") {
            成立條件 = "命宮" + 命宮飛四化.化忌.星曜 + "化忌沖" + 命宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為沖子女宮的田宅宮沖田宅宮，孩子比較不會與父母同住；也不適合移民。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "第四大限大命重疊田宅宮時剋應。";
            if(判斷句 != "") 分析矩陣.命宮.push(成立條件+ 判斷句);
        } //end if

    
    // ------------ 兄弟宮 ------------
    var 兄弟宮飛四化 = 宮位四化落宮(命盤, "兄弟宮", 1);
    
        // ------------ 化祿 ------------

        // ------------ 化忌 ------------
        if(兄弟宮飛四化.忌沖.宮位 == "疾厄宮") {
            成立條件 = "兄弟宮" + 兄弟宮飛四化.化忌.星曜 + "化忌沖" + 兄弟宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為官祿宮的疾厄宮沖疾厄宮，勞碌命。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.兄弟宮.push(成立條件+ 判斷句);
        } //end if
    
        if(兄弟宮飛四化.忌沖.宮位線 == "父疾線") {
            成立條件 = "兄弟宮" + 兄弟宮飛四化.化忌.星曜 + "化忌沖" + 兄弟宮飛四化.忌沖.宮位線 + "，";
            判斷句 = "";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "於第三大限大子重疊之時形成大子（交友宮的官祿宮）忌沖父疾線（官祿宮的子田線）重疊大限兄友線（官祿宮的成就線），失業或拆夥問題。";
            if(判斷句 != "") 分析矩陣.兄弟宮.push(成立條件+ 判斷句);
        } //end if
    
    // ------------ 夫妻宮 ------------
    var 夫妻宮飛四化 = 宮位四化落宮(命盤, "夫妻宮", 1);
    
        // ------------ 化祿 ------------

        // ------------ 化忌 ------------
        if(夫妻宮飛四化.忌沖.宮位 == "命宮") {
            成立條件 = "夫妻宮" + 夫妻宮飛四化.化忌.星曜 + "化忌沖" + 夫妻宮飛四化.忌沖.宮位 + "，";
            判斷句 = "夫妻緣薄，因忌入遷移宮（夫妻宮的財帛宮），夫妻容易因為錢財問題吵架。";
            if(判斷句 != "") 分析矩陣.夫妻宮.push(成立條件+ 判斷句);
        } //end if
    
        if(夫妻宮飛四化.忌沖.宮位 == "財帛宮") {
            成立條件 = "夫妻宮" + 夫妻宮飛四化.化忌.星曜 + "化忌沖" + 夫妻宮飛四化.忌沖.宮位 + "，";
            判斷句 = "";
            if(行運順逆 == "逆行") 判斷句 = "於第四大限會形成大父（交友的財帛宮）忌沖財帛宮重疊大限兄弟宮，人事損財。";
            if(判斷句 != "") 分析矩陣.夫妻宮.push(成立條件+ 判斷句);
        } //end if
        
        if(夫妻宮飛四化.忌沖.宮位 == "交友宮") {
            成立條件 = "夫妻宮" + 夫妻宮飛四化.化忌.星曜 + "化忌沖" + 夫妻宮飛四化.忌沖.宮位 + "，";
            判斷句 = "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(行運順逆 == "逆行") 判斷句 = "於第四大限會形成大父（交友的財帛宮）忌沖交友宮重疊大限財帛宮，賺不到錢。";
            if(判斷句 != "") 分析矩陣.夫妻宮.push(成立條件+ 判斷句);
        } //end if
    
    // ------------ 子女宮 ------------
    var 子女宮飛四化 = 宮位四化落宮(命盤, "子女宮", 1);
    判斷句 = "";
    
        // ------------ 化祿 ------------
        /*
        if(子女宮飛四化.化祿.宮位 == "財帛宮") {
            成立條件 = "子女宮" + 子女宮飛四化.化祿.星曜 + "化祿入" + 子女宮飛四化.化祿.宮位 + "，";
            判斷句 = "為父母宮的財帛宮化祿入財帛宮，容易得到父母的錢財。";
            if(判斷句 != "") 分析矩陣.子女宮.push(成立條件+ 判斷句);
        } //end if
        */
    
        // ------------ 化權 ------------
        if(子女宮飛四化.化權.宮位 == "父母宮") {
            成立條件 = "子女宮" + 子女宮飛四化.化權.星曜 + "化權入" + 子女宮飛四化.化權.宮位 + "，";
            判斷句 = "為父母宮的財帛宮化權入自身，父母把財權抓在手裡。";
            if(判斷句 != "") 分析矩陣.子女宮.push(成立條件+ 判斷句);
        } //end if
    
        // ------------ 化忌 ------------
        if(子女宮飛四化.化忌.宮位 == "財帛宮") {
            成立條件 = "子女宮" + 子女宮飛四化.化忌.星曜 + "化忌入" + 子女宮飛四化.化忌.宮位 + "，";
            判斷句 = "為父母宮的財帛宮化忌入財帛宮，會得到父母的錢財。";
    
            if(子女宮飛四化.化祿.宮位 == "兄弟宮") {
                成立條件 = "子女宮" + 子女宮飛四化.化祿.星曜 + "化祿入" + 子女宮飛四化.化祿.宮位 + "且" + 子女宮飛四化.化忌.星曜 + "化忌入" + 子女宮飛四化.化忌.宮位 + "，";
                判斷句 = "為父母宮的財帛宮化祿忌入財帛宮1、10，會得到父母的錢財。";
            }  // end if
            if(判斷句 != "") 分析矩陣.子女宮.push(成立條件+ 判斷句);
        } //end if
    
        if(子女宮飛四化.忌沖.宮位線=="父疾線") {
            成立條件 = "子女宮" + 子女宮飛四化.化忌.星曜 + "化忌沖" + 子女宮飛四化.忌沖.宮位線 + "，";
            if(行運順逆 == "順行") 判斷句 = "為交友的官祿宮忌沖命主官祿宮的子田線，不宜合夥、打工的機遇也較差。第五大限大友重疊子女宮容易剋應合夥、被裁員問題；第五大限大官重疊之時事業也是不佳。";
            if(行運順逆 == "逆行") 判斷句 = "為交友的官祿宮忌沖命主官祿宮的子田線，不宜合夥。第四大限大命重疊子女宮也可能會有孩子生育問題。";
            if(判斷句 != "") 分析矩陣.子女宮.push(成立條件+ 判斷句);
        } //end if

    
    // ------------ 財帛宮 ------------
    var 財帛宮飛四化 = 宮位四化落宮(命盤, "財帛宮", 1);
    
        // ------------ 化祿 ------------
    
        if(財帛宮飛四化.化祿.宮位 == "子女宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化忌.星曜 + "化祿入" + 財帛宮飛四化.化祿.宮位 + "，";
            判斷句 = "化祿入父母宮的財帛宮，會給父母錢財。";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
    
        
        if(財帛宮飛四化.化祿.宮位 == "田宅宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化忌.星曜 + "化祿入" + 財帛宮飛四化.化祿.宮位 + "，";
            判斷句 = "喜歡投資房地產。";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
    
        // ------------ 化權 ------------
        /*
        if(財帛宮飛四化.化權.宮位 == "遷移宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化權.星曜 + "化權入" + 財帛宮飛四化.化權.宮位 + "，";
            判斷句 = "化權入夫妻宮的財帛宮，會給配偶錢財。";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
        
        if(財帛宮飛四化.化權.宮位 == "子女宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化權.星曜 + "化權入" + 財帛宮飛四化.化權.宮位 + "，";
            判斷句 = "化權入父母宮的財帛宮，會給父母錢財。";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
        */
        // ------------ 化忌 ------------
        if(財帛宮飛四化.化忌.宮位 == "遷移宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化忌.星曜 + "化忌入" + 財帛宮飛四化.化忌.宮位 + "，";
            判斷句 = "化忌入夫妻宮的財帛宮，會給配偶錢財。";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
    
        if(財帛宮飛四化.化忌.宮位 == "子女宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化忌.星曜 + "化忌入" + 財帛宮飛四化.化忌.宮位 + "，";
            判斷句 = "化忌入父母宮的財帛宮，會給父母錢財。";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
    
        if(財帛宮飛四化.忌沖.宮位 == "子女宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化忌.星曜 + "化忌沖" + 財帛宮飛四化.忌沖.宮位 + "，";
            判斷句 = "";
            if(行運順逆 == "順行") 判斷句 += "於第五大限大官重疊之時形成大官化忌沖子女宮重疊大限交友宮，會因為不滿上司而離職，或拆夥。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
        
        if(財帛宮飛四化.忌沖.宮位 == "疾厄宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化忌.星曜 + "化忌沖" + 財帛宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為父母宮的疾厄宮沖疾厄宮，與父容易不和、緣薄。";
            if(行運順逆 == "順行") 判斷句 += "";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
    
        if(財帛宮飛四化.忌沖.宮位 == "官祿宮") {
            成立條件 = "財帛宮" + 財帛宮飛四化.化忌.星曜 + "化忌沖" + 財帛宮飛四化.忌沖.宮位 + "，";
            判斷句 = "";
            if(行運順逆 == "順行") 判斷句 += "於第四大限大友重疊之時容易遭到事業潰敗，失業等狀況。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.財帛宮.push(成立條件+ 判斷句);
        } //end if
        // -----------
        //財帛宮忌沖夫妻宮，為父母官的疾厄宮忌沖疾厄宮的田宅宮，父緣薄

    
    // ------------ 疾厄宮 ------------
    var 疾厄宮飛四化 = 宮位四化落宮(命盤, "疾厄宮", 1);
    
        // ------------ 化祿 ------------
    
        // ------------ 化忌 ------------
        if(疾厄宮飛四化.化忌.宮位 == 人事宮位挪移("父母宮", "交友宮")) {
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌入" + 疾厄宮飛四化.化忌.宮位 + "，";
            判斷句 = "為化忌入父母宮的交友宮，有可能成為別人的養子，或是小時候由別人帶大的。";
            if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);
        } //end if
    
        
        if(疾厄宮飛四化.忌沖.宮位 == "官祿宮") {
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌沖" + 疾厄宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為官祿宮的田宅宮沖官祿宮。";
            if(行運順逆 == "順行") 判斷句 += "於第四大限大官重疊之時形成大官化忌沖夫官線重疊大限父疾線（官祿宮宮的子田線)，事業容易遭受潰敗。";
            if(行運順逆 == "逆行") 判斷句 += "於第三大限大夫重疊之時形成大夫化忌沖夫官線重疊大限父疾線（夫妻宮的子田線)，婚姻容易出現狀況。";
            //if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);  //收錄在疾厄沖子田線
        } //end if
    
        // ------------ 六親緣分 ------------
        if(疾厄宮飛四化.忌沖.宮位 == 人事宮位挪移("父母宮", "田宅宮")) {
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌沖" + 疾厄宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為忌沖父母宮的田宅宮，與父親緣薄。";
            //if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);  //已收錄在疾厄宮沖子田
        } //end if
    
        if(疾厄宮飛四化.化忌.宮位 == "子女宮") {
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌入" + 疾厄宮飛四化.化忌.宮位 + "，";
            判斷句 = "";
            if(行運順逆 == "逆行") 判斷句 += "於第三大限大子重疊時形成大子忌入子女宮重疊大限兄友線（官祿宮的成就線），打工的事業前景不好，但適合招攬學生。";
            if(行運順逆 == "順行") 判斷句 += "";
            
            if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);
        } //end if
    
        if(疾厄宮飛四化.忌沖.宮位 == 人事宮位挪移("夫妻宮", "田宅宮")) {
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌沖" + 疾厄宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為忌沖夫妻宮的田宅宮，與配偶緣薄。";
            if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);
        } //end if
        
        /*
        if(疾厄宮飛四化.忌沖.宮位 == 人事宮位挪移("子女宮", "田宅宮")) { // 收錄在疾厄宮沖每個，6沖一的論斷
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌沖" + 疾厄宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為忌沖子女宮的田宅宮，與孩子緣薄。";
            if(性別 == "女") 判斷句 += "女命則可能是自己健康不佳而無法生育。";
            if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);
        } //end if
        */
    
        if(疾厄宮飛四化.忌沖.宮位 == 人事宮位挪移("兄弟宮", "田宅宮")) {
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌沖" + 疾厄宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為忌沖母親的田宅宮，與母親緣薄。";
            if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);
        } //end if
    
        if(疾厄宮飛四化.忌沖.宮位 == 人事宮位挪移("交友宮", "田宅宮")) {
            成立條件 = "疾厄宮" + 疾厄宮飛四化.化忌.星曜 + "化忌沖" + 疾厄宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為忌沖交友宮的田宅宮，自身與交友多人事是非。";
            if(判斷句 != "") 分析矩陣.疾厄宮.push(成立條件+ 判斷句);
        } //end if
    

    // ------------ 遷移宮 ------------
    var 遷移宮飛四化 = 宮位四化落宮(命盤, "遷移宮", 1);
    
        // ------------ 化權 ------------
        if(遷移宮飛四化.化權.宮位 == "命宮") {
            成立條件 = "遷移宮" + 遷移宮飛四化.化權.星曜 + "化權入" + 遷移宮飛四化.化權.宮位 + "，";
            判斷句 = "為父母宮的交友宮化權入命，有雙重父母的可能性，包括義父，或是過契給神明當孩子。";
            if(判斷句 != "") 分析矩陣.遷移宮.push(成立條件+ 判斷句);
        }  // end if
            
        if(遷移宮飛四化.化權.宮位 == "夫妻宮") {
            成立條件 = "遷移宮" + 遷移宮飛四化.化權.星曜 + "化權入" + 遷移宮飛四化.化權.宮位 + "，";
            判斷句 = "為夫妻宮的財帛宮化權入自身，配偶把財權抓在手裡。";
            if(判斷句 != "") 分析矩陣.子女宮.push(成立條件+ 判斷句);
        } //end if
    
        // ------------ 化忌 ------------
        if(遷移宮飛四化.化忌.宮位 == "命宮") {
            成立條件 = "遷移宮" + 遷移宮飛四化.化忌.星曜 + "化忌入" + 遷移宮飛四化.化忌.宮位 + "，";
            判斷句 = "為父母宮的交友宮化忌入命，有雙重父母的可能性，包括義父，或是過契給神明當孩子。";
            if(判斷句 != "") 分析矩陣.遷移宮.push(成立條件+ 判斷句);
        }  // end if
    
        if(遷移宮飛四化.化忌.宮位 == "財帛宮") {
            成立條件 = "遷移宮" + 遷移宮飛四化.化忌.星曜 + "化忌入" + 遷移宮飛四化.化忌.宮位 + "，";
            判斷句 = "為夫妻宮的財帛宮化忌入財帛宮，容易得到配偶的錢財。";
    
            if(遷移宮飛四化.化祿.宮位 == "兄弟宮") {
                成立條件 = "遷移宮" + 遷移宮飛四化.化祿.星曜 + "化祿入" + 遷移宮飛四化.化祿.宮位 + "且" + 遷移宮飛四化.化忌.星曜 + "化忌入" + 遷移宮飛四化.化忌.宮位 + "，";
                判斷句 = "為夫妻宮的財帛宮化祿忌入財帛宮1、10，容易得到配偶的錢財。";
            }  // end if
            if(判斷句 != "") 分析矩陣.遷移宮.push(成立條件+ 判斷句);
        } //end if
    
        if(遷移宮飛四化.忌沖.宮位 == "財帛宮") {
            成立條件 = "遷移宮" + 遷移宮飛四化.化忌.星曜 + "化忌沖" + 遷移宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為夫妻宮的財帛宮化忌沖財帛宮，配偶不會給錢/家用。";
            if(行運順逆 == "順行") 判斷句 += "";
            if(行運順逆 == "逆行") 判斷句 += "於第四大限大子重疊之時形成，大子化忌沖財帛宮重疊大限兄弟宮，因合夥損財。";
            if(判斷句 != "") 分析矩陣.遷移宮.push(成立條件+ 判斷句);
        } //end if
    
    // 忌沖命宮，為兄弟宮的疾厄宮忌沖疾厄宮的田宅宮，與母緣薄
    
    
    // ------------ 交友宮 ------------
    var 交友宮飛四化 = 宮位四化落宮(命盤, "交友宮", 1);
    
        // ------------ 化祿 ------------
        if(交友宮飛四化.化祿.宮位 == "夫妻宮") {
            成立條件 = "交友宮" + 交友宮飛四化.化祿.星曜 + "化祿入" + 交友宮飛四化.化祿.宮位 + "，";
            判斷句 = "多桃花。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "於第四大限，大田重疊交友宮時桃花對象可能是已婚或離婚人士。";
            if(判斷句 != "") 分析矩陣.交友宮.push(成立條件+ 判斷句);
        } //end if
    
        // ------------ 化忌 ------------
        if(交友宮飛四化.化忌.宮位 == "夫妻宮") {
            成立條件 = "交友宮" + 交友宮飛四化.化忌.星曜 + "化忌入" + 交友宮飛四化.化忌.宮位 + "，";
            判斷句 = "多桃花。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "於第四大限，大田重疊交友宮時容易發生三角戀。";
            if(判斷句 != "") 分析矩陣.交友宮.push(成立條件+ 判斷句);
        } //end if
    
        if(交友宮飛四化.忌沖.宮位 == "財帛宮") {
            成立條件 = "交友宮" + 交友宮飛四化.化忌.星曜 + "化忌沖" + 交友宮飛四化.忌沖.宮位 + "，";
            判斷句 = "難賺到朋友大眾的錢財。";
            if(行運順逆 == "逆行") 判斷句 += "於第四大限大財重疊時會嚴重人事損財或賺不到錢。";
            if(行運順逆 == "順行") 判斷句 += "於第五大限大父重疊時因朋友而在事業上損財。";
            if(判斷句 != "") 分析矩陣.交友宮.push(成立條件+ 判斷句);
        } //end if
        
        if(交友宮飛四化.忌沖.宮位 == "疾厄宮") {
            成立條件 = "交友宮" + 交友宮飛四化.化忌.星曜 + "化忌沖" + 交友宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為夫妻宮的疾厄宮沖疾厄宮，夫妻爭吵打架。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.交友宮.push(成立條件+ 判斷句);
        } //end if
    
        if(交友宮飛四化.忌沖.宮位線 == "父疾線") {
            成立條件 = "交友宮" + 交友宮飛四化.化忌.星曜 + "化忌沖" + 交友宮飛四化.忌沖.宮位線 + "，";
            判斷句 = "";
            if(行運順逆 == "逆行") 判斷句 += "於第五大限大子重疊時形成大子忌沖父疾線（官祿宮的子田線）重疊大限兄友線（官祿宮的成就線），拆夥、事業問題。";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.交友宮.push(成立條件+ 判斷句);
        } //end if
    
    // ------------ 官祿宮 ------------
    var 官祿宮飛四化 = 宮位四化落宮(命盤, "官祿宮", 1);
    
        // ------------ 化祿 ------------
        if(官祿宮飛四化.化祿.宮位 == "田宅宮") {
            成立條件 = "官祿宮" + 官祿宮飛四化.化祿.星曜 + "化祿入" + 官祿宮飛四化.化祿.宮位 + "，";
            判斷句 = "為父母官的田宅宮化祿入田宅宮，與父母同住，或容易得到父母的房地產。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.官祿宮.push(成立條件+ 判斷句);
        } //end if
    
        // ------------ 化忌 ------------
        if(官祿宮飛四化.忌沖.宮位 == "田宅宮") {
            成立條件 = "官祿宮" + 官祿宮飛四化.化忌.星曜 + "化忌沖" + 官祿宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為父母官的田宅宮化忌沖田宅宮，與家庭無緣，早年離家**。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.官祿宮.push(成立條件+ 判斷句);
        } //end if
        
        if(官祿宮飛四化.忌沖.宮位 == "疾厄宮") {
            成立條件 = "官祿宮" + 官祿宮飛四化.化忌.星曜 + "化忌沖" + 官祿宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為子女宮的疾厄宮沖疾厄宮，與孩子不和、緣薄。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.官祿宮.push(成立條件+ 判斷句);
        } //end if
    
        if(官祿宮飛四化.忌沖.宮位 == "命宮") {
            成立條件 = "官祿宮" + 官祿宮飛四化.化忌.星曜 + "化忌沖" + 官祿宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為沖官祿宮的財帛宮，事業資金容易周轉不靈。";
            if(行運順逆 == "順行") 判斷句 += "於第五大限大命重疊官祿宮時，形成大命忌沖命宮重疊大財，資金周轉不靈。";
            if(行運順逆 == "逆行") 判斷句 += "於第四大限大疾重疊官祿宮時，形成大疾忌沖命宮重疊大田，辦公室變動，轉換工作地點。於第五大限大財重疊官祿宮時，形成大財忌沖命宮，事業資金周轉不靈。";
            if(判斷句 != "") 分析矩陣.官祿宮.push(成立條件+ 判斷句);
        } //end if
    
    
    // ------------ 田宅宮 ------------
    var 田宅宮飛四化 = 宮位四化落宮(命盤, "田宅宮", 1);
    
        // ------------ 化祿 ------------
        
        // ------------ 化權 ------------
        if(田宅宮飛四化.化權.宮位 == "財帛宮") {
            成立條件 = "田宅宮" + 田宅宮飛四化.化權.星曜 + "化權入" + 田宅宮飛四化.化權.宮位 + "，";
            判斷句 = "為田宅權入交友的田宅宮，賣地產之象。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "剋應於第四大限，大命重疊田宅宮之時。";
            if(判斷句 != "") 分析矩陣.田宅宮.push(成立條件+ 判斷句);
        } //end if
    
        // ------------ 化忌 ------------
        if(田宅宮飛四化.化忌.宮位 == "夫妻宮") {
            成立條件 = "田宅宮" + 田宅宮飛四化.化忌.星曜 + "化忌入" + 田宅宮飛四化.化忌.宮位 + "，";
            判斷句 = "為交友的夫妻宮化忌入夫妻宮，配偶可能是已婚/離婚人士。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "剋應於第三大限，大友重疊田宅宮之時。";
            if(判斷句 != "") 分析矩陣.田宅宮.push(成立條件+ 判斷句);
        } //end if
        
        if(田宅宮飛四化.化忌.宮位 == "財帛宮") {
            成立條件 = "田宅宮" + 田宅宮飛四化.化忌.星曜 + "化忌入" + 田宅宮飛四化.化忌.宮位 + "，";
            判斷句 = "為田宅忌入交友的田宅宮，賣地產之象。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "剋應於第四大限，大命重疊田宅宮之時。";
            if(判斷句 != "") 分析矩陣.田宅宮.push(成立條件+ 判斷句);
        } //end if
    
        if(田宅宮飛四化.忌沖.宮位 == "父母宮") {
            成立條件 = "田宅宮" + 田宅宮飛四化.化忌.星曜 + "化忌沖" + 田宅宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為忌沖夫妻官的田宅宮，夫妻容易分居。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "第四大限大命重疊田宅宮時剋應。";
            if(判斷句 != "") 分析矩陣.田宅宮.push(成立條件+ 判斷句);
        } //end if
    
        if(田宅宮飛四化.忌沖.宮位 == "命宮") {
            成立條件 = "田宅宮" + 田宅宮飛四化.化忌.星曜 + "化忌沖" + 田宅宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為忌沖子女宮的田宅宮，孩子比較不會與父母同住。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "第四大限大命重疊田宅宮時剋應。";
            if(判斷句 != "") 分析矩陣.田宅宮.push(成立條件+ 判斷句);
        } //end if
        
        if(田宅宮飛四化.忌沖.宮位 == "疾厄宮") {
            成立條件 = "田宅宮" + 田宅宮飛四化.化忌.星曜 + "化忌沖" + 田宅宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為財帛宮的疾厄沖疾厄，勞碌命。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.田宅宮.push(成立條件+ 判斷句);
        } //end if
    
    
        if(田宅宮飛四化.忌沖.宮位 == "官祿宮") {
            成立條件 = "田宅宮" + 田宅宮飛四化.化忌.星曜 + "化忌沖" + 田宅宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為沖父母官的田宅宮，與家庭無緣，早年離家**。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.田宅宮.push(成立條件+ 判斷句);
        } //end if
    

    
    // ------------ 福德宮 ------------
    var 福德宮飛四化 = 宮位四化落宮(命盤, "福德宮", 1);
    
        // ------------ 化祿 ------------
        
        // ------------ 化科 ------------
        if(福德宮飛四化.化科.宮位 == "子女宮") {
            成立條件 = "福德宮" + 福德宮飛四化.化科.星曜 + "化科入" + 福德宮飛四化.化科.宮位 + "，";
            判斷句 = "為交友宮的子女宮化科入子女宮，可能會領養別人的孩子或收義子。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.福德宮.push(成立條件+ 判斷句);
        } //end if
    
        // ------------ 化忌 ------------
        if(福德宮飛四化.化忌.宮位 == "子女宮") {
            成立條件 = "福德宮" + 福德宮飛四化.化忌.星曜 + "化忌入" + 福德宮飛四化.化忌.宮位 + "，";
            判斷句 = "為交友宮的子女宮化忌入子女宮，可能會領養別人的孩子，收義子或是試管嬰兒產子。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.福德宮.push(成立條件+ 判斷句);
        } //end if
    
        if(福德宮飛四化.忌沖.宮位線 == "子田線") {
            成立條件 = "福德宮" + 福德宮飛四化.化忌.星曜 + "化忌沖" + 福德宮飛四化.忌沖.宮位線 + "，";
            判斷句 = "為沖破命財官的成就、光明、子田線，對物慾淡薄，適合修行**";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.福德宮.push(成立條件+ 判斷句);
        } //end if
    
    
        if(福德宮飛四化.忌沖.宮位線 == "夫官線") {
            成立條件 = "福德宮" + 福德宮飛四化.化忌.星曜 + "化忌沖" + 福德宮飛四化.忌沖.宮位線 + "，";
            判斷句 = "容易得罪政府、反對黨。";
            if(行運順逆 == "逆行") 判斷句 += "於第四大限大友重疊之時形成大友化忌沖夫官線重疊大限父疾線，失業或拆夥問題。";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.福德宮.push(成立條件+ 判斷句);
            
            if(福德宮飛四化.忌沖.宮位 == "官祿宮") {
                成立條件 = "福德宮" + 福德宮飛四化.化忌.星曜 + "化忌沖" + 福德宮飛四化.忌沖.宮位 + "，";
                判斷句 = "";
                if(行運順逆 == "逆行") 判斷句 += "";
                if(行運順逆 == "順行") 判斷句 += "於第三大限會形成大官忌沖官祿宮，事業不穩定。";
                if(判斷句 != "") 分析矩陣.福德宮.push(成立條件+ 判斷句);
            } //end if
        } //end if
        
        if(福德宮飛四化.忌沖.宮位 == "命宮") {
            成立條件 = "福德宮" + 福德宮飛四化.化忌.星曜 + "化忌沖" + 福德宮飛四化.忌沖.宮位 + "，";
            判斷句 = "容易逢賭必輸。";
            if(福德宮飛四化.化忌.星曜 == "貪狼") 判斷句 += "貪狼星來沖命，卻又偏爛賭。";
            if(判斷句 != "") 分析矩陣.福德宮.push(成立條件+ 判斷句);
        } //end if
    
    // ------------ 父母宮 ------------
    var 父母宮飛四化 = 宮位四化落宮(命盤, "父母宮", 1);
    
        // ------------ 化祿 ------------
        if(父母宮飛四化.化祿.宮位 == "財帛宮") {
            成立條件 = "父母宮" + 父母宮飛四化.化祿.星曜 + "化祿入" + 父母宮飛四化.化祿.宮位 + "，";
            判斷句 = "為交友宮的財帛宮化祿入財帛宮，容易得到交友大眾的錢財。";
            if(行運順逆 == "順行") 判斷句 += "於第五大限財重疊父母宮時剋應。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.父母宮.push(成立條件 + 判斷句);
        } //end if
    
        // ------------ 化忌 ------------
        if(父母宮飛四化.化忌.宮位 == "財帛宮") {
            成立條件 = "父母宮" + 父母宮飛四化.化忌.星曜 + "化忌入" + 父母宮飛四化.化忌.宮位 + "，";
            判斷句 = "為交友宮的財帛宮化忌入財帛宮，容易得到交友大眾的錢財。";
    
            if(父母宮飛四化.化祿.宮位 == "兄弟宮") {
                成立條件 = "父母宮" + 父母宮飛四化.化祿.星曜 + "化祿入" + 父母宮飛四化.化祿.宮位 + "且" + 父母宮飛四化.化忌.星曜 + "化忌入" + 父母宮飛四化.化忌.宮位 + "，";
                判斷句 = "為交友宮的財帛宮化祿忌入財帛宮1、10，容易得到交友大眾的錢財。";
            }  // end if
            if(判斷句 != "") 分析矩陣.父母宮.push(成立條件+ 判斷句);
        } //end if
    
        if(父母宮飛四化.化忌.宮位 == "子女宮") {
            成立條件 = "父母宮" + 父母宮飛四化.化忌.星曜 + "化忌入" + 父母宮飛四化.化忌.宮位 + "，";
            判斷句 = "";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "於第五大限大子重疊時形成大子忌入子女宮重疊大限兄友線（官祿宮的成就線），打工的事業前景不好，但適合招攬學生。";
            
            if(判斷句 != "") 分析矩陣.父母宮.push(成立條件+ 判斷句);
        } //end if
        
        if(父母宮飛四化.忌沖.宮位 == "財帛宮") {
            成立條件 = "父母宮" + 父母宮飛四化.化忌.星曜 + "化忌沖" + 父母宮飛四化.忌沖.宮位 + "，";
            判斷句 = "交友宮的財帛宮沖財，難賺到朋友大眾的錢財，同時也是父親忌沖自身的疾厄宮。";
            if(行運順逆 == "逆行") 判斷句 += "於第五大限大友重疊時賺錢困難。";
            if(行運順逆 == "順行") 判斷句 += "於第五大限大子重疊時難得到父母的錢財。";
            if(判斷句 != "") 分析矩陣.父母宮.push(成立條件+ 判斷句);
        } //end if
    
        if(父母宮飛四化.忌沖.宮位 == "命宮") {
            成立條件 = "父母宮" + 父母宮飛四化.化忌.星曜 + "化忌沖" + 父母宮飛四化.忌沖.宮位 + "，";
            判斷句 = "父親與命主緣薄。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.父母宮.push(成立條件+ 判斷句);
        } //end if
    
        if(父母宮飛四化.忌沖.宮位線 == "財福線") {
            成立條件 = "父母宮" + 父母宮飛四化.化忌.星曜 + "化忌沖" + 父母宮飛四化.忌沖.宮位線 + "，";
            判斷句 = "為沖兄弟宮的子田線，父母感情不好。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "";
            if(判斷句 != "") 分析矩陣.父母宮.push(成立條件+ 判斷句);
        } //end if
    
        if(父母宮飛四化.忌沖.宮位 == "田宅宮") {
            成立條件 = "父母宮" + 父母宮飛四化.化忌.星曜 + "化忌沖" + 父母宮飛四化.忌沖.宮位 + "，";
            判斷句 = "為沖夫妻宮的田宅宮沖田宅宮，夫妻容易分居。";
            if(行運順逆 == "逆行") 判斷句 += "";
            if(行運順逆 == "順行") 判斷句 += "第四大限大夫重疊父母宮時剋應。";
            if(判斷句 != "") 分析矩陣.父母宮.push(成立條件+ 判斷句);
        } //end if
    

} //end function 本命人事宮論斷

