
function 三世書演算(命盤元件){
    //console.log("三世書演算輸入："); console.log(命盤元件);
    var 三世書元件 = {};
    
    
    三世書年月元件(命盤元件.生年支, 命盤元件.生月數, 三世書元件);
    console.log(三世書元件);
    
}   // end function 三世書演算


function 三世書年月元件(生年支, 生月數, 三世書元件){
    
    三世書元件.前世福祿 = {"宮": "", "前世": "", "現世": ""};
    三世書元件.前世手藝 = {"宮": "", "前世": "", "現世": "", "註解": ""};
    三世書元件.屋宇 = {"宮": "", "詩": "", "註解": ""};
    //三世書元件.學堂 = {"宮": "", "詩": "", "註解": ""};
    三世書元件.蠶桑 = {"宮": "", "詩": ""}; // 算蠶桑知財祿
    //三世書元件.手藝 = {"宮": "", "詩": ""};
    //三世書元件.田業 = {"宮": "", "詩": ""};
    //三世書元件.得牛 = {"宮": "", "詩": ""};
    //三世書元件.養豬 = {"宮": "", "詩": ""};
    //三世書元件.十二骨 = {"宮": "", "詩": ""};
    //三世書元件.先天衣祿 = {"宮": "", "詩": ""};
    //三世書元件.後天衣祿 = {"宮": "", "詩": ""};
    //三世書元件.一生財運 = {"宮": "", "詩": ""};
    //三世書元件.來世命運 = {"宮": "", "詩": ""};
    //三世書元件.托化 = {"宮": "", "詩": ""};
    
    switch(生年支){
        case "子":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "執";
                    break;
                
            }  // end switch 生年支: 子
            break;
            
        case "丑":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "成";
                    break;
                
            }  // end switch 生年支：丑
            break;
            
        case "寅":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                
            }  // end switch 生年支：寅
            break;
            
        case "卯":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "執";
                    break;
                
            }  // end switch 生年支：卯
            break;
            
        case "辰":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "成";
                    break;
                
            }  // end switch 生年支：辰
            break;
            
        case "巳":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                
            }  // end switch 生年支：巳
            break;
            
        case "午":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                
            }  // end switch 生年支：午
            break;
            
        case "未":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "執";
                    break;
                
            }  // end switch 生年支：未
            break;
            
        case "申":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                
            }  // end switch 生年支：申
            break;
        
        case "酉":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "成";
                    break;
                
            }  // end switch 生年支：酉
            break;
            
        case "戌":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "除";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                
            }  // end switch 生年支：戌
            break;
            
        case "亥":
            switch(生月數) {
                case 1:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "除";
                    三世書元件.前世手藝.宮 = "十二";
                    三世書元件.屋宇.宮 = "滿";
                    break;
                case 2:
                    三世書元件.蠶桑.宮 = "敗";
                    三世書元件.前世福祿.宮 = "滿";
                    三世書元件.前世手藝.宮 = "十一";
                    三世書元件.屋宇.宮 = "平";
                    break;
                case 3:
                    三世書元件.蠶桑.宮 = "皆";
                    三世書元件.前世福祿.宮 = "平";
                    三世書元件.前世手藝.宮 = "十";
                    三世書元件.屋宇.宮 = "定";
                    break;
                case 4:
                    三世書元件.蠶桑.宮 = "破";
                    三世書元件.前世福祿.宮 = "定";
                    三世書元件.前世手藝.宮 = "九";
                    三世書元件.屋宇.宮 = "執";
                    break;
                case 5:
                    三世書元件.蠶桑.宮 = "空";
                    三世書元件.前世福祿.宮 = "執";
                    三世書元件.前世手藝.宮 = "八";
                    三世書元件.屋宇.宮 = "破";
                    break;
                case 6:
                    三世書元件.蠶桑.宮 = "庫";
                    三世書元件.前世福祿.宮 = "破";
                    三世書元件.前世手藝.宮 = "七";
                    三世書元件.屋宇.宮 = "危";
                    break;
                case 7:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "危";
                    三世書元件.前世手藝.宮 = "六";
                    三世書元件.屋宇.宮 = "成";
                    break;
                case 8:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "成";
                    三世書元件.前世手藝.宮 = "五";
                    三世書元件.屋宇.宮 = "收";
                    break;
                case 9:
                    三世書元件.蠶桑.宮 = "合";
                    三世書元件.前世福祿.宮 = "收";
                    三世書元件.前世手藝.宮 = "四";
                    三世書元件.屋宇.宮 = "開";
                    break;
                case 10:
                    三世書元件.蠶桑.宮 = "向";
                    三世書元件.前世福祿.宮 = "開";
                    三世書元件.前世手藝.宮 = "三";
                    三世書元件.屋宇.宮 = "閉";
                    break;
                case 11:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "閉";
                    三世書元件.前世手藝.宮 = "二";
                    三世書元件.屋宇.宮 = "建";
                    break;
                case 12:
                    三世書元件.蠶桑.宮 = "建";
                    三世書元件.前世福祿.宮 = "建";
                    三世書元件.前世手藝.宮 = "一";
                    三世書元件.屋宇.宮 = "除";
                    break;
                
            }  // end switch 生年支：亥
    }  // end switch 生年支
    
    三世書元件.蠶桑.詩 = 算蠶桑知財祿(三世書元件.蠶桑.宮);
    三世書元件.前世福祿.宮 = 三世書元件.前世福祿.宮 + "祿";
    三世書元件.前世手藝.宮 = 三世書元件.前世手藝.宮 + "宮"; 算前世手藝註解(三世書元件.前世手藝);
    三世書元件.屋宇.宮 = 三世書元件.屋宇.宮 + "宅";

};  //function 三世書年月元件



// **************** 三 世 書 註 解 詩 ****************


// ********** 算蠶桑知財祿 **********   
function 算蠶桑知財祿(蠶桑宮){
    switch(蠶桑宮){
        case "建": return "建宮蠶桑貴，桑葉立滿枝，蠶絲是應時，發積他最富。"; break;
        case "皆": return "皆宮蠶葉盛，桑葉滿林春，高蟲才發富，家道萬代昌。"; break;
        case "敗": return "敗宮蠶葉稀，桑葉空枝頭，蟲絲布成襪，福祿也多遭。"; break;
        case "破": return "破宮蠶葉虛，桑葉夢中立，蠶絲不成蛹，此格誰能容。"; break;
        case "空": return "空宮蠶絲爛，桑葉有蟲食，桑蟲不成雙，命裏注窮郎。"; break;
        case "庫": return "蠶桑墓庫中，桑枝無綠意，蠶絲不成形，窮命祿巴巴。"; break;
        case "向": return "向宮蠶桑富，柔時枝頭掛，蠶蛹堆滿襪，富貴極品隆。"; break;
        case "合": return "合宮蠶桑榮，桑時多比山，蠶絲已成珍，富貴享榮華。"; break;
    } // end switch
}; // end function 算蠶桑知財祿


function 算前世手藝註解(前世手藝){
    switch(前世手藝.宮){
        case "一宮": 前世手藝.前世 = "此命帶刑傷，君是僧道人；若不依命來，門庭頭風光。"; break;
        case "二宮": 前世手藝.前世 = "此身多富貴，經文滿腹熱；若然無衝剋，晚景轉皇君。"; break;
        case "三宮": 前世手藝.前世 = "此相甚聰明，萬事也能通；一生悠然身，到處獻愛心。"; break;
        case "四宮": 前世手藝.前世 = "此相注為師，官位示好求；萬物輪迴中，一生富榮華。"; break;
        case "五宮": 前世手藝.前世 = "此命朝中客，經文滿腹熱；若然無衝剋，晚景輔皇君。"; break;
        case "六宮": 前世手藝.前世 = "此命苦難求，讀書半是成；遇鄉尋手作，一生勞不停。"; break;
        case "七宮": 前世手藝.前世 = "相中為術士，作耕亦為宜；行善樂助人，外鄉也相傳。"; break;
        case "八宮": 前世手藝.前世 = "生相為大夫，救世濟民在；萬代外鄉傳，一生無憂愁。"; break;
        case "九宮": 前世手藝.前世 = "刑妻克兒相，命為乞兒郎；拜佛常炷香，好保命平安。"; break;
        case "十宮": 前世手藝.前世 = "船夫命相宜，衣祿急難求；不宜改戶名，晚景銀壓來。"; break;
        case "十一宮": 前世手藝.前世 = "命生災厄相，夫妻早分離；得兒亦早夭，此是苦命身。"; break;
        case "十二宮": 前世手藝.前世 = "此命是不同，公侯卿相左；金銀萬貫有，自身是逍遙。"; break;
    } // end switch
}; // end function 算蠶桑知財祿
