function 盲派納音_總論(輸入資料){
    var 納音總論 = {
        "八字": 輸入資料.四柱,
        "年柱": "", "月柱": "", "日柱": "", "時柱": "",
        "年柱納音": "", "月柱納音": "", "日柱納音": "", "時柱納音": "",
        "年柱納音五行": "", "月柱納音五行": "", "日柱納音五行": "", "時柱納音五行": "",
        "四柱納音": "", 
        "成立": false,
        "註解": "",
        "備註": ""
    };
    
    var 納音總論矩陣 = [];
    
    納音總論.年柱 = 納音總論.八字.substr(0,2); 納音總論.月柱 = 納音總論.八字.substr(2,2); 納音總論.日柱 = 納音總論.八字.substr(4,2); 納音總論.時柱 = 納音總論.八字.substr(6,2);
    納音總論.年柱納音 = 六十干支屬性(納音總論.年柱).納音; 納音總論.月柱納音 = 六十干支屬性(納音總論.月柱).納音; 納音總論.日柱納音 = 六十干支屬性(納音總論.日柱).納音; 納音總論.時柱納音 = 六十干支屬性(納音總論.時柱).納音; 
    納音總論.年柱納音五行 = 納音總論.年柱納音.substr(2,1); 納音總論.月柱納音五行 = 納音總論.月柱納音.substr(2,1); 納音總論.日柱納音五行 = 納音總論.日柱納音.substr(2,1); 納音總論.時柱納音五行 = 納音總論.時柱納音.substr(2,1);
    
    納音總論.年月五行關係 = 五行生剋(納音總論.年柱納音五行, 納音總論.月柱納音五行);
    納音總論.月日五行關係 = 五行生剋(納音總論.月柱納音五行, 納音總論.日柱納音五行);
    納音總論.日時五行關係 = 五行生剋(納音總論.日柱納音五行, 納音總論.時柱納音五行);
    //console.log(納音總論.年月五行關係 + " / " + 納音總論.月日五行關係 + " / " + 納音總論.日時五行關係);
                
    納音總論.時日五行關係 = 五行生剋(納音總論.時柱納音五行, 納音總論.日柱納音五行);
    納音總論.日月五行關係 = 五行生剋(納音總論.日柱納音五行, 納音總論.月柱納音五行);
    納音總論.月年五行關係 = 五行生剋(納音總論.月柱納音五行, 納音總論.年柱納音五行);

    納音總論.四柱納音 = "四柱：" + 納音總論.年柱 + "（" + 納音總論.年柱納音 + "） " + 納音總論.月柱 + "（" + 納音總論.月柱納音 + "） " + 納音總論.日柱 + "（" + 納音總論.日柱納音 + "） " + 納音總論.時柱 + "（" + 納音總論.時柱納音 + "）";
    
    // ************** 四柱納音 分析 **************
    var 四柱納音生剋 = 盲派納音_四柱依次生剋(納音總論);
    if(四柱納音生剋.成立) 納音總論矩陣.push("四柱納音依次生剋：<br>" + 四柱納音生剋.註解);
    
    var 四柱納音三合生剋 = 盲派納音_三合生剋(納音總論);
    if(四柱納音三合生剋.成立) 納音總論矩陣.push("地支三合生剋年柱納音：<br>" + 四柱納音三合生剋.註解);
    
    var 四柱納音其他論斷 = 盲派納音_其他論斷(納音總論);
    if(四柱納音其他論斷.成立) 納音總論矩陣.push("四柱納音其他論斷：<br>" + 四柱納音其他論斷.註解);
    
    
    
    // ************** 四柱納音 總結 **************

    if(納音總論矩陣.length > 0) {
        納音總論.成立 = true;
        納音總論矩陣.unshift(納音總論.四柱納音);
        納音總論.註解 = 納音總論矩陣.join("<br><br>");
    } // end if 納音總論矩陣.length, there is result from 納音總論
    
    return 納音總論;
}  // end Function 盲派納音_總論


function 盲派納音_四柱依次生剋(輸入資料){
    var 四柱生剋 = {
        "八字": 輸入資料.八字,
        "年柱": 輸入資料.年柱, "月柱": 輸入資料.月柱, "日柱": 輸入資料.日柱, "時柱": 輸入資料.時柱,
        "年柱納音": 輸入資料.年柱納音, "月柱納音": 輸入資料.月柱納音, "日柱納音": 輸入資料.日柱納音, "時柱納音": 輸入資料.時柱納音,
        "年柱納音五行": 輸入資料.年柱納音五行, "月柱納音五行": 輸入資料.月柱納音五行, "日柱納音五行": 輸入資料.日柱納音五行, "時柱納音五行": 輸入資料.時柱納音五行,
        "成立": false,
        "成立條件": "",
        "註解": "",
        "備註": ""
    };
    
    四柱生剋.年月五行關係 = 五行生剋(四柱生剋.年柱納音五行, 四柱生剋.月柱納音五行);
    四柱生剋.月日五行關係 = 五行生剋(四柱生剋.月柱納音五行, 四柱生剋.日柱納音五行);
    四柱生剋.日時五行關係 = 五行生剋(四柱生剋.日柱納音五行, 四柱生剋.時柱納音五行);
    //console.log(四柱生剋.年月五行關係 + " / " + 四柱生剋.月日五行關係 + " / " + 四柱生剋.日時五行關係);
                
    四柱生剋.時日五行關係 = 五行生剋(四柱生剋.時柱納音五行, 四柱生剋.日柱納音五行);
    四柱生剋.日月五行關係 = 五行生剋(四柱生剋.日柱納音五行, 四柱生剋.月柱納音五行);
    四柱生剋.月年五行關係 = 五行生剋(四柱生剋.月柱納音五行, 四柱生剋.年柱納音五行);
    
    //console.log(四柱生剋.年柱 + " / " + 四柱生剋.月柱 + " / " + 四柱生剋.日柱 + " / " + 四柱生剋.時柱);
    //console.log(四柱生剋.年柱納音 + " / " + 四柱生剋.月柱納音 + " / " + 四柱生剋.日柱納音 + " / " + 四柱生剋.時柱納音);
    //console.log(四柱生剋.時日五行關係 + " / " + 四柱生剋.日月五行關係 + " / " + 四柱生剋.月年五行關係);
    
    
    // 1：年生月，月生日，日生時, 1932年6月7日，亥時
    if(四柱生剋.年月五行關係 == "我生" && 四柱生剋.月日五行關係 == "我生" && 四柱生剋.日時五行關係 == "我生") {
        四柱生剋.成立 = true;
        //四柱生剋.成立條件 = "年柱「" + 四柱生剋.年柱 + "」（" + 四柱生剋.年柱納音 + "）生月柱「" + 四柱生剋.月柱 + "」（" + 四柱生剋.月柱納音 + "）生日柱「" + 四柱生剋.日柱 + "」（" + 四柱生剋.日柱納音 + "）生時柱「" + 四柱生剋.時柱 + "」（" + 四柱生剋.時柱納音 + "）";
        四柱生剋.成立條件 = "年柱納音（" + 四柱生剋.年柱納音五行 + "）生月柱納音（" + 四柱生剋.月柱納音五行 + "）生日柱納音（" + 四柱生剋.日柱納音五行 + "）生時柱納音（" + 四柱生剋.時柱納音五行 + "）";
        四柱生剋.註解 = 四柱生剋.成立條件 + "。<br>" + "四柱納音從上而下，依次相生者，多為貧賤之人。";
    } // end 年生月，月生日，日生時 成立
    
    
    // 2：年剋月，月剋日，日剋時, 1948年12月23日，申時「」
    if(四柱生剋.年月五行關係 == "我剋" && 四柱生剋.月日五行關係 == "我剋" && 四柱生剋.日時五行關係 == "我剋") {
        四柱生剋.成立 = true;
        //四柱生剋.成立條件 = "年柱「" + 四柱生剋.年柱 + "」（" + 四柱生剋.年柱納音 + "）剋月柱「" + 四柱生剋.月柱 + "」（" + 四柱生剋.月柱納音 + "）剋日柱「" + 四柱生剋.日柱 + "」（" + 四柱生剋.日柱納音 + "）剋時柱「" + 四柱生剋.時柱 + "」（" + 四柱生剋.時柱納音 + "）";
        四柱生剋.成立條件 = "年柱納音（" + 四柱生剋.年柱納音五行 + "）剋月柱納音（" + 四柱生剋.月柱納音五行 + "）剋日柱納音（" + 四柱生剋.日柱納音五行 + "）剋時柱納音（" + 四柱生剋.時柱納音五行 + "）";
        四柱生剋.註解 = 四柱生剋.成立條件 + "。<br>" + "四柱納音從上而下，依次相剋者，多為富貴之人。";
    } // end 年剋月，月剋日，日剋時 成立
    
    // 3：時剋日，日剋月，月剋年, 1944年1月12日，子時
    if(四柱生剋.時日五行關係 == "我剋" && 四柱生剋.日月五行關係 == "我剋" && 四柱生剋.月年五行關係 == "我剋") {
        四柱生剋.成立 = true;
        //四柱生剋.成立條件 = "時柱「" + 四柱生剋.時柱 + "」（" + 四柱生剋.時柱納音 + "）剋日柱「" + 四柱生剋.日柱 + "」（" + 四柱生剋.日柱納音 + "）剋月柱「" + 四柱生剋.月柱 + "」（" + 四柱生剋.月柱納音 + "）剋年柱「" + 四柱生剋.年柱 + "」（" + 四柱生剋.年柱納音 + "）";
        四柱生剋.成立條件 = "時柱納音（" + 四柱生剋.時柱納音五行 + "）剋日柱納音（" + 四柱生剋.日柱納音五行 + "）剋月柱納音（" + 四柱生剋.月柱納音五行 + "）剋年柱納音（" + 四柱生剋.年柱納音五行 + "）";
        四柱生剋.註解 = 四柱生剋.成立條件 + "。<br>" + "四柱納音從下而上，依次相剋者，多主傷剋長輩，家門破財，一生起伏多波折之人。";
    } // end 時剋日，日剋月，月剋年
    
     // 4：時生日，日生月，月生年, 1946年9月21日，亥時
    if(四柱生剋.時日五行關係 == "我生" && 四柱生剋.日月五行關係 == "我生" && 四柱生剋.月年五行關係 == "我生") {
        四柱生剋.成立 = true;
        四柱生剋.成立條件 = "時柱「" + 四柱生剋.時柱 + "」（" + 四柱生剋.時柱納音 + "）生日柱「" + 四柱生剋.日柱 + "」（" + 四柱生剋.日柱納音 + "）生月柱「" + 四柱生剋.月柱 + "」（" + 四柱生剋.月柱納音 + "）生年柱「" + 四柱生剋.年柱 + "」（" + 四柱生剋.年柱納音 + "）";
        四柱生剋.成立條件 = "時柱納音（" + 四柱生剋.時柱納音五行 + "）生日柱納音（" + 四柱生剋.日柱納音五行 + "）生月柱納音（" + 四柱生剋.月柱納音五行 + "）生年柱納音（" + 四柱生剋.年柱納音五行 + "）";
        四柱生剋.註解 = 四柱生剋.成立條件 + "。<br>" + "四柱納音從下而上，依次相生者，多為大富大貴之人。";
    } // end 時生日，日生月，月生年
    
    return 四柱生剋;
} // end function 盲派納音_四柱依次生剋


function 盲派納音_三合生剋(輸入資料){
    var 三合生剋 = {
        "八字": 輸入資料.八字,
        "年柱": 輸入資料.年柱,
        "年柱納音": 輸入資料.年柱納音,
        "年柱納音五行": 輸入資料.年柱納音五行,
        "地支三合": false,
        "地支三合五行": "",
        "成立": false,
        "成立條件": "",
        "註解": "",
        "備註": ""
    };

    
    var 四柱地支矩陣 = [三合生剋.八字.substr(1,1), 三合生剋.八字.substr(3,1), 三合生剋.八字.substr(5,1), 三合生剋.八字.substr(7,1)];
    
    if(ArraySubset(四柱地支矩陣, ["申", "子", "辰"])) { 三合生剋.地支三合 = true; 三合生剋.地支三合五行 = "水"; } //三合水
    if(ArraySubset(四柱地支矩陣, ["巳", "酉", "丑"])) { 三合生剋.地支三合 = true; 三合生剋.地支三合五行 = "金"; } //三合金
    if(ArraySubset(四柱地支矩陣, ["寅", "午", "戌"])) { 三合生剋.地支三合 = true; 三合生剋.地支三合五行 = "火"; } //三合火
    if(ArraySubset(四柱地支矩陣, ["亥", "卯", "未"])) { 三合生剋.地支三合 = true; 三合生剋.地支三合五行 = "木"; } //三合木
    
    if(三合生剋.地支三合) {
        var 地支合化字 = "八字地支三合化" + 三合生剋.地支三合五行;
        var 合化五行與年柱納音關係 = 五行生剋(三合生剋.年柱納音五行, 三合生剋.地支三合五行);
        
        switch(合化五行與年柱納音關係) {
            // 五行生剋關係 ： 同我，我生，我剋，剋我，生我
            case "同我":  //1950年3月29日未時
                三合生剋.成立 = true;
                三合生剋.成立條件 = 地支合化字 + "，與年柱納音「" + 三合生剋.年柱納音 + "」相同";
                三合生剋.註解 = 三合生剋.成立條件 + "者，多為富貴之人。";
                break;
            case "生我":  //
                三合生剋.成立 = true;
                三合生剋.成立條件 = 地支合化字 + "，生年柱納音「" + 三合生剋.年柱納音;
                三合生剋.註解 = 三合生剋.成立條件 + "」者，多為富貴之人。※";
                break;
            case "我生":  //1944年3月12日未時
                三合生剋.成立 = true;
                三合生剋.成立條件 = 地支合化字 + "，洩年柱納音「" + 三合生剋.年柱納音;
                三合生剋.註解 = 三合生剋.成立條件 + "」者，多為貧賤之人。";
                break;
            case "我剋":
                三合生剋.成立 = true;
                三合生剋.成立條件 = 地支合化字 + "，耗年柱納音「" + 三合生剋.年柱納音;
                三合生剋.註解 = 三合生剋.成立條件 + "」者，多為貧賤之人。";
                break;
            case "剋我": //1948年8月19日辰時
                三合生剋.成立 = true;
                三合生剋.成立條件 = 地支合化字 + "，剋年柱納音「" + 三合生剋.年柱納音;
                三合生剋.註解 = 三合生剋.成立條件 + "」者，多為盜賊、囚犯之人。";
                break;
        }  // end switch
    } // end if 地支三合 成立
    
    return 三合生剋;
}   // end function 盲派納音_三合生剋


function 盲派納音_其他論斷(輸入資料){
    var 納音其他 = {
        "八字": 輸入資料.八字,
        "年柱": 輸入資料.年柱, "月柱": 輸入資料.月柱, "日柱": 輸入資料.日柱, "時柱": 輸入資料.時柱,
        "年柱納音": 輸入資料.年柱納音, "月柱納音": 輸入資料.月柱納音, "日柱納音": 輸入資料.日柱納音, "時柱納音": 輸入資料.時柱納音,
        "年柱納音五行": 輸入資料.年柱納音五行, "月柱納音五行": 輸入資料.月柱納音五行, "日柱納音五行": 輸入資料.日柱納音五行, "時柱納音五行": 輸入資料.時柱納音五行,
        "成立": false,
        "成立條件": "",
        "註解": "",
        "備註": ""
    };
    
    var 納音其他論斷 = [];
    
    //納音其他.年柱 = 納音其他.八字.substr(0,2); 納音其他.月柱 = 納音其他.八字.substr(2,2); 納音其他.日柱 = 納音其他.八字.substr(4,2); 納音其他.時柱 = 納音其他.八字.substr(6,2);
    //納音其他.年柱納音 = 六十干支屬性(納音其他.年柱).納音; 納音其他.月柱納音 = 六十干支屬性(納音其他.月柱).納音; 納音其他.日柱納音 = 六十干支屬性(納音其他.日柱).納音; 納音其他.時柱納音 = 六十干支屬性(納音其他.時柱).納音; 
    //納音其他.年柱納音五行 = 納音其他.年柱納音.substr(2,1); 納音其他.月柱納音五行 = 納音其他.月柱納音.substr(2,1); 納音其他.日柱納音五行 = 納音其他.日柱納音.substr(2,1); 納音其他.時柱納音五行 = 納音其他.時柱納音.substr(2,1);
    
    // 1: 無子嗣
    if(納音其他.年柱納音五行 == "木" && 納音其他.時柱納音五行 == "金") {  // 日柱納音屬金也符合理論
        納音其他.成立;
        納音其他論斷.push("年柱納音為「木」，時柱納音為「金」之人，偏向沒有子嗣。");
    } // end if無子嗣
    
    
    // 2: 短壽夭折 1967年3月23日x時
    var 年支 = 納音其他.八字.substr(1,1), 日支 = 納音其他.八字.substr(5,1); 
    var 年支日支關係 = 地支刑沖合會害關係(年支, 日支);
    var 年日柱納音關係 = 五行生剋(納音其他.年柱納音五行, 納音其他.日柱納音五行);
    
    if(年日柱納音關係 == "剋我" && 年支日支關係.刑) {
        納音其他.成立 = true;
        納音其他論斷.push("年柱納音「" + 納音其他.年柱納音 + "」被日柱納音「" + 納音其他.日柱納音 + "」所剋，且年支「" + 年支 + "」又被日支「" + 日支 + "」所刑，多為短壽夭折之命。");
    } // end if 
    
    
    
    // ************************** 總結 **********************************
    if(納音其他論斷.length > 0) 納音其他.註解 = 納音其他論斷.join("<br><br>");
    
    return 納音其他;
} // function 盲派納音_其他
