// *****************************************************
// *                     袁天罡稱骨                      *
// *****************************************************

function 袁天罡稱骨(輸入資料){
    var 干支年 = 輸入資料.生年干支; 
    var 農曆月 = 輸入資料.農曆.月;
    var 農曆日 = 輸入資料.農曆.日;
    var 時支 = (輸入資料.農曆.時.length == 1)? 輸入資料.農曆.時 : 輸入資料.農曆.時.substr(1,1);
    var 男女 = 輸入資料.性別;
    
	var 年兩錢, 月兩錢, 日兩錢, 時兩錢;
    
	var 年柱重量=[
        { "干支": "甲子", "重量": 1.2, "重量中文": "一兩二錢"}, { "干支": "乙丑", "重量": 0.9, "重量中文": "九錢"}, { "干支": "丙寅", "重量": 0.6, "重量中文": "六錢"}, { "干支": "丁卯", "重量": 0.7, "重量中文": "七錢"}, { "干支": "戊辰", "重量": 1.2, "重量中文": "一兩二錢"}, { "干支": "己巳", "重量": 0.5, "重量中文": "五錢"}, { "干支": "庚午", "重量": 0.9, "重量中文": "九錢"}, { "干支": "辛未", "重量": 0.8, "重量中文": "八錢"}, { "干支": "壬申", "重量": 0.7, "重量中文": "七錢"}, { "干支": "癸酉", "重量": 0.8, "重量中文": "八錢"}, { "干支": "甲戌", "重量": 1.5, "重量中文": "一兩五錢"}, { "干支": "乙亥", "重量": 0.9, "重量中文": "九錢"},
        { "干支": "丙子", "重量": 1.6, "重量中文": "一兩六錢"}, { "干支": "丁丑", "重量": 0.8, "重量中文": "八錢"}, { "干支": "戊寅", "重量": 0.8, "重量中文": "八錢"}, { "干支": "己卯", "重量": 1.9, "重量中文": "一兩九錢"}, { "干支": "庚辰", "重量": 1.2, "重量中文": "一兩二錢"}, { "干支": "辛巳", "重量": 0.6, "重量中文": "六錢"}, { "干支": "壬午", "重量": 0.8, "重量中文": "八錢"}, { "干支": "癸未", "重量": 0.7, "重量中文": "七錢"}, { "干支": "甲申", "重量": 0.5, "重量中文": "五錢"}, { "干支": "乙酉", "重量": 1.5, "重量中文": "一兩五錢"}, { "干支": "丙戌", "重量": 0.6, "重量中文": "六錢"}, { "干支": "丁亥", "重量": 1.6, "重量中文": "一兩六錢"},
        { "干支": "戊子", "重量": 1.5, "重量中文": "一兩五錢"}, { "干支": "己丑", "重量": 0.7, "重量中文": "七錢"}, { "干支": "庚寅", "重量": 0.9, "重量中文": "九錢"}, { "干支": "辛卯", "重量": 1.2, "重量中文": "一兩二錢"}, { "干支": "壬辰", "重量": 1, "重量中文": "一兩"}, { "干支": "癸巳", "重量": 0.7, "重量中文": "七錢"}, { "干支": "甲午", "重量": 1.5, "重量中文": "一兩五錢"}, { "干支": "乙未", "重量": 0.6, "重量中文": "六錢"}, { "干支": "丙申", "重量": 0.5, "重量中文": "五錢"}, { "干支": "丁酉", "重量": 1.4, "重量中文": "一兩四錢"}, { "干支": "戊戌", "重量": 1.4, "重量中文": "一兩四錢"}, { "干支": "己亥", "重量": 0.9, "重量中文": "九錢"},
        { "干支": "庚子", "重量": 0.7, "重量中文": "七錢"}, { "干支": "辛丑", "重量": 0.7, "重量中文": "七錢"}, { "干支": "壬寅", "重量": 0.9, "重量中文": "九錢"}, { "干支": "癸卯", "重量": 1.2, "重量中文": "一兩二錢"}, { "干支": "甲辰", "重量": 0.8, "重量中文": "八錢"}, { "干支": "乙巳", "重量": 0.7, "重量中文": "七錢"}, { "干支": "丙午", "重量": 1.3, "重量中文": "一兩三錢"}, { "干支": "丁未", "重量": 0.5, "重量中文": "五錢"}, { "干支": "戊申", "重量": 1.4, "重量中文": "一兩四錢"}, { "干支": "己酉", "重量": 0.5, "重量中文": "五錢"}, { "干支": "庚戌", "重量": 0.9, "重量中文": "九錢"}, { "干支": "辛亥", "重量": 1.7, "重量中文": "一兩七錢"},
        { "干支": "壬子", "重量": 0.5, "重量中文": "五錢"}, { "干支": "癸丑", "重量": 0.7, "重量中文": "七錢"}, { "干支": "甲寅", "重量": 1.2, "重量中文": "一兩二錢"}, { "干支": "乙卯", "重量": 0.8, "重量中文": "八錢"}, { "干支": "丙辰", "重量": 0.8, "重量中文": "八錢"}, { "干支": "丁巳", "重量": 0.6, "重量中文": "六錢"}, { "干支": "戊午", "重量": 1.9, "重量中文": "一兩九錢"}, { "干支": "己未", "重量": 0.6, "重量中文": "六錢"}, { "干支": "庚申", "重量": 0.8, "重量中文": "八錢"}, { "干支": "辛酉", "重量": 1.6, "重量中文": "一兩六錢"}, { "干支": "壬戌", "重量": 1, "重量中文": "一兩"}, { "干支": "癸亥", "重量": 0.6, "重量中文": "六錢"}
    ];
    
    var 月份重量=[ { "農曆月": 1, "月份": "正月", "重量": 0.6, "重量中文": "六錢"}, { "農曆月": 2, "月份": "二月", "重量": 0.7, "重量中文": "七錢"}, { "農曆月": 3, "月份": "三月", "重量": 1.8, "重量中文": "一兩八錢"}, { "農曆月": 4, "月份": "四月", "重量": 0.9, "重量中文": "九錢"}, { "農曆月": 5, "月份": "五月", "重量": 0.5, "重量中文": "五錢"}, { "農曆月": 6, "月份": "六月", "重量": 1.6, "重量中文": "一兩六錢"}, { "農曆月": 7, "月份": "七月", "重量": 0.9, "重量中文": "九錢"}, { "農曆月": 8, "月份": "八月", "重量": 1.5, "重量中文": "一兩五錢"}, { "農曆月": 9, "月份": "九月", "重量": 1.8, "重量中文": "一兩八錢"}, { "農曆月": 10, "月份": "十月", "重量": 0.8, "重量中文": "八錢"}, { "農曆月": 11, "月份": "十一月", "重量": 0.9, "重量中文": "九錢"}, { "農曆月": 12, "月份": "十二月", "重量": 0.5, "重量中文": "五錢"} ]; 
    
    var 生日重量=[
        { "生日": 1, "農曆日": "初一", "重量": 0.5, "重量中文": "五錢"}, { "生日": 2, "農曆日": "初二", "重量": 1, "重量中文": "一兩"}, { "生日": 3, "農曆日": "初三", "重量": 0.8, "重量中文": "八錢"}, { "生日": 4, "農曆日": "初四", "重量": 1.5, "重量中文": "一兩五錢"}, { "生日": 5, "農曆日": "初五", "重量": 1.6, "重量中文": "一兩六錢"}, { "生日": 6, "農曆日": "初六", "重量": 1.5, "重量中文": "一兩五錢"}, { "生日": 7, "農曆日": "初七", "重量": 0.8, "重量中文": "八錢"}, { "生日": 8, "農曆日": "初八", "重量": 1.6, "重量中文": "一兩六錢"}, { "生日": 9, "農曆日": "初九", "重量": 0.8, "重量中文": "八錢"}, { "生日": 10, "農曆日": "初十", "重量": 1.6, "重量中文": "一兩六錢"},
        { "生日": 11, "農曆日": "十一", "重量": 0.9, "重量中文": "九錢"}, { "生日": 12, "農曆日": "十二", "重量": 1.7, "重量中文": "一兩七錢"}, { "生日": 13, "農曆日": "十三", "重量": 0.8, "重量中文": "八錢"}, { "生日": 14, "農曆日": "十四", "重量": 1.7, "重量中文": "一兩七錢"}, { "生日": 15, "農曆日": "十五", "重量": 1, "重量中文": "一兩"}, { "生日": 16, "農曆日": "十六", "重量": 0.8, "重量中文": "八錢"}, { "生日": 17, "農曆日": "十七", "重量": 0.9, "重量中文": "九錢"}, { "生日": 18, "農曆日": "十八", "重量": 1.8, "重量中文": "一兩八錢"}, { "生日": 19, "農曆日": "十九", "重量": 0.5, "重量中文": "五錢"}, { "生日": 20, "農曆日": "二十", "重量": 1, "重量中文": "一兩"},
        { "生日": 21, "農曆日": "廿一", "重量": 1, "重量中文": "一兩"}, { "生日": 22, "農曆日": "廿二", "重量": 0.9, "重量中文": "九錢"}, { "生日": 23, "農曆日": "廿三", "重量": 0.8, "重量中文": "八錢"}, { "生日": 24, "農曆日": "廿四", "重量": 0.9, "重量中文": "九錢"}, { "生日": 25, "農曆日": "廿五", "重量": 1.5, "重量中文": "一兩五錢"}, { "生日": 26, "農曆日": "廿六", "重量": 1.8, "重量中文": "一兩八錢"}, { "生日": 27, "農曆日": "廿七", "重量": 0.7, "重量中文": "七錢"}, { "生日": 28, "農曆日": "廿八", "重量": 0.8, "重量中文": "八錢"}, { "生日": 29, "農曆日": "廿九", "重量": 1.6, "重量中文": "一兩六錢"}, { "生日": 30, "農曆日": "三十", "重量": 0.6, "重量中文": "六錢"} ]; 
    
    var 時支重量=[ { "時支": "子", "重量": 1.6, "重量中文": "一兩六錢"}, { "時支": "丑", "重量": 0.6, "重量中文": "六錢"}, { "時支": "寅", "重量": 0.7, "重量中文": "七錢"}, { "時支": "卯", "重量": 1, "重量中文": "一兩"}, { "時支": "辰", "重量": 0.9, "重量中文": "九錢"}, { "時支": "巳", "重量": 1.6, "重量中文": "一兩六錢"}, { "時支": "午", "重量": 1, "重量中文": "一兩"}, { "時支": "未", "重量": 0.8, "重量中文": "八錢"}, { "時支": "申", "重量": 0.8, "重量中文": "八錢"}, { "時支": "酉", "重量": 0.9, "重量中文": "九錢"}, { "時支": "戌", "重量": 0.6, "重量中文": "六錢"}, { "時支": "亥", "重量": 0.6, "重量中文": "六錢"} ]; 
    
    var 重量註解=[
        { "重量": "2.1", "重量中文": "二兩一錢", "註解": "短命非業謂大空，平生災難事重重；凶禍頻臨陷逆境，終世困苦事不成。", "女命": "生身此命運不通，烏雲蓋月黑朦朧；莫向故園載花木，可來幽地種青松。"},
        { "重量": "2.2", "重量中文": "二兩二錢", "註解": "身寒骨冷苦伶仃，此命推來生乞人。碌碌巴巴無度日，終年打拱過平年。", "女命": "女命孤冷獨凄身，此身推來路乞人；操心煩惱難度日，一生痛苦度光陰。"},
        { "重量": "2.3", "重量中文": "二兩三錢", "註解": "此命推來骨自輕，求謀作事事難成。妻兒兄弟應難許，別處他鄉作散人。", "女命": "女命生來輕薄人，營謀事作難稱心；六親骨肉亦無靠，奔走勞碌困苦門。"},
        { "重量": "2.4", "重量中文": "二兩四錢", "註解": "此命推來福祿無，門庭困苦總難營。六親骨肉皆無靠，流到他鄉作老翁。", "女命": "女命推來福祿無，治家艱難辛苦多；丈夫兒女不親愛，奔走他鄉作游姑。"},
        { "重量": "2.5", "重量中文": "二兩五錢", "註解": "此命推來祖業微，門庭營度似稀奇。六親骨肉如冰炭，一生勤勞自把持。", "女命": "此命一身八字低，家庭艱辛多苦妻；娘家親友冷如炭，一生勤勞多憂眉。"},
        { "重量": "2.6", "重量中文": "二兩六錢", "註解": "平生衣祿苦中求，獨自經營事不休。離祖出門宜早計，晚來衣祿自無憂。", "女命": "平生依祿但苦求，兩次配夫帶憂愁；咸酸苦辣他償過，晚年衣食本無憂。"},
        { "重量": "2.7", "重量中文": "二兩七錢", "註解": "一生作事少商量，難靠祖宗作主張。獨馬單槍空做去，早來晚歲部無長。", "女命": "此格做事單獨強，難告夫君作主張；心問口來口問心，晚景衣祿宜自生。"},
        { "重量": "2.8", "重量中文": "二兩八錢", "註解": "一生作事似飄蓬，祖宗產業在夢中。若不過房並改姓，也當移徙兩三通。", "女命": "女命生來八字輕，為善作事也無因；你把別人當親生，別人對你假殷情。"},
        { "重量": "2.9", "重量中文": "二兩九錢", "註解": "初年運限未曾享，縱有功名在後底。須過四旬繞可上，移居改姓始為良。", "女命": "花支艷來硬性身，自奔自力不求人；若問求財方可止，在苦有甜度光陰。"},
        { "重量": "3.0", "重量中文": "三兩", "註解": "勞勞碌碌苦中求，東走西奔何日休。若使終身勤與儉，老來稍可免憂愁。", "女命": "女命推來比郎強，婚姻大事礙無障；中年走過坎坷地，末年漸經行前強。"},
        { "重量": "3.1", "重量中文": "三兩一錢", "註解": "忙忙碌碌苦中求，何日雲開見日頭。難得祖基家可立，中年衣食漸無憂。", "女命": "早年行運在忙頭，勞碌奔波苦勤求；費力勞心把家立，後來晚景名憂愁。"},
        { "重量": "3.2", "重量中文": "三兩二錢", "註解": "初年運蹇事難謀，漸有財源如水流。到得中年衣食旺，那時名利一齊來。", "女命": "時逢運來帶吉神，從有凶星轉灰塵；真變假來假成真，結拜弟妹當親生。"},
        { "重量": "3.3", "重量中文": "三兩三錢", "註解": "早年做事事難成，百計徒勞枉費心。半世自如流水去，後來運到得黃金。", "女命": "初限命中有變化，中年可比樹落花；勤儉持家難度日，晚年成業享榮華。"},
        { "重量": "3.4", "重量中文": "三兩四錢", "註解": "此命福氣果如何，僧道門中衣祿多。離祖出家方得妙，終朝拜佛念彌陀。", "女命": "矮巴勾棗難撈枝，看破紅塵最相宜；謀望求財空費力，婚姻三娶兩次離。"},
        { "重量": "3.5", "重量中文": "三兩五錢", "註解": "平生福量不周全，祖業根基覺少傳。營業生涯宜守舊，時來衣食勝從前。", "女命": "女子走冰怕冰薄，出行交易受殘霜；婚姻周郎休此意，官司口舌須相加。"},
        { "重量": "3.6", "重量中文": "三兩六錢", "註解": "不須勞碌過平生，獨自成家福不輕。早有福星常照命，任君行去百般成。", "女命": "憂悉常鎖兩眉間，家業掛心不等閑；從今以後防口角，任意行移不相關。"},
        { "重量": "3.7", "重量中文": "三兩七錢", "註解": "此命般般事不成，弟兄少力自孤成。雖然祖業須微有，來得明時去得明。", "女命": "此命推來費運多，若作摧群受折磨；山路崎嶇吊下耳，左插右安心難留。"},
        { "重量": "3.8", "重量中文": "三兩八錢", "註解": "一生骨肉最清高，早入黃門姓名標。待看看將三十六，藍袍脫去換紅袍。", "女命": "鳳鳴岐山四方揚，女命逢此大吉昌；走失夫君音信有，晚年衣祿財盈箱。"},
        { "重量": "3.9", "重量中文": "三兩九錢", "註解": "此命終身運不窮，勞勞作事盡皆空。苦心竭力成家計，到得那時在夢中。", "女命": "女命推來運未能，勞碌奔波一場空；好似俊鳥在籠鎖，中年未限凄秋風。"},
        { "重量": "4.0", "重量中文": "四兩", "註解": "生平衣祿是綿長，件件心中自主張。前面風霜多受過，後來必定享安康。", "女命": "目前月令運不良，千辛萬苦受煎熬；女身受得多苦難，晚年福祿比密甜。"},
        { "重量": "4.1", "重量中文": "四兩一錢", "註解": "此命推來事不同，為人能幹略凡庸。中年還有逍遙福，不比前年運未通。", "女命": "此命推來一般艱，女子為人很非凡；中年逍遙多自在，晚年更比中年超。"},
        { "重量": "4.2", "重量中文": "四兩二錢", "註解": "得寬懷處且寬懷，何用雙眉皺不開。若使中年命運濟，那時名利一齊來。", "女命": "杜井破廢已多年，今有泉水出來鮮；資生濟竭人稱美，中運來轉喜安然。"},
        { "重量": "4.3", "重量中文": "四兩三錢", "註解": "為人心性最聰明，作事軒昂近貴人。衣祿一生天數定，不須勞碌是豐享。", "女命": "推車靠涯道路通，女名求財也無窮；婚姻出配無阻礙，疾病口舌離身躬。"},
        { "重量": "4.4", "重量中文": "四兩四錢", "註解": "來事由天莫苦求，須知福祿勝前途。當年財帛難如意，晚景欣然便不憂。", "女命": "夜夢金銀醒來空，立志謀業運不通；婚姻難成交易散，夫君趟失未見蹤。"},
        { "重量": "4.5", "重量中文": "四兩五錢", "註解": "名利推來竟若何，前途辛苦后奔波。命中難養男與女，骨肉扶持也不多。", "女命": "女命終身駁雜多，六親骨肉不相助；命中男女都難養，勞碌辛苦還奔波。"},
        { "重量": "4.6", "重量中文": "四兩六錢", "註解": "東西南北盡皆空，出姓移名更覺隆。衣祿無虧天數定，中年晚景一般同。", "女命": "孤舟行水離沙灘，離鄉出外早過家；是非口舌皆無礙，婚姻合配紫微房。"},
        { "重量": "4.7", "重量中文": "四兩七錢", "註解": "此命推來旺末年，妻榮子貴自怡然。平生原有滔滔福，可有財源如水源。", "女命": "時來運轉喜開顏，多年枯木逢春花；枝葉重生多茂盛，凡人見得都贊誇。"},
        { "重量": "4.8", "重量中文": "四兩八錢", "註解": "幼年運道未曾享，若是蹉跎再不興。兄弟六親皆無靠，一身事業晚年成。", "女命": "一朵鮮花鏡中開，看着極好取不來；勸你休把鏡花想，此命推來主可癲。"},
        { "重量": "4.9", "重量中文": "四兩九錢", "註解": "此命推來福不輕，自成自立耀門庭。從來富貴人親近，使婢差奴過一生。", "女命": "一生為人福宏名，心茲隨君顯門庭；容貌美麗惹人愛，銀錢富足萬事成。"},
        { "重量": "5.0", "重量中文": "五兩", "註解": "為名為利終日勞，中年福祿也多遭。老來是有財星照，不比前番日下高。", "女命": "馬氏太公不相和，好命逢此憂凝多；恩人無義反為仇，是非平地起風波。"},
        { "重量": "5.1", "重量中文": "五兩一錢", "註解": "一世榮華事事通，不須勞碌自享豐。弟兄叔侄皆如意，家業成時福祿宏。", "女命": "肥羊一群入出場，防虎逢之把口張；適口充饑心歡喜，女命八字大吉昌。"},
        { "重量": "5.2", "重量中文": "五兩二錢", "註解": "一世享通事事能，不須勞思自然能。家族欣然心皆好，家業豐享自稱心。", "女命": "順風行舟扯起帆，上天又助一順風；不用費力逍遙去，任意順行大享通。"},
        { "重量": "5.3", "重量中文": "五兩三錢", "註解": "此格推來氣像真，興家發達在其中。一生福祿安排家，欲是人間一富翁。", "女命": "此命相貌眉目清，文武雙全功名成；一生衣祿皆無缺，可算世上積福人。"},
        { "重量": "5.4", "重量中文": "五兩四錢", "註解": "此命推來厚且清，詩畫滿腹看功成。豐衣足食自然穩，正是人間有福人。", "女命": "運開滿腹好文章，謀事求財大吉祥；出行交易多得穩，到處享通姓名揚。"},
        { "重量": "5.5", "重量中文": "五兩五錢", "註解": "走馬揚鞭爭名利，少年做事費籌謀。一朝福祿源源至，富貴榮華耀六親。", "女命": "發政旅仁志量高，女命求財任他鄉；交舍婚姻多有意，無君出外有音耗。"},
        { "重量": "5.6", "重量中文": "五兩六錢", "註解": "此格推來禮義通，一生福祿用無窮。甜酸苦辣皆嘗過，財源滾滾穩且豐。", "女命": "明珠輝吐離埃來，女有口有清散開；走失郎君當兩歸，交易有成永無災。"},
        { "重量": "5.7", "重量中文": "五兩七錢", "註解": "福祿豐盈萬事全，一生榮耀顯雙親。名揚威振人欽敬，處世逍遙似遇春。", "女命": "游魚戲水被網驚，踴身變化入龍門；三根楊柳垂金錢，萬朵桃花顯價能。"},
        { "重量": "5.8", "重量中文": "五兩八錢", "註解": "平生福祿自然來，名利雙全福祿偕。雁塔題名為貴客，紫袍玉帶走金階。", "女命": "此命推來轉悠悠，時運未來莫強求；幸得今日重反點，自有好運在後頭。"},
        { "重量": "5.9", "重量中文": "五兩九錢", "註解": "細推此格妙且清，必定財高禮義通。甲第之中應有分，揚鞭走馬顯威榮。", "女命": "雨雪載途活泥濘，交易不安難出生；疾病還拉婚姻慢，謀望求財事難尋。"},
        { "重量": "6.0", "重量中文": "六兩", "註解": "一朝金榜快題名，顯祖榮宗立大功。衣食定然原裕足，田園財帛更豐盛。", "女命": "女命八字喜氣和，謀事求財吉慶多；口舌漸消疾病少，夫君走別歸老窠。"},
        { "重量": "6.1", "重量中文": "六兩一錢", "註解": "不作朝中金榜客，定為世上一財翁。聰明天賦經書熟，名顯高科自是榮。", "女命": "緣木求魚事多難，雖不得魚無害反；若是行險弄巧地，事不遂心枉安凡。"},
        { "重量": "6.2", "重量中文": "六兩二錢", "註解": "此命推來福不窮，讀書必定顯親宗。紫衣金帶為卿相，富貴榮華皆可同。", "女命": "指日高升氣象新，走失待人有信音；好命遇事遂心好，伺病口舌皆除根。"},
        { "重量": "6.3", "重量中文": "六兩三錢", "註解": "命主為官福祿長，得來富貴定非常。名題雁塔傳金榜，定中高科天下揚。", "女命": "五官脫運難抬頭，婦命須當把財求；交易少行有人助，一生衣祿不須愁。"},
        { "重量": "6.4", "重量中文": "六兩四錢", "註解": "此格威權不可擋，紫袍金帶坐高望。榮華富貴雖能及，積玉堆金滿儲倉。", "女命": "俊鳥曾得出朧中，脫離為難顯威風；一朝得意福力至，東南西北任意通。"},
        { "重量": "6.5", "重量中文": "六兩五錢", "註解": "細推此命福不輕，安國安邦極品人。文紛雕梁徽富貴，威聲照耀四方聞。", "女命": "女命推來福非輕，茲善為事受人敬；天降文王開基業，八百年來富貴門。"},
        { "重量": "6.6", "重量中文": "六兩六錢", "註解": "此格人間一福人，堆金積玉滿堂春。從來富貴由天定，正勿垂紳謁聖君。", "女命": "時來運轉閨閣樓，賢德淑女君子求；擊鼓樂之大吉慶，女命逢此喜悠悠。"},
        { "重量": "6.7", "重量中文": "六兩七錢", "註解": "此命生來福自宏，田園家業最高隆。平生衣祿豐盈足，一世榮華萬事通。", "女命": "亂絲無頭定有頭，碰得親事暫折磨；交易出行無好處，謀事求財心不遂。"},
        { "重量": "6.8", "重量中文": "六兩八錢", "註解": "富貴由大莫苦求，萬金家計不須謀。十年不比前番事，祖業根基水上舟。", "女命": "水底明月不可撈，女命早限運未高；交易出行難獲利，未運終得漸見好。"},
        { "重量": "6.9", "重量中文": "六兩九錢", "註解": "君是人間前祿星，一生富貴眾人欽。縱然福祿由天定，安享榮華過一生。", "女命": "太公封祖不非凡，女子求財穩如山；交易合夥多吉慶，疾病口角遺天涯。"},
        { "重量": "7.0", "重量中文": "七兩", "註解": "此命推來福不輕，不須愁慮苦勞心。一生天定衣與祿，富貴榮華主一生。", "女命": "本命推斷喜氣新，恰遇郎君金遂心；坤身來交正當運，富貴衣祿樂平生。"},
        { "重量": "7.1", "重量中文": "七兩一錢", "註解": "此命生來大不同，公侯卿相在其中。一生自有逍遙福，富貴榮華極品隆。", "女命": "此命推來宏運交，不須再愁苦勞難；一生身有衣祿福，安享榮華勝班超。"},
        { "重量": "7.2", "重量中文": "七兩二錢", "註解": "此命推來天下隆，必定人間一主公。富貴榮華數不盡，定為乾坤一蛟龍。", "女命": ""}
    ];
    
    // -----------------------------------------------------------
    
	var 稱骨算命={
        "性別": 男女,
		"年重": -1,
        "月重": -1,
        "日重": -1,
        "時重": -1,
        "重量": -1,
		"重量文字": "",
        "重量文字計算": "",
        "歌訣": "",
        "Error": ""
	} // end obj 稱骨算命

	var 年索引=_.findIndex(年柱重量, {干支: 干支年});
    var 月索引=_.findIndex(月份重量, {農曆月: 農曆月});
	var 日索引=_.findIndex(生日重量, {生日: 農曆日});
    var 時索引=_.findIndex(時支重量, {時支: 時支});
    
	if(年索引 != -1){ 稱骨算命.年重 = 年柱重量[年索引].重量; } else 稱骨算命.Error = "年柱";
    if(月索引 != -1){ 稱骨算命.月重 = 月份重量[月索引].重量; } else 稱骨算命.Error = "月份";
    if(日索引 != -1){ 稱骨算命.日重 = 生日重量[日索引].重量; } else 稱骨算命.Error = "農曆日";
    if(時索引 != -1){ 稱骨算命.時重 = 時支重量[時索引].重量; } else 稱骨算命.Error = "時支";

    if(稱骨算命.Error == "") { // no error
        稱骨算命.重量 = Number(稱骨算命.年重 + 稱骨算命.月重 + 稱骨算命.日重 + 稱骨算命.時重).toFixed(1);
    } // end if no 稱骨算命.Error
    
    var 重量索引=_.findIndex(重量註解, {重量: 稱骨算命.重量});
    
    if(重量索引 != -1){ 
        稱骨算命.重量文字 = 重量註解[重量索引].重量中文;
        稱骨算命.歌訣 = 重量註解[重量索引].註解;
        if(男女 == "女") 稱骨算命.歌訣 = 重量註解[重量索引].女命;
        
        var 重量計算 = [];
        重量計算.push("年柱"+ 干支年 + "重" + 年柱重量[年索引].重量中文);
        重量計算.push("農曆"+ 中文數字(農曆月) + "月重" + 月份重量[月索引].重量中文);
        重量計算.push(生日重量[日索引].農曆日 + "日重" + 生日重量[日索引].重量中文);
        重量計算.push(時支 + "時重" + 時支重量[時索引].重量中文);
        重量計算.push("總計「" + 稱骨算命.重量文字 + "」。");
        稱骨算命.重量文字計算 = 重量計算.join("，");
    } else 稱骨算命.Error = "重量";
    
    return 稱骨算命;
} // end function 袁天罡稱骨


