
function 判斷刑冲合會害(命盤){
    // ********************** 執行 刑、冲、合、會、害 分析 ************************
    判斷天干五合(命盤);
    
    判斷地支三合(命盤);
    判斷地支三會(命盤);
    判斷地支三刑(命盤);
    判斷地支六合(命盤);
    if(命盤.分析.地支.三合.命盤三合<0) 判斷地支半合(命盤);
    判斷地支暗合(命盤);
    if(命盤.分析.地支.三刑.命盤三刑<0) 判斷地支相刑(命盤, "所有"); else 判斷地支相刑(命盤, "自刑無禮");
    判斷地支相冲(命盤);
    判斷地支相害(命盤);

    總結各柱的刑冲合會害(命盤);
}

function 總結各柱的刑冲合會害(命盤){
    // 三會>三合>沖>半合>六合>害、刑
    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].三會 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("三會");
        if(命盤.分析.四柱.四柱數據[i].三合 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("三合");
        if(命盤.分析.四柱.四柱數據[i].相冲 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("相冲");
        if(命盤.分析.四柱.四柱數據[i].半合 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("半合");
        if(命盤.分析.四柱.四柱數據[i].六合 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("六合");
        if(命盤.分析.四柱.四柱數據[i].三刑 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("三刑");
        if(命盤.分析.四柱.四柱數據[i].相刑 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("相刑");
        if(命盤.分析.四柱.四柱數據[i].相害 !="") 命盤.分析.四柱.四柱數據[i].刑冲合會害.總結.push("相害");
    }
}

function 刑冲合會害影響比率(命盤, 四柱){
    //計算某個地支因為有刑冲合會害而造成功能上的下降，比方 『乙亥』,亥支被冲，那個亥生乙木的能力下降了多少？
    //四柱：年柱，月柱，日柱，四柱

    var 四柱數=-1;
    var 影響條件;

    switch(四柱){
        case "年": case "年柱": case 0:
            四柱數=0;
            break;
        case "月": case "月柱": case 1:
            四柱數=1;
            break;
        case "日": case "日柱": case 2:
            四柱數=2;
            break;
        case "時": case "時柱": case 3:
            四柱數=3;
            break;
    }

    if(命盤.分析.四柱.四柱數據[四柱數].刑冲合會害.總結.length==0) return 1; //沒有 刑冲合會害，所以沒有影響
    else 影響條件=命盤.分析.四柱.四柱數據[四柱數].刑冲合會害.總結[0]; //取第一個印象最大的條件而已

    switch(影響條件){
        case "三會":
            return 0.4;
        case "三合":
            return 0.5;
        case "相冲":
            return 0.6;
        case "半合":
            return 0.7;
        case "六合":
            return 0.75;
        case "三刑": case "相刑": case "相害":
            return 0.8;
        default:
            return 1;
    }
}

function 命盤刑冲合會害分析(命盤){
    var 刑冲合會害分析 = [];

    var 天干五合論斷 = 天干五合註解分析(命盤);
    var 地支刑冲合會害論斷 = 各柱刑冲合會害(命盤);

    if(天干五合論斷!="") 刑冲合會害分析.push(天干五合論斷);
    if(地支刑冲合會害論斷!="") 刑冲合會害分析.push(地支刑冲合會害論斷+"<br>");

    var 四柱返吟伏吟論斷 = 四柱返吟伏吟(命盤);
    var 四柱天合地合論斷 = 四柱天合地合(命盤);
    if(四柱返吟伏吟論斷!="") 刑冲合會害分析.push(四柱返吟伏吟論斷);
    if(四柱天合地合論斷!="") 刑冲合會害分析.push(四柱天合地合論斷);

    //******************************************
    if (刑冲合會害分析.length > 0) {
        var 論斷項目= '<span class = "論斷單元">刑冲合會害分析：</span><br>';
        刑冲合會害分析.unshift(論斷項目);
        return 刑冲合會害分析.join("<br>");
    }
}

function 各柱刑冲合會害(命盤){
    var 各柱刑冲合會害總註解 = [];
    var 各柱相合矩陣 = [];
    var 各柱相冲矩陣 = [];
    var 各柱相刑矩陣 = [];
    var 各柱相害矩陣 = [];

    var 間隔 = ["", "緊貼", "隔合", "遙合"];

    //***************** 天干五合分析註解 *******************
    for(var i=0; i<命盤.分析.刑冲合會害表.length; i++){
        var 克應發生=命盤.分析.刑冲合會害表[i][0]; //是發生在天干或地支
        var 克應情況=命盤.分析.刑冲合會害表[i][1]; //相合、相刑、相冲、相害
        var 克應干支=命盤.分析.刑冲合會害表[i][2]; //克應地支對，比方申子相合
        var 克應五行=命盤.分析.刑冲合會害表[i][3]; //合化出來的五行（也用來斷合化是否成功）
        var 克應十神=命盤.分析.刑冲合會害表[i][5]; //合化出來的十神
        var 克應柱對=命盤.分析.刑冲合會害表[i][7]; //克應的柱對，比方，01，年月
        var 克應方式=命盤.分析.刑冲合會害表[i][16]; //克應的方式，比方半合，干合，相刑，相冲

        if(克應發生=="地支"){
            switch(克應情況){
                case "相合":
                    var 柱對矩陣 = 克應柱對.split(",");
                    for (var j=0; j<柱對矩陣.length;j++) {
                        各柱相合矩陣.push(各柱相合註解(String(柱對矩陣[j]), 命盤, 克應發生, 克應方式));
                    }

                    if(克應五行!="" && 克應方式=="三合") 各柱相合矩陣.push("<br>" + 三合註解(克應干支, 克應十神, 命盤));  //三合的註解
                    if(克應五行!="" && 克應方式=="六合") 各柱相合矩陣.push("<br>" + 六合註解(克應干支, 命盤));  //六合的註解
                    break;
                case "相冲":
                    var 柱對矩陣 = 克應柱對.split(",");
                    for (var j = 0; j < 柱對矩陣.length; j++) {
                        各柱相冲矩陣.push(各柱相冲註解(String(柱對矩陣[j]), 命盤, 克應發生, 克應方式, 克應干支));
                        if (命盤.分析.四柱.四柱數據[柱對矩陣[j].substr(0, 1)].天干 == 命盤.分析.四柱.四柱數據[柱對矩陣[j].substr(1, 1)].天干) 各柱相冲矩陣.push("天干相同；地支相沖，做事多勞苦無功，祖業不保。");
                    }

                    各柱相冲矩陣.push("<br>" + 六冲註解(克應干支, 命盤));  //六冲的註解
                    break;
                case "相刑":
                    var 柱對矩陣 = 克應柱對.split(",");
                    for (var j = 0; j < 柱對矩陣.length; j++) {
                        各柱相刑矩陣.push(各柱相刑註解(String(柱對矩陣[j]), 命盤, 克應發生, 克應方式, 克應干支));
                    }

                    各柱相刑矩陣.push(三刑註解(克應柱對, 克應干支, 命盤));  //三刑的註解
                    break;
                case "相害":
                    var 柱對矩陣 = 克應柱對.split(",");
                    for (var j = 0; j < 柱對矩陣.length; j++) {
                        各柱相害矩陣.push(各柱相害註解(String(柱對矩陣[j]), 命盤, 克應發生, 克應方式, 克應干支));
                    }

                    各柱相害矩陣.push(六害註解(克應柱對, 克應干支, 命盤)+"<br>");  //六害的註解
                    break;
            } // end switch 克應情況
        } //end if 克應發生在 地支
    } // end for

    if (各柱相合矩陣.length > 0) {
        var 論斷項目 = '<span class = "本命論斷項目">地支相合：</span>';
        各柱相合矩陣.unshift(論斷項目);
        各柱刑冲合會害總註解.push(各柱相合矩陣.join("<br>"));
    }

    if (各柱相冲矩陣.length > 0) {
        var 論斷項目 = '<span class = "本命論斷項目">地支相冲：</span>';
        各柱相冲矩陣.unshift(論斷項目);
        各柱刑冲合會害總註解.push(各柱相冲矩陣.join("<br>"));
    }

    if (各柱相刑矩陣.length > 0) {
        var 論斷項目 = '<span class = "本命論斷項目">地支相刑：</span>';
        各柱相刑矩陣.unshift(論斷項目);
        各柱刑冲合會害總註解.push(各柱相刑矩陣.join("<br>"));
    }

    if (各柱相害矩陣.length > 0) {
        var 論斷項目 = '<span class = "本命論斷項目">地支相害：</span>';
        各柱相害矩陣.unshift(論斷項目);
        各柱刑冲合會害總註解.push(各柱相害矩陣.join("<br>"));
    }

    var 十神刑冲合害克應=十神刑冲合害論斷(命盤);
    if(十神刑冲合害克應 !="") 各柱刑冲合會害總註解.push(十神刑冲合害克應);

    return 各柱刑冲合會害總註解.join("<br><br>");
}


function 判斷地支三會(命盤) {
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    //0. 寅卯辰 1. 巳午未 2. 申酉戌 3. 亥子丑
    var 三會矩陣 = ["寅卯辰", "巳午未", "申酉戌", "亥子丑"];
    var 三會五行矩陣 = ["木", "火", "金", "水"];
    var 三會表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0
    var 會化註解 = "";

    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反

    for (var i = 0; i < 三會矩陣.length; i++) {
        var 三會組 = 三會矩陣[i];
        var 三會五行 = 三會五行矩陣[i];
        var 三會字1 = 三會組.substr(0, 1);
        var 三會字2 = 三會組.substr(1, 1);
        var 三會字3 = 三會組.substr(2, 1);

        if ((_.indexOf(地支矩陣, 三會字1) >= 0) && (_.indexOf(地支矩陣, 三會字2) >= 0) && (_.indexOf(地支矩陣, 三會字3) >= 0)) {
            var 三會柱1 = _.indexOf(地支矩陣, 三會字1);
            var 三會柱2 = _.indexOf(地支矩陣, 三會字2);
            var 三會柱3 = _.indexOf(地支矩陣, 三會字3);        

            var 不參與三會地支 = _.without(地支矩陣, 三會字1, 三會字2, 三會字3);
            var 不參與地支柱 = _.indexOf(地支矩陣, String(不參與三會地支));

            if (不參與地支柱 < 0) { //每個地支都參與三會
                var LastIndex三會柱1 = _.lastIndexOf(地支矩陣, 三會字1);
                var LastIndex三會柱2 = _.lastIndexOf(地支矩陣, 三會字2);
                var LastIndex三會柱3 = _.lastIndexOf(地支矩陣, 三會字3);

                //alert(String(LastIndex三會柱1) + String(LastIndex三會柱2) + String(LastIndex三會柱3));
                if (LastIndex三會柱1 != 三會柱1) {
                    var 爭會地支 = 三會字1;
                    var 爭會柱1 = LastIndex三會柱1;
                    var 爭會柱2 = 三會柱1;
                    if (爭會柱1 < 爭會柱2) {
                        不參與地支柱 = 爭會柱2;
                        三會柱1 = 爭會柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三會組就會靠近日主
                    }
                    else {
                        不參與地支柱 = 爭會柱1;
                    }

                }
                if (LastIndex三會柱2 != 三會柱2) {
                    var 爭會地支 = 三會字2;
                    var 爭會柱1 = LastIndex三會柱2;
                    var 爭會柱2 = 三會柱2;
                    if (爭會柱1 < 爭會柱2) {
                        不參與地支柱 = 爭會柱2;
                        三會柱2 = 爭會柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三會組就會靠近日主
                    }
                    else {
                        不參與地支柱 = 爭會柱1;
                    }
                }
                if (LastIndex三會柱3 != 三會柱3) {
                    var 爭會地支 = 三會字3;
                    var 爭會柱1 = LastIndex三會柱3;
                    var 爭會柱2 = 三會柱3;
                    if (爭會柱1 < 爭會柱2) {
                        不參與地支柱 = 爭會柱2;
                        三會柱3 = 爭會柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三會組就會靠近日主
                    }
                    else {
                        不參與地支柱 = 爭會柱1;
                    }
                }
            }

            switch(三會五行){  //測是否有化
                case "火":
                     會化註解 = "化火，因月令為寅、午、戌、巳，故能化火。";
                     if ((命盤.月令 != "寅" && 命盤.月令 != "午" && 命盤.月令 != "戌" && 命盤.月令 != "巳")){
                         三會五行=""; //不化
                         會化註解 = "。月令不是寅、午、戌、巳月，故不化火。";
                     }
                    break;
                case "金":
                     會化註解 = "化金，因月令為巳、申、酉、丑，故能化金。";
                     if ((命盤.月令 != "巳" && 命盤.月令 != "申" && 命盤.月令 != "酉" && 命盤.月令 != "丑")){
                         三會五行=""; //不化
                         會化註解 = "。月令不是巳、申、酉、丑月，故不化金。";
                     }
                    break;
                case "水":
                     會化註解 = "化水，因月令為申、子、辰、亥，故能化水。";
                     if ((命盤.月令 != "申" && 命盤.月令 != "子" && 命盤.月令 != "辰" && 命盤.月令 != "亥")){
                         三會五行=""; //不化
                         會化註解 = "。月令不是申、子、辰、亥月，故不化水。";
                     }
                    break;
                case "木":
                     會化註解 = "化木，因月令為亥、卯、未、寅，故能化木。";
                     if ((命盤.月令 != "亥" && 命盤.月令 != "卯" && 命盤.月令 != "未" && 命盤.月令 != "寅")){
                         三會五行=""; //不化
                         會化註解 = "。月令不是亥、卯、未、寅月，故不化木。";
                     }
                    break;                              
            }

            命盤.分析.地支.三會.命盤三會 = i; //update the 三合=/0. 寅午戌 1. 巳酉丑 2. 申子辰 3. 亥卯未
            命盤.分析.地支.三會.命盤三會支=三會矩陣[i];
            命盤.分析.地支.三會.三會柱 = String(三會柱1) + String(三會柱2) + String(三會柱3);
            命盤.分析.地支.三會.會出五行 = 三會五行;
            命盤.分析.地支.三會.不參與地支 = String(不參與三會地支);
            命盤.分析.地支.三會.不參與地支柱 = String(不參與地支柱);

            命盤.分析.四柱.四柱數據[三會柱1].三會="三會"+三會五行;
            命盤.分析.四柱.四柱數據[三會柱2].三會="三會"+三會五行;
            命盤.分析.四柱.四柱數據[三會柱3].三會="三會"+三會五行;

            命盤.分析.四柱.四柱數據[三會柱1].三會化=三會五行;
            命盤.分析.四柱.四柱數據[三會柱2].三會化=三會五行;
            命盤.分析.四柱.四柱數據[三會柱3].三會化=三會五行;

            命盤.分析.四柱.四柱數據[三會柱1].三會柱 = String(三會柱2)+String(三會柱3);
            命盤.分析.四柱.四柱數據[三會柱2].三會柱 = String(三會柱1)+String(三會柱3);
            命盤.分析.四柱.四柱數據[三會柱3].三會柱 = String(三會柱1)+String(三會柱2);

            命盤.分析.四柱.四柱數據[三會柱1].三會柱不參與 = String(不參與地支柱);
            命盤.分析.四柱.四柱數據[三會柱2].三會柱不參與 = String(不參與地支柱);
            命盤.分析.四柱.四柱數據[三會柱3].三會柱不參與 = String(不參與地支柱);

            //命盤.分析.四柱.四柱數據[三會柱1].補充 = 三會註解;
            //命盤.分析.四柱.四柱數據[三會柱2].補充 = 三會註解;
            //命盤.分析.四柱.四柱數據[三會柱3].補充 = 三會註解;

            // ***************** update 地支 刑冲合會害 矩陣 *****************
            var 三會矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
            var 三會註解;
            三會矩陣[0]="地支三會";

            for(var i=0 ; i<4 ; i++){
               三會矩陣[四柱位置重組(Number(命盤.分析.地支.三會.三會柱.substr(i,1)),1)]="三會"+三會五行;
            }

            三會矩陣[四柱位置重組(Number(命盤.分析.地支.三會.不參與地支柱),1)]="";

            三會註解=四柱名稱(Number(命盤.分析.地支.三會.三會柱.substr(0,1)))+"、"+四柱名稱(Number(命盤.分析.地支.三會.三會柱.substr(1,1)))+"、"+四柱名稱(Number(命盤.分析.地支.三會.三會柱.substr(2,1)))+命盤.分析.地支.三會.命盤三會支+"三會"+會化註解;
            三會矩陣[5]=三會註解;

            命盤.分析句.刑冲合會害矩陣.push(三會矩陣);
            
            //************************************************
            var 克應柱對;
            三會表[1]="三會"; //天干、地支刑衝會害的名稱
            三會表[2]=三會組; //克應的干、支
            三會表[3]=三會五行; //會出的五行
            三會表[4]=(三會表[3]!="")?五行轉天干(三會表[3], 合出的陰陽):""; //會出的天干
            三會表[5]=(三會表[4]!="")?尋十神(三會表[4], 命盤.日干.天干):""; //會出的十神
            三會表[6]= (三會表[3] != "") ? 命盤.系統參數.運算.地支三會:0; //會出的力量
            克應柱對 = 命盤.分析.地支.三會.三會柱.substr(0, 1) + 命盤.分析.地支.三會.三會柱.substr(1, 1) + "," + 命盤.分析.地支.三會.三會柱.substr(1, 1) + 命盤.分析.地支.三會.三會柱.substr(2, 1) + "," + 命盤.分析.地支.三會.三會柱.substr(0, 1) + 命盤.分析.地支.三會.三會柱.substr(2, 1);
            三會表[7]=克應柱對; //參與的四柱
            三會表[8]=1; //間隔
            var 會支力量加減 = (三會表[3] != "") ? -4 : -1; //有會化，-3，會而不化，-1
            三會表[四柱位置重組(Number(命盤.分析.地支.三會.三會柱.substr(0, 1)), offsetTblCalc)] = 會支力量加減;
            三會表[四柱位置重組(Number(命盤.分析.地支.三會.三會柱.substr(1, 1)), offsetTblCalc)] = 會支力量加減;
            三會表[四柱位置重組(Number(命盤.分析.地支.三會.三會柱.substr(2, 1)), offsetTblCalc)] = 會支力量加減;
            三會表[四柱位置重組(Number(命盤.分析.地支.三會.不參與地支柱), offsetTblCalc)] = 0;
            三會表[13]=1; //納入計算中
            三會表[14]=0; //是否有爭，0=無，1，2，3
            三會表[15]=三會組+"三會";
            三會表[16]="三會";

            命盤.分析.刑冲合會害表.push(三會表);

        } // end if for the condition where 三會成立

    }  // for loop for all combination of 三會 test

}

function 判斷地支三合(命盤) {

    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    //0. 寅午戌 1. 巳酉丑 2. 申子辰 3. 亥卯未
    var 三合矩陣 = ["寅午戌", "巳酉丑", "申子辰", "亥卯未"];
    var 三合五行矩陣 = ["火", "金", "水", "木"];
    var 三合表 = ["地支","","","","","",0,"",0,0,0,0,0,0,"","",""]; //預設 納入計算=0，間隔數=0

    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反
	var 合化註解 = "";

    for (var i = 0; i < 三合矩陣.length; i++) {
        var 三合組 = 三合矩陣[i];
        var 三合五行 = 三合五行矩陣[i];
        var 三合字1 = 三合組.substr(0, 1);
        var 三合字2 = 三合組.substr(1, 1);
        var 三合字3 = 三合組.substr(2, 1);

        if ((_.indexOf(地支矩陣, 三合字1) >= 0) && (_.indexOf(地支矩陣, 三合字2) >= 0) && (_.indexOf(地支矩陣, 三合字3) >= 0)) {
            var 三合柱1 = _.indexOf(地支矩陣, 三合字1);
            var 三合柱2 = _.indexOf(地支矩陣, 三合字2);
            var 三合柱3 = _.indexOf(地支矩陣, 三合字3);

            var 不參與三合地支 = _.without(地支矩陣, 三合字1, 三合字2, 三合字3);
            var 不參與地支柱 = _.indexOf(地支矩陣, String(不參與三合地支));

            if (不參與地支柱 < 0) { //每個地支都參與三合
                var LastIndex三合柱1 = _.lastIndexOf(地支矩陣, 三合字1);
                var LastIndex三合柱2 = _.lastIndexOf(地支矩陣, 三合字2);
                var LastIndex三合柱3 = _.lastIndexOf(地支矩陣, 三合字3);

                //alert(String(LastIndex三合柱1) + String(LastIndex三合柱2) + String(LastIndex三合柱3));
                if (LastIndex三合柱1 != 三合柱1) {
                    var 爭合地支 = 三合字1;
                    var 爭合柱1 = LastIndex三合柱1;
                    var 爭合柱2 = 三合柱1;
                    if (爭合柱1 < 爭合柱2) {
                        不參與地支柱 = 爭合柱2;
                        三合柱1 = 爭合柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三合組就會靠近日主
                    }
                    else 不參與地支柱 = 爭合柱1;
                }
                if (LastIndex三合柱2 != 三合柱2) {
                    var 爭合地支 = 三合字2;
                    var 爭合柱1 = LastIndex三合柱2;
                    var 爭合柱2 = 三合柱2;
                    if (爭合柱1 < 爭合柱2) {
                        不參與地支柱 = 爭合柱2;
                        三合柱2 = 爭合柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三合組就會靠近日主
                    }
                    else {
                        不參與地支柱 = 爭合柱1;
                    }
                }
                if (LastIndex三合柱3 != 三合柱3) {
                    var 爭合地支 = 三合字3;
                    var 爭合柱1 = LastIndex三合柱3;
                    var 爭合柱2 = 三合柱3;
                    if (爭合柱1 < 爭合柱2) {
                        不參與地支柱 = 爭合柱2;
                        三合柱3 = 爭合柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三合組就會靠近日主
                    }
                    else 不參與地支柱 = 爭合柱1;
                }
            }

            switch(三合五行){  //測是否有化
                case "火":
                     合化註解 = "化火，因月令為寅、午、戌、巳，故能合化。";
                     if ((命盤.月令 != "寅" && 命盤.月令 != "午" && 命盤.月令 != "戌" && 命盤.月令 != "巳")){
                         三合五行=""; //不化
                         合化註解 = "。月令不是寅、午、戌、巳月，故不化火。";
                     }
                break;
                case "金":
                     合化註解 = "化金，因月令為巳、申、酉、丑，故能合化。";
                     if ((命盤.月令 != "巳" && 命盤.月令 != "申" && 命盤.月令 != "酉" && 命盤.月令 != "丑")){
                         三合五行=""; //不化
                         合化註解 = "。月令不是巳、申、酉、丑月，故不化金。";
                     }
                break;
                case "水":
                     合化註解 = "化水，因月令為申、子、辰、亥，故能合化。";
                     if ((命盤.月令 != "申" && 命盤.月令 != "子" && 命盤.月令 != "辰" && 命盤.月令 != "亥")){
                         三合五行=""; //不化
                         合化註解 = "。月令不是申、子、辰、亥月，故不化水。";
                     }
                break;
                case "木":
                     合化註解 = "化木，因月令為亥、卯、未、寅，故能合化。";
                     if ((命盤.月令 != "亥" && 命盤.月令 != "卯" && 命盤.月令 != "未" && 命盤.月令 != "寅")){
                         三合五行=""; //不化
                         合化註解 = "。月令不是亥、卯、未、寅月，故不化木。";
                     }
                break;                              
            }

            命盤.分析.地支.三合.三合柱 = String(三合柱1) + String(三合柱2) + String(三合柱3);
            命盤.分析.地支.三合.合出五行 = 三合五行;
            命盤.分析.地支.三合.不參與地支 = String(不參與三合地支);
            命盤.分析.地支.三合.不參與地支柱 = String(不參與地支柱);

            if(不參與地支柱<0){
                命盤.分析.地支.三合.爭合地支 = 地支矩陣[爭合柱1];
                命盤.分析.地支.三合.爭合地支柱 = String(爭合柱1) + String(爭合柱2);
                命盤.分析.地支.地支數據[地支字轉值(爭合地支)].爭合 = 1;
                命盤.分析.四柱.四柱數據[爭合柱1].三合爭合="爭合";
                命盤.分析.四柱.四柱數據[爭合柱2].三合爭合="爭合";               
            }
            else{
                命盤.分析.地支.三合.爭合地支 = "";
                命盤.分析.地支.三合.爭合地支柱 = "";
                //命盤.分析.地支.地支數據[地支字轉值(爭合地支)].爭合 = 1;
                //命盤.分析.四柱.四柱數據[爭合柱1].三合爭合="";
                //命盤.分析.四柱.四柱數據[爭合柱2].三合爭合="";
            }

            命盤.分析.地支.三合.命盤三合 = i; //update the 三合=/0. 寅午戌 1. 巳酉丑 2. 申子辰 3. 亥卯未
            命盤.分析.地支.三合.命盤三合支=三合矩陣[i];

            命盤.分析.四柱.四柱數據[三合柱1].總合=1;
            命盤.分析.四柱.四柱數據[三合柱2].總合=1;
            命盤.分析.四柱.四柱數據[三合柱3].總合=1;

            命盤.分析.四柱.四柱數據[三合柱1].三合="三合"+三合五行;
            命盤.分析.四柱.四柱數據[三合柱2].三合="三合"+三合五行;
            命盤.分析.四柱.四柱數據[三合柱3].三合="三合"+三合五行;

            命盤.分析.四柱.四柱數據[三合柱1].三合化=三合五行;
            命盤.分析.四柱.四柱數據[三合柱2].三合化=三合五行;
            命盤.分析.四柱.四柱數據[三合柱3].三合化=三合五行;

            命盤.分析.四柱.四柱數據[三合柱1].三合柱 = String(三合柱2)+String(三合柱3);
            命盤.分析.四柱.四柱數據[三合柱2].三合柱 = String(三合柱1)+String(三合柱3);
            命盤.分析.四柱.四柱數據[三合柱3].三合柱 = String(三合柱1)+String(三合柱2);

            命盤.分析.四柱.四柱數據[三合柱1].三合柱不參與 = String(不參與地支柱);
            命盤.分析.四柱.四柱數據[三合柱2].三合柱不參與 = String(不參與地支柱);
            命盤.分析.四柱.四柱數據[三合柱3].三合柱不參與 = String(不參與地支柱);

            //命盤.分析.四柱.四柱數據[三合柱1].補充 = 三合註解;
            //命盤.分析.四柱.四柱數據[三合柱2].補充 = 三合註解;
            //命盤.分析.四柱.四柱數據[三合柱3].補充 = 三合註解;

            // ***************** update 地支 刑冲合會害 矩陣 *****************
            var 三合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
            var 三合註解;
            三合矩陣[0]="地支三合";
            for (var i = 0; i < 4; i++) {
                三合矩陣[四柱位置重組(Number(命盤.分析.地支.三合.三合柱.substr(i, 1)), 1)] = "三合" + 三合五行;
            }
            三合矩陣[四柱位置重組(Number(命盤.分析.地支.三合.不參與地支柱),1)]="";
            三合註解=四柱名稱(Number(命盤.分析.地支.三合.三合柱.substr(0,1)))+"、"+四柱名稱(Number(命盤.分析.地支.三合.三合柱.substr(1,1)))+"、"+四柱名稱(Number(命盤.分析.地支.三合.三合柱.substr(2,1)))+命盤.分析.地支.三合.命盤三合支+"三合"+合化註解;
            三合矩陣[5]=三合註解;

            命盤.分析句.刑冲合會害矩陣.push(三合矩陣);
            //alert("三合地支：" + this.三合柱 + " / 爭合地支：" + this.爭合地支 + " / 爭合地支柱：" + this.爭合地支柱 + " / 不參與地支：" + this.不參與地支);

            //************************************************
            var 克應柱對;
            三合表[1]="相合"; //天干、地支刑衝會害的名稱
            三合表[2]=三合組; //克應的干、支
            三合表[3]=三合五行; //合出的五行
            三合表[4]=(三合表[3]!="")?五行轉天干(三合表[3], 合出的陰陽):""; //合出的天干
            三合表[5]=(三合表[4]!="")?尋十神(三合表[4], 命盤.日干.天干):""; //合出的十神

            三合表[6]= (三合表[3]!="")?命盤.系統參數.運算.地支三合:0; //合化出的力量
            克應柱對 = 命盤.分析.地支.三合.三合柱.substr(0, 1) + 命盤.分析.地支.三合.三合柱.substr(1, 1) + "," + 命盤.分析.地支.三合.三合柱.substr(1, 1) + 命盤.分析.地支.三合.三合柱.substr(2, 1) + "," + 命盤.分析.地支.三合.三合柱.substr(0, 1) + 命盤.分析.地支.三合.三合柱.substr(2, 1);
            三合表[7]=克應柱對; //參與的四柱
            三合表[8]=1; //間隔
            var 合支力量加減 = (三合表[3] != "") ? -3 : -1; //有合化，-3，合而不化，-1
            三合表[四柱位置重組(Number(命盤.分析.地支.三合.三合柱.substr(0, 1)), offsetTblCalc)] = 合支力量加減;
            三合表[四柱位置重組(Number(命盤.分析.地支.三合.三合柱.substr(1, 1)), offsetTblCalc)] = 合支力量加減;
            三合表[四柱位置重組(Number(命盤.分析.地支.三合.三合柱.substr(2, 1)), offsetTblCalc)] = 合支力量加減;
            三合表[四柱位置重組(Number(命盤.分析.地支.三合.不參與地支柱), offsetTblCalc)] = 0;
            三合表[13]=1; //納入計算中
            三合表[14]=0; //是否有爭，0=無，1，2，3
            三合表[15]=三合組+"三合";
            三合表[16]="三合";

            命盤.分析.刑冲合會害表.push(三合表);
        }
    }
}

function 判斷地支三刑(命盤) {
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    //0. 寅巳申 1. 丑戌未
    var 三刑矩陣 = ["寅巳申", "丑戌未"];
    var 三刑表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0

    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反

    for (var i = 0; i < 三刑矩陣.length; i++) {
        var 三刑組 = 三刑矩陣[i];
        var 三刑字1 = 三刑組.substr(0, 1);
        var 三刑字2 = 三刑組.substr(1, 1);
        var 三刑字3 = 三刑組.substr(2, 1);

        if ((_.indexOf(地支矩陣, 三刑字1) >= 0) && (_.indexOf(地支矩陣, 三刑字2) >= 0) && (_.indexOf(地支矩陣, 三刑字3) >= 0)) {
            var 三刑柱1 = _.indexOf(地支矩陣, 三刑字1);
            var 三刑柱2 = _.indexOf(地支矩陣, 三刑字2);
            var 三刑柱3 = _.indexOf(地支矩陣, 三刑字3);        

            var 不參與三刑地支 = _.without(地支矩陣, 三刑字1, 三刑字2, 三刑字3);
            var 不參與地支柱 = _.indexOf(地支矩陣, String(不參與三刑地支));

            if (不參與地支柱 < 0) { //每個地支都參與三刑
                var LastIndex三刑柱1 = _.lastIndexOf(地支矩陣, 三刑字1);
                var LastIndex三刑柱2 = _.lastIndexOf(地支矩陣, 三刑字2);
                var LastIndex三刑柱3 = _.lastIndexOf(地支矩陣, 三刑字3);
                //alert(String(LastIndex三刑柱1) + String(LastIndex三刑柱2) + String(LastIndex三刑柱3));
                if (LastIndex三刑柱1 != 三刑柱1) {
                    var 爭刑地支 = 三刑字1;
                    var 爭刑柱1 = LastIndex三刑柱1;
                    var 爭刑柱2 = 三刑柱1;
                    if (爭刑柱1 < 爭刑柱2) {
                        不參與地支柱 = 爭刑柱2;
                        三刑柱1 = 爭刑柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三刑組就會靠近日主
                    }
                    else {
                        不參與地支柱 = 爭刑柱1;
                    }

                }
                if (LastIndex三刑柱2 != 三刑柱2) {
                    var 爭刑地支 = 三刑字2;
                    var 爭刑柱1 = LastIndex三刑柱2;
                    var 爭刑柱2 = 三刑柱2;
                    if (爭刑柱1 < 爭刑柱2) {
                        不參與地支柱 = 爭刑柱2;
                        三刑柱2 = 爭刑柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三刑組就會靠近日主
                    }
                    else {
                        不參與地支柱 = 爭刑柱1;
                    }
                }
                if (LastIndex三刑柱3 != 三刑柱3) {
                    var 爭刑地支 = 三刑字3;
                    var 爭刑柱1 = LastIndex三刑柱3;
                    var 爭刑柱2 = 三刑柱3;
                    if (爭刑柱1 < 爭刑柱2) {
                        不參與地支柱 = 爭刑柱2;
                        三刑柱3 = 爭刑柱1; //如果爭會的地支柱大於原本的地支柱，對換，這樣三刑組就會靠近日主
                    }
                    else {
                        不參與地支柱 = 爭刑柱1;
                    }
                }
            }

            命盤.分析.地支.三刑.命盤三刑 = i; //update the 三合=/0. 寅午戌 1. 巳酉丑 2. 申子辰 3. 亥卯未
            命盤.分析.地支.三刑.命盤三刑支=三刑矩陣[i];
            命盤.分析.地支.三刑.三刑柱 = String(三刑柱1) + String(三刑柱2) + String(三刑柱3);
            命盤.分析.地支.三刑.不參與地支 = String(不參與三刑地支);
            命盤.分析.地支.三刑.不參與地支柱 = String(不參與地支柱);

            命盤.分析.四柱.四柱數據[三刑柱1].三刑="三刑";
            命盤.分析.四柱.四柱數據[三刑柱2].三刑="三刑";
            命盤.分析.四柱.四柱數據[三刑柱3].三刑="三刑";

            命盤.分析.四柱.四柱數據[三刑柱1].總刑=1;
            命盤.分析.四柱.四柱數據[三刑柱2].總刑=1;
            命盤.分析.四柱.四柱數據[三刑柱3].總刑=1;

            命盤.分析.四柱.四柱數據[三刑柱1].三刑柱 = String(三刑柱2)+String(三刑柱3);
            命盤.分析.四柱.四柱數據[三刑柱2].三刑柱 = String(三刑柱1)+String(三刑柱3);
            命盤.分析.四柱.四柱數據[三刑柱3].三刑柱 = String(三刑柱1)+String(三刑柱2);

            命盤.分析.四柱.四柱數據[三刑柱1].三刑柱不參與 = String(不參與地支柱);
            命盤.分析.四柱.四柱數據[三刑柱2].三刑柱不參與 = String(不參與地支柱);
            命盤.分析.四柱.四柱數據[三刑柱3].三刑柱不參與 = String(不參與地支柱);

            //命盤.分析.四柱.四柱數據[三刑柱1].補充 = 三刑註解;
            //命盤.分析.四柱.四柱數據[三刑柱2].補充 = 三刑註解;
            //命盤.分析.四柱.四柱數據[三刑柱3].補充 = 三刑註解;

            // ***************** update 地支 刑冲合會害 矩陣 *****************
            var 三刑矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
            var 三刑註解;

            三刑矩陣[0]="地支三刑";
            for(var i=0 ; i<4 ; i++){
               三刑矩陣[四柱位置重組(Number(命盤.分析.地支.三刑.三刑柱.substr(i,1)),1)]="三刑";
            }

            三刑矩陣[四柱位置重組(Number(命盤.分析.地支.三刑.不參與地支柱),1)]="";
            三刑註解=四柱名稱(Number(命盤.分析.地支.三刑.三刑柱.substr(0,1)))+"、"+四柱名稱(Number(命盤.分析.地支.三刑.三刑柱.substr(1,1)))+"、"+四柱名稱(Number(命盤.分析.地支.三刑.三刑柱.substr(2,1)))+命盤.分析.地支.三刑.命盤三刑支+"三刑";
            三刑矩陣[5]=三刑註解;

            命盤.分析句.刑冲合會害矩陣.push(三刑矩陣);

            //************************************************
            var 克應柱對;
            三刑表[1]="相刑"; //天干、地支刑衝會害的名稱
            三刑表[2]=三刑組; //克應的干、支
            三刑表[3]=""; //合出的五行
            三刑表[4]=""; //合出的天干
            三刑表[5]=""; //合出的十神

            三刑表[6]= 0; //刑出的力量
            克應柱對 = 命盤.分析.地支.三刑.三刑柱.substr(0, 1) + 命盤.分析.地支.三刑.三刑柱.substr(1, 1) + "," + 命盤.分析.地支.三刑.三刑柱.substr(1, 1) + 命盤.分析.地支.三刑.三刑柱.substr(2, 1) + "," + 命盤.分析.地支.三刑.三刑柱.substr(0, 1) + 命盤.分析.地支.三刑.三刑柱.substr(2, 1);
            三刑表[7]= 克應柱對; //參與的四柱
            三刑表[8]=1; //間隔

            三刑表[四柱位置重組(Number(命盤.分析.地支.三刑.三刑柱.substr(0, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支三刑)/3; //減3分，分佈在三個地支
            三刑表[四柱位置重組(Number(命盤.分析.地支.三刑.三刑柱.substr(1, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支三刑)/3; //減3分，分佈在三個地支
            三刑表[四柱位置重組(Number(命盤.分析.地支.三刑.三刑柱.substr(2, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支三刑)/3; //減3分，分佈在三個地支
            三刑表[四柱位置重組(Number(命盤.分析.地支.三刑.不參與地支柱), offsetTblCalc)] = 0;
            三刑表[13]=1; //納入計算中
            三刑表[14]=0; //是否有爭，0=無，1，2，3
            三刑表[15]=三刑組+"三刑";
            三刑表[16]="三刑";

            命盤.分析.刑冲合會害表.push(三刑表);

        } // end if for the condition where 三刑成立

    }  // for loop for all combination of 三刑 test

}

function 判斷地支半合(命盤) {
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    var 地支對 = [命盤.年支.地支 + 命盤.日支.地支, 
                  命盤.月支.地支 + 命盤.時支.地支, 
                  命盤.年支.地支 + 命盤.時支.地支,
                  命盤.年支.地支 + 命盤.月支.地支, 
                  命盤.月支.地支 + 命盤.日支.地支,
                  命盤.日支.地支 + 命盤.時支.地支];

    var 柱對 = ["02", "13", "03", "01", "12", "23"];
    var 鄰遙合 = ["隔合", "隔合", "遙合", "鄰合", "鄰合", "鄰合"];
    var 隔離數 = [2, 2, 3, 1, 1, 1];
    var 半合表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0

    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反
	var 合化註解 = "";
	var 隔離合化註解 = "";

    for(var i=0; i<地支對.length; i++){
        var 半合句 = 地支半合(地支對[i], 命盤);
        var 半合句拆分 = 半合句.split(",");
        if(半合句!=""){

            var 半合柱1 = Number(柱對[i].substr(0, 1));
            var 半合柱2 = Number(柱對[i].substr(1, 1));
            var 鄰合遙合 = 鄰遙合[i];
            var 半合句1 = 半合句拆分[0].substr(0,2);  //比方：半合, 先去掉合化五行
            var 半合句2 = 半合句拆分[1]; //柱對，比方：申子
            var 半合句3 = (typeof(半合句拆分[2]) != "undefined")?半合句拆分[2]:""; //附加註解
            var 半合五行 = 半合句.substr(2, 1);

            switch(半合五行){  //測是否有化
                case "火":
                     合化註解 = "化火，因月令為寅、午、戌、巳，故能合化。";
                     if ((命盤.月令 != "寅" && 命盤.月令 != "午" && 命盤.月令 != "戌" && 命盤.月令 != "巳")){
                         半合五行=""; //不化
                         合化註解 = "。月令不是寅、午、戌、巳月，故不化火。";
                     }
                    break;
                case "金":
                     合化註解 = "化金，因月令為巳、申、酉、丑，故能合化。";
                     if ((命盤.月令 != "巳" && 命盤.月令 != "申" && 命盤.月令 != "酉" && 命盤.月令 != "丑")){
                         半合五行=""; //不化
                         合化註解 = "。月令不是巳、申、酉、丑月，故不化金。";
                     }
                    break;
                case "水":
                     合化註解 = "化水，因月令為申、子、辰、亥，故能合化。";
                     if ((命盤.月令 != "申" && 命盤.月令 != "子" && 命盤.月令 != "辰" && 命盤.月令 != "亥")){
                         半合五行=""; //不化
                         合化註解 = "。月令不是申、子、辰、亥月，故不化水。";
                     }
                    break;
                case "木":
                     合化註解 = "化木，因月令為亥、卯、未、寅，故能合化。";
                     if ((命盤.月令 != "亥" && 命盤.月令 != "卯" && 命盤.月令 != "未" && 命盤.月令 != "寅")){
                         半合五行=""; //不化
                         合化註解 = "。月令不是亥、卯、未、寅月，故不化木。";
                     }
                    break;                              
            }

            //if((命盤.分析.四柱.四柱數據[半合柱1].半合鄰遙爭=="") && (命盤.分析.四柱.四柱數據[半合柱2].半合鄰遙爭=="")) 命盤.分析.地支.半合++; //半合的數量加1，有爭合的，就不算

            命盤.分析.四柱.四柱數據[半合柱1].半合=半合句1+半合五行;
            命盤.分析.四柱.四柱數據[半合柱1].半合地支=半合句2;
            命盤.分析.四柱.四柱數據[半合柱1].半合鄰遙爭=鄰合遙合;
            命盤.分析.四柱.四柱數據[半合柱1].半合柱間隔 = 隔離數[i];
            命盤.分析.四柱.四柱數據[半合柱1].半合化=半合五行;
            命盤.分析.四柱.四柱數據[半合柱1].半合數量++;
            命盤.分析.四柱.四柱數據[半合柱1].半合柱=命盤.分析.四柱.四柱數據[半合柱1].半合柱+String(半合柱2);
            命盤.分析.四柱.四柱數據[半合柱1].半合補充=半合句3+四柱名稱(半合柱1)+"與"+四柱名稱(半合柱2)+半合句2+半合句1+合化註解;
            命盤.分析.四柱.四柱數據[半合柱1].總合=1;
            
            命盤.分析.四柱.四柱數據[半合柱2].半合=半合句1+半合五行;
            命盤.分析.四柱.四柱數據[半合柱2].半合地支=半合句2;
            命盤.分析.四柱.四柱數據[半合柱2].半合鄰遙爭=鄰合遙合;
            命盤.分析.四柱.四柱數據[半合柱2].半合柱間隔 = 隔離數[i];
            命盤.分析.四柱.四柱數據[半合柱2].半合化=半合五行;
            命盤.分析.四柱.四柱數據[半合柱2].半合數量++;
            命盤.分析.四柱.四柱數據[半合柱2].半合柱=命盤.分析.四柱.四柱數據[半合柱2].半合柱+String(半合柱1);
            命盤.分析.四柱.四柱數據[半合柱2].半合補充=半合句3+四柱名稱(半合柱1)+"與"+四柱名稱(半合柱2)+半合句2+半合句1+合化註解;
            命盤.分析.四柱.四柱數據[半合柱2].總合=1;

        } // 半合判斷的if
    } // loop for 半合判斷組合

    var 已推出半合 = [];
    var 半合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
    半合矩陣[0]="地支半合";

    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].半合數量 >1){
            if (命盤.分析.四柱.四柱數據[i].半合數量 == 3) {
                var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(2, 1))) + "與" + 四柱名稱(i)  +半合句2+ "形成"+"一支與三支爭合。";
                命盤.分析.四柱.四柱數據[i].半合補充 = 命盤.分析.四柱.四柱數據[i].半合補充 + 爭合句;

                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))].半合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1))].半合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(2, 1))].半合鄰遙爭 = "爭合";

                命盤.分析.四柱.四柱數據[0].半合柱不參與 = "";
                命盤.分析.四柱.四柱數據[1].半合柱不參與 = "";
                命盤.分析.四柱.四柱數據[2].半合柱不參與 = "";
                命盤.分析.四柱.四柱數據[3].半合柱不參與 = "";

                已推出半合.push(i);
                已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)));
                已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1)));
                已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(2, 1)));
                
                半合矩陣[四柱位置重組(i,1)]=半合句1+半合五行;
                半合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)),1)] = 半合句1+半合五行+"*";
                半合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1)),1)] = 半合句1+半合五行+"*";
                半合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(2, 1)),1)] = 半合句1+半合五行+"*";
                半合矩陣[5] = 命盤.分析.四柱.四柱數據[i].半合補充;

                命盤.分析句.刑冲合會害矩陣.push(半合矩陣);
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].半合柱;
                //************************************************
                //var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時
                半合表[1]="相合"; //干支克應名稱
                半合表[2]=命盤.分析.四柱.四柱數據[i].半合地支; //克應的干、支
                半合表[3]=命盤.分析.四柱.四柱數據[i].半合化; //合出的五行
                半合表[4]=(半合表[3]!="") ? 五行轉天干(半合表[3], 合出的陰陽) : ""; //合出的天干
                半合表[5]=(半合表[4]!="") ? 尋十神(半合表[4], 命盤.日干.天干) : ""; //合出的十神

                半合表[6]= (半合表[3]!="") ? 命盤.系統參數.運算.地支半合 : 0; //合出的力量
                半合表[7]=i+命盤.分析.四柱.四柱數據[i].半合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].半合柱.substr(1,1)+","+i+命盤.分析.四柱.四柱數據[i].半合柱.substr(2,1); //i+命盤.分析.四柱.四柱數據[i].半合柱; //參與的四柱
                半合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                var 半合力量加減 = (半合表[3] != "") ?(-1/6)*命盤.系統參數.運算.地支半合 : (1/3)*命盤.系統參數.運算.合而不化;
                半合表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 3*半合力量加減;
                半合表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 半合力量加減;
                半合表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = 半合力量加減;
                半合表[四柱位置重組(Number(克應地支.substr(3, 1)), offsetTblCalc)] = 半合力量加減;

                半合表[13]=1; //納入計算中
                半合表[14]=5; //半合形態
                半合表[15]=半合表[2]+"半合（1對3）";
                半合表[16]="半合";

                命盤.分析.刑冲合會害表.push(半合表);
                命盤.分析.四柱.半合 = 5;

            }// 該柱的半合=3的 if
            if ((命盤.分析.四柱.四柱數據[i].半合數量 == 2) && (_.indexOf(已推出半合, i) == -1)) {
                if (命盤.分析.四柱.四柱數據[0].半合數量 == 2 && 命盤.分析.四柱.四柱數據[1].半合數量 == 2 && 命盤.分析.四柱.四柱數據[2].半合數量 == 2 && 命盤.分析.四柱.四柱數據[3].半合數量 == 2) {
                    // 兩組 半合
                    已推出半合.push(0);
                    已推出半合.push(1);
                    已推出半合.push(2);
                    已推出半合.push(3);

                    var 爭合句 = "四柱形成兩組"+半合句2+半合句1+"。";
                    命盤.分析.四柱.四柱數據[i].半合補充 = 命盤.分析.四柱.四柱數據[i].半合補充 + 爭合句;

                    半合矩陣[1] = "半合" + 命盤.分析.四柱.四柱數據[i].半合化+"*";
                    半合矩陣[2] = "半合" + 命盤.分析.四柱.四柱數據[i].半合化+"*";
                    半合矩陣[3] = "半合" + 命盤.分析.四柱.四柱數據[i].半合化+"*";
                    半合矩陣[4] = "半合" + 命盤.分析.四柱.四柱數據[i].半合化+"*";
                    半合矩陣[5] = 命盤.分析.四柱.四柱數據[i].半合補充;

                    命盤.分析句.刑冲合會害矩陣.push(半合矩陣);

                //************************************************
                var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時
                //var 合支1位置 = String(_.indexOf(地支對, 命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))) + String(_.lastIndexOf(地支對, 命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)));
                //alert(String(_.indexOf(地支對, 命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))) + " / " + String(_.lastIndexOf(地支對, 命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))));
                switch(命盤.分析.四柱.四柱數據[i].半合柱){
                    case "01": case "10": case "23":case "32":
                        克應柱對 = "12,13,02,03";
                        break;
                    case "12": case "21": case "03":case "30":
                        克應柱對 = "01,23,02,13";
                        break;
                    case "02": case "20": case "13":case "31":
                        克應柱對 = "01,23,12,03";
                        break;
                }
                半合表[1]="相合"; //干支克應名稱
                半合表[2]=命盤.分析.四柱.四柱數據[i].半合地支; //克應的干、支
                半合表[3]=命盤.分析.四柱.四柱數據[i].半合化; //合出的五行
                半合表[4]=(半合表[3]!="") ? 五行轉天干(半合表[3], 合出的陰陽) : ""; //合出的天干
                半合表[5]=(半合表[4]!="") ? 尋十神(半合表[4], 命盤.日干.天干) : ""; //合出的十神

                半合表[6]= (半合表[3]!="") ? parseFloat(命盤.系統參數.運算.地支半合 / Number(命盤.分析.四柱.四柱數據[i].半合柱間隔)) : 0; //合出的力量

                半合表[7]= 克應柱對; //i+命盤.分析.四柱.四柱數據[i].半合柱; //參與的四柱
                半合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是3
                var 半合力量加減 = (半合表[3] != "") ?(-1/4)*命盤.系統參數.運算.地支半合 : (1/2)*命盤.系統參數.運算.合而不化;
                半合表[9] = 半合力量加減;
                半合表[10] = 半合力量加減;
                半合表[11] = 半合力量加減;
                半合表[12] = 半合力量加減;
                半合表[13]=1; //納入計算中
                半合表[14]=4; //半合形態
                半合表[15]=半合表[2]+"半合（2組）";
                半合表[16]="半合";

                命盤.分析.刑冲合會害表.push(半合表);
                命盤.分析.四柱.半合 = 4;
                }
                else {
                    var 柱對矩陣=[]; //看那個柱對有克應，比方月年、月日、日時、月時、年時
                    var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1))) + "與" + 四柱名稱(i) + "形成爭合。";
                    命盤.分析.四柱.四柱數據[i].半合補充 = 命盤.分析.四柱.四柱數據[i].半合補充 + 爭合句;
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))].半合鄰遙爭 = "爭合";
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1))].半合鄰遙爭 = "爭合";

                    //命盤.分析.四柱.四柱數據[i].半合形態 = 3;
                    //命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))].半合形態 = 3;
                    //命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1))].半合形態 = 3;

                    if(命盤.分析.四柱.四柱數據[i].半合化!=""){ //地支隔離，故不化
                        if((i==0 && (命盤.分析.四柱.四柱數據[i].半合柱==23 || 命盤.分析.四柱.四柱數據[i].半合柱==32)) || (i==3 && (命盤.分析.四柱.四柱數據[i].半合柱==01 || 命盤.分析.四柱.四柱數據[i].半合柱==10))){
                            命盤.分析.四柱.四柱數據[i].半合化 = ""; //合干間隔，論不化
                            半合五行 = "";
                            命盤.分析.四柱.四柱數據[i].半合補充 = 命盤.分析.四柱.四柱數據[i].半合補充 + "合干並非相鄰，故不論化。";                           
                        }
                    }

                    已推出半合.push(i);
                    已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)));
                    已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1)));
                    //已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(2, 1)));

                    半合矩陣[四柱位置重組(i,1)] = 半合句1+半合五行;
                    半合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)),1)] = 半合句1+半合五行+"*";
                    半合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1)),1)] = 半合句1+半合五行+"*";

                    var 四柱 = [0, 1, 2, 3];
                    var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)), Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1)));

                    var 不參與柱 = 不參與矩陣[0];

                    命盤.分析.四柱.四柱數據[i].半合柱不參與 = String(不參與柱);
                    半合矩陣[四柱位置重組(不參與柱,1)] = "";
                    半合矩陣[5]=命盤.分析.四柱.四柱數據[i].半合補充;
                    命盤.分析句.刑冲合會害矩陣.push(半合矩陣);

                //************************************************
                var 柱對矩陣=[]; //看那個柱對有克應，比方月年、月日、日時、月時、年時
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].半合柱;
                半合表[1]="相合"; //干支克應名稱
                半合表[2]=命盤.分析.四柱.四柱數據[i].半合地支; //克應的干、支
                半合表[3]=命盤.分析.四柱.四柱數據[i].半合化; //合出的五行
                半合表[4]=(半合表[3]!="") ? 五行轉天干(半合表[3], 合出的陰陽) : ""; //合出的天干
                半合表[5]=(半合表[4]!="") ? 尋十神(半合表[4], 命盤.日干.天干) : ""; //合出的十神

                半合表[6]= (半合表[3]!="") ? 命盤.系統參數.運算.地支半合 : 0; //合出的力量
                半合表[7]= i+命盤.分析.四柱.四柱數據[i].半合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].半合柱.substr(1,1); //i+命盤.分析.四柱.四柱數據[i].半合柱; //參與的四柱
                半合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                var 半合力量加減 = (半合表[3] != "") ?(-1/4)*命盤.系統參數.運算.地支半合 : (1/2)*命盤.系統參數.運算.合而不化;
                半合表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 2*半合力量加減;
                半合表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 半合力量加減;
                半合表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = 半合力量加減;
                半合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                半合表[13]=1; //納入計算中
                半合表[14]=3; //半合形態
                半合表[15]=半合表[2]+"半合（爭）";
                半合表[16]="半合"; 

                命盤.分析.刑冲合會害表.push(半合表);
                命盤.分析.四柱.半合 = 3;
                }
            }// 該柱的半合=2的 if

        } // 該柱的合>2的 if
    } // for

    for (var i = 0; i < 4; i++) {
        if ((命盤.分析.四柱.四柱數據[i].半合數量 == 1) && (_.indexOf(已推出半合, i) == -1)) {
            var 半合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
            半合矩陣[0]="地支半合";
            var 半合表 = []; //need to reset the array to support multiple entry
            半合表[0]="地支";

            //命盤.分析.四柱.四柱數據[i].半合形態 = 1;
            //命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))].半合形態 = 1;

            if(命盤.分析.四柱.四柱數據[i].半合化!="" && 命盤.分析.四柱.四柱數據[i].半合柱間隔>1){
                命盤.分析.四柱.四柱數據[i].半合=半合句1;
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))].半合=半合句1;
                命盤.分析.四柱.四柱數據[i].半合化 = ""; //間隔，論不化
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))].半合化="";
                命盤.分析.四柱.四柱數據[i].半合補充 = 命盤.分析.四柱.四柱數據[i].半合補充 + "合干並非相鄰，故不論化。";
            }

            半合矩陣[四柱位置重組(i,1)] = "半合" + 命盤.分析.四柱.四柱數據[i].半合化;
            半合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)),1)] = "半合" + 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1))].半合化;

            已推出半合.push(i);
            已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)));
            //已推出半合.push(Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(1, 1)));

            var 四柱 = [0, 1, 2, 3];
            var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].半合柱.substr(0, 1)));

            var 不參與柱1 = 不參與矩陣[0];
            var 不參與柱2 = 不參與矩陣[1];

            命盤.分析.四柱.四柱數據[i].半合柱不參與 = String(不參與柱1) + String(不參與柱2);
            半合矩陣[四柱位置重組(不參與柱1,1)] = "";
            半合矩陣[四柱位置重組(不參與柱2,1)] = "";
            半合矩陣[5] = 命盤.分析.四柱.四柱數據[i].半合補充;

            命盤.分析句.刑冲合會害矩陣.push(半合矩陣);

                //************************************************
                半合表[1]="相合"; //干支克應名稱
                半合表[2]=命盤.分析.四柱.四柱數據[i].半合地支; //半合句1; //克應的干、支
                半合表[3]=命盤.分析.四柱.四柱數據[i].半合化; //合出的五行
                半合表[4]=(半合表[3]!="") ? 五行轉天干(半合表[3], 合出的陰陽) : ""; //合出的天干
                半合表[5]=(半合表[4]!="") ? 尋十神(半合表[4], 命盤.日干.天干) : ""; //合出的十神

                半合表[6]= (半合表[3]!="") ? 命盤.系統參數.運算.地支半合 : 0; //合出的力量
                半合表[7]=i+命盤.分析.四柱.四柱數據[i].半合柱; //參與的四柱
                半合表[8]=命盤.分析.四柱.四柱數據[i].半合柱間隔; //間隔
                var 半合力量加減 = (半合表[3] != "") ?(-1/2)*命盤.系統參數.運算.地支半合 : 命盤.系統參數.運算.合而不化;
                半合表[四柱位置重組(Number(半合表[7].substr(0, 1)), offsetTblCalc)] = 半合力量加減;
                半合表[四柱位置重組(Number(半合表[7].substr(1, 1)), offsetTblCalc)] = 半合力量加減;
                半合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                半合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].半合柱不參與.substr(1,1)), offsetTblCalc)] = 0;
                if(命盤.分析.四柱.四柱數據[Number(半合表[7].substr(0, 1))].三會 =="" || 命盤.分析.四柱.四柱數據[Number(半合表[7].substr(0, 1))].三合 =="" || 命盤.分析.四柱.四柱數據[Number(半合表[7].substr(1, 1))].三會 =="" || 命盤.分析.四柱.四柱數據[Number(半合表[7].substr(1, 1))].三合 =="") 半合表[13]=1; else 半合表[13]=0; //沒有三會、三合，才納入計算
                半合表[14]=1; //半合形態
                半合表[15]=半合表[2]+"半合"; 
                半合表[16]="半合";

                命盤.分析.刑冲合會害表.push(半合表); //有納入計算才推進去矩陣
                命盤.分析.四柱.半合=命盤.分析.四柱.半合+1;

        } // 該柱的半合=1的 if
    }
}

function 判斷地支六合(命盤){
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    var 地支對 = [命盤.年支.地支 + 命盤.日支.地支, 
                  命盤.月支.地支 + 命盤.時支.地支, 
                  命盤.年支.地支 + 命盤.時支.地支,
                  命盤.年支.地支 + 命盤.月支.地支, 
                  命盤.月支.地支 + 命盤.日支.地支,
                  命盤.日支.地支 + 命盤.時支.地支];

    var 柱對 = ["02", "13", "03", "01", "12", "23"];
    var 鄰遙合 = ["隔合", "隔合", "遙合", "鄰合", "鄰合", "鄰合"];
    var 隔離數 = [2, 2, 3, 1, 1, 1];
    var 六合表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0

    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反
	var 合化註解 = "";
	var 隔離合化註解 = "";

    for(var j=0; j<地支對.length; j++){
        var 六合句=地支六合(地支對[j]);

        if(六合句!=""){
            var 六合柱1 = Number(柱對[j].substr(0, 1));
            var 六合柱2 = Number(柱對[j].substr(1, 1));
            var 鄰遙爭合 = 鄰遙合[j];
            var 六合句拆分 = 六合句.split(",");
            var 六合句1 = 六合句拆分[0].substr(0,2);
            var 六合句2 = 六合句拆分[1];
            var 六合五行 = 六合句.substr(2, 1);
            /*
            switch(六合五行){  //測是否有化
                case "火":
                     合化註解 = "化火，因月令為寅、午、戌、巳，故能合化。";
                     if ((命盤.月令 != "寅" && 命盤.月令 != "午" && 命盤.月令 != "戌" && 命盤.月令 != "巳")){
                         六合五行=""; //不化
                         合化註解 = "。月令不是寅、午、戌、巳月，故不化火。";
                     }
                    break;
                case "金":
                     合化註解 = "化金，因月令為巳、申、酉、丑，故能合化。";
                     if ((命盤.月令 != "巳" && 命盤.月令 != "申" && 命盤.月令 != "酉" && 命盤.月令 != "丑")){
                         六合五行=""; //不化
                         合化註解 = "。月令不是巳、申、酉、丑月，故不化金。";
                     }
                    break;
                case "水":
                     合化註解 = "化水，因月令為申、子、辰、亥，故能合化。";
                     if ((命盤.月令 != "申" && 命盤.月令 != "子" && 命盤.月令 != "辰" && 命盤.月令 != "亥")){
                         六合五行=""; //不化
                         合化註解 = "。月令不是申、子、辰、亥月，故不化水。";
                     }
                    break;
                case "木":
                     合化註解 = "化木，因月令為亥、卯、未、寅，故能合化。";
                     if ((命盤.月令 != "亥" && 命盤.月令 != "卯" && 命盤.月令 != "未" && 命盤.月令 != "寅")){
                         六合五行=""; //不化
                         合化註解 = "。月令不是亥、卯、未、寅月，故不化木。";
                     }
                    break;                              
            } */
            //if((命盤.分析.四柱.四柱數據[六合柱1].六合鄰遙爭=="") && (命盤.分析.四柱.四柱數據[六合柱2].六合鄰遙爭=="")) 命盤.分析.地支.六合++; //六合的數量加1，有爭合的，就不算

            命盤.分析.四柱.四柱數據[六合柱1].六合=六合句1+六合五行;
            命盤.分析.四柱.四柱數據[六合柱1].六合鄰遙爭=鄰遙爭合;
            命盤.分析.四柱.四柱數據[六合柱1].六合柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[六合柱1].六合化=六合五行;
            命盤.分析.四柱.四柱數據[六合柱1].六合地支=六合句2;
            命盤.分析.四柱.四柱數據[六合柱1].六合數量++;
            命盤.分析.四柱.四柱數據[六合柱1].六合柱=命盤.分析.四柱.四柱數據[六合柱1].六合柱+String(六合柱2); //命盤.分析.四柱.四柱數據[六合柱1].六合柱
            命盤.分析.四柱.四柱數據[六合柱1].六合補充=四柱名稱(六合柱1)+"與"+四柱名稱(六合柱2)+六合句2+六合句1;
            命盤.分析.四柱.四柱數據[六合柱1].總合=1;

            命盤.分析.四柱.四柱數據[六合柱2].六合=六合句+六合五行;
            命盤.分析.四柱.四柱數據[六合柱2].六合鄰遙爭=鄰遙爭合;
            命盤.分析.四柱.四柱數據[六合柱2].六合柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[六合柱2].六合化=六合五行;
            命盤.分析.四柱.四柱數據[六合柱2].六合地支=六合句2;
            命盤.分析.四柱.四柱數據[六合柱2].六合數量++;
            命盤.分析.四柱.四柱數據[六合柱2].六合柱=命盤.分析.四柱.四柱數據[六合柱2].六合柱+String(六合柱1);
            命盤.分析.四柱.四柱數據[六合柱2].六合補充=四柱名稱(六合柱1)+"與"+四柱名稱(六合柱2)+六合句2+六合句1;
            命盤.分析.四柱.四柱數據[六合柱2].總合=1;
        } // 六合判斷的if

    } // loop for 六合判斷組合

     // 整體補充，比方是否有爭合
    var 已推出六合 = [];
    var 六合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
    六合矩陣[0]="地支六合";

    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].六合數量 >1){
            if (命盤.分析.四柱.四柱數據[i].六合數量 == 3) {
                var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(2, 1))) + "與" + 四柱名稱(i) +六合句2+六合句1 + "。此為一支與三支爭合。";
                命盤.分析.四柱.四柱數據[i].六合補充 = 爭合句;

                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1))].六合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1))].六合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(2, 1))].六合鄰遙爭 = "爭合";

                命盤.分析.四柱.四柱數據[0].六合柱不參與 = "";
                命盤.分析.四柱.四柱數據[1].六合柱不參與 = "";
                命盤.分析.四柱.四柱數據[2].六合柱不參與 = "";
                命盤.分析.四柱.四柱數據[3].六合柱不參與 = "";

                已推出六合.push(i);
                已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)));
                已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1)));
                已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(2, 1)));
                
                六合矩陣[四柱位置重組(i,1)]=六合句1;
                六合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)),1)] = 六合句1+"*";
                六合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1)),1)] = 六合句1+"*";
                六合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(2, 1)),1)] = 六合句1+"*";
                六合矩陣[5]=爭合句;

                命盤.分析句.刑冲合會害矩陣.push(六合矩陣);
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].六合柱;

                六合表[1]="相合"; //干支克應名稱
                六合表[2]=命盤.分析.四柱.四柱數據[i].六合地支; //克應的干、支
                六合表[3]=命盤.分析.四柱.四柱數據[i].六合化; //合出的五行
                六合表[4]=(六合表[3]!="") ? 五行轉天干(六合表[3], 合出的陰陽) : ""; //合出的天干
                六合表[5]=(六合表[4]!="") ? 尋十神(六合表[4], 命盤.日干.天干) : ""; //合出的十神

                六合表[6]= (六合表[3]!="") ? 命盤.系統參數.運算.地支六合 : 0; //合出的力量
                六合表[7]=i+命盤.分析.四柱.四柱數據[i].六合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].六合柱.substr(1,1)+","+i+命盤.分析.四柱.四柱數據[i].六合柱.substr(2,1); //i+命盤.分析.四柱.四柱數據[i].半合柱; //參與的四柱
                六合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                var 六合力量加減 = (六合表[3] != "") ?(-1/6)*命盤.系統參數.運算.地支六合 : (1/3)*命盤.系統參數.運算.合而不化;
                六合表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 3*六合力量加減;
                六合表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 六合力量加減;
                六合表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = 六合力量加減;
                六合表[四柱位置重組(Number(克應地支.substr(3, 1)), offsetTblCalc)] = 六合力量加減;
                //六合表[9] = (-1)*parseFloat(命盤.系統參數.運算.地支六合)/4; //減四分，分佈在4個天干
                //六合表[10] = (-1)*parseFloat(命盤.系統參數.運算.地支六合)/4; //減四分，分佈在4個天干
                //六合表[11] = (-1)*parseFloat(命盤.系統參數.運算.地支六合)/4; //減四分，分佈在4個天干
                //六合表[12] = (-1)*parseFloat(命盤.系統參數.運算.地支六合)/4; //減四分，分佈在4個天干
                六合表[13]=1; //納入計算中
                六合表[14]=5; //六合形態
                六合表[15]=六合表[2]+"六合（3對1）";
                六合表[16]="六合"; 

                命盤.分析.刑冲合會害表.push(六合表);
                命盤.分析.四柱.六合 = 5;

            }// 該柱的六合=3的 if

            if ((命盤.分析.四柱.四柱數據[i].六合數量 == 2) && (_.indexOf(已推出六合, i) == -1)){
                if(命盤.分析.四柱.四柱數據[0].六合數量 == 2 && 命盤.分析.四柱.四柱數據[1].六合數量 == 2 && 命盤.分析.四柱.四柱數據[2].六合數量 == 2 && 命盤.分析.四柱.四柱數據[3].六合數量 == 2){
                    // 兩組 六合，比方地支 巳申巳申
                    已推出六合.push(0);
                    已推出六合.push(1);
                    已推出六合.push(2);
                    已推出六合.push(3);

                    命盤.分析.四柱.四柱數據[0].六合柱不參與 = "";
                    命盤.分析.四柱.四柱數據[1].六合柱不參與 = "";
                    命盤.分析.四柱.四柱數據[2].六合柱不參與 = "";
                    命盤.分析.四柱.四柱數據[3].六合柱不參與 = "";

                    var 合支1 = 命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1);
                    var 合支2 = 命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1);
                    var 爭合句 = "四柱形成兩組"+六合句2+六合句1+"。";
                    六合矩陣[1]="六合"+命盤.分析.四柱.四柱數據[i].六合化+"*";
                    六合矩陣[2]="六合"+命盤.分析.四柱.四柱數據[i].六合化+"*";
                    六合矩陣[3]="六合"+命盤.分析.四柱.四柱數據[i].六合化+"*";
                    六合矩陣[4]="六合"+命盤.分析.四柱.四柱數據[i].六合化+"*";
                    六合矩陣[5]=爭合句;

                    命盤.分析句.刑冲合會害矩陣.push(六合矩陣);

                //************************************************
                var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時

                switch(命盤.分析.四柱.四柱數據[i].六合柱){
                    case "01": case "10": case "23":case "32":
                        克應柱對 = "12,13,02,03";
                        break;
                    case "12": case "21": case "03":case "30":
                        克應柱對 = "01,23,02,13";
                        break;
                    case "02": case "20": case "13":case "31":
                        克應柱對 = "01,23,12,03";
                        break;
                }
                六合表[1]="相合"; //干支克應名稱
                六合表[2]=命盤.分析.四柱.四柱數據[i].六合地支; //克應的干、支
                六合表[3]=命盤.分析.四柱.四柱數據[i].六合化; //合出的五行
                六合表[4]=(六合表[3]!="") ? 五行轉天干(六合表[3], 合出的陰陽) : ""; //合出的天干
                六合表[5]=(六合表[4]!="") ? 尋十神(六合表[4], 命盤.日干.天干) : ""; //合出的十神

                六合表[6]= (六合表[3]!="") ? 命盤.系統參數.運算.地支六合 : 0; //合出的力量
                六合表[7]=克應柱對; //參與的四柱
                六合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2
                var 六合力量加減 = (六合表[3] != "") ? (-1/4)*命盤.系統參數.運算.地支六合 : (1/2)*命盤.系統參數.運算.合而不化;
                六合表[9] = 六合力量加減;
                六合表[10] = 六合力量加減;
                六合表[11] = 六合力量加減;
                六合表[12] = 六合力量加減;
                六合表[13]=1; //納入計算中
                六合表[14]=4; //六合形態
                六合表[15]=六合表[2]+"六合（2組）";
                六合表[16]="六合"; 

                命盤.分析.刑冲合會害表.push(六合表);
                命盤.分析.四柱.六合 = 4;
                }
                else{
                    // 一個六合，帶2個爭合
                    var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1))) + "與" + 四柱名稱(i) + 六合句2+六合句1+"。此為一支與二支爭合。";
                    命盤.分析.四柱.四柱數據[i].六合補充 = 爭合句;
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1))].六合鄰遙爭 = "爭合";
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1))].六合鄰遙爭 = "爭合";

                    if(命盤.分析.四柱.四柱數據[i].六合化!=""){ //地支隔離，故不化
                        if((i==0 && (命盤.分析.四柱.四柱數據[i].六合柱==23 || 命盤.分析.四柱.四柱數據[i].六合柱==32)) || (i==3 && (命盤.分析.四柱.四柱數據[i].六合柱==01 || 命盤.分析.四柱.四柱數據[i].六合柱==10))){
                            命盤.分析.四柱.四柱數據[i].六合化 = ""; //合干間隔，論不化
                            六合五行 = "";
                            命盤.分析.四柱.四柱數據[i].六合補充 = 命盤.分析.四柱.四柱數據[i].六合補充 + "合干並非相鄰，故不論化。";                           
                        }
                    }

                    已推出六合.push(i);
                    已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)));
                    已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1)));
                    //已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(2, 1)));

                    六合矩陣[四柱位置重組(i,1)]="六合"+命盤.分析.四柱.四柱數據[i].六合化;
                    六合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)),1)] = "六合"+命盤.分析.四柱.四柱數據[i].六合化+"*";
                    六合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1)),1)] = "六合"+命盤.分析.四柱.四柱數據[i].六合化+"*";

                    var 四柱 = [0, 1, 2, 3];
                    var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)), Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1)));
                    
                    var 不參與柱 = 不參與矩陣[0];
                    命盤.分析.四柱.四柱數據[i].六合柱不參與 = String(不參與柱);
                    六合矩陣[四柱位置重組(不參與柱,1)] = "";

                    六合矩陣[5]=命盤.分析.四柱.四柱數據[i].六合補充;
                    命盤.分析句.刑冲合會害矩陣.push(六合矩陣);

                //************************************************
                var 柱對矩陣=[]; //看那個柱對有克應，比方月年、月日、日時、月時、年時
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].六合柱;
                六合表[1]="相合"; //干支克應名稱
                六合表[2]=命盤.分析.四柱.四柱數據[i].六合地支; //克應的干、支
                六合表[3]=命盤.分析.四柱.四柱數據[i].六合化; //合出的五行
                六合表[4]=(六合表[3]!="") ? 五行轉天干(六合表[3], 合出的陰陽) : ""; //合出的天干
                六合表[5]=(六合表[4]!="") ? 尋十神(六合表[4], 命盤.日干.天干) : ""; //合出的十神

                六合表[6]= (六合表[3]!="") ? parseFloat(命盤.系統參數.運算.地支六合 / Number(命盤.分析.四柱.四柱數據[i].六合柱間隔)) : 0; //合出的力量
                六合表[7]=i+命盤.分析.四柱.四柱數據[i].六合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].六合柱.substr(1,1);
                六合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2
                var 六合力量加減 = (六合表[3] != "") ? (-1/4)*命盤.系統參數.運算.地支六合 : (1/2)*命盤.系統參數.運算.合而不化;
                六合表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 2*六合力量加減;
                六合表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 六合力量加減;
                六合表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = 六合力量加減;
                六合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                六合表[13]=1; //納入計算中
                六合表[14]=3; //六合形態
                六合表[15]=六合表[2]+"六合（爭）";
                六合表[16]="六合"; 

                命盤.分析.刑冲合會害表.push(六合表);
                命盤.分析.四柱.六合 = 3;
                } // 一個六合，帶2個爭合
            }// 該柱的六合=2的 if
        } // 該柱的合>2的 if

    } // for

    for (var i = 0; i < 4; i++) {
        if ((命盤.分析.四柱.四柱數據[i].六合數量 == 1) && (_.indexOf(已推出六合, i) == -1)) {
            var 六合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解], need to reset the array to support multiple entry
            六合矩陣[0]="地支六合";
            var 六合表 = []; //need to reset the array to support multiple entry
            六合表[0]="地支";

            if(命盤.分析.四柱.四柱數據[i].六合化!="" && 命盤.分析.四柱.四柱數據[i].六合柱間隔>1){
                命盤.分析.四柱.四柱數據[i].六合=六合句1;
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1))].六合=六合句1;
                命盤.分析.四柱.四柱數據[i].六合化 = ""; //間隔，論不化
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1))].六合化 = ""; //間隔，論不化
                命盤.分析.四柱.四柱數據[i].六合補充 = 命盤.分析.四柱.四柱數據[i].六合補充 + "合干並非相鄰，故不論化。";
            }

            六合矩陣[四柱位置重組(i,1)] = "六合" + 命盤.分析.四柱.四柱數據[i].六合化;
            六合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)),1)] = "六合" + 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1))].六合化;
            //六合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1)),1)] = "六合" + 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1))].六合化;

            已推出六合.push(i);
            已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)));
            //已推出六合.push(Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(1, 1)));

            var 四柱 = [0, 1, 2, 3];
            var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].六合柱.substr(0, 1)));

            var 不參與柱1 = 不參與矩陣[0];
            var 不參與柱2 = 不參與矩陣[1];

            命盤.分析.四柱.四柱數據[i].六合柱不參與 = String(不參與柱1) + String(不參與柱2);
            六合矩陣[四柱位置重組(不參與柱1,1)] = "";
            六合矩陣[四柱位置重組(不參與柱2,1)] = "";
            六合矩陣[5] = 命盤.分析.四柱.四柱數據[i].六合補充;

            命盤.分析句.刑冲合會害矩陣.push(六合矩陣);

                //************************************************
                六合表[1]="相合"; //干支克應名稱
                六合表[2]=命盤.分析.四柱.四柱數據[i].六合地支; //半合句1; //克應的干、支
                六合表[3]=命盤.分析.四柱.四柱數據[i].六合化; //合出的五行
                六合表[4]=(六合表[3]!="") ? 五行轉天干(六合表[3], 合出的陰陽) : ""; //合出的天干
                六合表[5]=(六合表[4]!="") ? 尋十神(六合表[4], 命盤.日干.天干) : ""; //合出的十神

                六合表[6]= (六合表[3]!="") ? 命盤.系統參數.運算.地支六合 : 0; //合出的力量
                六合表[7]=i+命盤.分析.四柱.四柱數據[i].六合柱; //參與的四柱
                六合表[8]=命盤.分析.四柱.四柱數據[i].六合柱間隔; //間隔
                var 六合力量加減 = (六合表[3] != "") ? (-1/2)*命盤.系統參數.運算.地支六合 : 命盤.系統參數.運算.合而不化;
                六合表[四柱位置重組(Number(六合表[7].substr(0, 1)), offsetTblCalc)] = 六合力量加減;
                六合表[四柱位置重組(Number(六合表[7].substr(1, 1)), offsetTblCalc)] = 六合力量加減;
                六合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                六合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].六合柱不參與.substr(1,1)), offsetTblCalc)] = 0;
                if(命盤.分析.四柱.四柱數據[Number(六合表[7].substr(0, 1))].三會 !="" && 命盤.分析.四柱.四柱數據[Number(六合表[7].substr(0, 1))].三合 !="" && 命盤.分析.四柱.四柱數據[Number(六合表[7].substr(0, 1))].半合 !="" && 命盤.分析.四柱.四柱數據[Number(六合表[7].substr(1, 1))].三會 !="" && 命盤.分析.四柱.四柱數據[Number(六合表[7].substr(1, 1))].三合 !="" && 命盤.分析.四柱.四柱數據[Number(六合表[7].substr(1, 1))].半合 !="") 六合表[13]=1; else 六合表[13]=0; //沒有三會、三合，半合、才納入計算
                六合表[14]=1; //六合形態
                六合表[15]=六合表[2]+"六合";
                六合表[16]="六合";

                命盤.分析.刑冲合會害表.push(六合表); //有納入計算才推進去矩陣
                命盤.分析.四柱.六合 = 命盤.分析.四柱.六合+1;
        } // 該柱的六合=1的 if
    }
}

function 判斷地支暗合(命盤){
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    var 地支對 = [命盤.年支.地支 + 命盤.日支.地支, 
                  命盤.月支.地支 + 命盤.時支.地支, 
                  命盤.年支.地支 + 命盤.時支.地支,
                  命盤.年支.地支 + 命盤.月支.地支, 
                  命盤.月支.地支 + 命盤.日支.地支,
                  命盤.日支.地支 + 命盤.時支.地支];

    var 柱對 = ["02", "13", "03", "01", "12", "23"];
    var 鄰遙合 = ["隔合", "隔合", "遙合", "鄰合", "鄰合", "鄰合"];
    var 隔離數 = [2, 2, 3, 1, 1, 1];
    var 暗合表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0

    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反

    for(var j=0; j<地支對.length; j++){
        var 暗合句=地支暗合(地支對[j]);

        if(暗合句!=""){
            var 暗合柱1 = Number(柱對[j].substr(0, 1));
            var 暗合柱2 = Number(柱對[j].substr(1, 1));

            var 鄰遙爭合 = 鄰遙合[j];
            var 暗合句拆分 = 暗合句.split(",");
            var 暗合句1 = 暗合句拆分[0];
            var 暗合句2 = 暗合句拆分[1];  //暗合的天干，比方寅丑，暗合句2=甲己
            var 暗合句4 = 暗合句拆分[2];  //暗合的句子
            var 暗合句3 = 暗合句2.substr(0, 2); //暗合的地支
            var 合出五行 = 暗合句.substr(2, 1);

            if((命盤.分析.四柱.四柱數據[暗合柱1].暗合鄰遙爭=="") && (命盤.分析.四柱.四柱數據[暗合柱2].暗合鄰遙爭=="")) 命盤.分析.地支.暗合++; //暗合的數量加1，有爭合的，就不算
            命盤.分析.四柱.四柱數據[暗合柱1].暗合=暗合句1;
            命盤.分析.四柱.四柱數據[暗合柱1].暗合鄰遙爭=鄰遙爭合;
            命盤.分析.四柱.四柱數據[暗合柱1].暗合柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[暗合柱1].暗合化=合出五行;
            命盤.分析.四柱.四柱數據[暗合柱1].暗合地支=暗合句2;
            命盤.分析.四柱.四柱數據[暗合柱1].暗合天干=暗合句4;
            命盤.分析.四柱.四柱數據[暗合柱1].暗合數量++;
            命盤.分析.四柱.四柱數據[暗合柱1].暗合柱=命盤.分析.四柱.四柱數據[暗合柱1].暗合柱+String(暗合柱2); //命盤.分析.四柱.四柱數據[暗合柱1].暗合柱
            命盤.分析.四柱.四柱數據[暗合柱1].暗合補充=四柱名稱(暗合柱1)+"與"+四柱名稱(暗合柱2)+暗合句4;
            //命盤.分析.四柱.四柱數據[暗合柱1].總合=1;

            命盤.分析.四柱.四柱數據[暗合柱2].暗合=暗合句1;
            命盤.分析.四柱.四柱數據[暗合柱2].暗合鄰遙爭=鄰遙爭合;
            命盤.分析.四柱.四柱數據[暗合柱2].暗合柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[暗合柱2].暗合化=合出五行;
            命盤.分析.四柱.四柱數據[暗合柱2].暗合地支=暗合句2;
            命盤.分析.四柱.四柱數據[暗合柱2].暗合天干=暗合句4;
            命盤.分析.四柱.四柱數據[暗合柱2].暗合數量++;
            命盤.分析.四柱.四柱數據[暗合柱2].暗合柱=命盤.分析.四柱.四柱數據[暗合柱2].暗合柱+String(暗合柱1);
            命盤.分析.四柱.四柱數據[暗合柱2].暗合補充=四柱名稱(暗合柱1)+"與"+四柱名稱(暗合柱2)+暗合句4;
            //命盤.分析.四柱.四柱數據[暗合柱2].總合=1;

        } // 暗合判斷的if

    } // loop for 暗合判斷組合

     // 整體補充，比方是否有爭合
    var 已推出暗合 = [];
    var 暗合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
    暗合矩陣[0]="地支暗合";

    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].暗合數量 >1){
            if (命盤.分析.四柱.四柱數據[i].暗合數量 == 3) {
                var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(2, 1))) + "與" + 四柱名稱(i) + 暗合句2+ "形成一支（"+暗合句4+"）暗合三支。";
                命盤.分析.四柱.四柱數據[i].暗合補充 = 命盤.分析.四柱.四柱數據[i].暗合補充 + 爭合句;

                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1))].暗合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1))].暗合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(2, 1))].暗合鄰遙爭 = "爭合";

                已推出暗合.push(i);
                已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)));
                已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1)));
                已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(2, 1)));
                
                暗合矩陣[四柱位置重組(i,1)]="暗合"+命盤.分析.四柱.四柱數據[i].暗合化;
                暗合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)),1)] = 暗合句1+"*";
                暗合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1)),1)] = 暗合句1+"*";
                暗合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(2, 1)),1)] = 暗合句1+"*";
                暗合矩陣[5]=爭合句;

                命盤.分析句.刑冲合會害矩陣.push(暗合矩陣);

                //************************************************
                暗合表[1]="相合"; //干支克應名稱
                暗合表[2]=命盤.分析.四柱.四柱數據[i].暗合地支; //克應的干、支
                暗合表[3]=命盤.分析.四柱.四柱數據[i].暗合化; //合出的五行
                暗合表[4]=(暗合表[3]!="") ? 五行轉天干(暗合表[3], 合出的陰陽) : ""; //合出的天干
                暗合表[5]=(暗合表[4]!="") ? 尋十神(暗合表[4], 命盤.日干.天干) : ""; //合出的十神

                暗合表[6]= (暗合表[3]!="") ? parseFloat(命盤.系統參數.運算.地支暗合 / Number(命盤.分析.四柱.四柱數據[i].暗合柱間隔)) : 0; //合出的力量
                暗合表[7]=i+命盤.分析.四柱.四柱數據[i].暗合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].暗合柱.substr(1,1)+","+i+命盤.分析.四柱.四柱數據[i].暗合柱.substr(2,1); //參與的四柱
                暗合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                暗合表[9] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[10] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[11] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[12] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[13]=1; //納入計算中
                暗合表[14]=1; //是否有爭，0=無，1，2，3
                暗合表[15]=暗合表[2]+"暗合（1對3）";
                暗合表[16]="暗合"; 

                命盤.分析.刑冲合會害表.push(暗合表);

            }// 該柱的暗合=3的 if

            if ((命盤.分析.四柱.四柱數據[i].暗合數量 == 2) && (_.indexOf(已推出暗合, i) == -1)){
                if(命盤.分析.四柱.四柱數據[0].暗合數量 == 2 && 命盤.分析.四柱.四柱數據[1].暗合數量 == 2 && 命盤.分析.四柱.四柱數據[2].暗合數量 == 2 && 命盤.分析.四柱.四柱數據[3].暗合數量 == 2){
                    // 兩組 暗合，比方地支 巳申巳申
                    已推出暗合.push(0);
                    已推出暗合.push(1);
                    已推出暗合.push(2);
                    已推出暗合.push(3);

                    var 合支1 = 命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1);
                    var 合支2 = 命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1);
                    var 爭合句 = "四柱形成兩組"+暗合句2+"（"+暗合句4+"）"+暗合句1+"。";
                    暗合矩陣[1]=暗合句1+"*";
                    暗合矩陣[2]=暗合句1+"*";
                    暗合矩陣[3]=暗合句1+"*";
                    暗合矩陣[4]=暗合句1+"*";
                    暗合矩陣[5]=爭合句;

                    命盤.分析句.刑冲合會害矩陣.push(暗合矩陣);

                //************************************************
                var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時

                switch(命盤.分析.四柱.四柱數據[i].暗合柱){
                    case "01": case "10": case "23":case "32":
                        克應柱對 = "12,13,02,03";
                        break;
                    case "12": case "21": case "03":case "30":
                        克應柱對 = "01,23,02,13";
                        break;
                    case "02": case "20": case "13":case "31":
                        克應柱對 = "01,23,12,03";
                        break;
                }
                暗合表[1]="相合"; //干支克應名稱
                暗合表[2]=命盤.分析.四柱.四柱數據[i].暗合地支; //克應的干、支
                暗合表[3]=命盤.分析.四柱.四柱數據[i].暗合化; //合出的五行
                暗合表[4]=(暗合表[3]!="") ? 五行轉天干(暗合表[3], 合出的陰陽) : ""; //合出的天干
                暗合表[5]=(暗合表[4]!="") ? 尋十神(暗合表[4], 命盤.日干.天干) : ""; //合出的十神

                暗合表[6]= (暗合表[3]!="") ? parseFloat(命盤.系統參數.運算.地支暗合 / Number(命盤.分析.四柱.四柱數據[i].暗合柱間隔)) : 0; //合出的力量
                暗合表[7]= 克應柱對; //參與的四柱
                暗合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                暗合表[9] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[10] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[11] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[12] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/4; //減2分，分佈在4個天干
                暗合表[13]=1; //納入計算中
                暗合表[14]=1; //是否有爭，0=無，1，2，3
                暗合表[15]=暗合表[2]+"暗合（2組）";
                暗合表[16]="暗合"; 

                命盤.分析.刑冲合會害表.push(暗合表);
                }
                else{
                    // 一個暗合，帶2個爭合
                    var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1))) + "與" + 四柱名稱(i)+ 暗合句4 + "，也形成爭合。";
                    命盤.分析.四柱.四柱數據[i].暗合補充 = 爭合句;
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1))].暗合鄰遙爭 = "爭合";
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1))].暗合鄰遙爭 = "爭合";

                    已推出暗合.push(i);
                    已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)));
                    已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1)));
                    //已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(2, 1)));

                    暗合矩陣[四柱位置重組(i,1)]=暗合句1;
                    暗合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)),1)] = 暗合句1+"*";
                    暗合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1)),1)] = 暗合句1+"*";

                    var 四柱 = [0, 1, 2, 3];
                    var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)), Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1)));

                    var 不參與柱 = 不參與矩陣[0];

                    命盤.分析.四柱.四柱數據[i].暗合柱不參與 = String(不參與柱);
                    暗合矩陣[四柱位置重組(不參與柱,1)] = "";

                    暗合矩陣[5]=命盤.分析.四柱.四柱數據[i].暗合補充;
                    命盤.分析句.刑冲合會害矩陣.push(暗合矩陣);

                //************************************************
                //var 柱對矩陣=[]; //看那個柱對有克應，比方月年、月日、日時、月時、年時
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].暗合柱;

                暗合表[1]="相合"; //干支克應名稱
                暗合表[2]=命盤.分析.四柱.四柱數據[i].暗合地支; //克應的干、支
                暗合表[3]=命盤.分析.四柱.四柱數據[i].暗合化; //合出的五行
                暗合表[4]=(暗合表[3]!="") ? 五行轉天干(暗合表[3], 合出的陰陽) : ""; //合出的天干
                暗合表[5]=(暗合表[4]!="") ? 尋十神(暗合表[4], 命盤.日干.天干) : ""; //合出的十神

                暗合表[6]= (暗合表[3]!="") ? parseFloat(命盤.系統參數.運算.地支暗合 / Number(命盤.分析.四柱.四柱數據[i].暗合柱間隔)) : 0; //合出的力量
                暗合表[7]= i+命盤.分析.四柱.四柱數據[i].暗合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].暗合柱.substr(1,1); //參與的四柱
                暗合表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                暗合表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/3; //減四分，分佈在三個天干
                暗合表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/3; //減四分，分佈在三個天干
                暗合表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/3; //減四分，分佈在三個天干
                暗合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                暗合表[13]=1; //納入計算中
                暗合表[14]=1; //是否有爭，0=無，1，2，3
                暗合表[15]=暗合表[2]+"暗合（爭）";
                暗合表[16]="暗合";

                命盤.分析.刑冲合會害表.push(暗合表);
                } // 一個暗合，帶2個爭合
            }// 該柱的暗合=2的 if
        } // 該柱的合>2的 if

    } // for

    for (var i = 0; i < 4; i++) {
        if ((命盤.分析.四柱.四柱數據[i].暗合數量 == 1) && (_.indexOf(已推出暗合, i) == -1)) {
            var 暗合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解], need to reset the array to support multiple entry
            暗合矩陣[0]="地支暗合";
            var 暗合表 = []; //need to reset the array to support multiple entry
            暗合表[0]="地支";

            暗合矩陣[四柱位置重組(i,1)] = "暗合" + 命盤.分析.四柱.四柱數據[i].暗合化;
            暗合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)),1)] = "暗合" + 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1))].暗合化;
            //暗合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1)),1)] = "暗合" + 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1))].暗合化;

            已推出暗合.push(i);
            已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)));
            //已推出暗合.push(Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(1, 1)));
            
            var 四柱 = [0, 1, 2, 3];
            var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].暗合柱.substr(0, 1)));

            var 不參與柱1 = 不參與矩陣[0];
            var 不參與柱2 = 不參與矩陣[1];

            命盤.分析.四柱.四柱數據[i].暗合柱不參與 = String(不參與柱1) + String(不參與柱2);
            暗合矩陣[四柱位置重組(不參與柱1,1)] = "";
            暗合矩陣[四柱位置重組(不參與柱2,1)] = "";
            暗合矩陣[5] = 命盤.分析.四柱.四柱數據[i].暗合補充;

            命盤.分析句.刑冲合會害矩陣.push(暗合矩陣);

                //************************************************
                暗合表[1]="相合"; //干支克應名稱
                暗合表[2]=命盤.分析.四柱.四柱數據[i].暗合地支; //半合句1; //克應的干、支
                暗合表[3]=命盤.分析.四柱.四柱數據[i].暗合化; //合出的五行
                暗合表[4]=(暗合表[3]!="") ? 五行轉天干(暗合表[3], 合出的陰陽) : ""; //合出的天干
                暗合表[5]=(暗合表[4]!="") ? 尋十神(暗合表[4], 命盤.日干.天干) : ""; //合出的十神

                暗合表[6]= (暗合表[3]!="") ? parseFloat(命盤.系統參數.運算.地支暗合 / Number(命盤.分析.四柱.四柱數據[i].暗合柱間隔)) : 0; //合出的力量
                暗合表[7]=i+命盤.分析.四柱.四柱數據[i].暗合柱; //參與的四柱
                暗合表[8]=命盤.分析.四柱.四柱數據[i].暗合柱間隔; //間隔
                暗合表[四柱位置重組(Number(暗合表[7].substr(0, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/(2*Number(暗合表[8])); //減4分，分佈在2個天干
                暗合表[四柱位置重組(Number(暗合表[7].substr(1, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支暗合)/(2*Number(暗合表[8])); //減4分，分佈在2個天干
                暗合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                暗合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].暗合柱不參與.substr(1,1)), offsetTblCalc)] = 0;
                if(命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(0, 1))].三會 !="" && 命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(0, 1))].三合 !="" && 命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(0, 1))].半合 !="" && 命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(0, 1))].六合 !="" && 命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(1, 1))].三會 !="" && 命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(1, 1))].三合 !="" && 命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(1, 1))].半合 !="" && 命盤.分析.四柱.四柱數據[Number(暗合表[7].substr(1, 1))].半合 !="") 暗合表[13]=1; else 暗合表[13]=0; //沒有三會、三合，半合、才納入計算
                暗合表[14]=0; //是否有爭，0=無，1，2，3
                暗合表[15]=暗合表[2]+"暗合"; 
                暗合表[16]="暗合"; 

                命盤.分析.刑冲合會害表.push(暗合表); //有納入計算才推進去矩陣
        } // 該柱的暗合=1的 if
    }
}

function 判斷地支相刑(命盤, 刑方){
    //刑方: "所有", "自刑無禮"
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    var 地支對 = [命盤.年支.地支 + 命盤.日支.地支, 
                  命盤.月支.地支 + 命盤.時支.地支, 
                  命盤.年支.地支 + 命盤.時支.地支,
                  命盤.年支.地支 + 命盤.月支.地支, 
                  命盤.月支.地支 + 命盤.日支.地支,
                  命盤.日支.地支 + 命盤.時支.地支];

    var 柱對 = ["02", "13", "03", "01", "12", "23"];
    var 鄰遙刑 = ["隔刑", "隔刑", "遙刑", "鄰刑", "鄰刑", "鄰刑"];
    var 隔離數 = [2, 2, 3, 1, 1, 1];
    var 相刑表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0
    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    //var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	//var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反

    for(var j=0; j<地支對.length; j++){

        switch(刑方){
            case "所有":
                var 相刑句 = 地支相刑(地支對[j], "相刑", "所有");
                break;
            case "自刑無禮":
                var 相刑句 = 地支相刑(地支對[j], "相刑", "自刑無禮");
                break;
            default:
                alert("判斷命盤三刑選項錯誤 ！！")
                var 相刑句 = 地支相刑(地支對[j], "相刑", "所有");
                break;
        }

        if(相刑句!=""){
            var 相刑柱1 = Number(柱對[j].substr(0, 1));
            var 相刑柱2 = Number(柱對[j].substr(1, 1));

            var 鄰遙爭刑 = 鄰遙刑[j];
            var 相刑句拆分 = 相刑句.split(",");
            
            var 相刑句1 = 相刑句拆分[0]; // 自刑，相刑句.substr(0,4);
            var 相刑句2 = 相刑句拆分[1]; //亥亥，相刑句.substr(5,2);  //那個地支相刑
            //var 相刑句3 = 相刑句拆分[2];  //相刑的句子
            //var 合出五行 = 相刑句.substr(4, 1);
            //alert(相刑句1);
            if((命盤.分析.四柱.四柱數據[相刑柱1].相刑鄰遙爭=="") && (命盤.分析.四柱.四柱數據[相刑柱2].相刑鄰遙爭=="")) 命盤.分析.地支.相刑++; //相刑的數量加1，有爭刑的，就不算

            命盤.分析.四柱.四柱數據[相刑柱1].相刑=相刑句1;
            命盤.分析.四柱.四柱數據[相刑柱1].相刑鄰遙爭=鄰遙爭刑;
            命盤.分析.四柱.四柱數據[相刑柱1].相刑數量++;
            命盤.分析.四柱.四柱數據[相刑柱1].相刑柱 = 命盤.分析.四柱.四柱數據[相刑柱1].相刑柱 + String(相刑柱2);
            命盤.分析.四柱.四柱數據[相刑柱1].相刑柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[相刑柱1].相刑補充=四柱名稱(相刑柱1)+"與"+四柱名稱(相刑柱2)+相刑句2+相刑句1;
            命盤.分析.四柱.四柱數據[相刑柱1].相刑地支=相刑句2;
            命盤.分析.四柱.四柱數據[相刑柱1].相刑方向 = (四柱屬性(命盤, 相刑柱1, "地支") == 相刑句2.substr(0,1)) ? 1 : 0;

            命盤.分析.四柱.四柱數據[相刑柱2].相刑=相刑句1;
            命盤.分析.四柱.四柱數據[相刑柱2].相刑鄰遙爭=鄰遙爭刑;
            命盤.分析.四柱.四柱數據[相刑柱2].相刑數量++;
            命盤.分析.四柱.四柱數據[相刑柱2].相刑柱=命盤.分析.四柱.四柱數據[相刑柱2].相刑柱+String(相刑柱1);
            命盤.分析.四柱.四柱數據[相刑柱2].相刑柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[相刑柱2].相刑補充=四柱名稱(相刑柱1)+"與"+四柱名稱(相刑柱2)+相刑句2+相刑句1;
            命盤.分析.四柱.四柱數據[相刑柱2].相刑地支=相刑句2;
            命盤.分析.四柱.四柱數據[相刑柱2].相刑方向 = (四柱屬性(命盤, 相刑柱2, "地支") == 相刑句2.substr(0,1)) ? 1 : 0;
        } // 相刑判斷的if

    } // loop for 相刑判斷組合

     // 整體補充，比方是否有爭合
    var 已推出相刑 = [];
    var 相刑矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
    相刑矩陣[0]="地支相刑";

    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].相刑數量 >1){
            if (命盤.分析.四柱.四柱數據[i].相刑數量 == 3) {
                var 爭刑句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(2, 1))) + "與" + 四柱名稱(i) + 相刑句2+ "形成";
                if (命盤.分析.四柱.四柱數據[i].相刑方向 == 1) 爭刑句 = 爭刑句+ "一支刑三支的" + 相刑句1 + "。";
                if (命盤.分析.四柱.四柱數據[i].相刑方向 == 0) 爭刑句 = 爭刑句+ "三支刑一支的" + 相刑句1 + "。";

                命盤.分析.四柱.四柱數據[i].相刑補充 = 爭刑句;

                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1))].相刑鄰遙爭 = "爭刑";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1))].相刑鄰遙爭 = "爭刑";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(2, 1))].相刑鄰遙爭 = "爭刑";

                已推出相刑.push(i);
                已推出相刑.push(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)));
                已推出相刑.push(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1)));
                已推出相刑.push(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(2, 1)));
                
                相刑矩陣[四柱位置重組(i,1)]=相刑句1;
                相刑矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)),1)] = 相刑句1+"*";
                相刑矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1)),1)] = 相刑句1+"*";
                相刑矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(2, 1)),1)] = 相刑句1+"*";
                相刑矩陣[5] = 命盤.分析.四柱.四柱數據[i].相刑補充;

                命盤.分析句.刑冲合會害矩陣.push(相刑矩陣);

                //************************************************
                相刑表[1]="相刑"; //干支克應名稱
                相刑表[2]=命盤.分析.四柱.四柱數據[i].相刑地支; //克應的干、支
                相刑表[3] = "";
                相刑表[4] = "";
                相刑表[5] = "";
                相刑表[6] = 0; //合出的力量
                相刑表[7]=i+命盤.分析.四柱.四柱數據[i].相刑柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].相刑柱.substr(1,1)+","+i+命盤.分析.四柱.四柱數據[i].相刑柱.substr(2,1); //參與的四柱
                相刑表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相刑表[9] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[10] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[11] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[12] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[13]=1; //納入計算中
                相刑表[14]=1; //是否有爭，0=無，1，2，3
                相刑表[15]=相刑表[2]+"相刑（1對3）";
                相刑表[16]="相刑"; 

		        命盤.分析.刑冲合會害表.push(相刑表);
                命盤.分析.四柱.相刑 = 5;

            }// 該柱的相刑=3的 if

            if ((命盤.分析.四柱.四柱數據[i].相刑數量 == 2) && (_.indexOf(已推出相刑, i) == -1)){
                if(命盤.分析.四柱.四柱數據[0].相刑數量 == 2 && 命盤.分析.四柱.四柱數據[1].相刑數量 == 2 && 命盤.分析.四柱.四柱數據[2].相刑數量 == 2 && 命盤.分析.四柱.四柱數據[3].相刑數量 == 2){
                    // 兩組 相刑
                    已推出相刑.push(0);
                    已推出相刑.push(1);
                    已推出相刑.push(2);
                    已推出相刑.push(3);

                    var 刑支1 = 命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1);
                    var 刑支2 = 命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1);
                    var 爭刑句 = "四柱形成兩組"+相刑句2+相刑句1+"。";
                    相刑矩陣[1]=相刑句1;
                    相刑矩陣[2]=相刑句1;
                    相刑矩陣[3]=相刑句1;
                    相刑矩陣[4]=相刑句1;
                    相刑矩陣[5]=爭刑句;

                    命盤.分析句.刑冲合會害矩陣.push(相刑矩陣);

                //************************************************
                var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時

                switch(命盤.分析.四柱.四柱數據[i].相刑柱){
                    case "01": case "10": case "23":case "32":
                        克應柱對 = "12,13,02,03";
                        break;
                    case "12": case "21": case "03":case "30":
                        克應柱對 = "01,23,02,13";
                        break;
                    case "02": case "20": case "13":case "31":
                        克應柱對 = "01,23,12,03";
                        break;
                }
                相刑表[1]="相刑"; //干支克應名稱
                相刑表[2]=命盤.分析.四柱.四柱數據[i].相刑地支; //克應的干、支
                相刑表[3] = "";
                相刑表[4] = "";
                相刑表[5] = "";
                相刑表[6] = 0; //合出的力量
                相刑表[7]=克應柱對; //參與的四柱
                相刑表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相刑表[9] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[10] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[11] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[12] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/4; //減2分，分佈在4個天干
                相刑表[13]=1; //納入計算中
                相刑表[14]=1; //是否有爭，0=無，1，2，3
                相刑表[15]=相刑表[2]+"相刑（2組）"; 
                相刑表[16]="相刑"; 

		        命盤.分析.刑冲合會害表.push(相刑表);
                命盤.分析.四柱.相刑 = 4;
                }
                else{
                    // 一個相刑，帶2個爭合
                    var 爭刑句1 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1))) + "與" + 四柱名稱(i) + "形成"+相刑句2+相刑句1+"。";
                    if(命盤.分析.四柱.四柱數據[i].相刑方向 ==1) var 爭刑句2=四柱名稱(i) + "一支刑二支。"
                    if(命盤.分析.四柱.四柱數據[i].相刑方向 ==0) var 爭刑句2=四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1))) + "與" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1))) + "二支刑一支。"
                    
                    命盤.分析.四柱.四柱數據[i].相刑補充 = 爭刑句1+爭刑句2;
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1))].相刑鄰遙爭 = "爭刑";
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1))].相刑鄰遙爭 = "爭刑";

                    已推出相刑.push(i);
                    已推出相刑.push(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)));
                    已推出相刑.push(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1)));
                    //已推出相刑.push(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(2, 1)));

                    相刑矩陣[四柱位置重組(i,1)]=相刑句1;
                    相刑矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)),1)] = 相刑句1+"*";
                    相刑矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1)),1)] = 相刑句1+"*";

                    var 四柱 = [0, 1, 2, 3];
                    var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)), Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(1, 1)));

                    var 不參與柱 = 不參與矩陣[0];
                    命盤.分析.四柱.四柱數據[i].相刑柱不參與 = String(不參與柱);
                    相刑矩陣[四柱位置重組(不參與柱,1)] = "";

                    相刑矩陣[5]=命盤.分析.四柱.四柱數據[i].相刑補充;
                    命盤.分析句.刑冲合會害矩陣.push(相刑矩陣);

                //************************************************
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].相刑柱;
                相刑表[1]="相刑"; //干支克應名稱
                相刑表[2]=命盤.分析.四柱.四柱數據[i].相刑地支; //克應的干、支
                相刑表[3] = "";
                相刑表[4] = "";
                相刑表[5] = "";
                相刑表[6] = 0; //合出的力量
                相刑表[7]= i+命盤.分析.四柱.四柱數據[i].相刑柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].相刑柱.substr(1,1); //參與的四柱
                相刑表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相刑表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/3; //減2分，分佈在三個天干
                相刑表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/3; //減2分，分佈在三個天干
                相刑表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/3; //減2分，分佈在三個天干
                相刑表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                相刑表[13]=1; //納入計算中
                相刑表[14]=1; //是否有爭，0=無，1，2，3
                相刑表[15]=相刑表[2]+"相刑（爭）";
                相刑表[16]="相刑"; 

		        命盤.分析.刑冲合會害表.push(相刑表);
                命盤.分析.四柱.相刑 = 3;
                } // 一個相刑，帶2個爭合
            }// 該柱的相刑=2的 if
        } // 該柱的合>2的 if

    } // for

    for (var i = 0; i < 4; i++) {
        if ((命盤.分析.四柱.四柱數據[i].相刑數量 == 1) && (_.indexOf(已推出相刑, i) == -1)) {
            var 相刑矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解], need to reset the array to support multiple entry
            相刑矩陣[0]="地支相刑";
            var 相刑表 = []; //need to reset the array to support multiple entry
            相刑表[0]="地支";

            相刑矩陣[四柱位置重組(i,1)] = 命盤.分析.四柱.四柱數據[i].相刑;
            相刑矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)),1)] = 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1))].相刑;

            已推出相刑.push(i);
            已推出相刑.push(Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)));
            //alert(i + " / " + 命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1));
            
            var 四柱 = [0, 1, 2, 3];
            var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].相刑柱.substr(0, 1)));

            var 不參與柱1 = 不參與矩陣[0];
            var 不參與柱2 = 不參與矩陣[1];

            命盤.分析.四柱.四柱數據[i].相刑柱不參與 = String(不參與柱1) + String(不參與柱2);
            相刑矩陣[四柱位置重組(不參與柱1,1)] = "";
            相刑矩陣[四柱位置重組(不參與柱2,1)] = "";
            相刑矩陣[5] = 命盤.分析.四柱.四柱數據[i].相刑補充;

            命盤.分析句.刑冲合會害矩陣.push(相刑矩陣);

                //************************************************
                相刑表[1]="相刑"; //干支克應名稱
                相刑表[2]=命盤.分析.四柱.四柱數據[i].相刑地支; //半合句1; //克應的干、支
                相刑表[3] = "";
                相刑表[4] = "";
                相刑表[5] = "";
                相刑表[6] = 0;
                相刑表[7]=i+命盤.分析.四柱.四柱數據[i].相刑柱; //參與的四柱
                相刑表[8]=命盤.分析.四柱.四柱數據[i].相刑柱間隔; //間隔
                相刑表[四柱位置重組(Number(相刑表[7].substr(0, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/(2*Number(相刑表[8])); //減4分，分佈在2個天干
                相刑表[四柱位置重組(Number(相刑表[7].substr(1, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相刑)/(2*Number(相刑表[8])); //減4分，分佈在2個天干
                相刑表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                相刑表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相刑柱不參與.substr(1,1)), offsetTblCalc)] = 0;
                相刑表[13]=1; //納入計算
                相刑表[14]=0; //是否有爭，0=無，1，2，3
                相刑表[15]=相刑表[2]+"相刑";
                相刑表[16]="相刑"; 

                命盤.分析.刑冲合會害表.push(相刑表);
                命盤.分析.四柱.相刑 = 命盤.分析.四柱.相刑+1;
        } // 該柱的相刑=1的 if
    }
}

function 判斷地支相冲(命盤){
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    var 地支對 = [命盤.年支.地支 + 命盤.日支.地支, 
                  命盤.月支.地支 + 命盤.時支.地支, 
                  命盤.年支.地支 + 命盤.時支.地支,
                  命盤.年支.地支 + 命盤.月支.地支, 
                  命盤.月支.地支 + 命盤.日支.地支,
                  命盤.日支.地支 + 命盤.時支.地支];

    var 柱對 = ["02", "13", "03", "01", "12", "23"];
    var 鄰遙冲 = ["隔冲", "隔冲", "遙冲", "鄰冲", "鄰冲", "鄰冲"];
    var 隔離數 = [2, 2, 3, 1, 1, 1];
    var 相冲表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0
    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    //var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	//var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反

    for(var j=0; j<地支對.length; j++){

	    var 相冲句 = 地支相冲(地支對[j]);

        if(相冲句!=""){
            var 相冲柱1 = Number(柱對[j].substr(0, 1));
            var 相冲柱2 = Number(柱對[j].substr(1, 1));

            var 鄰遙爭冲 = 鄰遙冲[j];
            var 相冲句拆分 = 相冲句.split(",");
            
            var 相冲句1 = 相冲句拆分[0]; //相冲句.substr(0,1);
            var 相冲句2 = 相冲句拆分[1]; ;//相冲句拆分[1];  //那個地支相冲
            var 相冲句3 = 相冲句拆分[2];  //四庫、馬、花冲
            //var 合出五行 = 相冲句.substr(4, 1);
            //alert(相冲句1);
            if((命盤.分析.四柱.四柱數據[相冲柱1].相冲鄰遙爭=="") && (命盤.分析.四柱.四柱數據[相冲柱2].相冲鄰遙爭=="")) 命盤.分析.地支.相冲++; //相冲的數量加1，有爭冲的，就不算

            命盤.分析.四柱.四柱數據[相冲柱1].相冲=相冲句1;
            命盤.分析.四柱.四柱數據[相冲柱1].相冲鄰遙爭=鄰遙爭冲;
            命盤.分析.四柱.四柱數據[相冲柱1].相冲數量++;
            命盤.分析.四柱.四柱數據[相冲柱1].相冲柱 = 命盤.分析.四柱.四柱數據[相冲柱1].相冲柱 + String(相冲柱2);
            命盤.分析.四柱.四柱數據[相冲柱1].相冲柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[相冲柱1].相冲補充=四柱名稱(相冲柱1)+"與"+四柱名稱(相冲柱2)+相冲句2+相冲句3;
            命盤.分析.四柱.四柱數據[相冲柱1].相冲地支=相冲句2;
            命盤.分析.四柱.四柱數據[相冲柱1].相冲庫馬花=相冲句3;

            命盤.分析.四柱.四柱數據[相冲柱2].相冲=相冲句1;
            命盤.分析.四柱.四柱數據[相冲柱2].相冲鄰遙爭=鄰遙爭冲;
            命盤.分析.四柱.四柱數據[相冲柱2].相冲數量++;
            命盤.分析.四柱.四柱數據[相冲柱2].相冲柱=命盤.分析.四柱.四柱數據[相冲柱2].相冲柱+String(相冲柱1);
            命盤.分析.四柱.四柱數據[相冲柱2].相冲柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[相冲柱2].相冲補充=四柱名稱(相冲柱1)+"與"+四柱名稱(相冲柱2)+相冲句2+相冲句3;
            命盤.分析.四柱.四柱數據[相冲柱2].相冲地支=相冲句2;
            命盤.分析.四柱.四柱數據[相冲柱2].相冲庫馬花=相冲句3;
        } // 相冲判斷的if

    } // loop for 相冲判斷組合

     // 整體補充，比方是否有爭合
    var 已推出相冲 = [];
    var 相冲矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
    相冲矩陣[0]="地支相冲";

    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].相冲數量 >1){
            if (命盤.分析.四柱.四柱數據[i].相冲數量 == 3) {
                var 爭冲句1 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(2, 1))) + "與" + 四柱名稱(i) + "形成"+相冲句2+相冲句3+"。";

                命盤.分析.四柱.四柱數據[i].相冲補充 = 爭冲句1;

                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1))].相冲鄰遙爭 = "爭冲";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1))].相冲鄰遙爭 = "爭冲";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(2, 1))].相冲鄰遙爭 = "爭冲";

                命盤.分析.四柱.四柱數據[0].相冲柱不參與 = "";
                命盤.分析.四柱.四柱數據[1].相冲柱不參與 = "";
                命盤.分析.四柱.四柱數據[2].相冲柱不參與 = "";
                命盤.分析.四柱.四柱數據[3].相冲柱不參與 = "";

                已推出相冲.push(i);
                已推出相冲.push(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)));
                已推出相冲.push(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1)));
                已推出相冲.push(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(2, 1)));
                
                相冲矩陣[四柱位置重組(i)]=相冲句3;
                相冲矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)),1)] = 相冲句3+"*";
                相冲矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1)),1)] = 相冲句3+"*";
                相冲矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(2, 1)),1)] = 相冲句3+"*";
                相冲矩陣[5] = 命盤.分析.四柱.四柱數據[i].相冲補充;

                命盤.分析句.刑冲合會害矩陣.push(相冲矩陣);
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].相冲柱;
                //************************************************
                相冲表[1]="相冲"; //干支克應名稱
                相冲表[2]=命盤.分析.四柱.四柱數據[i].相冲地支; //克應的干、支
                相冲表[3] = ""; //x出的五行
                相冲表[4] = ""; //x出的天干
                相冲表[5] = ""; //x出的十神
                相冲表[6] = 0;  //x出的力量
                相冲表[7]=i+命盤.分析.四柱.四柱數據[i].相冲柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].相冲柱.substr(1,1)+","+i+命盤.分析.四柱.四柱數據[i].相冲柱.substr(2,1); //參與的四柱
                相冲表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2
                //冲支力度(地支)
                相冲表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(0, 1))].地支);
                相冲表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(1, 1))].地支)/3;
                相冲表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(2, 1))].地支)/3;
                相冲表[四柱位置重組(Number(克應地支.substr(3, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(3, 1))].地支)/3;

                相冲表[13]=1; //納入計算中
                相冲表[14]=1; //是否有爭，0=無，1，2，3
                相冲表[15]=相冲表[2]+"相冲（1對3）";
                相冲表[16]="相冲";

		        命盤.分析.刑冲合會害表.push(相冲表);
                命盤.分析.四柱.相冲 = 5; //有1冲3

            }// 該柱的相冲=3的 if

            if ((命盤.分析.四柱.四柱數據[i].相冲數量 == 2) && (_.indexOf(已推出相冲, i) == -1)){
                if(命盤.分析.四柱.四柱數據[0].相冲數量 == 2 && 命盤.分析.四柱.四柱數據[1].相冲數量 == 2 && 命盤.分析.四柱.四柱數據[2].相冲數量 == 2 && 命盤.分析.四柱.四柱數據[3].相冲數量 == 2){
                    // 兩組 相冲
                    已推出相冲.push(0);
                    已推出相冲.push(1);
                    已推出相冲.push(2);
                    已推出相冲.push(3);

                    命盤.分析.四柱.四柱數據[0].相冲柱不參與 = "";
                    命盤.分析.四柱.四柱數據[1].相冲柱不參與 = "";
                    命盤.分析.四柱.四柱數據[2].相冲柱不參與 = "";
                    命盤.分析.四柱.四柱數據[3].相冲柱不參與 = "";

                    var 冲支1 = 命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1);
                    var 冲支2 = 命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1);
                    var 爭冲句 = "四柱形成兩組"+相冲句2+相冲句3+"。";
                    相冲矩陣[1]=命盤.分析.四柱.四柱數據[0].相冲庫馬花;
                    相冲矩陣[2]=命盤.分析.四柱.四柱數據[1].相冲庫馬花;
                    相冲矩陣[3]=命盤.分析.四柱.四柱數據[2].相冲庫馬花;
                    相冲矩陣[4]=命盤.分析.四柱.四柱數據[3].相冲庫馬花;
                    相冲矩陣[5]=爭冲句;

                    命盤.分析句.刑冲合會害矩陣.push(相冲矩陣);

                //************************************************
                var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時

                switch(命盤.分析.四柱.四柱數據[i].相冲柱){
                    case "01": case "10": case "23":case "32":
                        克應柱對 = "12,13,02,03";
                        break;
                    case "12": case "21": case "03":case "30":
                        克應柱對 = "01,23,02,13";
                        break;
                    case "02": case "20": case "13":case "31":
                        克應柱對 = "01,23,12,03";
                        break;
                }
                相冲表[1]="相冲"; //干支克應名稱
                相冲表[2]=命盤.分析.四柱.四柱數據[i].相冲地支; //克應的干、支
                相冲表[3] = "";
                相冲表[4] = "";
                相冲表[5] = "";
                相冲表[6] = 0; //合出的力量
                相冲表[7]= 克應柱對; //參與的四柱
                相冲表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相冲表[9] = 冲支力度(命盤.分析.四柱.四柱數據[3].地支)/2;
                相冲表[10] = 冲支力度(命盤.分析.四柱.四柱數據[2].地支)/2;
                相冲表[11] = 冲支力度(命盤.分析.四柱.四柱數據[1].地支)/2;
                相冲表[12] = 冲支力度(命盤.分析.四柱.四柱數據[0].地支)/2;
                相冲表[13]=1; //納入計算中
                相冲表[14]=1; //是否有爭，0=無，1，2，3
                相冲表[15]=相冲表[2]+"相冲（2組）";
                相冲表[16]="相冲";

		        命盤.分析.刑冲合會害表.push(相冲表);
                命盤.分析.四柱.相冲 = 4; //有爭冲
                }
                else{
                    // 一個相冲，帶2個爭合
                    var 爭冲句1 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1))) + "與" + 四柱名稱(i) + "形成"+相冲句2+相冲句1+"。";
                    
                    命盤.分析.四柱.四柱數據[i].相冲補充 = 爭冲句1;
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1))].相冲鄰遙爭 = "爭冲";
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1))].相冲鄰遙爭 = "爭冲";

                    已推出相冲.push(i);
                    已推出相冲.push(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)));
                    已推出相冲.push(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1)));
                    //已推出相冲.push(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(2, 1)));

                    相冲矩陣[四柱位置重組(i,1)]=相冲句3;
                    相冲矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)),1)] = 相冲句3+"*";
                    相冲矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1)),1)] = 相冲句3+"*";

                    var 四柱 = [0, 1, 2, 3];
                    var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)), Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1)));

                    var 不參與柱 = 不參與矩陣[0];
                    命盤.分析.四柱.四柱數據[i].相冲柱不參與 = String(不參與柱);
                    相冲矩陣[四柱位置重組(不參與柱,1)] = "";

                    相冲矩陣[5]=命盤.分析.四柱.四柱數據[i].相冲補充;
                    命盤.分析句.刑冲合會害矩陣.push(相冲矩陣);


                //************************************************
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].相冲柱;
                相冲表[1]="相冲"; //干支克應名稱
                相冲表[2]=命盤.分析.四柱.四柱數據[i].相冲地支; //克應的干、支
                相冲表[3] = "";
                相冲表[4] = "";
                相冲表[5] = "";
                相冲表[6] = 0; //合出的力量
                相冲表[7]= i+命盤.分析.四柱.四柱數據[i].相冲柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].相冲柱.substr(1,1); //參與的四柱
                相冲表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相冲表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(0, 1))].地支);
                相冲表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(1, 1))].地支)/2;
                相冲表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(2, 1))].地支)/2;
                相冲表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                相冲表[13]=1; //納入計算中
                相冲表[14]=1; //是否有爭，0=無，1，2，3
                相冲表[15]=相冲表[2]+"相冲（爭）";
                相冲表[16]="相冲";

		        命盤.分析.刑冲合會害表.push(相冲表);
                命盤.分析.四柱.相冲 = 3; //有爭冲
                } // 一個相冲，帶2個爭合
            }// 該柱的相冲=2的 if
        } // 該柱的合>2的 if

    } // for

    for (var i = 0; i < 4; i++) {
        if ((命盤.分析.四柱.四柱數據[i].相冲數量 == 1) && (_.indexOf(已推出相冲, i) == -1)) {
            var 相冲矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解], need to reset the array to support multiple entry
            相冲矩陣[0]="地支相冲";
            var 相冲表 = []; //need to reset the array to support multiple entry
            相冲表[0]="地支";

            相冲矩陣[四柱位置重組(i,1)] = 相冲句3;
            相冲矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)),1)] = 相冲句3;
            //相冲矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1)),1)] = "相冲" + 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(1, 1))].相冲化;

            已推出相冲.push(i);
            已推出相冲.push(Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)));
            //alert(i + " / " + 命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1));
            
            var 四柱 = [0, 1, 2, 3];
            var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].相冲柱.substr(0, 1)));

            var 不參與柱1 = 不參與矩陣[0];
            var 不參與柱2 = 不參與矩陣[1];

            命盤.分析.四柱.四柱數據[i].相冲柱不參與 = String(不參與柱1) + String(不參與柱2);
            相冲矩陣[四柱位置重組(不參與柱1,1)] = "";
            相冲矩陣[四柱位置重組(不參與柱2,1)] = "";
            相冲矩陣[5] = 命盤.分析.四柱.四柱數據[i].相冲補充;

            命盤.分析句.刑冲合會害矩陣.push(相冲矩陣);
            var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].相冲柱;
                //************************************************
                相冲表[1]="相冲"; //干支克應名稱
                相冲表[2]=命盤.分析.四柱.四柱數據[i].相冲地支; //半合句1; //克應的干、支
                相冲表[3] = "";
                相冲表[4] = "";
                相冲表[5] = "";
                相冲表[6] = 0;
                相冲表[7]=i+命盤.分析.四柱.四柱數據[i].相冲柱; //參與的四柱
                相冲表[8]=命盤.分析.四柱.四柱數據[i].相冲柱間隔; //間隔
                相冲表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(0, 1))].地支);
                相冲表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 冲支力度(命盤.分析.四柱.四柱數據[Number(克應地支.substr(1, 1))].地支);
                相冲表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                相冲表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相冲柱不參與.substr(1,1)), offsetTblCalc)] = 0;
                相冲表[13]=1; //納入計算
                相冲表[14]=0; //是否有爭，0=無，1，2，3
                相冲表[15]=相冲表[2]+"相冲";
                相冲表[16]="相冲";

                命盤.分析.刑冲合會害表.push(相冲表);
                命盤.分析.四柱.相冲 = 命盤.分析.四柱.相冲+1;
        } // 該柱的相冲=1的 if
    }
}


function 判斷地支相害(命盤){
    var 地支矩陣 = [命盤.年支.地支, 命盤.月支.地支, 命盤.日支.地支, 命盤.時支.地支];
    var 地支對 = [命盤.年支.地支 + 命盤.日支.地支, 
                  命盤.月支.地支 + 命盤.時支.地支, 
                  命盤.年支.地支 + 命盤.時支.地支,
                  命盤.年支.地支 + 命盤.月支.地支, 
                  命盤.月支.地支 + 命盤.日支.地支,
                  命盤.日支.地支 + 命盤.時支.地支];

    var 柱對 = ["02", "13", "03", "01", "12", "23"];
    var 鄰遙害 = ["隔害", "隔害", "遙害", "鄰害", "鄰害", "鄰害"];
    var 隔離數 = [2, 2, 3, 1, 1, 1];
    var 相害表 = ["地支","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0
    var offsetTblCalc = 9; //offset 9 column for 刑冲合會害表
    //var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷會出來的十神
	//var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //會出的陰陽是日主陰陽的相反

    for(var j=0; j<地支對.length; j++){
	    var 相害句 = 地支相害(地支對[j]);

        if(相害句!=""){
            var 相害柱1 = Number(柱對[j].substr(0, 1));
            var 相害柱2 = Number(柱對[j].substr(1, 1));

            var 鄰遙爭害 = 鄰遙害[j];
            var 相害句拆分 = 相害句.split(",");
            
            var 相害句1 = 相害句拆分[0];
            var 相害句2 = 相害句拆分[1];

            if((命盤.分析.四柱.四柱數據[相害柱1].相害鄰遙爭=="") && (命盤.分析.四柱.四柱數據[相害柱2].相害鄰遙爭=="")) 命盤.分析.地支.相害++; //相害的數量加1，有爭冲的，就不算

            命盤.分析.四柱.四柱數據[相害柱1].相害=相害句1;
            命盤.分析.四柱.四柱數據[相害柱1].相害鄰遙爭=鄰遙爭害;
            命盤.分析.四柱.四柱數據[相害柱1].相害數量++;
            命盤.分析.四柱.四柱數據[相害柱1].相害柱 = 命盤.分析.四柱.四柱數據[相害柱1].相害柱 + String(相害柱2);
            命盤.分析.四柱.四柱數據[相害柱1].相害柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[相害柱1].相害補充=四柱名稱(相害柱1)+"與"+四柱名稱(相害柱2)+相害句2+"相"+相害句1;
            命盤.分析.四柱.四柱數據[相害柱1].相害地支=相害句2;

            命盤.分析.四柱.四柱數據[相害柱2].相害=相害句1;
            命盤.分析.四柱.四柱數據[相害柱2].相害鄰遙爭=鄰遙爭害;
            命盤.分析.四柱.四柱數據[相害柱2].相害數量++;
            命盤.分析.四柱.四柱數據[相害柱2].相害柱=命盤.分析.四柱.四柱數據[相害柱2].相害柱+String(相害柱1);
            命盤.分析.四柱.四柱數據[相害柱2].相害柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[相害柱2].相害補充=四柱名稱(相害柱1)+"與"+四柱名稱(相害柱2)+相害句2+"相"+相害句1;
            命盤.分析.四柱.四柱數據[相害柱2].相害地支=相害句2;
        } // 相害判斷的if

    } // loop for 相害判斷組合

     // 整體補充，比方是否有爭合
    var 已推出相害 = [];
    var 相害矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
    相害矩陣[0]="地支相害";

    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].相害數量 >1){
            if (命盤.分析.四柱.四柱數據[i].相害數量 == 3) {
                var 爭害句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(2, 1))) + "與" + 四柱名稱(i)+相害句2 + "形成三支害一支。";

                命盤.分析.四柱.四柱數據[i].相害補充 = 命盤.分析.四柱.四柱數據[i].相害補充 + 爭害句;

                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1))].相害鄰遙爭 = "爭害";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1))].相害鄰遙爭 = "爭害";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(2, 1))].相害鄰遙爭 = "爭害";

                已推出相害.push(i);
                已推出相害.push(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)));
                已推出相害.push(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1)));
                已推出相害.push(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(2, 1)));
                
                相害矩陣[四柱位置重組(i,1)]="相"+相害句1;
                相害矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)),1)] = "相"+相害句1+"*";
                相害矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1)),1)] = "相"+相害句1+"*";
                相害矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(2, 1)),1)] = "相"+相害句1+"*";
                相害矩陣[5]=爭害句;

                命盤.分析句.刑冲合會害矩陣.push(相害矩陣);
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].相害柱;
                //************************************************
                相害表[1]="相害"; //干支克應名稱
                相害表[2]=命盤.分析.四柱.四柱數據[i].相害地支; //克應的干、支
                相害表[3] = "";
                相害表[4] = "";
                相害表[5] = "";
                相害表[6] = 0; //合出的力量
                相害表[7]=i+命盤.分析.四柱.四柱數據[i].相害柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].相害柱.substr(1,1)+","+i+命盤.分析.四柱.四柱數據[i].相害柱.substr(2,1); //參與的四柱
                相害表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相害表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = (-1)*命盤.系統參數.運算.地支相害 / 2;
                相害表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = (-1)*命盤.系統參數.運算.地支相害 / 6;
                相害表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = (-1)*命盤.系統參數.運算.地支相害 / 6;
                相害表[四柱位置重組(Number(克應地支.substr(3, 1)), offsetTblCalc)] = (-1)*命盤.系統參數.運算.地支相害 / 6;
                相害表[13]=1; //納入計算中
                相害表[14]=1; //是否有爭，0=無，1，2，3
                相害表[15]=相害表[2]+"相害（1對3）"; 
                相害表[16]="相害"; 

		        命盤.分析.刑冲合會害表.push(相害表);
                命盤.分析.四柱.相害 = 5;
            }// 該柱的相害=3的 if

            if ((命盤.分析.四柱.四柱數據[i].相害數量 == 2) && (_.indexOf(已推出相害, i) == -1)){
                if(命盤.分析.四柱.四柱數據[0].相害數量 == 2 && 命盤.分析.四柱.四柱數據[1].相害數量 == 2 && 命盤.分析.四柱.四柱數據[2].相害數量 == 2 && 命盤.分析.四柱.四柱數據[3].相害數量 == 2){
                    // 兩組 相害
                    已推出相害.push(0);
                    已推出相害.push(1);
                    已推出相害.push(2);
                    已推出相害.push(3);

                    var 害支1 = 命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1);
                    var 害支2 = 命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1);
                    var 爭害句 = "四柱形成兩組"+相害句2+相害句1+"。";

                    相害矩陣[1]="相"+命盤.分析.四柱.四柱數據[0].相害+"*";
                    相害矩陣[2]="相"+命盤.分析.四柱.四柱數據[1].相害+"*";
                    相害矩陣[3]="相"+命盤.分析.四柱.四柱數據[2].相害+"*";
                    相害矩陣[4]="相"+命盤.分析.四柱.四柱數據[3].相害+"*";
                    相害矩陣[5]=爭害句;

                    命盤.分析句.刑冲合會害矩陣.push(相害矩陣);

                //************************************************
                var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時

                switch(命盤.分析.四柱.四柱數據[i].相害柱){
                    case "01": case "10": case "23":case "32":
                        克應柱對 = "12,13,02,03";
                        break;
                    case "12": case "21": case "03":case "30":
                        克應柱對 = "01,23,02,13";
                        break;
                    case "02": case "20": case "13":case "31":
                        克應柱對 = "01,23,12,03";
                        break;
                }
                相害表[1]="相害"; //干支克應名稱
                相害表[2]=命盤.分析.四柱.四柱數據[i].相害地支; //克應的干、支
                相害表[3] = "";
                相害表[4] = "";
                相害表[5] = "";
                相害表[6] = 0; //合出的力量
                相害表[7]= 克應柱對; //參與的四柱
                相害表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相害表[9] = (-1)*命盤.系統參數.運算.地支相害 / 2;
                相害表[10] = (-1)*命盤.系統參數.運算.地支相害 / 2;
                相害表[11] = (-1)*命盤.系統參數.運算.地支相害 / 2;
                相害表[12] = (-1)*parseFloat(命盤.系統參數.運算.地支相害 / 2);

                相害表[13]=1; //納入計算中
                相害表[14]=1; //是否有爭，0=無，1，2，3
                相害表[15]=相害表[2]+"相害（2組）";
                相害表[16]="相害";

		        命盤.分析.刑冲合會害表.push(相害表);
                命盤.分析.四柱.相害 = 4;
                }
                else{
                    // 一個相害，帶2個爭害
                    var 爭害句 = 四柱名稱(i) + 相害句2 + "一支害兩支，"+四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1)))+"。";
                    
                    命盤.分析.四柱.四柱數據[i].相害補充 = 爭害句;
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1))].相害鄰遙爭 = "爭害";
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1))].相害鄰遙爭 = "爭害";

                    已推出相害.push(i);
                    已推出相害.push(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)));
                    已推出相害.push(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1)));
                    //已推出相害.push(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(2, 1)));

                    相害矩陣[四柱位置重組(i,1)]="相"+相害句1;
                    相害矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)),1)] = "相"+相害句1+"*";
                    相害矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1)),1)] = "相"+相害句1+"*";

                    var 四柱 = [0, 1, 2, 3];
                    var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)), Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1)));

                    var 不參與柱 = 不參與矩陣[0];
                    命盤.分析.四柱.四柱數據[i].相害柱不參與 = String(不參與柱);
                    相害矩陣[四柱位置重組(不參與柱,1)] = "";
                    相害矩陣[5]=命盤.分析.四柱.四柱數據[i].相害補充;

                    命盤.分析句.刑冲合會害矩陣.push(相害矩陣);

                //************************************************
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].相害柱;
                相害表[1]="相害"; //干支克應名稱
                相害表[2]=命盤.分析.四柱.四柱數據[i].相害地支; //克應的干、支
                相害表[3] = "";
                相害表[4] = "";
                相害表[5] = "";
                相害表[6] = 0; //合出的力量
                相害表[7]= i+命盤.分析.四柱.四柱數據[i].相害柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].相害柱.substr(1,1); //參與的四柱
                相害表[8]=1; //間隔, 比方時柱甲，年月柱是己，距離是2

                相害表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相害)/2;
                相害表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相害)/4;
                相害表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = (-1)*parseFloat(命盤.系統參數.運算.地支相害)/4;
                相害表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                相害表[13]=1; //納入計算中
                相害表[14]=1; //是否有爭，0=無，1，2，3
                相害表[15]=相害表[2]+"相害（爭）";
                相害表[16]="相害";

		        命盤.分析.刑冲合會害表.push(相害表);
                命盤.分析.四柱.相害 = 3;
                } // 一個相害，帶2個爭合
            }// 該柱的相害=2的 if
        } // 該柱的合>2的 if

    } // for

    for (var i = 0; i < 4; i++) {
        if ((命盤.分析.四柱.四柱數據[i].相害數量 == 1) && (_.indexOf(已推出相害, i) == -1)) {
            var 相害矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解], need to reset the array to support multiple entry
            相害矩陣[0]="地支相害";
            var 相害表 = []; //need to reset the array to support multiple entry
            相害表[0]="地支";

            相害矩陣[四柱位置重組(i,1)] = "相"+相害句1;
            相害矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)),1)] = "相"+相害句1;
            //相害矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1)),1)] = "相害" + 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(1, 1))].相害化;

            已推出相害.push(i);
            已推出相害.push(Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)));
            //alert(i + " / " + 命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1));
            
            var 四柱 = [0, 1, 2, 3];
            var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].相害柱.substr(0, 1)));

            var 不參與柱1 = 不參與矩陣[0];
            var 不參與柱2 = 不參與矩陣[1];

            命盤.分析.四柱.四柱數據[i].相害柱不參與 = String(不參與柱1) + String(不參與柱2);
            相害矩陣[四柱位置重組(不參與柱1,1)] = "";
            相害矩陣[四柱位置重組(不參與柱2,1)] = "";
            相害矩陣[5] = 命盤.分析.四柱.四柱數據[i].相害補充;

            命盤.分析句.刑冲合會害矩陣.push(相害矩陣);

                //************************************************
                相害表[1]="相害"; //干支克應名稱
                相害表[2]=命盤.分析.四柱.四柱數據[i].相害地支; //半合句1; //克應的干、支
                相害表[3] = "";
                相害表[4] = "";
                相害表[5] = "";
                相害表[6] = 0;
                相害表[7]=i+命盤.分析.四柱.四柱數據[i].相害柱; //參與的四柱
                相害表[8]=命盤.分析.四柱.四柱數據[i].相害柱間隔; //間隔
                相害表[四柱位置重組(Number(相害表[7].substr(0, 1)), offsetTblCalc)] = (-1)*命盤.系統參數.運算.地支相害 / 2;
                相害表[四柱位置重組(Number(相害表[7].substr(1, 1)), offsetTblCalc)] = (-1)*命盤.系統參數.運算.地支相害 / 2;
                相害表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                相害表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].相害柱不參與.substr(1,1)), offsetTblCalc)] = 0;
                相害表[13]=1; //納入計算
                相害表[14]=0; //是否有爭，0=無，1，2，3
                相害表[15]=相害表[2]+"相害";
                相害表[16]="相害";

                命盤.分析.刑冲合會害表.push(相害表);
                命盤.分析.四柱.相害 = 命盤.分析.四柱.相害+1;
        } // 該柱的相害=1的 if
    }
}

function 判斷天干五合(命盤){
    var 天干矩陣 = [命盤.年干.天干, 命盤.月干.天干, 命盤.日干.天干, 命盤.時干.天干];
    var 天干對 = [命盤.年干.天干 + 命盤.日干.天干, 
                  命盤.月干.天干 + 命盤.時干.天干, 
                  命盤.年干.天干 + 命盤.時干.天干,
                  命盤.年干.天干 + 命盤.月干.天干, 
                  命盤.月干.天干 + 命盤.日干.天干,
                  命盤.日干.天干 + 命盤.時干.天干];

    var 柱對 = ["02", "13", "03", "01", "12", "23"];
    var 鄰遙合 = ["隔合", "隔合", "遙合", "鄰合", "鄰合", "鄰合"];
    var 隔離數 = [2, 2, 3, 1, 1, 1];
    var offsetTblCalc = 9; //offset 9 column
    //發生在天干還是地支(0)，干支克應名稱(1)，克應的干、支(2)，合化五行(3)，合化出的天干(4)，合化出的十神(5)，合化出來的力量(6)，參與的四柱(7)，合化柱的間隔數(8)，時柱力度加減(9)，日柱力度加減(10)，月柱力度加減(11)，年柱力度加減(12)，納入計算(13)，爭(14)，備註1(15)
    
    var 五合表 = ["天干","","","","","", 0,"",0,0,0, 0,0,0,"","",""]; //預設 納入計算=0，間隔數=0

    for(var j=0; j<天干對.length; j++){
        var 五合句=天干合化(天干對[j],命盤);

        if(五合句!=""){
            var 五合柱1 = Number(柱對[j].substr(0, 1));
            var 五合柱2 = Number(柱對[j].substr(1, 1));
            var 鄰遙爭合 = 鄰遙合[j];
            var 五合句拆分 = 五合句.split(",");
            var 五合句1 = 五合句拆分[0];  //天干合
            var 五合句2 = 五合句拆分[1]; //天干五合的五行，程式沒有
            var 五合句3 = 五合句拆分[2]; //造成天干五合的天干，比方甲己
            var 五合句4 = 五合句拆分[3]; //合化成功合出的五行，不化則""
            var 五合句5 = 五合句拆分[4]; //合化的註解，放在補充句那裡
            var 合出五行 = 五合句4;

            if((命盤.分析.四柱.四柱數據[五合柱1].五合鄰遙爭=="") && (命盤.分析.四柱.四柱數據[五合柱2].五合鄰遙爭=="")) 命盤.分析.天干.五合++; //五合的數量加1，有爭合的，就不算

            命盤.分析.四柱.四柱數據[五合柱1].天干五合=五合句1;
            命盤.分析.四柱.四柱數據[五合柱1].五合鄰遙爭=鄰遙爭合;
            命盤.分析.四柱.四柱數據[五合柱1].五合柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[五合柱1].天干五合化=合出五行;
            命盤.分析.四柱.四柱數據[五合柱1].五合天干=五合句3;
            命盤.分析.四柱.四柱數據[五合柱1].五合數量++;
            命盤.分析.四柱.四柱數據[五合柱1].五合柱=命盤.分析.四柱.四柱數據[五合柱1].五合柱+String(五合柱2); //命盤.分析.四柱.四柱數據[五合柱1].五合柱
            命盤.分析.四柱.四柱數據[五合柱1].五合補充=四柱名稱(五合柱1)+"與"+四柱名稱(五合柱2)+五合句3+五合句1+"。"+五合句5;
            //命盤.分析.四柱.四柱數據[五合柱1].總合=1;  //只用在地支的多種合化

            命盤.分析.四柱.四柱數據[五合柱2].天干五合=五合句1;
            命盤.分析.四柱.四柱數據[五合柱2].五合鄰遙爭=鄰遙爭合;
            命盤.分析.四柱.四柱數據[五合柱2].五合柱間隔 = 隔離數[j];
            命盤.分析.四柱.四柱數據[五合柱2].天干五合化=合出五行;
            命盤.分析.四柱.四柱數據[五合柱2].五合天干=五合句3;
            命盤.分析.四柱.四柱數據[五合柱2].五合數量++;
            命盤.分析.四柱.四柱數據[五合柱2].五合柱=命盤.分析.四柱.四柱數據[五合柱2].五合柱+String(五合柱1);
            命盤.分析.四柱.四柱數據[五合柱2].五合補充=四柱名稱(五合柱1)+"與"+四柱名稱(五合柱2)+五合句3+五合句1+"。"+五合句5;
            //命盤.分析.四柱.四柱數據[五合柱2].總合=1;
        } // 五合判斷的if

    } // loop for 五合判斷組合

     // 整體補充，比方是否有爭合
    var 已推出五合 = [];
    var 五合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解]
    五合矩陣[0]="天干五合";

    var 日主陰陽=天干屬性(命盤.日干.天干, "陰陽"); // 用以判斷合出來的十神
	var 合出的陰陽=(日主陰陽=="陽")?"陰":"陽"; //合出的陰陽是日主陰陽的相反

    for(var i=0; i<4; i++){
        if(命盤.分析.四柱.四柱數據[i].五合數量 >1){
            if (命盤.分析.四柱.四柱數據[i].五合數量 == 3) {
                var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(2, 1))) + "與" + 四柱名稱(i) +"天干合"+五合句2+ "。形成一干與三干爭合。";
                命盤.分析.四柱.四柱數據[i].五合補充 = 命盤.分析.四柱.四柱數據[i].五合補充+爭合句;

                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].五合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1))].五合鄰遙爭 = "爭合";
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(2, 1))].五合鄰遙爭 = "爭合";

                命盤.分析.四柱.四柱數據[0].五合柱不參與 = "";
                命盤.分析.四柱.四柱數據[1].五合柱不參與 = "";
                命盤.分析.四柱.四柱數據[2].五合柱不參與 = "";
                命盤.分析.四柱.四柱數據[3].五合柱不參與 = "";

                已推出五合.push(i);
                已推出五合.push(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)));
                已推出五合.push(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1)));
                已推出五合.push(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(2, 1)));
                
                五合矩陣[四柱位置重組(i,1)]=五合句1+合出五行;
                五合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)),1)] = 五合句1+合出五行+"*";
                五合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1)),1)] = 五合句1+合出五行+"*";
                五合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(2, 1)),1)] = 五合句1+合出五行+"*";
                五合矩陣[5]=命盤.分析.四柱.四柱數據[i].五合補充;

                命盤.分析句.刑冲合會害矩陣.push(五合矩陣);
                
                //************************************************
                五合表[1]="相合"; //干支克應名稱
                五合表[2]=五合句3; //克應的干、支
                五合表[3]=合出五行; //合出的五行
                五合表[4]=(五合表[3]!="") ? 五行轉天干(合出五行, 合出的陰陽) : ""; //合出的天干
                五合表[5]=(五合表[4]!="") ? 尋十神(五合表[4], 命盤.日干.天干) : ""; //合出的十神

                五合表[6]= (合出五行!="") ? 命盤.系統參數.運算.天干五合化 : 0; //合出的力量
                五合表[7]=i+命盤.分析.四柱.四柱數據[i].五合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].五合柱.substr(1,1)+","+i+命盤.分析.四柱.四柱數據[i].五合柱.substr(2,1); //參與的四柱
                五合表[8]=1; //間隔

                var 干合力量加減 = (五合表[3] != "") ? (-1/2)*命盤.系統參數.運算.天干五合化 : (1/2)*命盤.系統參數.運算.合而不化;
                五合表[四柱位置重組(Number(五合表[7].substr(0, 1)), offsetTblCalc)] = 干合力量加減;
                五合表[四柱位置重組(Number(五合表[7].substr(1, 1)), offsetTblCalc)] = 干合力量加減/3;
                五合表[四柱位置重組(Number(五合表[7].substr(2, 1)), offsetTblCalc)] = 干合力量加減/3;
                五合表[四柱位置重組(Number(五合表[7].substr(3, 1)), offsetTblCalc)] = 干合力量加減/3;

                五合表[13]=1; //納入計算中
                五合表[14]=5; //五合形態
                五合表[15]=五合表[2]+"天干五合（1對3）";
                五合表[16]="干合";

                命盤.分析.刑冲合會害表.push(五合表);
                命盤.分析.四柱.干合 = 5;

            }// 該柱的五合=3的 if

            if ((命盤.分析.四柱.四柱數據[i].五合數量 == 2) && (_.indexOf(已推出五合, i) == -1)){
                if(命盤.分析.四柱.四柱數據[0].五合數量 == 2 && 命盤.分析.四柱.四柱數據[1].五合數量 == 2 && 命盤.分析.四柱.四柱數據[2].五合數量 == 2 && 命盤.分析.四柱.四柱數據[3].五合數量 == 2){
                    // 兩組 五合，比方天干 戊癸戊癸
                    已推出五合.push(0);
                    已推出五合.push(1);
                    已推出五合.push(2);
                    已推出五合.push(3);

                    var 合干1 = 命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1);
                    var 合干2 = 命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1);
                    var 爭合句 = "四柱形成兩組"+五合句3+五合句1+合出五行+"。";

                    //命盤.分析.四柱.四柱數據[0].五合形態 = 4;
                    //命盤.分析.四柱.四柱數據[1].五合形態 = 4;
                    //命盤.分析.四柱.四柱數據[2].五合形態 = 4;
                    //命盤.分析.四柱.四柱數據[3].五合形態 = 4;

                    五合矩陣[1]=五合句1+合出五行+"*";
                    五合矩陣[2]=五合句1+合出五行+"*";
                    五合矩陣[3]=五合句1+合出五行+"*";
                    五合矩陣[4]=五合句1+合出五行+"*";
                    五合矩陣[5]=五合句5+爭合句;
                    命盤.分析.四柱.四柱數據[i].五合柱不參與 = "";

                    命盤.分析句.刑冲合會害矩陣.push(五合矩陣);

                //************************************************
                var 克應柱對; //看那個柱對有克應，比方月年、月日、日時、月時、年時

                switch(命盤.分析.四柱.四柱數據[i].五合柱){
                    case "01": case "10": case "23":case "32":
                        克應柱對 = "12,13,02,03";
                        break;
                    case "12": case "21": case "03":case "30":
                        克應柱對 = "01,23,02,13";
                        break;
                    case "02": case "20": case "13":case "31":
                        克應柱對 = "01,23,12,03";
                        break;
                }

                五合表[1]="相合"; //干支克應名稱
                五合表[2]=五合句3; //克應的干、支
                五合表[3]=合出五行; //合出的五行
                五合表[4]=(五合表[3]!="") ? 五行轉天干(合出五行, 合出的陰陽) : ""; //合出的天干
                五合表[5]=(五合表[4]!="") ? 尋十神(五合表[4], 命盤.日干.天干) : ""; //合出的十神

                五合表[6]= (合出五行!="") ? 命盤.系統參數.運算.天干五合化 : 0; //合出的力量
                五合表[7]= 克應柱對; //參與的四柱
                五合表[8]=1; //間隔
                五合表[9]= (-1)*parseFloat(命盤.系統參數.運算.天干五合化)/4; //時柱減掉的力量
                五合表[10]=(-1)*parseFloat(命盤.系統參數.運算.天干五合化)/4; //日柱減掉的力量
                五合表[11]=(-1)*parseFloat(命盤.系統參數.運算.天干五合化)/4; //月柱減掉的力量
                五合表[12]=(-1)*parseFloat(命盤.系統參數.運算.天干五合化)/4; //年柱減掉的力量
                五合表[13]=1; //納入計算中
                五合表[14]=4; //五合形態
                五合表[15]=五合表[2]+"天干五合（2組）";
                五合表[16]="干合";

                命盤.分析.刑冲合會害表.push(五合表);
                命盤.分析.四柱.干合 = 4;
                }
                else{
                    // 一個五合，帶2個爭合
                    var 爭合句 = 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))) + "、" + 四柱名稱(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1))) + "與" + 四柱名稱(i) + "形成"+五合句3+"兩個爭合。";
                    命盤.分析.四柱.四柱數據[i].五合補充 = 五合句5+爭合句;
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].五合鄰遙爭 = "爭合";
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1))].五合鄰遙爭 = "爭合";


                    if(命盤.分析.四柱.四柱數據[i].天干五合化!=""){ //地支隔離，故不化
                        if((i==0 && (命盤.分析.四柱.四柱數據[i].五合柱==23 || 命盤.分析.四柱.四柱數據[i].五合柱==32)) || (i==3 && (命盤.分析.四柱.四柱數據[i].五合柱==01 || 命盤.分析.四柱.四柱數據[i].五合柱==10))){
                            命盤.分析.四柱.四柱數據[i].天干五合化 = ""; //合干間隔，論不化
                            合出五行 = "";
                            命盤.分析.四柱.四柱數據[i].五合補充 = 命盤.分析.四柱.四柱數據[i].五合補充 + "合干並非相鄰，故不論化。";                           
                        }
                    }

                    已推出五合.push(i);
                    已推出五合.push(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)));
                    已推出五合.push(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1)));
                    //已推出五合.push(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(2, 1)));

                    五合矩陣[四柱位置重組(i,1)]=五合句1+合出五行;
                    五合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)),1)] = 五合句1+合出五行+"*";
                    五合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1)),1)] = 五合句1+合出五行+"*";

                    var 四柱 = [0, 1, 2, 3];
                    var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)), Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1)));

                    var 不參與柱 = 不參與矩陣[0];

                    五合矩陣[四柱位置重組(不參與柱,1)] = "";
                    命盤.分析.四柱.四柱數據[i].五合柱不參與 = String(不參與柱);
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].五合柱不參與 = String(不參與柱);
                    命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(1, 1))].五合柱不參與 = String(不參與柱);
                    五合矩陣[5]=命盤.分析.四柱.四柱數據[i].五合補充;
                    命盤.分析句.刑冲合會害矩陣.push(五合矩陣);

                //************************************************
                var 克應地支 = i + 命盤.分析.四柱.四柱數據[i].五合柱;
                五合表[1]="相合"; //干支克應名稱
                五合表[2]=五合句3; //克應的干、支
                五合表[3]=合出五行; //合出的五行
                五合表[4]=(五合表[3]!="") ? 五行轉天干(合出五行, 合出的陰陽) : ""; //合出的天干
                五合表[5]=(五合表[4]!="") ? 尋十神(五合表[4], 命盤.日干.天干) : ""; //合出的十神

                五合表[6]= (合出五行!="") ? 命盤.系統參數.運算.天干五合化 : 0; //合出的力量
                五合表[7]=i+命盤.分析.四柱.四柱數據[i].五合柱.substr(0,1)+","+i+命盤.分析.四柱.四柱數據[i].五合柱.substr(1,1); //參與的四柱

                var 干合力量加減 = (五合表[3] != "") ? (-1/4)*命盤.系統參數.運算.天干五合化 : (1/2)*命盤.系統參數.運算.合而不化;
                五合表[四柱位置重組(Number(克應地支.substr(0, 1)), offsetTblCalc)] = 2*干合力量加減;
                五合表[四柱位置重組(Number(克應地支.substr(1, 1)), offsetTblCalc)] = 干合力量加減;
                五合表[四柱位置重組(Number(克應地支.substr(2, 1)), offsetTblCalc)] = 干合力量加減;
                五合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                五合表[13]=1; //納入計算中
                五合表[14]=3; //五合形態
                五合表[15]=五合表[2]+"天干五合（爭）";
                五合表[16]="干合";

                命盤.分析.刑冲合會害表.push(五合表);
                命盤.分析.四柱.干合 = 3;
                } // 一個五合，帶2個爭合
            }// 該柱的五合=2的 if
        } // 該柱的合>2的 if

    } // for

    for (var i = 0; i < 4; i++) {
        if ((命盤.分析.四柱.四柱數據[i].五合數量 == 1) && (_.indexOf(已推出五合, i) == -1)) {
            var 五合矩陣 = []; //[標題，時柱，日柱，月柱，年柱，註解], need to reset the array to support multiple entry
            var 五合表 = []; //need to reset the array to support multiple entry
            五合矩陣[0]="天干五合";
            五合表[0]="天干";

            if(命盤.分析.四柱.四柱數據[i].天干五合化!="" && 命盤.分析.四柱.四柱數據[i].五合柱間隔>1){
                命盤.分析.四柱.四柱數據[i].天干五合=五合句1;
                命盤.分析.四柱.四柱數據[i].天干五合化 = ""; //合干間隔，論不化
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].天干五合=五合句1;
                命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].天干五合化="";
                命盤.分析.四柱.四柱數據[i].五合補充 = 命盤.分析.四柱.四柱數據[i].五合補充 + "合干並非相鄰，故不論化。";
            }

            五合矩陣[四柱位置重組(i,1)] = 命盤.分析.四柱.四柱數據[i].天干五合+命盤.分析.四柱.四柱數據[i].天干五合化;
            五合矩陣[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)),1)] = 命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].天干五合+命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].天干五合化;

            //命盤.分析.四柱.四柱數據[i].五合形態 = 1;
            //命盤.分析.四柱.四柱數據[Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1))].五合形態 = 1;

            已推出五合.push(i);
            已推出五合.push(Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)));

            var 四柱 = [0, 1, 2, 3];
            var 不參與矩陣 = _.without(四柱, i, Number(命盤.分析.四柱.四柱數據[i].五合柱.substr(0, 1)));

            var 不參與柱1 = 不參與矩陣[0];
            var 不參與柱2 = 不參與矩陣[1];

            命盤.分析.四柱.四柱數據[i].五合柱不參與 = String(不參與柱1)+String(不參與柱2);
            五合矩陣[四柱位置重組(不參與柱1,1)] = "";
            五合矩陣[四柱位置重組(不參與柱2,1)] = "";
            五合矩陣[5] = 命盤.分析.四柱.四柱數據[i].五合補充;

            命盤.分析句.刑冲合會害矩陣.push(五合矩陣);

                //************************************************
                五合表[1]="相合"; //干支克應名稱
                五合表[2]=命盤.分析.四柱.四柱數據[i].五合天干; //五合句1; //克應的干、支
                五合表[3]=命盤.分析.四柱.四柱數據[i].天干五合化; //合出的五行
                五合表[4]=(五合表[3]!="") ? 五行轉天干(合出五行, 合出的陰陽) : ""; //合出的天干
                五合表[5]=(五合表[4]!="") ? 尋十神(五合表[4], 命盤.日干.天干) : ""; //合出的十神

                五合表[6]= (五合表[3]!="") ? 命盤.系統參數.運算.天干五合化: 0; //合出的力量
                五合表[7]=i+命盤.分析.四柱.四柱數據[i].五合柱; //參與的四柱
                五合表[8]=命盤.分析.四柱.四柱數據[i].五合柱間隔; //間隔
                var 干合力量加減 = (五合表[3] != "") ? (-1/2)*命盤.系統參數.運算.天干五合化 : 命盤.系統參數.運算.合而不化;
                五合表[四柱位置重組(Number(五合表[7].substr(0, 1)), offsetTblCalc)] = 干合力量加減;
                五合表[四柱位置重組(Number(五合表[7].substr(1, 1)), offsetTblCalc)] = 干合力量加減;
                五合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱不參與.substr(0,1)), offsetTblCalc)] = 0;
                五合表[四柱位置重組(Number(命盤.分析.四柱.四柱數據[i].五合柱不參與.substr(1,1)), offsetTblCalc)] = 0;
                五合表[13]=1; //納入計算中
                五合表[14]=1; //五合形態
                五合表[15]=五合表[2]+"天干五合";
                五合表[16]="干合";

                命盤.分析.刑冲合會害表.push(五合表);
                命盤.分析.四柱.干合 = 命盤.分析.四柱.干合+1;

        } // 該柱的五合=1的 if
    }
}


function 判斷干支相合(命盤){
    var 四柱干支 = [命盤.年柱.干支,命盤.月柱.干支,命盤.日柱.干支,命盤.時柱.干支];
    var 干支相合矩陣 = ["干支暗合","","","","",""];

    for (i=0; i<4; i++){
        var 干支相合句 = 干支相合(四柱干支[i]);
            if(干支相合句!=""){
                var 干支相合句拆分 = 干支相合句.split(",");
                var 相合句1 = 干支相合句拆分[0];
                var 相合句2 = 干支相合句拆分[1]; //合出五行
                var 相合句3 = 干支相合句拆分[2]; //干支
                var 相合句4 = 干支相合句拆分[3]; //干支暗合的天干

                命盤.分析.四柱.四柱數據[i].干支合化=相合句1+相合句2;
                命盤.分析.四柱.四柱數據[i].干支合化補充=相合句3+相合句4;
                干支相合矩陣[四柱位置重組(i,1)] = 相合句4+"合"+相合句2;
                干支相合矩陣[5] = 干支相合矩陣[5] + 四柱名稱(i) + 相合句3 + "（" + 相合句4 + "）暗合" + 相合句2 + "。";
            }
    }
    if(干支相合矩陣[5]!="") 命盤.分析句.刑冲合會害矩陣.push(干支相合矩陣);
}

function 四柱位置重組(四柱數, offset){
    var position;
    //offset for table subject
    switch (四柱數){
        case 3: //時柱
            position = 0 + offset;
            return position;
            break;
        case 2: //日柱
            position = 1 + offset;
            return position;
            break;
        case 1: //月柱
            position = 2 + offset;
            return position;
            break;
        case 0: //年柱
            position = 3 + offset;
            return position;
            break;
        default:
            return 0;
    }
}


function 干支克應分析(命盤){
    var 天干字串 = "天干," + 命盤.時干.天干 + "," + 命盤.日干.天干 + ","+ 命盤.月干.天干 + "," + 命盤.年干.天干;
    var 地支字串 = "地支," + 命盤.時支.地支 + "," + 命盤.日支.地支 + ","+ 命盤.月支.地支 + "," + 命盤.年支.地支;
    var 四柱字串="四柱, 時柱, 日柱, 月柱, 年柱";

    var 干支克應矩陣=[];
    干支克應矩陣= RemoveColumnFromArray(命盤.分析句.刑冲合會害矩陣, 5);
    干支克應矩陣.unshift(地支字串);
    干支克應矩陣.unshift(天干字串);
    干支克應矩陣.unshift(四柱字串);

    var 干支克應註解 = SpliceColumnFromArray(命盤.分析句.刑冲合會害矩陣, 5, "Yes"); //remove column 1-4, left 5, should it is empty, exclude it
    var 干支克應註解單 = Array2UnorderedList(干支克應註解);

    //ArryToTable(dataarry, tablename, colwidtharry, rowheight, captionstr)
    //var 年干坐基={ "因素": "坐基", "條件": 命盤.年柱.干支, "形態": 六十干支屬性(命盤.年柱.干支, "干支關係"), "力度加減": 六十干支屬性(命盤.年柱.干支, "天干力度")*命盤.系統參數.運算.干支基數};
    var ArryTblProp = {
        "Caption": true, //with caption
        "CaptionStr": "干支的刑冲合會害表",
        "CaptionCSS": "TableCaptionCSS",
        "TableTitle": "",
        "RowHeight": 24, //px
        "ColumnWidth": [100, 100, 100, 100, 100], //width for each column
        "HighligtedRow": [],
        "HighligtedCSS": "",
        "FirstRowIsTitle": true,
        "FirstColIsTitle": true,
        "RowTitleCSS": "",
        "ColTitleCSS": ""
    };

    var 地支干支克應表 = ArryToTable(干支克應矩陣, ArryTblProp);

    return 地支干支克應表+干支克應註解單;
}


function 天干五合註解分析(命盤){
    var 天干五合總結=[];
    var 天干五合句子;

    //***************** 天干五合分析註解 *******************
    for (var i = 0; i < 命盤.分析.刑冲合會害表.length; i++) {
        var 克應發生 = 命盤.分析.刑冲合會害表[i][0]; //是發生在天干或地支
        var 克應干支 = 命盤.分析.刑冲合會害表[i][2];
        var 克應方式=命盤.分析.刑冲合會害表[i][16]; //克應的方式，比方半合，干合，相刑，相冲
        var 合化間隔 = 命盤.分析.刑冲合會害表[i][8];
        var 合柱 = 命盤.分析.刑冲合會害表[i][7];
        var 合化 = 命盤.分析.刑冲合會害表[i][3];

        if (克應方式=="干合" && 合化間隔==1) 天干五合總結.push(天干合化註解(克應干支, 合柱, 合化, 合化間隔, 命盤));
    }

    if (天干五合總結.length > 0) {
        var 論斷項目= '<span class = "本命論斷項目">天干五合：</span>';
        天干五合總結.unshift(論斷項目);
        return 天干五合總結.join("<br><br>");
    }
    else return "";
}

// -----------------------------------------------------------------------------------------------------------------------



function 十神刑冲合害論斷(命盤){
    var 冲過的十神 = []; //論斷過的十神刑冲合會害
    var 十神刑冲合害矩陣 = [];

    //****************** 十神被冲 **************************
    if(十神刑冲合害("食神", "地支", "冲", 命盤) && (_.indexOf(冲過的十神, "食神") == -1)){
        十神刑冲合害矩陣.push("食神逢沖，幼年時，母親身體衰弱，無乳。");
        冲過的十神.push("食神");
    }

    if(十神刑冲合害("正財", "地支", "冲", 命盤) && (_.indexOf(冲過的十神, "正財") == -1)){
        十神刑冲合害矩陣.push("正財被冲，多苦心積慮，創業營謀艱辛。");
        冲過的十神.push("正財");
    }

    if(十神刑冲合害("正官", "地支", "冲", 命盤) && (_.indexOf(冲過的十神, "正官") == -1)){
        十神刑冲合害矩陣.push("正官被沖，落魄不遇。");
        冲過的十神.push("正官");
    }

    if(十神刑冲合害("正印", "地支", "冲", 命盤) && (_.indexOf(冲過的十神, "正印") == -1)){
        十神刑冲合害矩陣.push("正印被沖，學業中斷，和母親緣薄或有文書是非。");
        冲過的十神.push("正印");
    }

    if (命盤.性別 == "女") {
        if(十神刑冲合害("正官", "地支", "冲", 命盤) || 十神刑冲合害("七殺", "地支", "冲", 命盤)) 十神刑冲合害矩陣.push("女命四柱有正官、七殺被冲，夫緣容易發生變化。");
        if(十神刑冲合害("食神", "地支", "冲", 命盤) || 十神刑冲合害("食神", "地支", "刑", 命盤)) 十神刑冲合害矩陣.push("女命四柱有食神，且被刑冲，夫女緣薄。");
        if((十神刑冲合害("正官", "干支", "冲", 命盤) || 十神刑冲合害("七殺", "干支", "冲", 命盤)) && 十神刑冲合害("食神", "干支", "合", 命盤)) 十神刑冲合害矩陣.push("正官、七殺之四柱有被沖之女子，而食神有合者，丈夫運較不平穩（依子而破夫之運）。");
        if(命盤.分析.四柱.四柱數據[2].相冲 !="" && 命盤.分析.四柱.干合 >0) 十神刑冲合害矩陣.push("日柱有冲，而四柱有干合之女命，勞苦不絕，多有感情困擾。");
    }

    // ************************************************
    if (十神刑冲合害矩陣.length > 0) {
        return 十神刑冲合害矩陣.join("<br>");
    }
    else return "";
}

function 各柱相合註解(柱對,命盤, 干或支, 合的方式){
    var 相合註解 = [];

    var 柱1=柱對.substr(0,1);
    var 柱2=柱對.substr(1,1);
    var 柱名1=四柱名稱(柱1);
    var 柱名2=四柱名稱(柱2);
    var 克應柱子;

    switch(干或支){
        case "地支":
            //alert(柱1 + " / " + 柱2);
            var 十神1 = 四柱屬性(命盤, Number(柱1), "地支十神1");
            var 十神2 = 四柱屬性(命盤, Number(柱2), "地支十神1");
            break;
        case "天干":
            var 十神1 = (柱1!="2")?四柱屬性(命盤, Number(柱1), "天干十神"):"日主";
            var 十神2 = (柱2!="2")?四柱屬性(命盤, Number(柱2), "天干十神"):"日主";
            break;
        default:
            alert(干或支 + "：干支克應錯誤 ！！");
    }

    克應柱子 = 干或支+柱名1 + "（" + 十神1 + "）與" + 柱名2 + "（" + 十神2 + "）"+合的方式+"，";
    switch(柱對){
        case "01":case "10": //年月柱
            克應句子 = 克應柱子 + "家庭觀念強，對妻兒盡職。易受長輩幫助，有長輩緣，易被上司提攜器重。孝順，有老人緣。"
            相合註解.push(克應句子);
            break;
        case "12": case "21": //月日柱
            克應句子 = 克應柱子 + "自我觀念強，凡事先考慮自己。與配偶合得來，會在意對方。事業上有自己的主見，容易滿足於現狀，愛打扮。"
            相合註解.push(克應句子);
            break;
        case "23": case "32": //日時柱
            克應句子 = 克應柱子 + "工作態度曖昧，做事不積極。配偶對事業有助力。若創業，會堅守下去。"
            相合註解.push(克應句子);
            break;
        case "13": case "31": //月時柱
            克應句子 = 克應柱子 + "敬業，很在意他的事業。若他做有興趣的事業，都會做很久，不輕易改變。在意孩子、員工、晚輩。"
            相合註解.push(克應句子);
            break;
        case "02": case "20": //年日組
            克應句子 = 克應柱子 + "配偶長相佳，父母與配偶合得來，創業時宜聽取長輩、上司的意見。"
            相合註解.push(克應句子);
            break;
        case "03": case "30": //年時組
            克應句子 = 克應柱子 + "長輩、上司對家庭、事業有幫助。會包裝自己，不易透露心事。"
            相合註解.push(克應句子);
            break;
        default:
            alert(柱對 + "：各柱相合柱錯誤 ！！");
    }
    
    if(相合註解.length>0){
        相合註解.join("<br>");
        return 相合註解;
    }
}

function 各柱相冲註解(柱對,命盤,干或支,冲的方式,克應干支){
    var 相冲註解 = [];

    var 柱1=柱對.substr(0,1);
    var 柱2=柱對.substr(1,1);
    var 柱名1=四柱名稱(柱1);
    var 柱名2=四柱名稱(柱2);
    var 克應柱子;

    switch(干或支){
        case "地支":
            //alert(柱1 + " / " + 柱2);
            var 十神1 = 四柱屬性(命盤, Number(柱1), "地支十神1");
            var 十神2 = 四柱屬性(命盤, Number(柱2), "地支十神1");
            break;
        case "天干":
            var 十神1 = (柱1!="2")?四柱屬性(命盤, Number(柱1), "天干十神"):"日主";
            var 十神2 = (柱2!="2")?四柱屬性(命盤, Number(柱2), "天干十神"):"日主";
            break;
        default:
            alert(干或支 + "：干支克應錯誤 ！！");
    }

    克應柱子 = 干或支+柱名1 + "（" + 十神1 + "）與" + 柱名2 + "（" + 十神2 + "）"+冲的方式+"，";
    switch(柱對){
        case "01":case "10": //年月柱
            克應句子 = 克應柱子 + "原生家庭觀念易淡薄，個性衝動，大都遠離祖業，離家工作，家業難繼，祖先遺產較無福消受，在他鄉建立事業者多。和長輩或上司容易意見不合。"
            相冲註解.push(克應句子);
            break;
        case "12": case "21": //月日柱
            克應句子 = 克應柱子 + "本人情緒較不安定，不喜受束縛，反覆，易罹疾患。和配偶較有意見看法不同，夫妻易多有衝突，或配偶與家族相處較不愉快。單身，相親比較難成功，也比較不喜歡別人介紹對象。兄弟易不睦。"
            相冲註解.push(克應句子);
            break;
        case "23":case "32": //日時柱
            克應句子 = 克應柱子 + "配偶對命主的事業較有意見或干涉，注意夫妻之間意見衝突。配偶容易和小孩溝通不良，或是教育孩子的方法不同。"
            if (命盤.性別 == "男") 克應句子 = 克應句子 + "男命，事業上配偶最好不要插手。";
            if (命盤.性別 == "女") 克應句子 = 克應句子 + "女命易流產。";
            if (命盤.性別 == "男" && (克應干支=="辰戌" || 克應干支=="戌辰")) 克應句子 = 克應句子 + "男命日與時有辰戌之冲，多女兒，沒有孩子。";
            if (命盤.性別 == "女" && (克應干支=="辰戌" || 克應干支=="戌辰")) 克應句子 = 克應句子 + "女命日與時有辰戌之冲，多陷於孤寡。";
            相冲註解.push(克應句子);
            break;
        case "13": case "31": //月時柱
            克應句子 = 克應柱子 + "對事業有衝動，勿虎頭蛇尾，事業比較不穩定。本身比較容易跟孩子或部屬有看法不同或意見。"
            相冲註解.push(克應句子);
            break;
        case "02": case "20": //年日組
            克應句子 = 克應柱子 + "父母對配偶比較有意見。長輩、上司會督促與干預命主的事業。"
            相冲註解.push(克應句子);
            break;
        case "03":case "30": //年時組
            克應句子 = 克應柱子 + "長輩對事業較有意見。子女易好動，父母較無法幫忙命主帶孩子。"
            相冲註解.push(克應句子);
            break;
        default:
            alert(柱對 + "：各柱相冲柱錯誤 ！！");
    }
    
    if(相冲註解.length>0){
        相冲註解.join("<br>");
        return 相冲註解;
    }
}

function 天干合化註解(五合干支, 合柱, 合化, 合化間隔, 命盤) {
// *********************
    //var 合化間隔 = 命盤.分析.刑冲合會害表[i][8];
    //var 合柱 = 命盤.分析.刑冲合會害表[i][7];
    //var 合化 = 命盤.分析.刑冲合會害表[i][3];
    var 天干五合註解 = [];
    var 隔合 = ["", "緊貼", "隔合", "遙合"];

    switch (五合干支) {
        case "甲己":
            天干五合註解.push("甲己之合，稱之「中正之合」，四柱之中帶有此合者，大都安分守己，心思廣大，度量寬宏，能接納他人，厚重，德行高尚，凡事隨和，故能受世人敬愛其性，仰慕其德。");
            天干五合註解.push("甲己合之人，一板一眼，不會說好聽的話，不懂生活情趣，不解風情。");
            天干五合註解.push("*化氣之土若無氣時，而又帶殺者，旣無情義，又不知恥，無義務觀念，爲人自我心強，且薄情，易怒，詭譎。");
            if (命盤.系統參數.設定.Access > 5) 天干五合註解.push("甲己合化相關的疾病為結石，瘤，癌。");
            if (命盤.分析.天干.天干數據[天干字轉值("丁")].天干 > 0 && 命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 0) 天干五合註解.push("命中忌有丁壬來合干，凶相暗伏。");

            if (命盤.日主 == "甲" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>甲日合己化土，五常爲信義，惟土尅水，水主智，智被尅，故爲人重信義，但乏智力。生於甲日之人，因爲能將土化為我己之土，因此都爲仁信兼備，性格溫厚，仁慈，明辨善惡曲直，擇善固執，能匡正他人之惡，溫文有禮，聰穎過人，能廣孚衆望。");
                天干五合註解.push("*如果是妒合偏枯的情況，則會失去謙讓之心，有些人則會變成陰險狡詐，獨善排他。");
                if (命盤.分析.天干.天干數據[天干字轉值("乙")].天干 > 0) 天干五合註解.push("他干見乙者會尅夫、妻。");
                if (命盤.分析.天干.天干數據[天干字轉值("丁")].天干 > 0) 天干五合註解.push("他干見丁者減損資財。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛必受長上提拔。");
                if (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 > 0) 天干五合註解.push("他干見戊者富貴幸福。");
                if (命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0) 天干五合註解.push("他干見癸者平安。");
                if (命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 0) 天干五合註解.push("他干見壬者一生漂泊變轉。");

                if (命盤.月干.天干 == "庚") 天干五合註解.push("生月干見庚者，家族離散。");
                if (命盤.時干.天干 == "丙") 天干五合註解.push("生時干見丙者，大發達之命。");
            }

            if (命盤.日主 == "己" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>己日合甲化土，爲土之不足，又土不及必被木所尅制，因此，此人欠信義，面相鼻低無力，聲音重濁。");
                if (命盤.分析.天干.天干數據[天干字轉值("乙")].天干 > 0) 天干五合註解.push("他干見乙者自陷困境。");
                if (命盤.分析.天干.天干數據[天干字轉值("丁")].天干 > 0) 天干五合註解.push("他干見丁必爲他人之事受辱。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛者富貴。");
                if (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 > 0) 天干五合註解.push("他干見戊而藏干見癸者亦得享幸福。");
                if (命盤.分析.天干.天干數據[天干字轉值("丙")].天干 > 0) 天干五合註解.push("他干見丙而藏干見辛者爲貴命。");
                if (命盤.分析.天干.天干數據[天干字轉值("庚")].天干 > 0) 天干五合註解.push("他干見庚貧苦。");
                if (命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0) 天干五合註解.push("他干見癸者宦途榮晉。");
                if (命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 1 || (命盤.年柱.干支 == "壬子" || 命盤.月柱.干支 == "壬子" || 命盤.時柱.干支 == "壬子")) 天干五合註解.push("見壬兩個或干見壬子者困苦重重。");
            }
            break;
        case "乙庚":
            天干五合註解.push("乙庚之合，稱之「仁義之合」，有此合者，每都果敢強健，剛柔兼備，富仁義之心，做事積極進取，操守堅定，不屈不撓，重視規律，此仁義之合也。");
            天干五合註解.push("乙庚合之人，不懂生活情趣，不解風情。");
            天干五合註解.push("*四柱之中若有偏官或逢宿宮星之死、絕者，則成勇而風采不揚之下賤性質。");
            if (命盤.系統參數.設定.Access > 5) 天干五合註解.push("乙庚合化相關的疾病為膽結石，頭痛，神經痛。");

            if (命盤.分析.地支.地支數據[地支字轉值("寅")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("午")].數量 > 0 && 命盤.分析.地支.地支數據[地支字轉值("戌")].數量 > 0) 天干五合註解.push("乙庚合，乃怕火炎，遇寅午戌則爲下格，隨緣奔走覓糧食。");
            // should add if 火太大, 都不宜, not just 寅午戌

            if (命盤.日主 == "乙" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>乙日合庚化金，爲金之不足，又金不足，必被火制抑，而五常以金爲義，火爲禮，故此人欠缺決斷力，無禮。");
                if (命盤.分析.天干.天干數據[天干字轉值("丙")].天干 > 0) 天干五合註解.push("他干見丙者，萬事澀滯。");
                if (命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 0) 天干五合註解.push("他干見壬者能逐漸發展。");
                if (命盤.分析.天干.天干數據[天干字轉值("丁")].天干 > 0) 天干五合註解.push("他干見丁者諸事順調如意。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛者運勢頹廢。");
            }

            if (命盤.日主 == "庚" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>庚日合乙化金，爲金之太過，惟金尅木，木主仁，仁被尅則爲人較無慈悲心，且常誇張，又牙齒強硬爲其特徵。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛者常罹災害。");
                if (命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 0) 天干五合註解.push("他干見壬則增財。");
                if (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 > 0) 天干五合註解.push("他干見見戊者大富。");
                if (命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0) 天干五合註解.push("他干見癸者蕩盡財產。");
            }
            break;
        case "丙辛":
            天干五合註解.push("丙辛之合，稱之「威嚴之合」，命中有此五合之人，個性強，儀表威嚴，獨善其身，脾氣古怪乖僻之傾向，好色，同時也擅用權術詐謀。");
            天干五合註解.push("丙辛之人，重情趣，重視心靈上的享受，喜歡年輕的異性，較易偷情。");
            天干五合註解.push("*四柱之中有七殺而居死絕者，反而性酷薄情，不知恩。");

            if (合化 != "") { if (命盤.分析.四柱.四柱數據[1].相冲 != 0 || 命盤.分析.四柱.四柱數據[Number(合柱.substr(0, 1))].相冲 != 0 || 命盤.分析.四柱.四柱數據[Number(合柱.substr(1, 1))].相冲 != 0) 天干五合註解.push("*丙辛化水，支逢冲者主多淫。"); }
            if (命盤.分析.地支.地支數據[地支字轉值("辰")].數量 > 0) 天干五合註解.push("丙辛合，若能擁有壬水之辰庫，則爲貴，表示有智慧，禮儀兼修，有吉慶之兆。");
            if (命盤.系統參數.設定.Access > 5) 天干五合註解.push("丙辛合化相關的疾病為胃出血，發炎。");

            if (命盤.日主 == "丙" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>丙日合辛化水，爲水之太過，水如過多則會尅火，而五常以水爲智，火爲禮，禮被損，則禮儀必亂，因此這種人都智略多謀，反招譎詐，又禮易亂。");
                if (命盤.分析.天干.天干數據[天干字轉值("己")].天干 > 0) 天干五合註解.push("他干見己者雖是得榮達亦難保長久。");
                if (命盤.分析.天干.天干數據[天干字轉值("乙")].天干 > 0) 天干五合註解.push("他干見乙者大發達，*又見丁者破財。");
                if (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 > 0) 天干五合註解.push("他干見戊者地位高昇，且得信譽。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛者，呈現吉慶。");
            }

            if (命盤.日主 == "辛" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>辛日合丙化水，為水之不及。水不及則易被土尅壓，如是者此人不能用智，自然不能懷大志大望，其身體亦多矮小。");
                if (命盤.分析.天干.天干數據[天干字轉值("丁")].天干 > 0) 天干五合註解.push("他干見丁者反招傷害疾病之厄。");
                if (命盤.分析.天干.天干數據[天干字轉值("戊")].天干 > 0) 天干五合註解.push("他干見戊者一生幸福榮華。");
            }
            break;

        case "丁壬":
            天干五合註解.push("丁壬之合，稱之「仁壽之合」，有此合者，多主仁壽，但壬水向下流，丁爲陰火，陰暗，不照三光，無論男女，均有好色，妖媚，淫邪，有失高潔，嫉妒心強，有敗亂家庭的傾向，其一生之命運吉凶參半。");
            天干五合註解.push("丁壬之人，重品位、情調，懂生活情趣，風情萬種，講究穿著，非常有異性緣，喜歡年輕的人異性。");
            天干五合註解.push("此合雖爲英雄，但有耽溺於色情之虞，因此丁壬之合亦稱爲「淫匿之合」。");
            天干五合註解.push("*自坐死絕者，易因酒色破家。如偏枯而死絕之命，若有庚之尅制其毒，使成爲乙制亦佳，或者亦可洩丙。");
            if (命盤.系統參數.設定.Access > 5) 天干五合註解.push("丁壬合化相關的疾病為心藏，糖尿病。");

            if (命盤.日主 == "丁" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>丁日合化木，爲木之不及，木主仁不及則被金抑制，不能施木之仁，故此人小心且嫉妒心強，身材高而體痩。");
                if (命盤.分析.天干.天干數據[天干字轉值("丙")].天干 > 0) 天干五合註解.push("他干見能丙者，生涯厚福之命。");
                if (命盤.分析.天干.天干數據[天干字轉值("乙")].天干 > 0) 天干五合註解.push("他干見乙則要防破財。");
                if (命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0) 天干五合註解.push("他干見癸即苦勞不絕。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛則一生安泰快樂。");
            }

            if (命盤.日主 == "壬" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>壬日合丁，爲木之太過，惟木強則會尅土，土之信被破則必破信義，因此，此人性質古怪偏倔又易怒，缺乏信用。");
                天干五合註解.push("<br>生於壬日之人，膚色略黑，身長之人爲多，木太過即身體高大。");
                if (命盤.分析.天干.天干數據[天干字轉值("甲")].天干 > 0) 天干五合註解.push("他干見甲者，則能擁有許多部下或佣人。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛者富於田園。");
                if (命盤.分析.天干.天干數據[天干字轉值("丙")].天干 > 0) 天干五合註解.push("他干見丙者有英雄素質。");
                if (命盤.分析.天干.天干數據[天干字轉值("癸")].天干 > 0) 天干五合註解.push("他干見癸者苦心常纏矣。");

                if (命盤.時支.地支 == "辰") 天干五合註解.push("生時有甲木辰的水庫，則可得中和，有如流水般聰明睿智，思慮周詳，機智靈敏，學問淵博，有木氣的仁慈，能辨曲直，有發明創造之能力，可供安身。");
            }
            break;

        case "戊癸":
            天干五合註解.push("戊癸之合，稱之「無情之合」，命中有此合者，則大都爲冷靜理智之人。這種人多半聰明過人，同時，無論男女，皆外貌出衆，容姿端正，但是卻有沈默寡言，缺乏人情味的缺點，因比較缺乏和氣，氣氛比較冷淸。");
            天干五合註解.push("戊癸之人，容易翻臉，易生氣，氣過後便沒事。喜歡成熟的異性，重情趣，但無情見錢眼開，馬上翻臉，不宜有金錢來往。");
            天干五合註解.push("女性大多由於貌美之故，外表冷漠，不夠親切，常會耽誤婚期，男性則不婚居多。");
            天干五合註解.push("*命局中火太弱時，薄情寡義，男多抱玩世之心，女命則多嫁俊夫/老夫。");
            if (命盤.系統參數.設定.Access > 5) 天干五合註解.push("戊癸合化相關的疾病為肝病，皮膚。");

            if (命盤.日主 == "戊" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>戊日合癸化火，為火之太過，惟火旺必剋金，故此人雖是聰明，又一見似有情誼，但內心無情。*倘若火太過則性急躁。");
                if (命盤.分析.天干.天干數據[天干字轉值("乙")].天干 > 0) 天干五合註解.push("他干見乙者六親不和睦，但中年以後必發達。");
                if (命盤.分析.天干.天干數據[天干字轉值("壬")].天干 > 0) 天干五合註解.push("他干見壬者幸福。");
                if (命盤.分析.天干.天干數據[天干字轉值("己")].天干 > 0) 天干五合註解.push("他干見己者有尅妻之嫌。");
            }

            if (命盤.日主 == "癸" && 命盤.系統參數.設定.Access > 5) {
                天干五合註解.push("<br>癸日合戊，爲火之不足，火主禮不及被水所尅，則不能施火之禮，因此，此人智力不足，作事有始無終，且嫉妒心亦強。又身體痩而外表古僕，男命常娶異省之婦，女命常嫁老夫。");
                if (命盤.分析.天干.天干數據[天干字轉值("辛")].天干 > 0) 天干五合註解.push("他干見辛者多破敗。");
                if (命盤.分析.天干.天干數據[天干字轉值("丁")].天干 > 0) 天干五合註解.push("他干見丁者得財帛。");
                if (命盤.分析.天干.天干數據[天干字轉值("庚")].天干 > 0) 天干五合註解.push("他干見庚者必發達。");
                if (命盤.分析.天干.天干數據[天干字轉值("乙")].天干 > 0) 天干五合註解.push("他干見乙者能富裕。");
            }
            break;
        default:
            alert(五合干支 + "：天干五合的輸入天干錯誤 ！");
            return "";
    } // end switch

    if (合化間隔 > 1) 天干五合註解.push(五合干支 + "合為" + 隔合[合化間隔] + "，因此特性不會太明顯。");
    return 天干五合註解.join("<br>")+"<br>";
}


function 三合註解(三合地支, 合出的十神, 命盤) {
    var 三合矩陣 = [];
    var 三合格局, 克應句子;

    switch (三合地支) {
        case "寅午戌": case "寅戌午": case "午寅戌": case "午戌寅": case "戌寅午": case "戌午寅": 
            三合格局 = "三合火";
            break;
        case "巳酉丑": case "巳丑酉": case "酉巳丑": case "酉丑巳": case "丑巳酉": case "丑酉巳": 
            三合格局 = "三合金";
            break;
        case "申子辰": case "申辰子": case "子申辰": case "子辰申": case "辰申子": case "辰子申": 
            三合格局 = "三合水";
            break;
        case "亥卯未": case "亥未卯": case "卯亥未": case "卯未亥": case "未亥卯": case "未卯亥": 
            三合格局 = "三合木";
            break;
        default:
            alert(三合地支 + "：三合沒有對應的註解");
            三合格局 = "";
            break;
    }

    switch (三合格局) {
        case "三合木":
            三合矩陣.push("命局有亥卯未之三合木者，卯木得亥生而納入未之木庫，則命局不懼金剋。這樣的人有勤奮之氣魄，個性活潑，心胸開朗，思慮深遠，具創造力，重道德，具仁義，有包容之心胸與先見之明。木局乃勞苦之積累，自己不斷努力之後終有光榮之成果，不會主動去助人，但也不求他人之助。比較喜歡幻想，不切實際，心地軟，計畫一堆，大部分無法實現。");
            if(命盤.日主五行=="土") 三合矩陣.push("<br>日主屬土，殺強而身弱，凡事多阻滯，謀事宜三思。");
            break;

        case "三合火":
            三合矩陣.push("命局有寅午戌之三合火者，午火得寅生而納入戌之火庫，則午火之光輝燦爛，照耀大地，固有旺盛之陽氣，而能急進發展，但速進亦速退。火局光芒四射，普照大地，速成速退，生涯多變化。為人熱情，前熱後冷，行動派，急性子。");
            if(命盤.日主五行=="金") 三合矩陣.push("<br>日主屬金，殺強而身弱，凡事多阻滯，謀事宜三思。");
            break;

        case "三合金":
            三合矩陣.push("命局有巳酉丑之三合金者，巳火煉金成製品後納入丑之金庫。其人精明能幹，積極進取，心胸寬大，講究義氣，身體健康，皮膚白皙。金局火金鍛煉成器入庫，故早年辛苦，大器晚成。外表威嚴較酷，會強出頭，較易有血光之災，且會包裝自己，講話會修飾。");
            if(命盤.日主五行=="木") 三合矩陣.push("<br>日主屬木，殺強而身弱，凡事多阻滯，謀事宜三思。");
            break;

        case "三合水":
            三合矩陣.push("命局中有申子辰之三合水者，子水得申生而納入辰之水庫，則命局不懼土剋。其人必智慮深遠，能謀善略，意志堅強，具領袖之才能。但易有桃色糾紛。水局潺潺流水，細而不止，終能水到渠成，開花結果。思想變化上很快，也很聰明，但較冷漠自私。");
            if(命盤.日主五行=="火") 三合矩陣.push("<br>日主屬火，殺強而身弱，凡事多阻滯，謀事宜三思。");
            break;
    }

    三合矩陣.push("<br>"+合會十神註解(合出的十神,命盤.性別));
    return 三合矩陣.join("<br>");
}

function 六合註解(六合地支, 命盤) {
    var 六合矩陣 = [];
    var 六合原理, 六合註解, 六合病原;

    switch (六合地支) {
        case "子丑":case "丑子":
            六合原理 = "子與丑合，子水為陽，丑土為陰，好比一個男人聽從女人，所以為逆合，遷就之意。子水雖然合土，但是被丑土剋制，感覺不舒服，所以容易出現問題，為先好後壞之暗示。";
            六合註解 = "<br>子、丑合土，逆合、湊合。婚姻兩人湊合過，不美滿，也只違背意願的遵從，不情願，因為丑土來合子水，子水沒有辦法，才順從丑土。";
            六合病原 = "<br>子丑合，論疾病，因為丑土剋制子水，水、土混雜，主容易出現腎病、皮膚之病。";
            六合矩陣.push(六合原理+六合註解+六合病原);
            break;
        case "寅亥":case "亥寅":
            六合原理 = "亥水生寅木，是有情相生之象，是陰從陽之象，所以從寅木，化木。亥水生寅木，但是亥中壬水剋制寅中丙火，所以為破合。";
            六合註解 = "<br>亥、寅合木，破合，主貴人幫助有力量，但是容易中間有所損耗的情形。論婚姻，為生合，表示男女相互間感情很不錯，但是容易也有其他的想法。此外亥水為思想，寅、亥為驛馬地，也多主走動、出門兩地經常分開之意。";
            六合病原 = "<br>寅亥合，論疾病，容易出現意外疾病的信息。";
            六合矩陣.push(六合原理+六合註解+六合病原);
            break;
        case "卯戌":case "戌卯":
            六合原理 = "卯木太衝，主無自控能力、意志不堅定、缺乏主見。卯木剋戌土，是合中帶剋之象。取通關有情，卯木生火，火生戌土，化火。卯為少女，戌為老人，所以主有淫合之意思。卯為草木，戌為火庫，卯去合戌進了火庫而招自焚。";
            六合註解 = "<br>卯、戌合火，淫合，自焚之象，在婚姻方面，容易出現未婚同居，或者有二婚、意外的桃花等信息。";
            六合病原 = "<br>卯戌合，論疾病，卯木剋制戌土，容易出現脾、胃方面較不利的情況。";
            六合矩陣.push(六合原理+六合註解+六合病原);
            break;
        case "辰酉":case "酉辰":
            六合原理 = "辰土生酉金，是有情相生之象，是陽從陰之象，所以從酉金，化金。辰土全力生扶酉金，所以為暗合。";
            六合註解 = "<br>辰、酉合金，暗合、陰私之合，在事業上容易多得貴人幫助，人緣好。在感情方面容易私下定，不公開，也主異性緣份好，能得到異性的追求。";
            六合病原 = "<br>辰酉合，論疾病，酉制了辰中乙木，主四肢與肝、膽方面較易有不利的狀況。";
            六合矩陣.push(六合原理+六合註解+六合病原);
            break;
        case "巳申":case "申巳":
            六合原理 = "巳火剋申金，是合中帶剋之象，而且巳又刑申（無恩之刑）。這是無情之象，巳火欺凌申金太甚，所以取申金所生之水剋制巳火凶焰，化水。因巳火剋制申金，寅、巳、申三刑，所以為刑合。";
            六合註解 = "<br>巳、申合水，刑合，有矛盾、意見紛紜的暗示，在事業上，雖然有共同的目標、目的，但是容易有各懷鬼胎，自己的小算盤的情況。也主容易出矛盾，意見多、爭吵等信息。在感情方面容易在一起就吵，分開又會想的意思。";
            六合病原 = "<br>巳申合，論疾病，容易出現心臟、肺病，意外發展的傷害等信息。";
            六合矩陣.push(六合原理+六合註解+六合病原);
            break;
        case "午未":case "未午":
            六合原理 = "";
            六合註解 = "午、未合，是午火生未土，為明合，主公開、實心實意，毫不遮掩。也主在事業發展與己合作之人彼此間互動較為融洽、真誠，雙方能相互支持、信任。在婚姻方面也主感情穩定，較能坦誠相見。";
            六合病原 = "<br>午未合，論疾病，表現為土燥，容易出現皮膚不好佳的情形，特別是四肢手腳方面。";
            六合矩陣.push(六合原理+六合註解+六合病原);
            break;
        }
    return 六合矩陣.join("<br>");
}

function 合會十神註解(十神,性別){
    switch(十神){
        case "比肩":
            return "三支會合化作比肩，無論置身何處，總有好友相隨，形如一家，不會孤單。";
            break;
        case "劫財":
            return "三支會合化作劫財，事業自有人助，但應慎防錢財被人侵占，或配偶緣分惡化。";
            break;
        case "食神":
            return "三支會合化作食神，可獲多方面的援助，資金充裕，經營順利。";
            break;
        case "傷官":
            return "三支會合化作傷官，獨立創業或從事技藝工作都能成功，若進入仕途或靠薪資維生，則欠理想。";
            break;
        case "正財":
            var 合會十神註解 = "三支會合化作正財，金錢始終充裕，縱然赤手空拳，資金周轉亦得心應手。";
            if (性別 == "男") 合會十神註解 = 合會十神註解 + "男命也艷福不淺。";
            合會十神註解 = 合會十神註解 + "<br>*三合局化財為財旺，財為喜用者，則利商賈運營，財多利厚，多得人和之利，多得妻利，女人之利，富貴悠悠。財為忌仇者，多被財物所困累，多被妻和女人所累；凡生災咎，也多因財或女人所致，一生奔波勞碌。";
            return 合會十神註解;
            break;
        case "偏財":
            var 合會十神註解 = "三支會合化作偏財，各地支支助不斷，從商則生意鼎盛，周轉靈活，左右逢源。";
            合會十神註解 = 合會十神註解 + "<br>*三合局化財為財旺，財為喜用者，則利商賈運營，財多利厚，多得人和之利，多得妻利，女人之利，富貴悠悠。財為忌仇者，多被財物所困累，多被妻和女人所累；凡生災咎，也多因財或女人所致，一生奔波勞碌。";
            return 合會十神註解;
            break;
        case "正官":
            var 合會十神註解 = "三支會合化作正官，適合擔任管理職務，諸如董事長、局長、部長、校長等職位。此外，能繼承家業。";
            合會十神註解 = 合會十神註解 + "<br>*三合局化官為官旺，官為喜用者，則利仕途揚鞭，多得人和之利，多得他人提攜，官運亨通。若官為忌仇者，居官在位者，多被名利、權勢所困、所累；平民百姓者，一生多官非口舌，膽小懦弱，病傷不斷。";
            return 合會十神註解;
            break;
        case "七殺":
            var 合會十神註解 = "三支會合化作七殺，在社會上能得眾望，常居人上，或是江湖老大、單位主管、工廠廠長、或是高級領導。但是身體虛弱者，難免患病。";
            合會十神註解 = 合會十神註解 + "<br>*三合局化官為官旺，官為喜用者，則利仕途揚鞭，多得人和之利，多得他人提攜，官運亨通。若官為忌仇者，居官在位者，多被名利、權勢所困、所累；平民百姓者，一生多官非口舌，膽小懦弱，病傷不斷。";
            return 合會十神註解;
            break;
        case "正印":
            var 合會十神註解 = "三支會合化作正印，事業發達，分支機構多，與各地或國外生意往來頻繁，或為工業技術人員、學者、藝術家都能有成。";
            合會十神註解 = 合會十神註解 + "<br>*三合局化印為印旺，印為喜用者，多主文貴，多利文教、仕途。為忌仇者，靠山多而無靠山，難以自立成事。";
            return 合會十神註解;
            break;
        case "偏印":
            var 合會十神註解 = "三支會合化作偏印時，從事特殊行業（葬儀社、清潔服務社、酒家及特殊技術等），成功有望。";
            合會十神註解 = 合會十神註解 + "<br>*三合局化印為印旺，印為喜用者，多主文貴，多利文教、仕途。為忌仇者，靠山多而無靠山，難以自立成事。";
            return 合會十神註解;
            break;
    }
}

function 六冲註解(相冲地支, 命盤) {
    var 六冲矩陣 = [];

    switch (相冲地支) {
        case "子午": case "午子":
            var 克應句子 = "子午為桃花冲，人緣好、好勝、不服輸、個性極端，心性不穩定，易有感情問題，一生不安定。";
            if (命盤.性別 == "女") 克應句子 = 克應句子 + "女性通常都長得漂亮。";
            六冲矩陣.push(克應句子);
            六冲矩陣.push("本命子午相冲，預防抵抗力不足、癌症、手腳冰冷、血壓疾病、腹疾、心腎功能損壞、敗血症。");
            break;
        case "丑未": case "未丑":
            var 克應句子 = "丑未為財庫冲，恃勢之刑，主觀意識強烈，鑽牛角尖，追根究底，較易與人吵架，凡事多阻逆、猶豫，切勿自大。財庫衝開，錢財留不住，難聚財，易流失小財。";
            if (命盤.性別 == "女") 克應句子 = 克應句子 + "女命易流產。";
            六冲矩陣.push(克應句子);
            六冲矩陣.push("本命丑未相冲，預防脾、肺、腹脹、嘔吐、食慾不振、腹痛、精血虛弱 、胃病、肝病、出汗、惡寒。");
            break;
        case "寅申": case "申寅":
            var 克應句子 = "寅申為驛馬冲，無恩之刑，閒不住，勞碌命。個性較直率，多疑不決，多情，愛管閒事。吉則善經商之道；兇時信神信鬼。六親較無緣，靠自己，對人付出，卻不容易得到感激。適合外務，東奔西跑。喜歡飚車，有車關，易生車禍。*八字有寅申沖的人，大都相信鬼神之說，對人生有深刻的體驗，有些人是天生的陰陽眼、靈媒。";
            六冲矩陣.push(克應句子);
            六冲矩陣.push("本命寅申相冲，預防腸胃先天不佳、口苦、咽乾、肝膽病、頭痛、暈眩 、口苦咽乾、頭昏目眩、便秘、神經病，易發生交通事故。");
            break;  
        case "卯酉": case "酉卯":
            六冲矩陣.push("卯酉為桃花冲，異性、長輩緣好，個性較不穩定、鐵齒，敏銳、有判斷力、自我感覺良好。有強烈第六感，對外在的人事物感應非常強，較懂得權衡，憑直覺做事。也有可能是靈異體質（尤其是月時冲）。");
            六冲矩陣.push("本命卯酉相冲，預防心肌梗塞、膽胃之症、胃病、肝病、出汗、惡寒。");
            break;
        case "辰戌": case "戌辰":
            var 克應句子 = "辰戌為財庫冲，鐵齒、愛辯、主觀重、脾氣不好、固執、喜當老大、做事野心大。不服輸，較會自圓其說，自找台階，理由多，會將錯就錯，歸咎於別人。財庫衝開，錢財留不住，難聚財，投資易損財。";
            if (命盤.性別 == "男") 克應句子 = 克應句子 + "男命有辰戌冲，易因喜好而破家";
            if (命盤.性別 == "女") 克應句子 = 克應句子 + "女命較不利丈夫子女運勢，或是太重享受喜好等慾望，易有孤獨感。";
            六冲矩陣.push(克應句子);
            var 相冲疾病 = "本命辰戌相冲，預防身體酸痛、頸項、頭痛、失眠、感冒、肺炎、皮膚病、香港腳、小便不利 、惡寒、小腸、膀胱。";
            if (命盤.性別 == "女") 相冲疾病 = 相冲疾病 + "女性卯酉冲，注意胸部病變（肺部，胸部，淋巴）、難產、開刀 。";
            六冲矩陣.push(相冲疾病);
            break;
        case "巳亥": case "亥巳":
            六冲矩陣.push("巳亥為驛馬冲，理智，閒不住，多管閒事，好照顧他人。口才很好，愛聊天，較不服輸，追根究底，得理不饒人，會禍從口出。適合外務，有車關，易生車禍。");
            六冲矩陣.push("本命巳亥相冲，預內臟功能失調、肝、腎兩虧、中風、糖尿病、胃炎、神經痛、糖尿病，上吐下瀉，肝病。");
            break;
        }

        return 六冲矩陣.join("<br>");
}


function 各柱相刑註解(柱對,命盤, 干或支, 刑的方式){
    var 相刑註解 = [];

    var 柱1=柱對.substr(0,1);
    var 柱2=柱對.substr(1,1);
    var 柱名1=四柱名稱(柱1);
    var 柱名2=四柱名稱(柱2);
    var 克應柱子;

    switch(干或支){
        case "地支":
            var 十神1 = 四柱屬性(命盤, Number(柱1), "地支十神1");
            var 十神2 = 四柱屬性(命盤, Number(柱2), "地支十神1");
            break;
        case "天干":
            var 十神1 = (柱1!="2")?四柱屬性(命盤, Number(柱1), "天干十神"):"日主";
            var 十神2 = (柱2!="2")?四柱屬性(命盤, Number(柱2), "天干十神"):"日主";
            break;
        default:
            alert(干或支 + "：干支克應錯誤 ！！");
    }

    克應柱子 = 干或支+柱名1 + "（" + 十神1 + "）與" + 柱名2 + "（" + 十神2 + "）"+刑的方式+"，";
    switch(柱對){
        case "01":case "10": //年月柱
            克應句子 = 克應柱子 + "與長輩、上司有種隔閡的感覺，溝通困難，互相抱怨、折磨，總是很煩。"
            相刑註解.push(克應句子);
            break;
        case "12": case "21": //月日柱
            克應句子 = 克應柱子 + "夫妻關係總是各有心事，易常惹對方生悶氣。"
            相刑註解.push(克應句子);
            break;
        case "23": case "32": //日時柱
            克應句子 = 克應柱子 + "與配偶對子女及事業的看法不一致。"
            相刑註解.push(克應句子);
            break;
        case "13": case "31": //月時柱
            克應句子 = 克應柱子 + "自己與子女或部屬間的彼此協調認同度不夠，會產生誤會或敵對的心態。事業上較放不開。"
            相刑註解.push(克應句子);
            break;
        case "02": case "20": //年日組
            克應句子 = 克應柱子 + "婆媳之間溝通困難，配偶易因長輩的言語而感到鬱悶。"
            相刑註解.push(克應句子);
            break;
        case "03": case "30": //年時組
            克應句子 = 克應柱子 + "長輩與子孫，上司與部屬間有隔閡的感覺。上司對命主工作比較多意見。"
            相刑註解.push(克應句子);
            break;
        default:
            alert(柱對 + "：各柱相刑柱錯誤 ！！");
    }
    
    if(相刑註解.length>0){
        相刑註解.join("<br>");
        return 相刑註解;
    }
}

function 三刑註解(相刑柱, 相刑地支, 命盤) {
    var 三刑矩陣 = [];
    var 刑的格局, 克應句子;

    switch (相刑地支) {
        case "寅巳申": case "寅申巳": case "巳寅申": case "巳申寅": case "申寅巳": case "申巳寅": case "寅巳": case "巳寅": case "寅申": case "申寅": case "巳申": case "申巳":
            刑的格局 = "無恩之刑";
            break;
        case "丑戌未": case "丑未戌": case "戌丑未": case "戌未丑": case "未丑戌": case "未戌丑": case "丑戌": case "戌丑": case "丑未": case "未丑": case "戌未":case "未戌":
            刑的格局 = "恃勢之刑";
            break;
        case "卯子": case "子卯": 
            刑的格局 = "無禮之刑";
            break;
        case "辰辰": case "午午": case "酉酉": case "亥亥": 
            刑的格局 = "自刑";
            break;
        default:
            alert(相刑地支 + "：相刑克應沒有相對的註解");
            刑的格局 = "";
            break;
    }

    switch (刑的格局) {
        case "無禮之刑":
            var 克應句子 = "無禮之刑，有此刑者，性質多暴戾，無視禮節，朋友之間相妒不睦，常常造成別人的不快。沒氣質、沒禮貌、不客氣、不隨便與人交談、直視清高、不喜歡就不理會、脾氣不好。";
            if(尋四柱運星(相刑柱, "死", 命盤) || 尋四柱運星(相刑柱, "絕", 命盤)) 克應句子 = 克應句子 + "有死、絕等星出現，則更是精神酷惡，不孝，有時甚至有傷害親人之惡兆。";
            if (命盤.性別 == "女") 克應句子 = 克應句子 + "女命最忌此刑，主受夫之刑害，翁姑不睦，易有損子。";
            三刑矩陣.push(克應句子);
            break;

        case "無恩之刑":
            var 克應句子 = "無恩之刑，有此刑者，無人賞識，做事易被人嫌棄，替人打天下，任勞任怨，愛恨交加，性情冷酷薄義。";
            if (尋四柱運星(相刑柱, "死", 命盤) || 尋四柱運星(相刑柱, "絕", 命盤)) 克應句子 = 克應句子 + "有死、絕等星出現，則有可能恩將仇報之可能，不講信義，與邪惡同流合污，胡作非為。";
            if (命盤.性別 == "女") 克應句子 = 克應句子 + "婦人有此刑，易孤獨。在懷孕期間，身心有遭苦難之虞。";
            三刑矩陣.push(克應句子);
            三刑矩陣.push("一般而言，命帶寅巳申刑之人，較不利骨肉六親。");
            break;

        case "恃勢之刑":
            var 克應句子 = "恃勢之刑，有此刑者，剛毅，無惻隱之心，太過自信，常會依恃自己的能力，過於猛進，但卻易遭遇挫折，以致失敗。<br>丑刑戌，丑對戌太有信心，認為戌可以幫助自己搞定一切，但往往事與願違。<br>";
            if (尋四柱運星(相刑柱, "長生", 命盤) || 尋四柱運星(相刑柱, "冠帶", 命盤) || 尋四柱運星(相刑柱, "臨官", 命盤) || 尋四柱運星(相刑柱, "帝旺", 命盤)) 克應句子 = 克應句子 + "此刑坐長生、冠帶、建祿、帝旺等旺運同柱，精神剛毅，氣色光潤，能夠獲得福運。";
            if (尋四柱運星(相刑柱, "死", 命盤) || 尋四柱運星(相刑柱, "絕", 命盤)) 克應句子 = 克應句子 + "與死、絕等弱運同柱者，多性情冷酷薄義、缺乏奮鬥精神，品行卑劣，狡猾奸詐，缺乏人性。有些人甚至會遭遇禍害，遭他人妒嫉陷害。";
            if (命盤.性別 == "女") 克應句子 = 克應句子 + "女性帶此刑者，易有損子之虞，且有孤獨之傾向。";
            三刑矩陣.push(克應句子);
            三刑矩陣.push("一般而言，命帶丑戌未之刑者，較容易突遭挫折，是非，同僚不和，或多病災。庫位相刑，入不敷出。");
            break;

        case "自刑":
            三刑矩陣.push("命帶自刑者，較欠缺獨立精神，常常有始無終，固執己見，不講道理，易與人不和或敵對。常明知不可為而為之，或拿石頭砸自己的腳，因此容易陷入困境。");
            if (尋四柱運星(相刑柱, "死", 命盤) || 尋四柱運星(相刑柱, "絕", 命盤)) 三刑矩陣.push("與死、絕同柱者，思慮淺薄，重者致疾。");
            if(相刑地支=="辰辰") 三刑矩陣.push("辰刑辰，固執，有原則，不喜歡別人左右，喜歡獨立，作老大，懷才不遇，做事有頭無尾，鬱卒型。");
            if(相刑地支=="午午") 三刑矩陣.push("午刑午，好勝心強，不喜歡別人用話刺激他。個性極端，沒耐性，健忘。喜歡別人拍馬屁。");
            if(相刑地支=="酉酉") 三刑矩陣.push("酉刑酉，講義氣，較雞婆，鬱卒。常常想幫助別人，但卻得不到認同。");
            if(相刑地支=="亥亥") 三刑矩陣.push("亥刑亥，聰明，智慧，明理。會歇斯底里，悲觀，總認為比別人認真、努力，但卻比別人歹命。");
            break;
    }
    if(相刑地支.length==3) 三刑矩陣.push("原局備齊三刑之人，出身多貧庸或普通家庭的多，較易患病。八字內有貴人或格局優異者，則不會太明顯。");
    return 三刑矩陣.join("<br>");
}


function 各柱相害註解(柱對, 命盤, 干或支, 刑的方式){
    var 相害註解 = [];

    var 柱1=柱對.substr(0,1);
    var 柱2=柱對.substr(1,1);
    var 柱名1=四柱名稱(柱1);
    var 柱名2=四柱名稱(柱2);
    var 克應柱子;

    switch(干或支){
        case "地支":
            var 十神1 = 四柱屬性(命盤, Number(柱1), "地支十神1");
            var 十神2 = 四柱屬性(命盤, Number(柱2), "地支十神1");
            break;
        case "天干":
            var 十神1 = (柱1!="2")?四柱屬性(命盤, Number(柱1), "天干十神"):"日主";
            var 十神2 = (柱2!="2")?四柱屬性(命盤, Number(柱2), "天干十神"):"日主";
            break;
        default:
            alert(干或支 + "：干支克應錯誤 ！！");
    }

    克應柱子 = 干或支+柱名1 + "（" + 十神1 + "）與" + 柱名2 + "（" + 十神2 + "）"+刑的方式+"，";
    switch(柱對){
        case "01":case "10": //年月柱
            克應句子 = 克應柱子 + "和長輩或上司不易溝通，有心結、代溝。不喜攀緣。少年易離家工作．外出。"
            相害註解.push(克應句子);
            break;
        case "12": case "21": //月日柱
            克應句子 = 克應柱子 + "不在意配偶，聚少離多，孤獨薄命，夫妻各有心事，彼此心結多，溝通不良則易有婚變現象。不敢創業。"
            相害註解.push(克應句子);
            break;
        case "23": case "32": //日時柱
            克應句子 = 克應柱子 + "配偶較不認同你的人際關係，較難支持你的事業，或和小孩難溝通。防老年傷殘。"
            相害註解.push(克應句子);
            break;
        case "13": case "31": //月時柱
            克應句子 = 克應柱子 + "與小孩較不易溝通，或經常換工作，工作無法專心，常對工作不滿。"
            相害註解.push(克應句子);
            break;
        case "02": case "20": //年日組
            克應句子 = 克應柱子 + "配偶和長輩無緣。長輩對配偶有意見，結婚不宜讓父母做主。"
            相害註解.push(克應句子);
            break;
        case "03": case "30": //年時組
            克應句子 = 克應柱子 + "長輩不認同你的事業，子女和長輩無緣，長輩不會幫忙帶小孩。"
            相害註解.push(克應句子);
            break;
        default:
            alert(柱對 + "：各柱相害柱錯誤 ！！");
    }
    
    if(相害註解.length>0){
        相害註解.join("<br>");
        return 相害註解;
    }
}


function 六害註解(相害柱,相害地支, 命盤) {
    var 六害矩陣 = [];
    var 附加註解 = "";
    var 相害疾病;

    switch (相害地支) {
        case "子未":case "未子":
            var 克應句子 = "子未相害，為人極端，易犯小人，易換工作。貌合神離，會要求對方。親子之間較早分離。";
            if (命盤.系統參數.設定.Access > 5) 克應句子 = 克應句子 + "<br>子未相害是因為午未相合，而子午相沖，子水可以沖散未午相合；未丑相沖，未土可以沖散子丑相合，故而子未相互害了起來。子水為陰水，未土為陰土，兩陰強害之爭，導致六親相傷。格局貴者手握重權，格局差者身體疾病或六親不睦。";
            六害矩陣.push(克應句子);
            if (尋四柱運星(相害柱, "長生", 命盤) || 尋四柱運星(相害柱, "冠帶", 命盤) || 尋四柱運星(相害柱, "臨官", 命盤) || 尋四柱運星(相害柱, "帝旺", 命盤)) 附加註解 = 附加註解 + "子未生旺，死絕皆不利六親骨肉。子未逢旺，則性暴躁，好發怒，缺乏耐性。";
            if (尋四柱運星(相害柱, "死", 命盤) || 尋四柱運星(相害柱, "絕", 命盤)) 附加註解 = 附加註解 + "子未生旺、死絕皆不利六親骨肉。";

            if (命盤.系統參數.設定.Access <= 5){
                附加註解 = 附加註解 + "*入貴格多妻妾之累，入賤格孤獨無倚。";
                六害矩陣.push(附加註解);                
            }

            相害疾病 = "子未相害者，";
            if (命盤.性別 == "女") 相害疾病 = 相害疾病 + "女命易患婦科病，易墮胎、流產。";
            if (命盤.性別 == "男") 相害疾病 = 相害疾病 + "男命多有脾胃之疾。";
            六害矩陣.push(相害疾病);
            break;
        case "丑午": case "午丑":
            var 克應句子 = "丑午相害，耐心差，容易生氣，貌合神離。";
            if (命盤.系統參數.設定.Access > 5) 克應句子 = 克應句子 + "<br>丑午相害是因午合未，而丑未沖，丑可以沖散午未合；子午沖，午可以沖散子丑相合，故此丑未相互害了起來。這種相害是陰濕之土昧旺火，有種旺拼之勢。所以，人命逢之嫉妒心強，性格剛毅，容易與人結仇，身弱者恐有身體傷殘，或遭遇牢獄之災。身旺或入格者，有權威，是功成名就之人。";
            六害矩陣.push(克應句子);
            if (尋四柱運星(相害柱, "長生", 命盤) || 尋四柱運星(相害柱, "冠帶", 命盤) || 尋四柱運星(相害柱, "臨官", 命盤) || 尋四柱運星(相害柱, "帝旺", 命盤)) 附加註解 = 附加註解 + "地支值生旺，性格暴躁，好勝多怒，缺乏耐性。";
            if (尋四柱運星(相害柱, "死", 命盤) || 尋四柱運星(相害柱, "絕", 命盤)) 附加註解 = 附加註解 + "地支值死絕主毒害、傷慘、傾覆之事。";
            
            if (命盤.系統參數.設定.Access <= 5){
                附加註解 = 附加註解 + "*入貴格則主大權，司刑典獄；入賤格則謀生於不義之地。";
                六害矩陣.push(附加註解);                
            }

            相害疾病 = "丑午相害者，易患腦神經病。";
            六害矩陣.push(相害疾病);
            break;
        case "寅巳": case "巳寅":
            var 克應句子 = "寅巳相害，是非多，無人情味，易犯小人，冷眼旁觀，辯才無疑。*重金者，防廢疾纏身。";
            if (命盤.系統參數.設定.Access > 5) 克應句子 = 克應句子 + "<br> 寅巳相害是因為巳亥相沖，巳可以沖散寅亥相合；寅申相沖，寅沖散巳申相合，故此寅巳相互害了起來。身強者喜言論，愛多管閑事，易惹是生非。身弱者易疾病纏身，難成大事，平凡一生。";
            六害矩陣.push(克應句子);
            
            if (尋四柱運星(相害柱, "長生", 命盤) || 尋四柱運星(相害柱, "冠帶", 命盤) || 尋四柱運星(相害柱, "臨官", 命盤) || 尋四柱運星(相害柱, "帝旺", 命盤)) 附加註解 = 附加註解 + "地支值生旺則主神潔貌俊，好爭奪，喜激作。";
            if (尋四柱運星(相害柱, "死", 命盤) || 尋四柱運星(相害柱, "絕", 命盤)) 附加註解 = 附加註解 + "地支值死絕則多謀少成，學人做事，兀兀趨進不厭。";
            
            if (命盤.系統參數.設定.Access <= 5){
                附加註解 = 附加註解 + "*入貴格則有操守，善機權；入賤格則多詐、愛貧、鄙吝。";
                六害矩陣.push(附加註解);                
            }

            相害疾病 = "寅巳相害者，體弱多病，易患腸胃病或遭肢體傷殘之苦。";
            六害矩陣.push(相害疾病);
            break;
        case "卯辰": case "辰卯":
            var 克應句子 = "卯辰相害，易遭周邊情人相害，朋友扯後腿，兄弟無緣，手足無助；愈親近的人，反駁力愈大。";
            if (命盤.系統參數.設定.Access > 5) 克應句子 = 克應句子 + "<br> 卯辰相害是因辰戌相沖，辰沖散了戌卯相合；卯酉相沖，卯沖散了辰酉相合，故此卯與辰相互害了起來。卯為旺木克喜辰濕土。命局入格者，性格執著，能成就大事；破壞格局者，恐有疾病，有志難伸。";
            六害矩陣.push(克應句子);
            if (尋四柱運星(相害柱, "長生", 命盤) || 尋四柱運星(相害柱, "冠帶", 命盤) || 尋四柱運星(相害柱, "臨官", 命盤) || 尋四柱運星(相害柱, "帝旺", 命盤)) 附加註解 = 附加註解 + "地支值生旺，主好勝多怒，嚴毅不忍。";
            if (尋四柱運星(相害柱, "死", 命盤) || 尋四柱運星(相害柱, "絕", 命盤)) 附加註解 = 附加註解 + "地支值死絕主毒害、傷慘、傾覆之事。";
            
            if (命盤.系統參數.設定.Access <= 5){
                附加註解 = 附加註解 + "*入貴格則主大權，司刑典獄；入賤格則謀生於不義之地。";
                六害矩陣.push(附加註解);                
            }

            相害疾病 = "卯辰相害者，火多易患上肝膽之疾或遭受外傷。";
            六害矩陣.push(相害疾病);
            break;
        case "酉戌": case "戌酉":
            var 克應句子 = "酉戌相害，容易被近親戲弄，雞犬不寧，離婚率高。面部易生暗瘡。";
            if (命盤.系統參數.設定.Access > 5) 克應句子 = 克應句子 + "<br> 酉戌相害是因辰酉相合，辰戌相沖，戌可以沖散辰酉相合；卯酉相沖，酉可以沖散卯戌相合，故而酉戌相互害了起來。命局土多者，酉戌相害易導致皮膚病，肺病，金多者耳聾或腎臟疾病。入格者利名譽，反之，無作為，或臭名在外。";
            六害矩陣.push(克應句子);
            if (尋四柱運星(相害柱, "長生", 命盤) || 尋四柱運星(相害柱, "冠帶", 命盤) || 尋四柱運星(相害柱, "臨官", 命盤) || 尋四柱運星(相害柱, "帝旺", 命盤)) 附加註解 = 附加註解 + "戌酉如生旺，不容物，多剛戾。";
            if (尋四柱運星(相害柱, "死", 命盤) || 尋四柱運星(相害柱, "絕", 命盤)) 附加註解 = 附加註解 + "戌酉死絕酷狠，憎善妒能。";

            if (命盤.系統參數.設定.Access <= 5){
                附加註解 = 附加註解 + "*入貴格羅怯無辜，結構入訟，頗多奸佞；入賤格殘害、陰狡、性佞、不良。";
                六害矩陣.push(附加註解);                
            }

            相害疾病 = "酉戌相害者，多生惡瘡，易遭受燙傷和火傷。*命局土多者，酉戌相害易導致皮膚病，肺病；金多者耳聾或腎臟疾病。";
            六害矩陣.push(相害疾病);
            break;
        case "申亥": case "亥申":
            var 克應句子 ="巳亥為驛馬冲，理智，閒不住，多管閒事，好照顧他人。口才很好，愛聊天，較不服輸，追根究底，得理不饒人，會禍從口出。適合外務，有車關，易生車禍。";
            if (命盤.系統參數.設定.Access > 5) 克應句子 = 克應句子 + "<br> 申亥相害是因為亥巳相沖，亥沖散了巳申相合；寅申相沖，申沖散了寅亥相合，故此申亥相互害了起來。申亥相害不利公職，應遠離功名場合。入格者一生自由，反之，則內心壓抑，受人約束。";
            六害矩陣.push(克應句子);
            if (尋四柱運星(相害柱, "長生", 命盤) || 尋四柱運星(相害柱, "冠帶", 命盤) || 尋四柱運星(相害柱, "臨官", 命盤) || 尋四柱運星(相害柱, "帝旺", 命盤)) 附加註解 = 附加註解 + "地支值生旺則主神潔貌俊，好爭奪，喜激作。";
            if (尋四柱運星(相害柱, "死", 命盤) || 尋四柱運星(相害柱, "絕", 命盤)) 附加註解 = 附加註解 + "地支值死絕則多謀少成，學人做事，兀兀趨進不厭。";
            
            if (命盤.系統參數.設定.Access <= 5){
                附加註解 = 附加註解 + "*入貴格則有操守，善機權；入賤格則多詐、愛貧、鄙吝。";
                六害矩陣.push(附加註解);                
            }

            相害疾病 = "申亥相害者，身體易患有筋骨之疾，臉面易遭損傷。";
            六害矩陣.push(相害疾病);
            break;
        }
        return 六害矩陣.join("<br>");
}



// --------------------------------------------返吟、伏吟 -------------------------------------------------
function 四柱返吟伏吟(命盤){
    var 四柱 = [命盤.年柱.干支, 命盤.月柱.干支, 命盤.日柱.干支, 命盤.時柱.干支];
    var 伏吟干支, 返吟干支1, 返吟干支2;
    var 女命時伏吟 = "女命時支子息宮伏吟，不管是與年、月、日任何一支皆同論，易生雙胞胎，自己或子女有雙婚現象。";


    //
    伏吟資料 = [
        "年月伏吟，代表由祖輩宮分裂、分化，也表示分家的意思，也代表父親的兄弟有分家的現象，但因五行同性，故父親居住的地方，與祖居地相離不遠，只是不會住在祖地。<br>*伏吟若為忌神，早年破蕩祖業，父祖輩刑剋，也代表日主早年不佳。再視伏吟的五行與十神，判別祖父母或父母有雙婚、雙姓、雙胞胎之現象。",
        "年日伏吟，出生時見不到祖輩的機率很大。與祖父母相處機會不多，祖蔭亦不豐。若年干透比劫，無祖產可得。有可能配偶出生時，見不到對方配偶的祖輩。伏吟為忌神，嚴重剋配偶，男女皆同。",
        "年時伏吟，出生時見不到祖輩，或是六歲之前，祖輩會過世。幼年剋祖上，老年剋子息，子息疏離，或有子息早逝、夭折、損胎。不剋子女，也會剋自己。子息疏離，緣薄。",
        "月日伏吟，命局本人有雙婚，或兄弟有雙婚的現象。自己或配偶有雙婚的現象，或配偶的父母或兄弟有雙婚的現象。六親刑剋，婚姻不穩，情緒易激動，心情常感不安，家庭生活波折。月日伏吟，事業多起伏，蹇滯不順。",
        "月時伏吟，事業宮伏吟，小心事業、財務的問題，事業多起伏，蹇滯不順；如伏吟為忌神，容易在工作上鬧情緒。子息宮伏吟，要注意子女身體的健康問題。子息與父母有雙婚、雙姓、雙胞胎之現象。",
        "日時伏吟，老年孤單，子息難在身邊，子息緣淡薄。子息宮伏吟，要注意子女身體的健康問題或有早逝現象。婚姻宮與子息宮伏吟，不利婚緣，且健康有起伏。事業宮伏吟，老運、事業、財運較有起伏不利，辛苦勞碌難免。"
    ];

    返吟資料 = [
        "年月返吟，難得祖上的餘蔭，或出生寒微之家，與祖輩之緣淡薄，祖基門戶盡破。父祖輩有刑剋或過養的現象，乃破祖離家之象。年幼時，體弱多病難養，易多跌撞、災傷、疾病。主年少時居所多遷移。主工作事業多變動，不穩定。中年以前易遭逢一場災難，不得人助。婚前多次戀愛，姻緣難定，不適合早婚。",
        "年日返吟，難得祖上的照顧、餘蔭，與祖輩緣薄或與長輩不和。夫妻宮返吟，婚姻易生變，易剋離或感情不順，或不易早婚。宜嫁取同年生之配偶或年柱納音相同者，方可免難。中年事業、財利，易變動起伏，不利身體健康。",
        "年時返吟，老運、事業、財富、健康有起伏變化，辛苦勞碌難免。或有子息早逝、夭折、損胎。不剋子女，也會剋自己。子息疏離、緣薄，或子息遠離難聚身邊，老年孤單，多災厄，子息疏離，做事有始無終。若時支再有刑沖，則婚後不易得子。",
        "月日返吟，日主與父母兄弟之緣份疏遠淡薄，不能安於家室。個性不喜拘束，情緒不穩定。返伏吟易有喪父、喪母、喪手足之痛。難得父母的培育，也難獲得高等教育。不居父母家，有早入社會工作自力更生之象。中壯年期，夫妻、事業、工作變動不定，阻滯多艱。一生多謗譽，或有居家遷移之象。配偶與父母疏遠不和睦。夫妻感情易生不睦，口角是非爭執，甚至有離異之象，或不容易找到婚姻對象，或為生計奔波於外，易晚婚。",
        "月時返吟，子女與祖父母緣份疏離，不居父母家；六親之間不和睦，多爭吵。不利事業、財運，或工作不順、健康起伏有變動，不能順遂。本人事業乖舛不順，屢起屢倒。子女易有損胎之象，或健康不佳，或有早逝現象。子女不喜在家，喜歡往外跑，或出不肖子息。老運孤單，辛苦勞碌，子息疏離。",
        "日時返吟，刑剋配偶，婚姻不穩，感情不睦，健康不佳，更甚者有離異、早別之象。時日對沖，傷害妻子。中年後事業、工作、財運、居家有變動，起伏不定，辛苦勞碌難免。老年孤單，子息疏遠，緣薄，或夫妻老年積勞成疾；或中年後一場災。子女少，容易有損，或健康不佳，或早逝，或子女不喜在家，出不肖子息，子息遠離無緣。"
    ];

    var 論斷項目= '<span class = "本命論斷項目">返吟、伏吟：</span><br>';
    var 返吟伏吟論斷矩陣 = [];
    
    // -- 年柱判斷 --
    伏吟干支 = 命盤.年柱.干支;
    返吟干支1 = 干支天剋地冲(伏吟干支, "剋我");
    返吟干支2 = 干支天剋地冲(伏吟干支, "我剋");

    for(var i=1; i<四柱.length; i++){
        if (四柱[i] == 伏吟干支) 返吟伏吟論斷矩陣.push(伏吟資料[i - 1]);
        if (四柱[i] == 返吟干支1) 返吟伏吟論斷矩陣.push(返吟資料[i - 1]);
        if (四柱[i] == 返吟干支2) 返吟伏吟論斷矩陣.push(返吟資料[i - 1]);
    }

    // -- 月、日時柱判斷 --
    伏吟干支 = 命盤.月柱.干支;
    返吟干支1 = 干支天剋地冲(伏吟干支, "剋我");
    返吟干支2 = 干支天剋地冲(伏吟干支, "我剋");
    for(var i=2; i<四柱.length; i++){
        var 附加論斷 = (i == 3 && 命盤.性別 == "女") ? 女命時伏吟 : "";
        if (四柱[i] == 伏吟干支) 返吟伏吟論斷矩陣.push(伏吟資料[i + 1]+附加論斷);
        if (四柱[i] == 返吟干支1) 返吟伏吟論斷矩陣.push(返吟資料[i + 1]);
        if (四柱[i] == 返吟干支2) 返吟伏吟論斷矩陣.push(返吟資料[i + 1]);
    }

    // -- 日、時柱判斷 --
    伏吟干支 = 命盤.日柱.干支;
    返吟干支1 = 干支天剋地冲(伏吟干支, "剋我");
    返吟干支2 = 干支天剋地冲(伏吟干支, "我剋");

    var 附加論斷 = (命盤.性別 == "女") ? 女命時伏吟 : "";
    if (四柱[3] == 伏吟干支) 返吟伏吟論斷矩陣.push(伏吟資料[5]+附加論斷);
    if (四柱[3] == 返吟干支1) 返吟伏吟論斷矩陣.push(返吟資料[5]);
    if (四柱[3] == 返吟干支2) 返吟伏吟論斷矩陣.push(返吟資料[5]);

    if (返吟伏吟論斷矩陣.length > 0) {
        var 返吟伏吟論斷字串 = 返吟伏吟論斷矩陣.join("<br><br>");
        return 論斷項目 + 返吟伏吟論斷字串;
    } else return "";
}


function 四柱天合地合(命盤){
    var 四柱干支 = [命盤.年柱.干支, 命盤.月柱.干支, 命盤.日柱.干支, 命盤.時柱.干支];
    var 論斷項目= '<span class = "本命論斷項目">四柱天合地合：</span><br>';
    var 天合地合論斷矩陣 = [];
    var 註解;

    var 年月合 = 天合地合註解(四柱干支[0], 四柱干支[1]);
    var 月日合 = 天合地合註解(四柱干支[1], 四柱干支[2]);
    var 日時合 = 天合地合註解(四柱干支[2], 四柱干支[3]);
    var 年日合 = 天合地合註解(四柱干支[0], 四柱干支[2]);
    var 年時合 = 天合地合註解(四柱干支[0], 四柱干支[3]);
    var 月時合 = 天合地合註解(四柱干支[1], 四柱干支[3]);

    if(年月合!="") 天合地合論斷矩陣.push("年柱與月柱形成天合地合。" + 年月合+"<br>年月合吉兆顯應於一至三十二歲之間。");
    if(月日合!="") 天合地合論斷矩陣.push("月柱與日柱形成天合地合。" + 月日合+"<br>年月合吉兆顯應於十七至四十八歲之間。");
    if(日時合!="") 天合地合論斷矩陣.push("日柱與時柱形成天合地合。" + 日時合+"<br>年月合吉兆顯應於三十三至六十四歲之間。");
    if(年日合!="") 天合地合論斷矩陣.push("年柱與日柱形成天合地合。" + 年日合);
    if(年時合!="") 天合地合論斷矩陣.push("年柱與時柱形成天合地合。" + 年時合);
    if(月時合!="") 天合地合論斷矩陣.push("月柱與時柱形成天合地合。" + 月時合);

    if (天合地合論斷矩陣.length > 0) return 論斷項目 + 天合地合論斷矩陣.join("<br>"); else return "";
}  //要做天比地冲嗎？

function 冲支力度(地支){
    var base = -4;

    switch (地支) {
        case "亥":
            return base * 0.25;
        case "子":
            return base * 0.25;
        case "丑":
            return 0;
        case "寅":
            return base * 0.75;
        case "卯":
            return base * 0.75;
        case "辰":
            return 0;
        case "巳":
            return base * 0.75;
        case "午":
            return base * 0.75;
        case "未":
            return 0;
        case "申":
            return base * 0.25;
        case "酉":
            return base * 0.25;
        case "戌":
            return 0;
        default:
            alert(地支 + "：冲支力度輸入錯誤！！")
            return 0;
    }
}