function 窮通寶鑑用神喜忌(日主,月令,命盤){
	var 窮通寶鑑喜忌表=["窮通寶鑑","","","","","","","","","","",""];
	
	switch(日主){
	    case "甲":
	        switch (月令) {
	            case "寅":
	                窮通寶鑑喜忌表[喜忌表格位置("丙")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("癸")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "調和氣候為要，丙火為主，癸水為佐。";
	                break;
	            case "卯":
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丙")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("戊")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("己")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "陽刃架殺，專用庚金，以戊己滋殺為佐。無庚用丙丁泄秀，不取制殺。";
	                break;
	            case "辰":
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("壬")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "用庚金必須丁火制之，傷官制殺，無庚用壬。";
	                break;
	            case "巳":
	                窮通寶鑑喜忌表[喜忌表格位置("癸")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "調和氣候，癸水為主。原局氣潤，庚丁為用。";
	                break;
	            case "午":
	                窮通寶鑑喜忌表[喜忌表格位置("癸")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "木性虛焦，癸為主要，無癸用丁，也宜運行北地。木盛先庚，庚盛先丁。";
	                break;
	            case "未":
	                窮通寶鑑喜忌表[喜忌表格位置("癸")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "上半月用癸，下半月用庚丁。";
	                break;
	            case "申":
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("壬")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "傷官倒殺，無丁用壬，富而不貴。";
	                break;
	            case "酉":
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丙")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "用丁制殺，用丙調候，丁丙並用為佐。";
	                break;
	            case "戌":
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("甲")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("壬")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("癸")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "土旺者用甲木，木旺者用庚金，丁壬癸為佐。";
	                break;
	            case "亥":
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丙")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("戊")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "用庚金，取丁火制之，丙火調候。水旺用戊。";
	                break;
	            case "子":
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丙")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "木性生寒，丁先庚后，丙火為佐。必須支見巳寅，方為貴格。";
	                break;
	            case "丑":
	                窮通寶鑑喜忌表[喜忌表格位置("丁")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("庚")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("丙")] = "喜";
	                窮通寶鑑喜忌表[喜忌表格位置("簡析")] = "丁火必不可少，通根巳寅，甲木為助。用庚劈甲引丁。";
	                break;
	        }
	        break;
		case "乙":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取丙火解寒，略取癸水滋潤，不宜困丙。火多用癸。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以癸滋木，以丙泄秀，不宜見金。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="若支成水局，取戊為佐。";
					break;
				case "巳":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="月令丙火得祿，專用癸水，調候為急。";
					break;
				case "午":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="上半月專用癸水，下半月丙癸並用。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="忌";
                    窮通寶鑑喜忌表[喜忌表格位置("己")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="潤土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊己雜亂。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("己")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="月垣庚金司令，取丙火制之，或癸水化之。不論用丙用癸，皆己土為佐。";
					break;
				case "酉":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="上半月癸先丙后，下半月丙先癸后，無癸用壬。交成金局，又宜用丁。";
					break;
				case "戌":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以金發水之源。見甲，名藤蘿繫甲。";
					break;
				case "亥":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					//窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="乙木向陽，專取丙火。水多以戊為佐。";
					break;
				case "子":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="寒木向陽，專取丙火，忌見癸水。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="寒谷回春，專用丙火。";
					break;
			}
            break;
		case "丙":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬水為用，庚金發水之源為佐。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("己")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="專用壬水，水多用戊制之，身弱用印化之。無壬用己。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="專用壬水，土重以甲為佐。";
					break;
				case "巳":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以庚為佐，忌戊制壬。無壬用癸。";
					break;
				case "午":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬庚以通根申宮為妙。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以庚為佐。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬水通根申宮，壬多必取戊制。";
					break;
				case "酉":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="四柱多丙，一壬高透為奇。無壬用癸。";
					break;
				case "戌":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="忌";
                    窮通寶鑑喜忌表[喜忌表格位置("己")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="忌土晦光，先取甲疏土，次用壬水。";
					break;
				case "亥":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="月垣壬水秉令，水旺用甲木化之，身殺兩旺，用戊制之。火旺用壬，木旺宜庚。";
					break;
				case "子":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("己")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="氣進二陽，丙火弱中復強，用壬水，用戊制之。無戊用己。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="喜壬為用，土多不可少甲。";
					break;
			}
            break;
		case "丁":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="用庚金劈甲引丁。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以庚去乙，以甲引丁。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="用甲木引丁制土，次看庚金。木盛用庚，水盛用戊。";
					break;
				case "巳":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取甲引丁，甲多又以庚為先。";
					break;
				case "午":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="水多以庚壬兩透為貴。無壬用癸，為獨殺當權。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以甲木化壬引丁為用，用甲不能無庚，取庚為佐。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取庚劈甲，無甲用乙。用丙暖金晒甲，無庚甲而用乙者，見丙為枯草引燈。水旺用戊。";
					break;
				case "酉":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取庚劈甲，無甲用乙。用丙暖金晒甲，無庚甲而用乙者，見丙為枯草引燈。水旺用戊。";
					break;
				case "戌":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="一派戊土無甲，為傷官傷盡。";
					break;
				case "亥":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="庚金劈甲引丁，甲木為尊，庚金為佐，戊癸權宜酌用。";
					break;
				case "子":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="庚金劈甲引丁，甲木為尊，庚金為佐，戊癸權宜酌用。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="庚金劈甲引丁，甲木為尊，庚金為佐，戊癸權宜酌用。";
					break;
			}
            break;
		case "戊":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="無丙照暖，戊土不生，無甲疏劈，戊土不靈。無壬滋潤，萬物不長，先丙、次甲、次癸。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="無丙照暖，戊土不生，無甲疏劈，戊土不靈。無壬滋潤，萬物不長，先丙、次甲、次癸。";
					break;
				case "辰":
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="戊土司令，先用甲疏，次丙、次癸。";
					break;
				case "巳":
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="戊土建祿，先用甲疏劈，次取丙癸。";
					break;
				case "午":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="調候為急，先用壬水，次取甲木，丙火酌用。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    //窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="調候為急，癸不可缺，次用丙火。土重不能無甲。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					//窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="寒氣漸增，先用丙火，後用癸水。水多、用甲洩之。";
					break;
				case "酉":
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="賴丙照暖，喜水滋潤。";
					break;
				case "戌":
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="戊土當權，先用甲木，次取丙火。見金先用癸水，後取丙火。";
					break;
				case "亥":
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="非甲不靈，非丙不暖。";
					break;
				case "子":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="丙火為尚，甲木為佐。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="丙火為尚，甲木為佐。";
					break;
			}
            break;
		case "己":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					//窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    //窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取丙解寒，忌見壬水，如水多，須以戊土為佐。土多用甲。甲多用庚。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="用甲忌與己土合化，次用癸水潤之。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="先丙後癸，土暖而潤，隨用甲疏。";
					break;
				case "巳":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="調候不能無癸，土潤不能無丙。";
					break;
				case "午":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="調候不能無癸，土潤不能無丙。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="調候不能無癸，土潤不能無丙。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="丙火溫土，癸水潤土，七月庚金司權，丙能制金，癸以洩金。";
					break;
				case "酉":
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取辛輔癸。";
					break;
				case "戌":
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="九月土盛，宜甲木疏之，次用丙癸。";
					break;
				case "亥":
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。";
					break;
				case "子":
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="三冬己土，非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。";
					break;
				case "丑":
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="三冬己土，非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。";
					break;
			}
            break;
		case "庚":
			switch(月令){
				case "寅":
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="用丙暖庚性，患土厚埋金，須甲疏洩。火多用土，支成火局用壬。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="庚金暗強，專用丁火，借甲引丁，用庚劈甲。無丁用丙。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="頑金宜丁，旺土用甲，不用庚劈，支火宜癸，干火宜壬。";
					break;
				case "巳":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="丙不熔金，唯喜壬制，次取戊土，丙火為佐。支成金局，變弱為強，須用丁火。";
					break;
				case "午":
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="專用壬水，癸次之，須支見庚辛為助。無壬癸，用戊己洩火之氣。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="若支會土局，甲先丁後。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="專用丁火，甲木引丁。";
					break;
				case "酉":
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="用丁甲煉金，兼用丙火調候。";
					break;
				case "戌":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="土厚先用甲疏，次用壬洗。忌見己土濁壬。";
					break;
				case "亥":
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="水冷金寒愛丙丁，甲木輔丁。";
					break;
				case "子":
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="仍取丁甲，次取丙火照暖，一派金水，不入和暖之鄉，孤貧。丙丁須臨寅巳午未戌支，方為有力。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="仍取丁甲，次取丙火照暖，一派金水，不入和暖之鄉，孤貧。丙丁須臨寅巳午未戌支，方為有力。";
					break;
			}
            break;
		case "辛":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("己")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="辛金失令，取己土為生身之本，欲得辛金發，用金賴壬水之功。壬己並用，以庚為助。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="忌";
                    窮通寶鑑喜忌表[喜忌表格位置("己")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬水為尊，見戊己為病，須甲制伏。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="若見丙火合辛，須有癸制丙，支見亥子申，為貴。";
					break;
				case "巳":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬水洗淘，兼有調候之用，更有甲木制戊，一清澈底。";
					break;
				case "午":
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("己")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="己無壬不濕，辛無己不生，故壬己並用。無壬用癸。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    //窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="先用壬水，取庚為佐，忌戊出，得甲制之，方吉。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬水為尊，甲戊酌用。不可用癸水。";
					break;
				case "酉":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬水淘洗，如見戊己，須甲制土。支成金局，無壬用丁。";
					break;
				case "戌":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丙")]="忌";
                    //窮通寶鑑喜忌表[喜忌表格位置("丁")]="忌";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="忌";
                    //窮通寶鑑喜忌表[喜忌表格位置("己")]="忌";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="火土為病，水木為藥。";
					break;
				case "亥":
					窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="先壬後丙，名金白水清，餘皆酌用。";
					break;
				case "子":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="冬月辛金，不能缺丙火溫暖，餘皆酌用。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("己")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="丙先壬後，戊己次之，總之丙火不可少也。";
					break;
			}
            break;
		case "壬":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="無比劫者，不必用戊，專用庚金，以丙為佐。如比劫多，又宜制之，一戊出干，名一將當關，群邪自伏。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="三春壬水絕，取庚辛發水之源。水多用戊。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="甲疏季土，次取庚金發水源，金多須丙制之為妙。";
					break;
				case "巳":
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="壬水弱極，取庚辛為源，壬癸比助。";
					break;
				case "午":
					窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取庚為源，取癸為佐。無庚用辛。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以辛金發水源，甲木疏土。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌方可為用。";
					break;
				case "酉":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="無甲、用金發水之源，名濁水犯庚辛，體全之義。";
					break;
				case "戌":
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="以甲制戌中戊土，丙火為佐。";
					break;
				case "亥":
					窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="如甲出制戊，須以庚金為救。";
					break;
				case "子":
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="水旺宜戊，調候宜丙，丙戊必須兼用。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="上半月專用丙火，下半月用丙，甲木為佐。";
					break;
			}
            break;
		case "癸":
			switch(月令){
				case "寅":
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="用辛生癸水為源，無辛用庚，丙不可少。";
					break;
				case "卯":
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="乙木司令，專用庚金，辛金次之。";
					break;
				case "辰":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="上半月專用丙火，下半月雖用丙火，辛甲為佐。";
					break;
				case "巳":
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="無辛用庚。";
					break;
				case "午":
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="庚辛為生身之本，但丁火司權，金難敵火宜兼用比劫，方得庚辛之用。";
					break;					
				case "未":
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="上半月金神衰弱，火氣炎熱，宜比劫幫身。下半月無比劫也可。";
					break;					
				case "申":
					窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="庚金得祿，必丁火制金為用，丁火以通根午戌未為妙。";
					break;
				case "酉":
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="辛金為用，丙火佐之，名水暖金溫，須隔位同透為妙。";
					break;
				case "戌":
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("甲")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("壬")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("癸")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="專用辛金，忌戊土。要比劫滋甲，制戊為妙。";
					break;
				case "亥":
					窮通寶鑑喜忌表[喜忌表格位置("庚")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("戊")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="亥中甲木長生，洩散元神，宜用庚辛。水多用戊，金多用丁。";
					break;
				case "子":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("辛")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="丙火解凍。辛金滋扶。";
					break;
				case "丑":
					窮通寶鑑喜忌表[喜忌表格位置("丙")]="喜";
                    窮通寶鑑喜忌表[喜忌表格位置("丁")]="喜";
					窮通寶鑑喜忌表[喜忌表格位置("簡析")]="丙火解凍，通根寅巳午未戌，方妙，癸巳會黨，年透丁火，名雪後燈光，夜生者貴。支成火局，又宜用庚辛。";
					break;
			}
            break;
        default:
            alert("窮通寶鑑 喜忌表，日干錯誤！");
            break;
    } // end of 日干 switch

    命盤.分析句.用神喜忌矩陣.push(窮通寶鑑喜忌表);
}

function 喜忌表格位置(十干註解){
	switch(十干註解){
		case "甲":
            return 1;
			break;
		case "乙":
			return 2;
			break;
		case "丙":
			return 3;
			break;
		case "丁":
			return 4;
			break;
		case "戊":
			return 5;
			break;
		case "己":
			return 6;
			break;
		case "庚":
			return 7;
			break;
		case "辛":
			return 8;
			break;
		case "壬":
			return 9;
			break;
		case "癸":
			return 10;
			break;
		case "簡析":
			return 11;
			break;
		default:
			alert("喜忌位置輸入不正確！");
            break;
	}
}