
function 八門形態(遁甲盤){
	
	var 八門形態矩陣=[
		{ "八門宮位": "開門乾", "形態": "伏吟"},
		{ "八門宮位": "開門坎", "形態": "次吉"},
		{ "八門宮位": "開門艮", "形態": "入墓"},
		{ "八門宮位": "開門震", "形態": "迫"},
		{ "八門宮位": "開門巽", "形態": "反吟"},
		{ "八門宮位": "開門離", "形態": "受制"},
		{ "八門宮位": "開門坤", "形態": "大吉"},
		{ "八門宮位": "開門兌", "形態": "旺相"},
		{ "八門宮位": "休門乾", "形態": "大吉"},
		{ "八門宮位": "休門坎", "形態": "伏吟"},
		{ "八門宮位": "休門艮", "形態": "受剋"},
		{ "八門宮位": "休門震", "形態": "次吉"},
		{ "八門宮位": "休門巽", "形態": "入墓"},
		{ "八門宮位": "休門離", "形態": "反吟"},
		{ "八門宮位": "休門坤", "形態": "受剋"},
		{ "八門宮位": "休門兌", "形態": "大吉"},
		{ "八門宮位": "生門乾", "形態": "次吉"},
		{ "八門宮位": "生門坎", "形態": "迫"},
		{ "八門宮位": "生門艮", "形態": "伏吟"},
		{ "八門宮位": "生門震", "形態": "受剋"},
		{ "八門宮位": "生門巽", "形態": "入墓"},
		{ "八門宮位": "生門離", "形態": "大吉"},
		{ "八門宮位": "生門坤", "形態": "反吟"},
		{ "八門宮位": "生門兌", "形態": "次吉"},
		{ "八門宮位": "傷門乾", "形態": "受制"},
		{ "八門宮位": "傷門坎", "形態": "大凶"},
		{ "八門宮位": "傷門艮", "形態": "迫凶"},
		{ "八門宮位": "傷門震", "形態": "伏吟"},
		{ "八門宮位": "傷門巽", "形態": ""},
		{ "八門宮位": "傷門離", "形態": "洩氣"},
		{ "八門宮位": "傷門坤", "形態": "入墓"},
		{ "八門宮位": "傷門兌", "形態": "反吟"},
		{ "八門宮位": "杜門乾", "形態": "反吟"},
		{ "八門宮位": "杜門坎", "形態": "受生"},
		{ "八門宮位": "杜門艮", "形態": "迫"},
		{ "八門宮位": "杜門震", "形態": "比和"},
		{ "八門宮位": "杜門巽", "形態": "伏吟"},
		{ "八門宮位": "杜門離", "形態": "洩氣"},
		{ "八門宮位": "杜門坤", "形態": "入墓"},
		{ "八門宮位": "杜門兌", "形態": "受剋"},
		{ "八門宮位": "景門乾", "形態": "入墓"},
		{ "八門宮位": "景門坎", "形態": "反吟"},
		{ "八門宮位": "景門艮", "形態": "相生"},
		{ "八門宮位": "景門震", "形態": "生旺"},
		{ "八門宮位": "景門巽", "形態": "生旺"},
		{ "八門宮位": "景門離", "形態": "伏吟"},
		{ "八門宮位": "景門坤", "形態": "相生"},
		{ "八門宮位": "景門兌", "形態": "迫"},
		{ "八門宮位": "死門乾", "形態": "相生"},
		{ "八門宮位": "死門坎", "形態": "迫凶"},
		{ "八門宮位": "死門艮", "形態": "反吟"},
		{ "八門宮位": "死門震", "形態": "受剋"},
		{ "八門宮位": "死門巽", "形態": "入墓"},
		{ "八門宮位": "死門離", "形態": "大凶"},
		{ "八門宮位": "死門坤", "形態": "伏吟"},
		{ "八門宮位": "死門兌", "形態": "相生"},
		{ "八門宮位": "驚門乾", "形態": "比和"},
		{ "八門宮位": "驚門坎", "形態": "洩氣"},
		{ "八門宮位": "驚門艮", "形態": "入墓"},
		{ "八門宮位": "驚門震", "形態": "反吟"},
		{ "八門宮位": "驚門巽", "形態": "迫"},
		{ "八門宮位": "驚門離", "形態": "受制"},
		{ "八門宮位": "驚門坤", "形態": "受生"},
		{ "八門宮位": "驚門兌", "形態": "伏吟"}
		];

	var 八門落宮, 八門形態索引;

	for(var i=1; i<10; i++){
		//if(i!=5){
			八門落宮=遁甲盤.天盤[i].八門+遁甲盤.地盤[i].後天八卦;

			八門形態索引=_.findIndex(八門形態矩陣, {八門宮位: 八門落宮});
			//console.log(八門落宮 + ":" + 八門形態矩陣[八門形態索引].形態);
			if (八門形態索引 != -1) 遁甲盤.天盤[i].八門形態=八門形態矩陣[八門形態索引].形態; else 遁甲盤.天盤[i].八門形態="-";
		//} // end if
	}  // end for
}


function 八門加八門(遁甲盤){
	var 門加門矩陣=[
		{ "地盤": "開門", "人盤": "開門", "地門人門": "開門開門", "剋應": "主貴人寶物財喜。"},
		{ "地盤": "開門", "人盤": "休門", "地門人門": "開門休門", "剋應": "主貴人財喜及開張鋪店，貿易大利。"},
		{ "地盤": "開門", "人盤": "生門", "地門人門": "開門生門", "剋應": "主見貴人，謀望所求遂意。"},
		{ "地盤": "開門", "人盤": "傷門", "地門人門": "開門傷門", "剋應": "主變動、更改、移徒，事皆不吉。"},
		{ "地盤": "開門", "人盤": "杜門", "地門人門": "開門杜門", "剋應": "主失脫，刊印書契，小凶。"},
		{ "地盤": "開門", "人盤": "景門", "地門人門": "開門景門", "剋應": "主見貴人，因文書不利。"},
		{ "地盤": "開門", "人盤": "死門", "地門人門": "開門死門", "剋應": "主官司驚憂，先憂後喜。"},
		{ "地盤": "開門", "人盤": "驚門", "地門人門": "開門驚門", "剋應": "主百事不利。"},
		{ "地盤": "休門", "人盤": "休門", "地門人門": "休門休門", "剋應": "求財，進人口，謁貴吉，上任，修造亦大利。"},
		{ "地盤": "休門", "人盤": "生門", "地門人門": "休門生門", "剋應": "主得陰人財物，謁貴謀望，雖遲也吉。"},
		{ "地盤": "休門", "人盤": "傷門", "地門人門": "休門傷門", "剋應": "上官喜慶，求財不得，有親戚分產，變動事不吉。"},
		{ "地盤": "休門", "人盤": "杜門", "地門人門": "休門杜門", "剋應": "主破財，失物難尋。"},
		{ "地盤": "休門", "人盤": "景門", "地門人門": "休門景門", "剋應": "主求文書印信事不至，反招口舌小凶。"},
		{ "地盤": "休門", "人盤": "死門", "地門人門": "休門死門", "剋應": "主文印官司事不吉，遠行，僧道事不吉，占病凶。"},
		{ "地盤": "休門", "人盤": "驚門", "地門人門": "休門驚門", "剋應": "主損財、招非並疾病、驚恐事。"},
		{ "地盤": "休門", "人盤": "開門", "地門人門": "休門開門", "剋應": "主開張店鋪及見貴、求財等喜事大吉。"},
		{ "地盤": "生門", "人盤": "生門", "地門人門": "生門生門", "剋應": "主遠行、求財、婚姻、生育吉。"},
		{ "地盤": "生門", "人盤": "傷門", "地門人門": "生門傷門", "剋應": "主親友變動，道路不吉。"},
		{ "地盤": "生門", "人盤": "杜門", "地門人門": "生門杜門", "剋應": "主陰謀，陰人破財，不利。"},
		{ "地盤": "生門", "人盤": "景門", "地門人門": "生門景門", "剋應": "主陰人、小口不甯及文書事，後吉。"},
		{ "地盤": "生門", "人盤": "死門", "地門人門": "生門死門", "剋應": "主田宅官司，病主難救。"},
		{ "地盤": "生門", "人盤": "驚門", "地門人門": "生門驚門", "剋應": "主尊長財產、詞訟，病遲愈，吉。"},
		{ "地盤": "生門", "人盤": "開門", "地門人門": "生門開門", "剋應": "主見貴人，求財大發。"},
		{ "地盤": "生門", "人盤": "休門", "地門人門": "生門休門", "剋應": "主陰人處求謀財利。"},
		{ "地盤": "傷門", "人盤": "傷門", "地門人門": "傷門傷門", "剋應": "主變動，遠行折傷，凶。"},
		{ "地盤": "傷門", "人盤": "杜門", "地門人門": "傷門杜門", "剋應": "主變動，失脫，官司，桎梏，百事凶。"},
		{ "地盤": "傷門", "人盤": "景門", "地門人門": "傷門景門", "剋應": "主文書印信，口舌，惹是生非。"},
		{ "地盤": "傷門", "人盤": "死門", "地門人門": "傷門死門", "剋應": "主官司印信凶，出行大忌，占病凶。"},
		{ "地盤": "傷門", "人盤": "驚門", "地門人門": "傷門驚門", "剋應": "主親人疾病憂驚，媒伐不利，凶。"},
		{ "地盤": "傷門", "人盤": "開門", "地門人門": "傷門開門", "剋應": "主見貴人、開張、走失、變動之事，不利。"},
		{ "地盤": "傷門", "人盤": "休門", "地門人門": "傷門休門", "剋應": "主男人變動或托人辦事，財名不利。"},
		{ "地盤": "傷門", "人盤": "生門", "地門人門": "傷門生門", "剋應": "主房產、種植事業，凶。"},
		{ "地盤": "杜門", "人盤": "杜門", "地門人門": "杜門杜門", "剋應": "主因父母疾病、田宅出脫事，凶。"},
		{ "地盤": "杜門", "人盤": "景門", "地門人門": "杜門景門", "剋應": "主文書印信阻隔，男人小口疾病，遲疑不利。"},
		{ "地盤": "杜門", "人盤": "死門", "地門人門": "杜門死門", "剋應": "主田宅文書失落，官司破財，小凶。"},
		{ "地盤": "杜門", "人盤": "驚門", "地門人門": "杜門驚門", "剋應": "主門戶內憂疑驚恐，並有詞訟事。"},
		{ "地盤": "杜門", "人盤": "開門", "地門人門": "杜門開門", "剋應": "主見貴人官長，謀事主先破己財，後吉。"},
		{ "地盤": "杜門", "人盤": "休門", "地門人門": "杜門休門", "剋應": "主求財有益。"},
		{ "地盤": "杜門", "人盤": "生門", "地門人門": "杜門生門", "剋應": "主男人小口破財，田宅求財不利。"},
		{ "地盤": "杜門", "人盤": "傷門", "地門人門": "杜門傷門", "剋應": "主兄弟相爭，破財不利。"},
		{ "地盤": "景門", "人盤": "景門", "地門人門": "景門景門", "剋應": "主文狀未動有預先見之意，內有男人小口憂患。"},
		{ "地盤": "景門", "人盤": "死門", "地門人門": "景門死門", "剋應": "主官訟，因田宅事相爭，惹麻煩。"},
		{ "地盤": "景門", "人盤": "驚門", "地門人門": "景門驚門", "剋應": "主官訟，女人小口疾病，凶。"},
		{ "地盤": "景門", "人盤": "開門", "地門人門": "景門開門", "剋應": "主官人升遷，吉，求文印更吉。"},
		{ "地盤": "景門", "人盤": "休門", "地門人門": "景門休門", "剋應": "主文書遺失，爭訟不休。"},
		{ "地盤": "景門", "人盤": "生門", "地門人門": "景門生門", "剋應": "主陰人生產大喜，更主求財旺利，行人皆吉。"},
		{ "地盤": "景門", "人盤": "傷門", "地門人門": "景門傷門", "剋應": "主姻親小口口舌。"},
		{ "地盤": "景門", "人盤": "杜門", "地門人門": "景門杜門", "剋應": "主失脫文書，敗財後平。"},
		{ "地盤": "死門", "人盤": "死門", "地門人門": "死門死門", "剋應": "主官事稽留，印信無氣，凶。"},
		{ "地盤": "死門", "人盤": "驚門", "地門人門": "死門驚門", "剋應": "主因官司不結，憂疑患病，凶。"},
		{ "地盤": "死門", "人盤": "開門", "地門人門": "死門開門", "剋應": "主見貴人，求印信文書事大利。"},
		{ "地盤": "死門", "人盤": "休門", "地門人門": "死門休門", "剋應": "主求財物事不吉，若問僧道求方吉。"},
		{ "地盤": "死門", "人盤": "生門", "地門人門": "死門生門", "剋應": "主喪事，求財得，占病死而復生。"},
		{ "地盤": "死門", "人盤": "傷門", "地門人門": "死門傷門", "剋應": "主官司動而被刑杖，凶。"},
		{ "地盤": "死門", "人盤": "杜門", "地門人門": "死門杜門", "剋應": "主破財，婦人風疾，腹腫，阻絕凶。"},
		{ "地盤": "死門", "人盤": "景門", "地門人門": "死門景門", "剋應": "主因文契印信財產事見官，先怒後喜，不凶。"},
		{ "地盤": "驚門", "人盤": "驚門", "地門人門": "驚門驚門", "剋應": "主疾病，憂慮，驚恐。"},
		{ "地盤": "驚門", "人盤": "開門", "地門人門": "驚門開門", "剋應": "主官司憂疑，能見貴人不凶。"},
		{ "地盤": "驚門", "人盤": "休門", "地門人門": "驚門休門", "剋應": "主求財事或口舌事，遲吉。"},
		{ "地盤": "驚門", "人盤": "生門", "地門人門": "驚門生門", "剋應": "主因婦人生產或求財事驚憂，皆吉。"},
		{ "地盤": "驚門", "人盤": "傷門", "地門人門": "驚門傷門", "剋應": "主因商議同謀害人，事泄惹訟，凶。"},
		{ "地盤": "驚門", "人盤": "杜門", "地門人門": "驚門杜門", "剋應": "主因失脫破財驚恐，不凶。"},
		{ "地盤": "驚門", "人盤": "景門", "地門人門": "驚門景門", "剋應": "主詞訟不息，小口疾病，凶。"},
		{ "地盤": "驚門", "人盤": "死門", "地門人門": "驚門死門", "剋應": "主因宅中怪異而生是非，凶。"}
	];

	var 人盤八門, 地盤八門, 地人盤八門, 門加門索引;

	for(var i=1; i<10; i++){
		var 門加門剋應元件={
			"人盤": "",
			"地盤": "",
			"剋應文": ""
		};
		if(i!=5){
			人盤八門=遁甲盤.天盤[i].八門;
			地盤八門=遁甲盤.地盤[i].八門;
			地人盤八門=人盤八門+地盤八門;
			//console.log(地人盤八門);
			門加門剋引=_.findIndex(門加門矩陣, {地門人門: 地人盤八門});
			if (門加門剋引 != -1) {
				門加門剋應元件.人盤 = 人盤八門; 門加門剋應元件.地盤=地盤八門;
				門加門剋應元件.剋應文 = 人盤八門 + "加" + 地盤八門 + "，" + 門加門矩陣[門加門剋引].剋應;
				遁甲盤.天盤[i].格局.八門.push(門加門剋應元件);
				//遁甲盤.測試文矩陣.push(門加門剋應元件.剋應文);
			} //end if found index	
		} //end if !=5
	} // end for
}


function 八門加天干(遁甲盤){
	var 八門加天干矩陣=[
		{ "地盤": "開門", "人盤": "戊", "人門天盤干": "開門戊", "剋應": "財名俱得。"},
		{ "地盤": "開門", "人盤": "乙", "人門天盤干": "開門乙", "剋應": "小財可求。"},
		{ "地盤": "開門", "人盤": "丙", "人門天盤干": "開門丙", "剋應": "貴人印綬。"},
		{ "地盤": "開門", "人盤": "丁", "人門天盤干": "開門丁", "剋應": "遠信必至。"},
		{ "地盤": "開門", "人盤": "己", "人門天盤干": "開門己", "剋應": "事緒不定。"},
		{ "地盤": "開門", "人盤": "庚", "人門天盤干": "開門庚", "剋應": "道路詞訟，謀為兩岐。"},
		{ "地盤": "開門", "人盤": "辛", "人門天盤干": "開門辛", "剋應": "陰人道路。"},
		{ "地盤": "開門", "人盤": "壬", "人門天盤干": "開門壬", "剋應": "遠行有失，注意破財。"},
		{ "地盤": "開門", "人盤": "癸", "人門天盤干": "開門癸", "剋應": "陰人失財小凶。"},
		{ "地盤": "休門", "人盤": "戊", "人門天盤干": "休門戊", "剋應": "財物和合。"},
		{ "地盤": "休門", "人盤": "乙", "人門天盤干": "休門乙", "剋應": "求謀重，不得，求輕，可得。"},
		{ "地盤": "休門", "人盤": "丙", "人門天盤干": "休門丙", "剋應": "文書和合喜慶。"},
		{ "地盤": "休門", "人盤": "丁", "人門天盤干": "休門丁", "剋應": "百訟休歇。"},
		{ "地盤": "休門", "人盤": "己", "人門天盤干": "休門己", "剋應": "暗昧不甯，後吉。"},
		{ "地盤": "休門", "人盤": "庚", "人門天盤干": "休門庚", "剋應": "文書詞訟先結後解。"},
		{ "地盤": "休門", "人盤": "辛", "人門天盤干": "休門辛", "剋應": "疾病退愈，失物不得。"},
		{ "地盤": "休門", "人盤": "壬", "人門天盤干": "休門壬", "剋應": "陰人詞訟牽連。"},
		{ "地盤": "休門", "人盤": "癸", "人門天盤干": "休門癸", "剋應": "陰人詞訟牽連。"},
		{ "地盤": "生門", "人盤": "戊", "人門天盤干": "生門戊", "剋應": "嫁娶、求財、謁貴皆吉。"},
		{ "地盤": "生門", "人盤": "乙", "人門天盤干": "生門乙", "剋應": "主陰人生產，遲吉。"},
		{ "地盤": "生門", "人盤": "丙", "人門天盤干": "生門丙", "剋應": "主貴人印綏、婚姻、書信喜事。"},
		{ "地盤": "生門", "人盤": "丁", "人門天盤干": "生門丁", "剋應": "主詞訟、婚姻、財利大吉。"},
		{ "地盤": "生門", "人盤": "己", "人門天盤干": "生門己", "剋應": "主得貴人維持，吉。"},
		{ "地盤": "生門", "人盤": "庚", "人門天盤干": "生門庚", "剋應": "主財產爭訟破產，不利。"},
		{ "地盤": "生門", "人盤": "辛", "人門天盤干": "生門辛", "剋應": "主產婦疾病，後吉。"},
		{ "地盤": "生門", "人盤": "壬", "人門天盤干": "生門壬", "剋應": "主遺失財後得，賊盜易獲。"},
		{ "地盤": "生門", "人盤": "癸", "人門天盤干": "生門癸", "剋應": "主婚姻不成，余事皆吉。"},
		{ "地盤": "傷門", "人盤": "戊", "人門天盤干": "傷門戊", "剋應": "主失脫難獲。"},
		{ "地盤": "傷門", "人盤": "乙", "人門天盤干": "傷門乙", "剋應": "主求謀不得，反防盜失財。"},
		{ "地盤": "傷門", "人盤": "丙", "人門天盤干": "傷門丙", "剋應": "主道路損失。"},
		{ "地盤": "傷門", "人盤": "丁", "人門天盤干": "傷門丁", "剋應": "主音信不至。"},
		{ "地盤": "傷門", "人盤": "己", "人門天盤干": "傷門己", "剋應": "主財散人病。"},
		{ "地盤": "傷門", "人盤": "庚", "人門天盤干": "傷門庚", "剋應": "主訟獄被刑杖，凶。"},
		{ "地盤": "傷門", "人盤": "辛", "人門天盤干": "傷門辛", "剋應": "主夫妻懷私恣怨。"},
		{ "地盤": "傷門", "人盤": "壬", "人門天盤干": "傷門壬", "剋應": "主囚盜牽連。"},
		{ "地盤": "傷門", "人盤": "癸", "人門天盤干": "傷門癸", "剋應": "主訟獄被冤，有理難伸。"},
		{ "地盤": "杜門", "人盤": "戊", "人門天盤干": "杜門戊", "剋應": "主謀事不成，秘處求財得。"},
		{ "地盤": "杜門", "人盤": "乙", "人門天盤干": "杜門乙", "剋應": "宜暗求男人財物，得主不明致訟。"},
		{ "地盤": "杜門", "人盤": "丙", "人門天盤干": "杜門丙", "剋應": "主文契遺失。"},
		{ "地盤": "杜門", "人盤": "丁", "人門天盤干": "杜門丁", "剋應": "主男人訟獄。"},
		{ "地盤": "杜門", "人盤": "己", "人門天盤干": "杜門己", "剋應": "主私謀害人招非。"},
		{ "地盤": "杜門", "人盤": "庚", "人門天盤干": "杜門庚", "剋應": "主因女人訟獄被刑。"},
		{ "地盤": "杜門", "人盤": "辛", "人門天盤干": "杜門辛", "剋應": "主打傷人，詞訟，男人小口凶。"},
		{ "地盤": "杜門", "人盤": "壬", "人門天盤干": "杜門壬", "剋應": "主奸盜事，凶。"},
		{ "地盤": "杜門", "人盤": "癸", "人門天盤干": "杜門癸", "剋應": "主百事皆阻，病者不食。"},
		{ "地盤": "景門", "人盤": "戊", "人門天盤干": "景門戊", "剋應": "因財產詞訟，遠行吉。"},
		{ "地盤": "景門", "人盤": "乙", "人門天盤干": "景門乙", "剋應": "主訟事不成。"},
		{ "地盤": "景門", "人盤": "丙", "人門天盤干": "景門丙", "剋應": "主文書急迫，火速不利。"},
		{ "地盤": "景門", "人盤": "丁", "人門天盤干": "景門丁", "剋應": "主因文書印狀招非。"},
		{ "地盤": "景門", "人盤": "己", "人門天盤干": "景門己", "剋應": "主官司牽連。"},
		{ "地盤": "景門", "人盤": "庚", "人門天盤干": "景門庚", "剋應": "主訟人自訟。"},
		{ "地盤": "景門", "人盤": "辛", "人門天盤干": "景門辛", "剋應": "主陰人詞訟。"},
		{ "地盤": "景門", "人盤": "壬", "人門天盤干": "景門壬", "剋應": "主因賊牽連。"},
		{ "地盤": "景門", "人盤": "癸", "人門天盤干": "景門癸", "剋應": "主因奴婢受刑。"},
		{ "地盤": "死門", "人盤": "戊", "人門天盤干": "死門戊", "剋應": "主作偽財。"},
		{ "地盤": "死門", "人盤": "乙", "人門天盤干": "死門乙", "剋應": "主求事不成。"},
		{ "地盤": "死門", "人盤": "丙", "人門天盤干": "死門丙", "剋應": "主信息憂疑。"},
		{ "地盤": "死門", "人盤": "丁", "人門天盤干": "死門丁", "剋應": "主老陽人疾病。"},
		{ "地盤": "死門", "人盤": "己", "人門天盤干": "死門己", "剋應": "主病訟牽連不已，凶。"},
		{ "地盤": "死門", "人盤": "庚", "人門天盤干": "死門庚", "剋應": "主女人生產，母子俱凶。"},
		{ "地盤": "死門", "人盤": "辛", "人門天盤干": "死門辛", "剋應": "主盜賊失脫難獲。"},
		{ "地盤": "死門", "人盤": "壬", "人門天盤干": "死門壬", "剋應": "主訟人自訟自招。"},
		{ "地盤": "死門", "人盤": "癸", "人門天盤干": "死門癸", "剋應": "主婦女嫁娶事凶。"},
		{ "地盤": "驚門", "人盤": "戊", "人門天盤干": "驚門戊", "剋應": "主損財，信阻。"},
		{ "地盤": "驚門", "人盤": "乙", "人門天盤干": "驚門乙", "剋應": "主謀財不得。"},
		{ "地盤": "驚門", "人盤": "丙", "人門天盤干": "驚門丙", "剋應": "主文書印信驚恐。"},
		{ "地盤": "驚門", "人盤": "丁", "人門天盤干": "驚門丁", "剋應": "主詞訟牽連。"},
		{ "地盤": "驚門", "人盤": "己", "人門天盤干": "驚門己", "剋應": "主惡犬傷人成訟。"},
		{ "地盤": "驚門", "人盤": "庚", "人門天盤干": "驚門庚", "剋應": "主道路損折，遇賊盜，凶。"},
		{ "地盤": "驚門", "人盤": "辛", "人門天盤干": "驚門辛", "剋應": "主女人成訟，凶。"},
		{ "地盤": "驚門", "人盤": "壬", "人門天盤干": "驚門壬", "剋應": "主官司囚禁，病者大凶。"},
		{ "地盤": "驚門", "人盤": "癸", "人門天盤干": "驚門癸", "剋應": "主被盜，失物難獲。"}
	];

	var 人盤八門, 天盤天干, 八門天干, 門加門索引;

	for(var i=1; i<10; i++){
		var 門加干剋應元件={
			"人盤八門": "",
			"天盤天干": "",
			"剋應文": ""
		};
		if(i!=5){
			人盤八門=遁甲盤.天盤[i].八門;
			天盤天干=遁甲盤.天盤[i].天干;
			八門天干=人盤八門+天盤天干;
			//console.log(八門天干);
			門加干剋引=_.findIndex(八門加天干矩陣, {人門天盤干: 八門天干});
			if (門加干剋引 != -1) {
				門加干剋應元件.人盤八門 = 人盤八門; 門加干剋應元件.天盤天干=天盤天干;
				門加干剋應元件.剋應文 = 人盤八門 + "加" + 天盤天干 + "，" + 八門加天干矩陣[門加干剋引].剋應;
				遁甲盤.天盤[i].格局.十干.push(門加干剋應元件);
				//遁甲盤.測試文矩陣.push(門加干剋應元件.剋應文);
			} //end if found index	
		} //end if !=5
	} // end for
}

// ***************** 天干 *****************

function 十干剋應(遁甲盤){
	var 十干剋應矩陣=[
		{ "天盤": "乙", "地盤": "戊", "天盤干地盤干": "乙戊", "條件": "天盤乙加地盤戊", "格局": "陰害陽門", "剋應": "遇此利陰不利陽，門吉尚可謀事，門凶、門迫則破財傷人。"},
		{ "天盤": "乙", "地盤": "乙", "天盤干地盤干": "乙乙", "條件": "天盤乙加地盤乙", "格局": "日奇伏吟", "剋應": "此不宜見上層領導、貴人、求名求利；只宜安分守己。"},
		{ "天盤": "乙", "地盤": "丙", "天盤干地盤干": "乙丙", "條件": "天盤乙加地盤丙", "格局": "奇儀順遂", "剋應": "遇此逢吉星遷官晉職。逢凶星則夫妻反目離別。"},
		{ "天盤": "乙", "地盤": "丁", "天盤干地盤干": "乙丁", "條件": "天盤乙加地盤丁", "格局": "奇儀相佐", "剋應": "最利文書、考試，百事吉利。"},
		{ "天盤": "乙", "地盤": "己", "天盤干地盤干": "乙己", "條件": "天盤乙加地盤己", "格局": "日奇入墓", "剋應": "遇凶事必凶，得生、開二吉門為地遁。"},
		{ "天盤": "乙", "地盤": "庚", "天盤干地盤干": "乙庚", "條件": "天盤乙加地盤庚", "格局": "日奇被刑", "剋應": "此為爭訟財產，夫妻懷有私意。"},
		{ "天盤": "乙", "地盤": "辛", "天盤干地盤干": "乙辛", "條件": "天盤乙加地盤辛", "格局": "靑龍逃走", "剋應": "遇此人亡財破，奴僕拐帶，六畜皆傷，測婚姻則為女逃男。"},
		{ "天盤": "乙", "地盤": "壬", "天盤干地盤干": "乙壬", "條件": "天盤乙加地盤壬", "格局": "日奇入地", "剋應": "遇此尊卑悖亂，官訟是非，有人謀害之事。"},
		{ "天盤": "乙", "地盤": "癸", "天盤干地盤干": "乙癸", "條件": "天盤乙加地盤癸", "格局": "華蓋逢星", "剋應": "遇此宜遁跡修道，隱匿藏形，躲災避難為吉。"},
		{ "天盤": "丙", "地盤": "戊", "天盤干地盤干": "丙戊", "條件": "天盤丙加地盤戊", "格局": "飛鳥跌穴", "剋應": "遇此百事皆吉，事業可為，可謀大事。"},
		{ "天盤": "丙", "地盤": "乙", "天盤干地盤干": "丙乙", "條件": "天盤丙加地盤乙", "格局": "曰月並行", "剋應": "遇此為公為私皆吉，但宜自制為上。"},
		{ "天盤": "丙", "地盤": "丙", "天盤干地盤干": "丙丙", "條件": "天盤丙加地盤丙", "格局": "月奇悖師", "剋應": "遇此文書逼迫，破耗遺失。主單據或票証不明遺失。"},
		{ "天盤": "丙", "地盤": "丁", "天盤干地盤干": "丙丁", "條件": "天盤丙加地盤丁", "格局": "星奇朱雀", "剋應": "遇此貴人文書吉利，常人平靜安樂，得三吉門為天遁。"},
		{ "天盤": "丙", "地盤": "己", "天盤干地盤干": "丙己", "條件": "天盤丙加地盤己", "格局": "火悖入刑", "剋應": "遇此會囚人刑杖，文書不行，吉門得吉，凶門轉凶。"},
		{ "天盤": "丙", "地盤": "庚", "天盤干地盤干": "丙庚", "條件": "天盤丙加地盤庚", "格局": "熒入太白", "剋應": "遇此門戶破敗，盜賊耗失，事業也凶。"},
		{ "天盤": "丙", "地盤": "辛", "天盤干地盤干": "丙辛", "條件": "天盤丙加地盤辛", "格局": "日月相會", "剋應": "遇此謀事能成，為疾病人會遇良醫。"},
		{ "天盤": "丙", "地盤": "壬", "天盤干地盤干": "丙壬", "條件": "天盤丙加地盤壬", "格局": "火入天羅", "剋應": "因壬水沖克丙火，所以為客不利，是非頗多。"},
		{ "天盤": "丙", "地盤": "癸", "天盤干地盤干": "丙癸", "條件": "天盤丙加地盤癸", "格局": "華蓋悖師", "剋應": "遇此被陰人害事，災禍頻生。"},
		{ "天盤": "丁", "地盤": "戊", "天盤干地盤干": "丁戊", "條件": "天盤丁加地盤戊", "格局": "育龍轉光", "剋應": "遇此官人會升遷，常人會威昌，百事皆吉。"},
		{ "天盤": "丁", "地盤": "乙", "天盤干地盤干": "丁乙", "條件": "天盤丁加地盤乙", "格局": "玉女奇生", "剋應": "遇此為人遁吉格，貴人加官晉爵，常人婚姻吉慶、財帛豐厚。"},
		{ "天盤": "丁", "地盤": "丙", "天盤干地盤干": "丁丙", "條件": "天盤丁加地盤丙", "格局": "星隨月轉", "剋應": "遇此貴人越級髙升，常人樂極生悲，但要忍耐，不然會引起更大的不幸。"},
		{ "天盤": "丁", "地盤": "丁", "天盤干地盤干": "丁丁", "條件": "天盤丁加地盤丁", "格局": "奇入太陰", "剋應": "遇此文書証件即至，喜事從心，萬事如意。"},
		{ "天盤": "丁", "地盤": "己", "天盤干地盤干": "丁己", "條件": "天盤丁加地盤己", "格局": "火入勾陳", "剋應": "遇此會遇奸私仇冤，而且事情多因女人。"},
		{ "天盤": "丁", "地盤": "庚", "天盤干地盤干": "丁庚", "條件": "天盤丁加地盤庚", "格局": "玉女刑殺", "剋應": "遇此則為文書阻隔，行人必歸。"},
		{ "天盤": "丁", "地盤": "辛", "天盤干地盤干": "丁辛", "條件": "天盤丁加地盤辛", "格局": "玉女伏虎", "剋應": "此諸事不順，罪人釋囚，官人失位。"},
		{ "天盤": "丁", "地盤": "壬", "天盤干地盤干": "丁壬", "條件": "天盤丁加地盤壬", "格局": "五神互合", "剋應": "遇此貴人恩詔，訟獄公平。測婚多為苟合。"},
		{ "天盤": "丁", "地盤": "癸", "天盤干地盤干": "丁癸", "條件": "天盤丁加地盤癸", "格局": "朱雀投江", "剋應": "遇此會逢文書口舌是非，驚官動府，詞訟不利，音信沉溺不到。"},
		{ "天盤": "戊", "地盤": "戊", "天盤干地盤干": "戊戊", "條件": "天盤戊加地盤戊", "格局": "靑龍伏吟", "剋應": "遇此凡事不利，道路閉塞，以守為吉。"},
		{ "天盤": "戊", "地盤": "乙", "天盤干地盤干": "戊乙", "條件": "天盤戊加地盤乙", "格局": "靑龍和會", "剋應": "門吉事也吉，門凶事也凶，最喜逢三吉門。"},
		{ "天盤": "戊", "地盤": "丙", "天盤干地盤干": "戊丙", "條件": "天盤戊加地盤丙", "格局": "靑龍返首", "剋應": "遇此謀事，大吉大利。但遇到迫、墓、擊、刑，就會吉事成凶。"},
		{ "天盤": "戊", "地盤": "丁", "天盤干地盤干": "戊丁", "條件": "天盤戊加地盤丁", "格局": "靑龍耀明", "剋應": "遇此宜見上級領導、貴人、求功名，為事吉利。但遇到墓、迫，則會招惹是非。"},
		{ "天盤": "戊", "地盤": "己", "天盤干地盤干": "戊己", "條件": "天盤戊加地盤己", "格局": "貴人入獄", "剋應": "遇此諸事不順，公私都不利。"},
		{ "天盤": "戊", "地盤": "庚", "天盤干地盤干": "戊庚", "條件": "天盤戊加地盤庚", "格局": "值符飛宮", "剋應": "遇此吉事不吉，凶事更凶，求財沒利益，測病也主凶。"},
		{ "天盤": "戊", "地盤": "辛", "天盤干地盤干": "戊辛", "條件": "天盤戊加地盤辛", "格局": "靑龍折足", "剋應": "遇此吉門有生助，還能謀事；若是遇凶門，主招災、失財或有足疾、折傷。"},
		{ "天盤": "戊", "地盤": "壬", "天盤干地盤干": "戊壬", "條件": "天盤戊加地盤壬", "格局": "靑龍破獄", "剋應": "遇此諸事破耗，陰陽事都不吉利。"},
		{ "天盤": "戊", "地盤": "癸", "天盤干地盤干": "戊癸", "條件": "天盤戊加地盤癸", "格局": "靑龍華蓋", "剋應": "逢吉門為吉，可招福臨門；逢凶門則事情多不利，為凶。"},
		{ "天盤": "己", "地盤": "戊", "天盤干地盤干": "己戊", "條件": "天盤己加地盤戊", "格局": "犬遇靑龍", "剋應": "遇此門吉則謀望遂意，上人見喜；若逢凶門，則枉費心機。"},
		{ "天盤": "己", "地盤": "乙", "天盤干地盤干": "己乙", "條件": "天盤己加地盤乙", "格局": "墓神不明", "剋應": "此為地戶逢星，宜遁跡隱形。"},
		{ "天盤": "己", "地盤": "丙", "天盤干地盤干": "己丙", "條件": "天盤己加地盤丙", "格局": "火悖地戶", "剋應": "遇此男人冤冤相害，女人必致淫污。"},
		{ "天盤": "己", "地盤": "丁", "天盤干地盤干": "己丁", "條件": "天盤己加地盤丁", "格局": "朱雀入墓", "剋應": "遇此會有文書詞訟，先曲后直。"},
		{ "天盤": "己", "地盤": "己", "天盤干地盤干": "己己", "條件": "天盤己加地盤己", "格局": "地戶逢鬼", "剋應": "遇此病者發凶或必死，百事不遂，暫不要謀事，謀事則凶。"},
		{ "天盤": "己", "地盤": "庚", "天盤干地盤干": "己庚", "條件": "天盤己加地盤庚", "格局": "刑格返名", "剋應": "遇此詞訟先動者不利，如臨陰星則有謀害之情。"},
		{ "天盤": "己", "地盤": "辛", "天盤干地盤干": "己辛", "條件": "天盤己加地盤辛", "格局": "游魂入墓", "剋應": "遇此易遭陰邪鬼魅作祟。"},
		{ "天盤": "己", "地盤": "壬", "天盤干地盤干": "己壬", "條件": "天盤己加地盤壬", "格局": "地網高張", "剋應": "遇此狡童佚女，奸情傷殺，子孫不肖。"},
		{ "天盤": "己", "地盤": "癸", "天盤干地盤干": "己癸", "條件": "天盤己加地盤癸", "格局": "地刑玄武", "剋應": "遇此男女疾病垂危，有囚獄詞訟之災。"},
		{ "天盤": "庚", "地盤": "戊", "天盤干地盤干": "庚戊", "條件": "天盤庚加地盤戊", "格局": "天乙伏宮", "剋應": "遇此百事不可謀，官司是非，大凶。"},
		{ "天盤": "庚", "地盤": "乙", "天盤干地盤干": "庚乙", "條件": "天盤庚加地盤乙", "格局": "太白逢星", "剋應": "遇此宜守不宜進，樂極生悲，謀事不利。"},
		{ "天盤": "庚", "地盤": "丙", "天盤干地盤干": "庚丙", "條件": "天盤庚加地盤丙", "格局": "太白入熒", "剋應": "遇此盜賊肯定要來，為客進利，為主破財，主客皆不利，且勞心勞力。"},
		{ "天盤": "庚", "地盤": "丁", "天盤干地盤干": "庚丁", "條件": "天盤庚加地盤丁", "格局": "太白受刑", "剋應": "遇此會因私匿或男女關係起官司是非，遇吉門有救，遇凶門則凶事更凶。"},
		{ "天盤": "庚", "地盤": "己", "天盤干地盤干": "庚己", "條件": "天盤庚加地盤己", "格局": "太白大刑", "剋應": "遇此主有官司口舌，因官訟被判刑，住牢獄更凶。"},
		{ "天盤": "庚", "地盤": "庚", "天盤干地盤干": "庚庚", "條件": "天盤庚加地盤庚", "格局": "太白同宮", "剋應": "遇此官災橫禍，兄弟或同輩朋友相沖撞，不利做事。"},
		{ "天盤": "庚", "地盤": "辛", "天盤干地盤干": "庚辛", "條件": "天盤庚加地盤辛", "格局": "太白重鋒", "剋應": "遇此不宜遠行，否則會車折馬傷，求財更為大凶。"},
		{ "天盤": "庚", "地盤": "壬", "天盤干地盤干": "庚壬", "條件": "天盤庚加地盤壬", "格局": "太白退位", "剋應": "遇此遠行道路會迷失，男女音信難通。"},
		{ "天盤": "庚", "地盤": "癸", "天盤干地盤干": "庚癸", "條件": "天盤庚加地盤癸", "格局": "太白沖刑", "剋應": "遇此主車禍，行人不至，官事不止，生育母子俱傷，大凶。"},
		{ "天盤": "辛", "地盤": "戊", "天盤干地盤干": "辛戊", "條件": "天盤辛加地盤戊", "格局": "困龍被傷", "剋應": "遇此主因官司破財，忌妄動。"},
		{ "天盤": "辛", "地盤": "乙", "天盤干地盤干": "辛乙", "條件": "天盤辛加地盤乙", "格局": "白虎猖狂", "剋應": "遇此家敗人亡，遠行多災殃；測婚主離散，而且多因男方。"},
		{ "天盤": "辛", "地盤": "丙", "天盤干地盤干": "辛丙", "條件": "天盤辛加地盤丙", "格局": "干合悖師", "剋應": "遇此逢門吉則事吉，門凶則事凶，測事易因財物致訟。"},
		{ "天盤": "辛", "地盤": "丁", "天盤干地盤干": "辛丁", "條件": "天盤辛加地盤丁", "格局": "獄神得奇", "剋應": "遇此經商求財獲利倍增，囚人逢天赦釋免。"},
		{ "天盤": "辛", "地盤": "己", "天盤干地盤干": "辛己", "條件": "天盤辛加地盤己", "格局": "入獄自刑", "剋應": "遇此奴僕背主，有苦訴訟難伸。"},
		{ "天盤": "辛", "地盤": "庚", "天盤干地盤干": "辛庚", "條件": "天盤辛加地盤庚", "格局": "白虎出力", "剋應": "遇此刀刃相交，主客相殘，遜讓退步尚行，強進則血濺衣衫。"},
		{ "天盤": "辛", "地盤": "辛", "天盤干地盤干": "辛辛", "條件": "天盤辛加地盤辛", "格局": "伏吟天庭", "剋應": "遇此公廢私就，訟獄自罹罪名。"},
		{ "天盤": "辛", "地盤": "壬", "天盤干地盤干": "辛壬", "條件": "天盤辛加地盤壬", "格局": "凶蛇入獄", "剋應": "遇此主兩男爭女，訟獄不息，先動者失理。"},
		{ "天盤": "辛", "地盤": "癸", "天盤干地盤干": "辛癸", "條件": "天盤辛加地盤癸", "格局": "天牢華蓋", "剋應": "遇此日月失明，誤入天網，口舌是非。"},
		{ "天盤": "壬", "地盤": "戊", "天盤干地盤干": "壬戊", "條件": "天盤壬加地盤戊", "格局": "小蛇化龍", "剋應": "遇此宜攀附權貴，男人發達，女人產嬰童。"},
		{ "天盤": "壬", "地盤": "乙", "天盤干地盤干": "壬乙", "條件": "天盤壬加地盤乙", "格局": "小蛇得勢", "剋應": "遇此女人柔順，男人通達，測孕育生子，祿馬光華。"},
		{ "天盤": "壬", "地盤": "丙", "天盤干地盤干": "壬丙", "條件": "天盤壬加地盤丙", "格局": "水蛇入火", "剋應": "遇此主官災刑禁，絡繹不絕。"},
		{ "天盤": "壬", "地盤": "丁", "天盤干地盤干": "壬丁", "條件": "天盤壬加地盤丁", "格局": "干合蛇刑", "剋應": "遇此主文書牽連，貴人匆匆，男吉女凶。"},
		{ "天盤": "壬", "地盤": "己", "天盤干地盤干": "壬己", "條件": "天盤壬加地盤己", "格局": "反吟蛇刑", "剋應": "遇此主官訟敗訴，大禍將至，順守可吉，妄動必凶。"},
		{ "天盤": "壬", "地盤": "庚", "天盤干地盤干": "壬庚", "條件": "天盤壬加地盤庚", "格局": "太白擒蛇", "剋應": "遇此主刑獄公平，立剖邪正，不宜操之過急。"},
		{ "天盤": "壬", "地盤": "辛", "天盤干地盤干": "壬辛", "條件": "天盤壬加地盤辛", "格局": "騰蛇相纏", "剋應": "遇此縱得吉門，也不能安寧，如果有謀望，則被人欺瞞。"},
		{ "天盤": "壬", "地盤": "壬", "天盤干地盤干": "壬壬", "條件": "天盤壬加地盤壬", "格局": "蛇入地羅", "剋應": "遇此主外人纏繞，內事索索，只有遇吉門吉星，才能免此蹉跎。"},
		{ "天盤": "壬", "地盤": "癸", "天盤干地盤干": "壬癸", "條件": "天盤壬加地盤癸", "格局": "幼女奸淫", "剋應": "遇此主有家丑外揚之事發生，門吉星凶，易反福為禍。"},
		{ "天盤": "癸", "地盤": "戊", "天盤干地盤干": "癸戊", "條件": "天盤癸加地盤戊", "格局": "天乙會合", "剋應": "遇此若逢吉門宜求財，婚姻喜美，吉人相助；若逢門凶迫制，反禍官非。"},
		{ "天盤": "癸", "地盤": "乙", "天盤干地盤干": "癸乙", "條件": "天盤癸加地盤乙", "格局": "華蓋逢星", "剋應": "遇此主貴人祿位，常人平安，門吉則吉，門凶則凶。"},
		{ "天盤": "癸", "地盤": "丙", "天盤干地盤干": "癸丙", "條件": "天盤癸加地盤丙", "格局": "華蓋悖師", "剋應": "貴賤逢之皆不利，唯上人見喜。"},
		{ "天盤": "癸", "地盤": "丁", "天盤干地盤干": "癸丁", "條件": "天盤癸加地盤丁", "格局": "騰蛇夭矯", "剋應": "遇此主文書官司，火焚也逃不掉。"},
		{ "天盤": "癸", "地盤": "己", "天盤干地盤干": "癸己", "條件": "天盤癸加地盤己", "格局": "華蓋地戶", "剋應": "遇此若是男女測之，則音信皆阻，只宜於躲災避難。"},
		{ "天盤": "癸", "地盤": "庚", "天盤干地盤干": "癸庚", "條件": "天盤癸加地盤庚", "格局": "太白入網", "剋應": "遇此主以暴力爭訟，自罹罪貴。"},
		{ "天盤": "癸", "地盤": "辛", "天盤干地盤干": "癸辛", "條件": "天盤癸加地盤辛", "格局": "網蓋天牢", "剋應": "遇此主官司敗訴，死罪難逃；測病亦大凶。"},
		{ "天盤": "癸", "地盤": "壬", "天盤干地盤干": "癸壬", "條件": "天盤癸加地盤壬", "格局": "復見騰蛇", "剋應": "遇此主嫁娶重婚，後嫁無子，不保年華。"},
		{ "天盤": "癸", "地盤": "癸", "天盤干地盤干": "癸癸", "條件": "天盤癸加地盤癸", "格局": "天網四張", "剋應": "遇此主行人失伴，病訟皆傷。"}
	];

	var 天盤天干, 地盤天干, 天地盤干, 天干剋應索引;

	for(var i=1; i<10; i++){
		var 天干剋應元件={
			"天盤": "",
			"地盤": "",
			"格局": "",
			"剋應文": ""
		};
		if(i!=5){
			天盤天干=遁甲盤.天盤[i].天干;
			地盤天干=遁甲盤.地盤[i].天干;
			天地盤干=天盤天干+地盤天干;
			//console.log(天地盤干);
			天干剋應索引=_.findIndex(十干剋應矩陣, {天盤干地盤干: 天地盤干});
			if (天干剋應索引 != -1) {
				天干剋應元件.天盤 = 天盤天干; 天干剋應元件.地盤=地盤天干; 天干剋應元件.格局=十干剋應矩陣[天干剋應索引].格局;
				天干剋應元件.剋應文 = 十干剋應矩陣[天干剋應索引].條件 + "為「" + 天干剋應元件.格局 + "」，" + 十干剋應矩陣[天干剋應索引].剋應;
				遁甲盤.天盤[i].格局.十干.push(天干剋應元件);
				//遁甲盤.測試文矩陣.push(天干剋應元件.剋應文);
			} //end if found index	
		} //end if !=5
	} // end for
} // end function 十干剋應



// ******************** 八卦宮位分析 輸出入Group Panel ********************

function 八卦宮位分析輸出(遁甲盤, GrpPanelAnchorTag){
	var 八宮分析矩陣=[];
	for(var i=1; i<10; i++){
		var 宮位分析文=[];
		var 八門分析文;

		if(i!=5){
			var 八宮分析元件={
				"SubGroupName": "",
				"ContentDisplay": ""
			};  //end 八宮分析元件

			八宮分析元件.SubGroupName = 遁甲盤.地盤[i].後天八卦 + "宮";
			if(遁甲盤.天盤[i].格局.八門.length>0){
				for(var j=0; j<遁甲盤.天盤[i].格局.八門.length; j++){
					宮位分析文.push(遁甲盤.天盤[i].格局.八門[j].剋應文);
				} // end for
			} //end if 八門 length >0

			if(遁甲盤.天盤[i].格局.十干.length>0){
				for(var j=0; j<遁甲盤.天盤[i].格局.十干.length; j++){
					宮位分析文.push(遁甲盤.天盤[i].格局.十干[j].剋應文);
				} // end for
			} //end if 天干 length >0
			八宮分析元件.ContentDisplay = 宮位分析文.join("<br><br>");
			八宮分析矩陣.push(八宮分析元件);
		} //end if if(i!=5)
	} // end for all 宮位
	$("#"+GrpPanelAnchorTag).html(DataArrytoPanelGrp(八宮分析矩陣, "八宮分析"));
}  // end function 八卦宮位分析輸出