function 遁甲起盤(輸入資料){
    var 輸入生日 = new 日期格式(輸入資料.西曆日期);
    var 干支曆=西曆轉換干支曆(輸入資料.西曆日期, 輸入資料.城市, 輸入資料.夜子時, 輸入資料.節氣用區域時間, 輸入資料.節氣用真太陽時, false, false);
    var 農曆= 西曆轉換農曆(輸入資料.西曆日期, 輸入資料.城市, 輸入資料.夜子時, false, false, false, false);
    var 遁甲盤=奇門遁甲盤架構(干支曆, 農曆.日期);

    var 曆法={
        "干支曆": 干支曆,
        "農曆": 農曆,
        "奇門遁甲盤": 遁甲盤, 
        "資訊": new function(){
                        this.人元司令= "";
                        this.日光節約= 日光節約(Number(輸入資料.年), 輸入資料.國家);
                        this.備註= "-";
                    },
        "備註": ""
    }  //end object 曆法
    return 曆法;
}

function 奇門遁甲盤架構(干支曆, 農曆日期){
    var 日期 = {
        "西曆": 干支曆.運算的西曆,
        "中文日期": 干支曆.中文日期,
        "農曆": 農曆日期,
        "干支曆": 干支曆.四柱,
        "日柱": 干支曆.日柱,
        "時柱": 干支曆.時柱,
        "節氣": 干支曆.節氣,
        "節氣數": 干支曆.節氣數,
        "節氣後天數": 干支曆.距離節氣的天數,
        "三旬": 干支曆.節氣旬.節氣三元,
        "交節日": 干支曆.交節,
        "值符字串": "",
        "值使字串": "",
        "節氣字串": "", 
        "日柱字串": "", 
        "時柱字串": ""
    }

    var 日柱旬首=干支尋旬首(日期.日柱);
    var 時柱旬首=干支尋旬首(日期.時柱);
    var 節氣遁甲局數=二十四節氣屬性(日期.節氣, "元件");
    var 遁甲局數=Number(節氣遁甲局數.遁甲局數.substr(日柱旬首.節氣三元數-1,1));
    var 遁甲地盤=九宮架構("奇門遁甲地盤");
    var 遁甲天盤=九宮架構("奇門遁甲天盤");
    var 遁甲陰陽=(日期.節氣數>=21 || 日期.節氣數<9) ? "陽" : "陰";

    //var 紫白飛星盤=九宮架構("紫白飛星");
    //九宮飛泊(紫白飛星盤, 7, "紫白飛星");
    //console.log(紫白飛星盤);

    九宮飛泊(遁甲地盤, 遁甲局數, "奇門遁甲");
    地盤三奇六儀配置(遁甲地盤, 遁甲陰陽);
    var 時干=日期.時柱.substr(0,1);
    if(時干=="甲") 時干="己";

    var 符首位置=_.findIndex(遁甲地盤, {天干: 時柱旬首.符首});
	var 符首後天八卦數=遁甲地盤[符首位置].後天八卦數;
    var 地盤時干位置=_.findIndex(遁甲地盤, {天干: 時干});
    var 值符=遁甲地盤[符首位置].九星;
    if(符首位置==5) 值符=遁甲地盤[3].九星;  //符首落中宮，取坤二宮的九星
    var 值使=遁甲地盤[符首位置].八門;
    var 值使位置= 0; // default value _.findIndex(遁甲地盤, {八門: 值使});
    var 值使後天八卦數= 0; // default value 遁甲地盤[值使位置].後天八卦數;

    // ********** 日期字串處理 *************
    日期.節氣字串=(日期.交節日!=true) ? 日期.節氣 + "「" + 節氣遁甲局數.遁甲局數 + "」" + "後" + 日期.節氣後天數 + "天，" + 日期.三旬 + "元" : 日期.節氣 + "【" + 節氣遁甲局數.遁甲局數 + "】" + "當天，" + 日期.三旬 + "元";
    日期.日柱字串=日期.日柱 + "日為" + 日柱旬首.旬別 + "旬，符首為「" + 日柱旬首.符首 + "」";
    日期.時柱字串=日期.時柱 + "時為" + 時柱旬首.旬別 + "旬，旬首為「" + 時柱旬首.符首 + "」";

    var 奇門遁甲盤={
        "日期": 日期,
        "陰陽遁": 遁甲陰陽,
        "節氣三元": 日柱旬首.節氣三元,
        "日旬首": 日柱旬首.旬別,
        "符首後天八卦數": 符首後天八卦數,
        "符頭": 日柱旬首.符頭,
        "旬首": 時柱旬首.旬別,
        "符首": 時柱旬首.符首,
        "地盤時干位置": 地盤時干位置,
        "符首位置": 符首位置,
        "值符位置": 地盤時干位置, //default
        "值符後天八卦數": 0,  //default
        "值符": 值符,
        "值使": 值使,
        "值使位置": 值使位置, 
        "值使後天八卦數": 值使後天八卦數,
        "節氣局數": 節氣遁甲局數.遁甲局數,
        "局數": 遁甲局數,
        "地盤": 遁甲地盤, 
        "天盤": 遁甲天盤,
        "符首落中宮": false,
        "時干落中宮": false,
        "空亡": "", //default
        "空亡宮1": 0, //default
        "空亡宮2": 0, //default
        "驛馬宮": 0, //default
        "測試文矩陣": [], //test result
        "局碼": ""
    };

    天盤三奇六儀配置(奇門遁甲盤);
	天盤八門配置(奇門遁甲盤);
    天盤八神配置(奇門遁甲盤);
    驛馬空亡配置(奇門遁甲盤);
    八門形態(奇門遁甲盤);
    十干剋應(奇門遁甲盤);
    八門加八門(奇門遁甲盤);
    八門加天干(奇門遁甲盤);
	//流年紫白飛星數(2006);
    return 奇門遁甲盤;
}


function 九宮架構(九宮盤) {
    // 九宮盤是不同的九宮盤架構，比方奇門遁甲地盤，紫白飛星等
    //一白坎、二黑坤、三碧震、四綠巽，五黃中，六白乾、七赤兌、八白艮、九紫離
    var 紫白飛星盤=[], 遁甲地盤=[], 遁甲天盤=[];

    for(var i=0; i<=9; i++){
        遁甲地盤.push(new 奇門遁甲地盤基數(i));
        遁甲天盤.push(new 奇門遁甲天盤基數(i));
        紫白飛星盤.push(new 紫白飛星盤基數(i));
    } // end for

    // *** 調整 ***
    遁甲地盤[0].後天八卦=undefined; 遁甲地盤[0].後天八卦數=undefined; 遁甲地盤[5].後天八卦=undefined; 

    switch(九宮盤){
        case "奇門遁甲地盤":
            return 遁甲地盤;
            break;
        case "奇門遁甲天盤":
            return 遁甲天盤;
            break;
        case "紫白飛星":
            return 紫白飛星盤;
            break;  
    } // end switch
    
}  //end function 九星飛泊

function 奇門遁甲地盤基數(九宮宮位數){
    var 後天八卦="-巽離坤震 兌艮坎乾";
    var 後天八卦中文數="-四九二三 七八一六";
    var 後天八卦數="0492357816";
    var 地盤天干="-乙辛己戊丙癸壬庚丁";
    var 地盤方向=["", "東南", "南", "西南", "東", "中", "西", "東北", "北", "西北"];
    var 地盤地支=["", "辰巳", "午", "未申", "卯", "", "酉", "丑寅", "子", "戌亥"];
    var 地盤五行="-木火土木 金土水金";
    var 地盤八門=["", "杜門", "景門", "死門", "傷門", "中門", "驚門", "生門", "休門", "開門"];
    var 地盤九星=["", "天輔", "天英", "天芮", "天沖", "天禽", "天柱", "天任", "天蓬", "天心"];
	//var 地盤干支=["", "甲午", "", "甲寅", "甲辰", "", "甲子", "", "", "甲戌"];

    this.宮數 = 九宮宮位數;
    this.天干 = 地盤天干.substr(九宮宮位數,1);
    this.地支 = 地盤地支[九宮宮位數];
    this.五行 = 地盤五行.substr(九宮宮位數,1);
    this.方向 = 地盤方向[九宮宮位數];
    this.八門 = 地盤八門[九宮宮位數];
    this.九星 = 地盤九星[九宮宮位數];
    this.寄星 = (九宮宮位數==2) ? "天禽" : ""; // 天禽星寄宮於坤宮
    this.後天八卦 = 後天八卦.substr(九宮宮位數,1);
    this.後天八卦數 = Number(後天八卦數.substr(九宮宮位數,1));
    this.後天八卦中文數 = 後天八卦中文數.substr(九宮宮位數 ,1);
    this.九宮飛泊數=0;
    if(九宮宮位數!=0 && 九宮宮位數!=5 && 九宮宮位數<=9) this.卦的屬性=八卦象意(後天八卦.substr(九宮宮位數,1), "元件"); else this.卦的屬性="";
} // end function 奇門遁甲地盤基數


function 奇門遁甲天盤基數(九宮宮位數){
    var 後天八卦數="0492357816";

    //var 後天八卦="-巽離坤震 兌艮坎乾";
    //var 地盤天干="-乙辛己戊丙癸壬庚丁";
    //var 地盤方向=["", "東南", "南", "西南", "東", "中", "兌", "東北", "北", "西北"];
    //var 地盤地支=["", "辰巳", "午", "未申", "卯", "", "酉", "丑寅", "子", "戌亥"];
    //var 地盤五行="-木火土木 金土水金";
    
    //var 地盤九星=["", "天輔", "天英", "天芮", "天沖", "", "天柱", "天任", "天蓬", "天心"];

    this.宮數 = 九宮宮位數;
    this.後天八卦數 = Number(後天八卦數.substr(九宮宮位數,1));
    this.天干 = "";
    this.八門 = "";
    this.八門形態 = "";
    this.九星 = "";
    this.八神 = "";
	this.寄神 = "";
    this.寄星 = "";
    this.寄宮天干=""; //如果符首落中宮，就會有借坤位的天干
    this.九宮飛泊數=0;
    this.空亡 = "";
    this.驛馬 = "";
    this.格局 = new function (){
                this.十干=[];
                this.八門=[];
            }  // end 格局
} // end function 奇門遁甲飛盤基數


function 紫白飛星盤基數(九宮宮位數){
    var 後天八卦數="0492357816";
    var 後天八卦="-巽離坤震 兌艮坎乾";
    var 方向=["", "東南", "南", "西南", "東", "中", "西", "東北", "北", "西北"];
    var 九星數據 = [
        { "數": "-", "顏色": "-", "星曜": "-", "五行": "-", "註解": "-"},
        { "數": "一", "顏色": "白", "星曜": "貪狼", "五行": "水", "註解": "-"},
        { "數": "二", "顏色": "黑", "星曜": "巨門", "五行": "土", "註解": "-"},
        { "數": "三", "顏色": "碧", "星曜": "祿存", "五行": "木", "註解": "-"},
        { "數": "四", "顏色": "綠", "星曜": "文曲", "五行": "木", "註解": "-"},
        { "數": "五", "顏色": "黃", "星曜": "廉貞", "五行": "土", "註解": "-"},
        { "數": "六", "顏色": "白", "星曜": "武曲", "五行": "金", "註解": "-"},
        { "數": "七", "顏色": "赤", "星曜": "破軍", "五行": "金", "註解": "-"},
        { "數": "八", "顏色": "白", "星曜": "左輔", "五行": "土", "註解": "-"},
        { "數": "九", "顏色": "紫", "星曜": "右弼", "五行": "火", "註解": "-"}
    ];

    this.宮數 = 九宮宮位數;
    this.後天八卦 = 後天八卦.substr(九宮宮位數,1);
    this.後天八卦數 = Number(後天八卦數.substr(九宮宮位數,1));
    this.方向 = 方向[九宮宮位數];
    this.九星 = 九星數據[Number(後天八卦數.substr(九宮宮位數,1))].星曜;
    this.飛星 = 九星數據[Number(後天八卦數.substr(九宮宮位數,1))].數 + 九星數據[Number(後天八卦數.substr(九宮宮位數,1))].顏色;
    this.九宮飛泊數=0;
} // end function 紫白飛星

function 流年紫白飛星數(流年年份){
	var 流年飛星數, Last2DigitSum, YearStr1=流年年份.toString();
	var SumDigit1=Number(YearStr1.substr(2,1)) + Number(YearStr1.substr(3,1));
	var YearStr2, SumDigit2;
	
	if(SumDigit1 > 9) {
		YearStr2=SumDigit1.toString();
		SumDigit2=Number(YearStr2.substr(0,1)) + Number(YearStr2.substr(1,1));
	}
	else SumDigit2=SumDigit1;
	
	if(流年年份<2000) 流年飛星數 = 10 - SumDigit2;
	if(流年年份>=2000) 流年飛星數 = 9 - SumDigit2;
	return 流年飛星數;
}

function 九宮飛泊(九宮, 局數, 飛泊法則){
    //九宮 is the array of the 九星架構
    //局數在奇門遁甲是指哪個宮位開始起飛；在紫白飛星則是指那個數在中宮
    var 飛泊基數, 飛泊數;

    switch(飛泊法則){
        case "奇門遁甲":
            // 以那個宮位起飛為1，比方4局，就由4宮開始起飛，為1
            飛泊基數 = 局數-1;
            break;
        case "紫白飛星":
            飛泊基數 = 5-局數;
            break;
        default:  //奇門遁甲
            飛泊基數 = 局數-1;
    }

    for (i=1; i<=9; i++){
        飛泊數=九宮[i].後天八卦數 - 飛泊基數;
        if(飛泊數<=0) 飛泊數=飛泊數+9;
        if(飛泊數>9) 飛泊數=飛泊數-9;
        九宮[i].九宮飛泊數=飛泊數;
    } // end for
} // end function 九宮飛泊

function 地盤三奇六儀配置(九宮, 陰陽遁) {
    // 九宮 is the array of the 九星架構
    // 陰陽遁 看陽遁還是陰遁
    // 九宮飛泊的基數需要事先計算好

    var 陽遁三奇六儀="戊己庚辛壬癸丁丙乙";
    var 陰遁三奇六儀="戊乙丙丁癸壬辛庚己";
    var 地盤八門=["休門", "死門", "傷門", "杜門", "", "開門", "驚門", "生門", "景門"];

    var 三奇六儀順序=(陰陽遁=="陽")? 陽遁三奇六儀 : 陰遁三奇六儀;

    for (i=1; i<=9; i++){
        九宮[i].天干=三奇六儀順序.substr(九宮[i].九宮飛泊數-1,1);
    }
}

function 天盤三奇六儀配置(遁甲盤) {
    var 符首位置=遁甲盤.符首位置;
    var 天盤天干="", 寄宮天干;

    switch(符首位置){
        case 1:
            天盤天干=遁甲盤.地盤[2].天干 + 遁甲盤.地盤[3].天干 + 遁甲盤.地盤[6].天干 + 遁甲盤.地盤[9].天干 + 遁甲盤.地盤[8].天干 + 遁甲盤.地盤[7].天干 + 遁甲盤.地盤[4].天干;
            break;
        case 2:
            天盤天干=遁甲盤.地盤[3].天干 + 遁甲盤.地盤[6].天干 + 遁甲盤.地盤[9].天干 + 遁甲盤.地盤[8].天干 + 遁甲盤.地盤[7].天干 + 遁甲盤.地盤[4].天干 + 遁甲盤.地盤[1].天干;
            break;
        case 3:
            天盤天干=遁甲盤.地盤[6].天干 + 遁甲盤.地盤[9].天干 + 遁甲盤.地盤[8].天干 + 遁甲盤.地盤[7].天干 + 遁甲盤.地盤[4].天干 + 遁甲盤.地盤[1].天干 + 遁甲盤.地盤[2].天干;
            break;
        case 4:
            天盤天干=遁甲盤.地盤[1].天干 + 遁甲盤.地盤[2].天干 + 遁甲盤.地盤[3].天干 + 遁甲盤.地盤[6].天干 + 遁甲盤.地盤[9].天干 + 遁甲盤.地盤[8].天干 + 遁甲盤.地盤[7].天干;
            break;  
        case 6:
            天盤天干=遁甲盤.地盤[9].天干 + 遁甲盤.地盤[8].天干 + 遁甲盤.地盤[7].天干 + 遁甲盤.地盤[4].天干 + 遁甲盤.地盤[1].天干 + 遁甲盤.地盤[2].天干 + 遁甲盤.地盤[3].天干;
            break;
        case 7:
            天盤天干=遁甲盤.地盤[4].天干 + 遁甲盤.地盤[1].天干 + 遁甲盤.地盤[2].天干 + 遁甲盤.地盤[3].天干 + 遁甲盤.地盤[6].天干 + 遁甲盤.地盤[9].天干 + 遁甲盤.地盤[8].天干;
            break;
        case 8:
            天盤天干=遁甲盤.地盤[7].天干 + 遁甲盤.地盤[4].天干 + 遁甲盤.地盤[1].天干 + 遁甲盤.地盤[2].天干 + 遁甲盤.地盤[3].天干 + 遁甲盤.地盤[6].天干 + 遁甲盤.地盤[9].天干;
            break;
        case 9:
            天盤天干=遁甲盤.地盤[8].天干 + 遁甲盤.地盤[7].天干 + 遁甲盤.地盤[4].天干 + 遁甲盤.地盤[1].天干 + 遁甲盤.地盤[2].天干 + 遁甲盤.地盤[3].天干 + 遁甲盤.地盤[6].天干;
            break;
        case 5:
            遁甲盤.符首落中宮=true;
            寄宮天干=遁甲盤.地盤[3].天干;
            天盤天干=遁甲盤.地盤[6].天干 + 遁甲盤.地盤[9].天干 + 遁甲盤.地盤[8].天干 + 遁甲盤.地盤[7].天干 + 遁甲盤.地盤[4].天干 + 遁甲盤.地盤[1].天干 + 遁甲盤.地盤[2].天干;
            break;
    } //end switch


    switch(遁甲盤.地盤時干位置){
        case 1:
            遁甲盤.天盤[1].天干=遁甲盤.符首;
            遁甲盤.天盤[2].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[3].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[6].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[9].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[8].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[7].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[4].天干=天盤天干.substr(6,1);
            break;
        case 2:
            遁甲盤.天盤[2].天干=遁甲盤.符首;
            遁甲盤.天盤[3].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[6].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[9].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[8].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[7].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[4].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[1].天干=天盤天干.substr(6,1);
            break;
        case 3:
            遁甲盤.天盤[3].天干=遁甲盤.符首;
            遁甲盤.天盤[6].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[9].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[8].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[7].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[4].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[1].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[2].天干=天盤天干.substr(6,1);
            break;
        case 6:
            遁甲盤.天盤[6].天干=遁甲盤.符首;
            遁甲盤.天盤[9].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[8].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[7].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[4].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[1].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[2].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[3].天干=天盤天干.substr(6,1);
            break;
        case 9:
            遁甲盤.天盤[9].天干=遁甲盤.符首;
            遁甲盤.天盤[8].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[7].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[4].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[1].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[2].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[3].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[6].天干=天盤天干.substr(6,1);
            break;
        case 8:
            遁甲盤.天盤[8].天干=遁甲盤.符首;
            遁甲盤.天盤[7].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[4].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[1].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[2].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[3].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[6].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[9].天干=天盤天干.substr(6,1);
            break;
        case 7:
            遁甲盤.天盤[7].天干=遁甲盤.符首;
            遁甲盤.天盤[4].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[1].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[2].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[3].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[6].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[9].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[8].天干=天盤天干.substr(6,1);
            break;
        case 4:
            遁甲盤.天盤[4].天干=遁甲盤.符首;
            遁甲盤.天盤[1].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[2].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[3].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[6].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[9].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[8].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[7].天干=天盤天干.substr(6,1);
            break;
        case 5:  //時干落中宮，與3，坤為同
            遁甲盤.時干落中宮=true;
            寄宮天干=遁甲盤.地盤[5].天干;
            遁甲盤.天盤[3].天干=遁甲盤.符首;
            遁甲盤.天盤[6].天干=天盤天干.substr(0,1);
            遁甲盤.天盤[9].天干=天盤天干.substr(1,1);
            遁甲盤.天盤[8].天干=天盤天干.substr(2,1);
            遁甲盤.天盤[7].天干=天盤天干.substr(3,1);
            遁甲盤.天盤[4].天干=天盤天干.substr(4,1);
            遁甲盤.天盤[1].天干=天盤天干.substr(5,1);
            遁甲盤.天盤[2].天干=天盤天干.substr(6,1);
            break;
        default:
            alert("地盤時干位置不在八卦宮位: " + 遁甲盤.地盤時干位置);    
    }  //end switch

    if(遁甲盤.符首落中宮) {  //調整天干位置
        遁甲盤.天盤[遁甲盤.地盤時干位置].天干=遁甲盤.地盤[3].天干;
        遁甲盤.天盤[遁甲盤.地盤時干位置].寄宮天干=遁甲盤.地盤[5].天干;
    } 

    /* else {
        遁甲盤.天盤[3].寄宮天干=遁甲盤.地盤[5].天干;
    } */
}

function 天盤八門配置(遁甲盤) {
    var 符首位置=遁甲盤.符首位置;
    var 天盤八門=[], 寄宮八門;
    var 天盤九星=[], 寄宮九星;

	var 時柱旬別序數=六十干支屬性(遁甲盤.日期.時柱, "旬序");
	var 遁甲地盤=遁甲盤.地盤;


    switch(符首位置){
        case 1:
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            break;
        case 2:
            天盤八門.push(遁甲盤.地盤[2].八門);
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);          
            break;
        case 3:
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);          
            break;
        case 4:
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);          
            break;  
        case 6:
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);
            天盤八門.push(遁甲盤.地盤[3].八門);
        case 7:
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            break;
        case 8:
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);           
            break;
        case 9:
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);           
            break;
        case 5:
            天盤八門.push(遁甲盤.地盤[3].八門);
            天盤八門.push(遁甲盤.地盤[6].八門);
            天盤八門.push(遁甲盤.地盤[9].八門);
            天盤八門.push(遁甲盤.地盤[8].八門);
            天盤八門.push(遁甲盤.地盤[7].八門);
            天盤八門.push(遁甲盤.地盤[4].八門);
            天盤八門.push(遁甲盤.地盤[1].八門);
            天盤八門.push(遁甲盤.地盤[2].八門);
            遁甲盤.值使=遁甲盤.地盤[3].八門;
            break;
    } //end switch

    var 值使地盤位置=_.findIndex(遁甲地盤, {八門: 遁甲盤.值使});  //not used, used 遁甲盤.符首位置 instead
    var 值使地盤後天八卦數=(遁甲盤.符首位置 != 5) ? 遁甲地盤[遁甲盤.符首位置].後天八卦數 : 2; //如果符首落中宮，寄居坤二宮
    遁甲盤.值使後天八卦數=(遁甲盤.陰陽遁=="陽") ? 九宮滾動(值使地盤後天八卦數, 時柱旬別序數) : 九宮滾動(值使地盤後天八卦數, 時柱旬別序數*(-1));
    遁甲盤.值使位置= _.findIndex(遁甲地盤, {後天八卦數: 遁甲盤.值使後天八卦數});
    if(遁甲盤.值使位置==5) 遁甲盤.值使位置=3;

    switch(遁甲盤.值使位置){
        case 1:
            遁甲盤.天盤[1].八門=天盤八門[0];
            遁甲盤.天盤[2].八門=天盤八門[1];
            遁甲盤.天盤[3].八門=天盤八門[2];
            遁甲盤.天盤[6].八門=天盤八門[3];
            遁甲盤.天盤[9].八門=天盤八門[4];
            遁甲盤.天盤[8].八門=天盤八門[5];
            遁甲盤.天盤[7].八門=天盤八門[6];
            遁甲盤.天盤[4].八門=天盤八門[7];           
            break;
        case 2:
            遁甲盤.天盤[2].八門=天盤八門[0];
            遁甲盤.天盤[3].八門=天盤八門[1];
            遁甲盤.天盤[6].八門=天盤八門[2];
            遁甲盤.天盤[9].八門=天盤八門[3];
            遁甲盤.天盤[8].八門=天盤八門[4];
            遁甲盤.天盤[7].八門=天盤八門[5];
            遁甲盤.天盤[4].八門=天盤八門[6];
            遁甲盤.天盤[1].八門=天盤八門[7];            
            break;
        case 3: case 5:
            遁甲盤.天盤[3].八門=天盤八門[0];
            遁甲盤.天盤[6].八門=天盤八門[1];
            遁甲盤.天盤[9].八門=天盤八門[2];
            遁甲盤.天盤[8].八門=天盤八門[3];
            遁甲盤.天盤[7].八門=天盤八門[4];
            遁甲盤.天盤[4].八門=天盤八門[5];
            遁甲盤.天盤[1].八門=天盤八門[6];
            遁甲盤.天盤[2].八門=天盤八門[7];           
            break;
        case 6:
            遁甲盤.天盤[6].八門=天盤八門[0];
            遁甲盤.天盤[9].八門=天盤八門[1];
            遁甲盤.天盤[8].八門=天盤八門[2];
            遁甲盤.天盤[7].八門=天盤八門[3];
            遁甲盤.天盤[4].八門=天盤八門[4];
            遁甲盤.天盤[1].八門=天盤八門[5];
            遁甲盤.天盤[2].八門=天盤八門[6];
            遁甲盤.天盤[3].八門=天盤八門[7];
            break;
        case 9:
            遁甲盤.天盤[9].八門=天盤八門[0];
            遁甲盤.天盤[8].八門=天盤八門[1];
            遁甲盤.天盤[7].八門=天盤八門[2];
            遁甲盤.天盤[4].八門=天盤八門[3];
            遁甲盤.天盤[1].八門=天盤八門[4];
            遁甲盤.天盤[2].八門=天盤八門[5];
            遁甲盤.天盤[3].八門=天盤八門[6];
            遁甲盤.天盤[6].八門=天盤八門[7];
            break;
        case 8:
            遁甲盤.天盤[8].八門=天盤八門[0];
            遁甲盤.天盤[7].八門=天盤八門[1];
            遁甲盤.天盤[4].八門=天盤八門[2];
            遁甲盤.天盤[1].八門=天盤八門[3];
            遁甲盤.天盤[2].八門=天盤八門[4];
            遁甲盤.天盤[3].八門=天盤八門[5];
            遁甲盤.天盤[6].八門=天盤八門[6];
            遁甲盤.天盤[9].八門=天盤八門[7];
            break;
        case 7:
            遁甲盤.天盤[7].八門=天盤八門[0];
            遁甲盤.天盤[4].八門=天盤八門[1];
            遁甲盤.天盤[1].八門=天盤八門[2];
            遁甲盤.天盤[2].八門=天盤八門[3];
            遁甲盤.天盤[3].八門=天盤八門[4];
            遁甲盤.天盤[6].八門=天盤八門[5];
            遁甲盤.天盤[9].八門=天盤八門[6];
            遁甲盤.天盤[8].八門=天盤八門[7];
            break;
        case 4:
            遁甲盤.天盤[4].八門=天盤八門[0];
            遁甲盤.天盤[1].八門=天盤八門[1];
            遁甲盤.天盤[2].八門=天盤八門[2];
            遁甲盤.天盤[3].八門=天盤八門[3];
            遁甲盤.天盤[6].八門=天盤八門[4];
            遁甲盤.天盤[9].八門=天盤八門[5];
            遁甲盤.天盤[8].八門=天盤八門[6];
            遁甲盤.天盤[7].八門=天盤八門[7];
            break;        
	}
    //遁甲盤.值使=遁甲盤.地盤[3].八門;


    //*********** 九星配置 **************
    switch(符首位置){
        case 1:
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            break;
        case 2:
            天盤九星.push(遁甲盤.地盤[2].九星);
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);          
            break;
        case 3:
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);          
            break;
        case 4:
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);          
            break;  
        case 6:
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);
            天盤九星.push(遁甲盤.地盤[3].九星);
        case 7:
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            break;
        case 8:
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);           
            break;
        case 9:
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);           
            break;
        case 5:
            天盤九星.push(遁甲盤.地盤[3].九星);
            天盤九星.push(遁甲盤.地盤[6].九星);
            天盤九星.push(遁甲盤.地盤[9].九星);
            天盤九星.push(遁甲盤.地盤[8].九星);
            天盤九星.push(遁甲盤.地盤[7].九星);
            天盤九星.push(遁甲盤.地盤[4].九星);
            天盤九星.push(遁甲盤.地盤[1].九星);
            天盤九星.push(遁甲盤.地盤[2].九星);
            遁甲盤.值符=遁甲盤.地盤[3].九星;
            break;
    } //end switch

    switch(遁甲盤.地盤時干位置){
        case 1:
            遁甲盤.天盤[1].九星=天盤九星[0];
            遁甲盤.天盤[2].九星=天盤九星[1];
            遁甲盤.天盤[3].九星=天盤九星[2];
            遁甲盤.天盤[6].九星=天盤九星[3];
            遁甲盤.天盤[9].九星=天盤九星[4];
            遁甲盤.天盤[8].九星=天盤九星[5];
            遁甲盤.天盤[7].九星=天盤九星[6];
            遁甲盤.天盤[4].九星=天盤九星[7];           
            break;
        case 2:
            遁甲盤.天盤[2].九星=天盤九星[0];
            遁甲盤.天盤[3].九星=天盤九星[1];
            遁甲盤.天盤[6].九星=天盤九星[2];
            遁甲盤.天盤[9].九星=天盤九星[3];
            遁甲盤.天盤[8].九星=天盤九星[4];
            遁甲盤.天盤[7].九星=天盤九星[5];
            遁甲盤.天盤[4].九星=天盤九星[6];
            遁甲盤.天盤[1].九星=天盤九星[7];            
            break;
        case 3: case 5:
            遁甲盤.天盤[3].九星=天盤九星[0];
            遁甲盤.天盤[6].九星=天盤九星[1];
            遁甲盤.天盤[9].九星=天盤九星[2];
            遁甲盤.天盤[8].九星=天盤九星[3];
            遁甲盤.天盤[7].九星=天盤九星[4];
            遁甲盤.天盤[4].九星=天盤九星[5];
            遁甲盤.天盤[1].九星=天盤九星[6];
            遁甲盤.天盤[2].九星=天盤九星[7];           
            break;
        case 6:
            遁甲盤.天盤[6].九星=天盤九星[0];
            遁甲盤.天盤[9].九星=天盤九星[1];
            遁甲盤.天盤[8].九星=天盤九星[2];
            遁甲盤.天盤[7].九星=天盤九星[3];
            遁甲盤.天盤[4].九星=天盤九星[4];
            遁甲盤.天盤[1].九星=天盤九星[5];
            遁甲盤.天盤[2].九星=天盤九星[6];
            遁甲盤.天盤[3].九星=天盤九星[7];
            break;
        case 9:
            遁甲盤.天盤[9].九星=天盤九星[0];
            遁甲盤.天盤[8].九星=天盤九星[1];
            遁甲盤.天盤[7].九星=天盤九星[2];
            遁甲盤.天盤[4].九星=天盤九星[3];
            遁甲盤.天盤[1].九星=天盤九星[4];
            遁甲盤.天盤[2].九星=天盤九星[5];
            遁甲盤.天盤[3].九星=天盤九星[6];
            遁甲盤.天盤[6].九星=天盤九星[7];
            break;
        case 8:
            遁甲盤.天盤[8].九星=天盤九星[0];
            遁甲盤.天盤[7].九星=天盤九星[1];
            遁甲盤.天盤[4].九星=天盤九星[2];
            遁甲盤.天盤[1].九星=天盤九星[3];
            遁甲盤.天盤[2].九星=天盤九星[4];
            遁甲盤.天盤[3].九星=天盤九星[5];
            遁甲盤.天盤[6].九星=天盤九星[6];
            遁甲盤.天盤[9].九星=天盤九星[7];
            break;
        case 7:
            遁甲盤.天盤[7].九星=天盤九星[0];
            遁甲盤.天盤[4].九星=天盤九星[1];
            遁甲盤.天盤[1].九星=天盤九星[2];
            遁甲盤.天盤[2].九星=天盤九星[3];
            遁甲盤.天盤[3].九星=天盤九星[4];
            遁甲盤.天盤[6].九星=天盤九星[5];
            遁甲盤.天盤[9].九星=天盤九星[6];
            遁甲盤.天盤[8].九星=天盤九星[7];
            break;
        case 4:
            遁甲盤.天盤[4].九星=天盤九星[0];
            遁甲盤.天盤[1].九星=天盤九星[1];
            遁甲盤.天盤[2].九星=天盤九星[2];
            遁甲盤.天盤[3].九星=天盤九星[3];
            遁甲盤.天盤[6].九星=天盤九星[4];
            遁甲盤.天盤[9].九星=天盤九星[5];
            遁甲盤.天盤[8].九星=天盤九星[6];
            遁甲盤.天盤[7].九星=天盤九星[7];
            break;
    } // end switch 九星配置
    遁甲盤.天盤[_.findIndex(遁甲盤.天盤, {九星: "天芮"})].寄星="天禽";
    //*************************
} // end function 

function 天盤八神配置(遁甲盤) {
    var 陽遁八神=["值符", "騰蛇", "太陰", "六合", "白虎", "玄武", "九地", "九天"];
    var 陰遁八神=["值符", "九天", "九地", "玄武", "白虎", "六合", "太陰", "騰蛇"];
    // 朱雀 - 玄武，勾陳 - 白虎
    var 八神順序=(遁甲盤.陰陽遁=="陽")? 陽遁八神 : 陰遁八神;   

    switch(遁甲盤.值符位置){
        case 1:
            遁甲盤.天盤[1].八神=八神順序[0];
            遁甲盤.天盤[2].八神=八神順序[1];
            遁甲盤.天盤[3].八神=八神順序[2];
            遁甲盤.天盤[6].八神=八神順序[3];
            遁甲盤.天盤[9].八神=八神順序[4];
            遁甲盤.天盤[8].八神=八神順序[5];
            遁甲盤.天盤[7].八神=八神順序[6];
            遁甲盤.天盤[4].八神=八神順序[7];
            break;
        case 2:
            遁甲盤.天盤[2].八神=八神順序[0];
            遁甲盤.天盤[3].八神=八神順序[1];
            遁甲盤.天盤[6].八神=八神順序[2];
            遁甲盤.天盤[9].八神=八神順序[3];
            遁甲盤.天盤[8].八神=八神順序[4];
            遁甲盤.天盤[7].八神=八神順序[5];
            遁甲盤.天盤[4].八神=八神順序[6];
            遁甲盤.天盤[1].八神=八神順序[7];
            break;
        case 3:
            遁甲盤.天盤[3].八神=八神順序[0];
            遁甲盤.天盤[6].八神=八神順序[1];
            遁甲盤.天盤[9].八神=八神順序[2];
            遁甲盤.天盤[8].八神=八神順序[3];
            遁甲盤.天盤[7].八神=八神順序[4];
            遁甲盤.天盤[4].八神=八神順序[5];
            遁甲盤.天盤[1].八神=八神順序[6];
            遁甲盤.天盤[2].八神=八神順序[7];
            break;
        case 6:
            遁甲盤.天盤[6].八神=八神順序[0];
            遁甲盤.天盤[9].八神=八神順序[1];
            遁甲盤.天盤[8].八神=八神順序[2];
            遁甲盤.天盤[7].八神=八神順序[3];
            遁甲盤.天盤[4].八神=八神順序[4];
            遁甲盤.天盤[1].八神=八神順序[5];
            遁甲盤.天盤[2].八神=八神順序[6];
            遁甲盤.天盤[3].八神=八神順序[7];
            break;
        case 9:
            遁甲盤.天盤[9].八神=八神順序[0];
            遁甲盤.天盤[8].八神=八神順序[1];
            遁甲盤.天盤[7].八神=八神順序[2];
            遁甲盤.天盤[4].八神=八神順序[3];
            遁甲盤.天盤[1].八神=八神順序[4];
            遁甲盤.天盤[2].八神=八神順序[5];
            遁甲盤.天盤[3].八神=八神順序[6];
            遁甲盤.天盤[6].八神=八神順序[7];
            break;
        case 8:
            遁甲盤.天盤[8].八神=八神順序[0];
            遁甲盤.天盤[7].八神=八神順序[1];
            遁甲盤.天盤[4].八神=八神順序[2];
            遁甲盤.天盤[1].八神=八神順序[3];
            遁甲盤.天盤[2].八神=八神順序[4];
            遁甲盤.天盤[3].八神=八神順序[5];
            遁甲盤.天盤[6].八神=八神順序[6];
            遁甲盤.天盤[9].八神=八神順序[7];
            break;
        case 7:
            遁甲盤.天盤[7].八神=八神順序[0];
            遁甲盤.天盤[4].八神=八神順序[1];
            遁甲盤.天盤[1].八神=八神順序[2];
            遁甲盤.天盤[2].八神=八神順序[3];
            遁甲盤.天盤[3].八神=八神順序[4];
            遁甲盤.天盤[6].八神=八神順序[5];
            遁甲盤.天盤[9].八神=八神順序[6];
            遁甲盤.天盤[8].八神=八神順序[7];
            break;
        case 4:
            遁甲盤.天盤[4].八神=八神順序[0];
            遁甲盤.天盤[1].八神=八神順序[1];
            遁甲盤.天盤[2].八神=八神順序[2];
            遁甲盤.天盤[3].八神=八神順序[3];
            遁甲盤.天盤[6].八神=八神順序[4];
            遁甲盤.天盤[9].八神=八神順序[5];
            遁甲盤.天盤[8].八神=八神順序[6];
            遁甲盤.天盤[7].八神=八神順序[7];
            break;
        case 5:  //時干落中宮，與3，坤為同
            遁甲盤.時干落中宮=true;
            寄宮天干=遁甲盤.地盤[5].八神;
            遁甲盤.天盤[3].八神=八神順序[0];
            遁甲盤.天盤[6].八神=八神順序[1];
            遁甲盤.天盤[9].八神=八神順序[2];
            遁甲盤.天盤[8].八神=八神順序[3];
            遁甲盤.天盤[7].八神=八神順序[4];
            遁甲盤.天盤[4].八神=八神順序[5];
            遁甲盤.天盤[1].八神=八神順序[6];
            遁甲盤.天盤[2].八神=八神順序[7];
            break;  
    } //end switch
	
	for(i=1; i<10; i++){
		if(遁甲盤.天盤[i].八神=="白虎") 遁甲盤.天盤[i].寄神="勾陳";
		if(遁甲盤.天盤[i].八神=="玄武") 遁甲盤.天盤[i].寄神="朱雀";
	} // end for
	
    遁甲盤.值符位置=_.findIndex(遁甲盤.天盤, {八神: "值符"});
    遁甲盤.值符後天八卦數=遁甲盤.地盤[遁甲盤.值符位置].後天八卦數;
}


// --------------------------------------------------
function 驛馬空亡配置(遁甲盤) {
    遁甲盤.空亡=判空亡(遁甲盤.日期.時柱);
    switch(遁甲盤.空亡){
        case "戌亥": //甲子旬，乾宫空
            遁甲盤.空亡宮1=9;
            遁甲盤.空亡宮2=0;
            遁甲盤.天盤[9].空亡="空&#x26AA;";
            break;
        case "子丑": //甲寅旬，坎和艮宫空
            遁甲盤.空亡宮1=8;
            遁甲盤.空亡宮2=7;
            遁甲盤.天盤[8].空亡="空&#x26AA;";
            遁甲盤.天盤[7].空亡="空&#x26AA;";
            break;
        case "寅卯": //甲辰旬，艮和震宫空
            遁甲盤.空亡宮1=7;
            遁甲盤.空亡宮2=4;
            遁甲盤.天盤[7].空亡="空&#x26AA;";
            遁甲盤.天盤[4].空亡="空&#x26AA;";
            break;
        case "辰巳": //甲午旬，巽宫空
            遁甲盤.空亡宮1=1;
            遁甲盤.空亡宮2=0;
            遁甲盤.天盤[1].空亡="空&#x26AA;";
            break;
        case "午未": //甲申旬，离宫空
            遁甲盤.空亡宮1=2;
            遁甲盤.空亡宮2=0;
            遁甲盤.天盤[2].空亡="空&#x26AA;";
            break;
        case "申酉": //甲戌旬，坤和兑宫空
            遁甲盤.空亡宮1=3;
            遁甲盤.空亡宮2=6;
            遁甲盤.天盤[3].空亡="空&#x26AA;";
            遁甲盤.天盤[6].空亡="空&#x26AA;";
            break;
        default:
            alert(遁甲盤.空亡 + "：空亡配置錯誤！");
    }// end switch

    var 時支=遁甲盤.日期.時柱.substr(1,1);
    switch(時支){
        case "亥": case "卯": case "未": //巽宫
            遁甲盤.驛馬宮=1;
            遁甲盤.天盤[1].驛馬="馬&#9816;";
            break;
        case "申": case "子": case "辰": //艮宫
            遁甲盤.驛馬宮=7;
            遁甲盤.天盤[7].驛馬="馬&#9816;";
            break;
        case "寅": case "午": case "戌": //坤宫
            遁甲盤.驛馬宮=3;
            遁甲盤.天盤[3].驛馬="馬&#9816;";
            break;
        case "巳": case "酉": case "丑": //乾宫
            遁甲盤.驛馬宮=9;
            遁甲盤.天盤[9].驛馬="馬&#9816;";
            break;
        default:
            alert(時支 + "：驛馬配置錯誤！");
    }// end switch 時支
}