

function 八卦象意(八卦, 選項){
	//選項: 元件，速查矩陣，八卦，係數 ...............
	var 八卦象意矩陣=[
		{ "卦名": "坤", "係數": 0, "二進制": "000", "拼音": "kūn", "陰陽": "陰", "五行": "土", "卦象": "地", "概念": "坤為地，表現地的功能、承載、潛意識及柔順的性質。大地、方形、柔順、平安、開闊、穩健、文雅、勤儉、謙卑、依賴、迷惘、憂慮、慈悲、安靜、溫厚、踏實、沉默、伏藏、遲緩、包容、含蓄、消極、沉默、優柔、寡斷、懦弱、卑賤、丑陋等。", "形態": "方形、柔軟、粗笨、能容、普通、共用、虛空、包容的、黃色、粉狀、平整、數多。", "方位": "西南方，北方（先天八卦方位），下方，底層。", "季節": "夏季末，農歷六月、七月，未、申年、月、日、時，辰、戌、丑、未五行為土年，月、月、日，立秋至白露。", "天象": "多雲、陰天、霧氣、露水、低氣壓、溫暖。", "人物": "在國家為皇后、第一夫人；<br>在單位為職工、群眾；<br>在家庭為母親、祖母，為老母、后母、老婦人；<br>在社會為眾人、為鄉人、為小人、為大腹人、為懦弱之人、吝嗇這人；<br>在性別為女；<br>在年齡為老婦，老年女人。", "地理": "原野、田野、平地、盆地、空地、鄉村、農村、牧場、農舍、民房、農貿市場、曠野、矮屋、下方、底層、集會場所、辦公室、公園、倉庫、寢室、殯儀館、肉類加工廠、雞窩、兔圈、操場、庄稼地。", "數字": "二（后天八卦數）、八（先天八卦數）、五、十（五行土數）。", "動物": "牛、羊、螞蟻、蜘蛛、烏鴉、鴿子、海鷗、雌性百獸、夜行動物、牝馬。", "靜物": "衣服、瓷器、方形物、方柔之物、水泥、磚瓦、五谷、布帛、絲棉、土中之物、食品、大車、鍋瓦、衣服、藥品、箱子、日用品、農具、婦女用品、書包、紙張、汽車等。", "性情": "溫柔謙虛、行動遲緩、吝嗇消極、守信誠實、固執保守。", "人體": "腹、脾臟、胃、肚臍、右手、右肩（九宮位）、耳、肌肉、女性生殖器、腸、消化器官。", "疾病": "胃病、消化系統疾病、食欲不振、貧血、下體流血、過度疲勞、失眠、惡心、消化不良、下痢、便秘、黃疸、皮膚病、肩周炎、虛脫、惡死、傷寒、健忘、皮膚斑、虛脫、浮腫、暈症、慢性病、癌症。", "顏色": "黃色、黑色。", "五味": "甘、甜"},
		{ "卦名": "艮", "係數": 1, "二進制": "001", "拼音": "gěn", "陰陽": "陰", "五行": "土", "卦象": "山", "概念": "艮為山，為土，表示靜止和安定的狀態。靜止、開始、變化、轉折、改革、斷絕、呆板、穩定、固守、慎重、等待、困難、遲滯、誠實、守信、阻隔、艱難、安定。", "形態": "堅硬的、頑固的、與腿腳有關的、向下發展的、上硬下軟的、停止不前的、獨立存在的、靜止的、保守的。", "方位": "東北方，西北（先天八卦方位）。", "季節": "冬春之交，農歷十二月和正月，丑、寅年、月、日、時，立春至驚蟄。", "天象": "為雲，為霧，為嵐。", "人物": "在家庭為少男，表少年；<br>在社會為少年、兒童，為土建人員、宗教人員、官僚、貴族、繼承人、警衛、守門人、礦工、獄吏、石匠、儲蓄所人員。", "地理": "山地、丘陵、高台、堤壩、休息室、墳場、閣寺、房屋、監獄、公安機關、派出所、大樓、城牆、倉庫、宗廟、祠堂、礦山、採石場、銀行、貯藏室。", "數字": "七（先天八卦數）、八（九宮數）、五、十（五行土數）。", "動物": "老虎、狼、熊、狗、鼠、狐、鴿子、喜鵲、啄木鳥、爬虫、有尾動物。", "靜物": "岩石、山坡、階梯、石碑、土坑、椅子、桌子、床、瓜果、土中之物、木生之物、石刻、石塊、瓷器、門戶、門坎、台階、座位、屏風、牆壁。", "性情": "保守、固執、憨厚、穩重、誠實、守信、謹慎、遲緩、安靜、篤實、任勞任怨。", "人體": "背、腰、鼻、手、指、關節、左腿（九宮位）、腳腕、腳趾、乳房、脾、胃、結腸、男性生殖器。", "疾病": "筋骨酸痛、脾胃病、消化不良、虛弱、小兒麻痺症、瘡腫、瘤、結石、皮膚過敏、疑難症、虛脹、麻木、痘類疾病。", "顏色": "黃色、棕黃、咖啡色、或白色（八白）。", "五味": "甘、甜"},
		{ "卦名": "坎", "係數": 2, "二進制": "010", "拼音": "kǎn", "陰陽": "陽", "五行": "水", "卦象": "水", "概念": "坎為水，為月亮，表示艱難、險阻的狀態。勞苦、艱難、苦難、險阻、煩惱、陷落、沉溺、色情、誘惑、交際、交往、關系、結合、悲哀、哭泣、毒害、災難、躊躇、缺陷、失敗、困難、測量、思考、暗昧、滋潤、仁慈、沉默、智慧、聰明、狡詐、時尚、漂泊、隱伏。", "形態": "不規則形狀的、辛苦勞碌的、忍耐的、暗昧的、流動的、寒冷的、變化的。", "方位": "北方，西方（先天八卦方位）。", "季節": "冬天，農歷十一月，子年、月、日、時，冬至至大寒。", "天象": "雨、雪、雲、露、霜、水、寒風、霞、深夜、月。", "人物": "在家庭為中男，中年男子；<br>在社會為江湖之人、舟人、盜賊、匪徒，為數學、醫生、律師、逃亡者、黑社會之人、詐騙犯、勞務人員、酒鬼、娼婦、自來水公司人員。", "地理": "江河、湖海、溪澗、泉、井、溝渠、窪地、潮濕、下水道、魚池、浴池、酒吧、消防隊、妓院、娛樂場所、車站、碼頭、醫院、電影院、俱樂部、漁場、洗發房、水庫、黑暗的家、地下室、洗手間、廚房、廁所。", "數字": "一（九宮數）、六（五行水數，一、六水）。", "動物": "豬、狐狸、四足動物、夜行動物、鼠、水鳥、魚類、水中動物。", "靜物": "帶子、繩子、裙子、液體、飲料、酒油、湯具、水具、音像制品、文具、涂料、毒藥、黑色物、冷藏設備、消防設備、潛水艇、浮萍、輪子、船、墨水、帶核果品。", "性情": "善謀多智、獨立見解、創新思維、外柔內剛、隨波逐流。", "人體": "腎、膀胱、泌尿系統、生殖系統、血液、體液、骨髓、陰部、子宮、卵巢、膀胱、尿道、生殖器、內分泌系統、耳、肛門。", "疾病": "腎病、耳病、怕冷、水腫、瘡、月經不調、花柳病、性病、婦女病、中毒、血行不暢、腳部疾病、神經衰弱、抑郁症、糖尿病、血液病、膀胱病、尿道病、髓壞疽、風寒、拉肚子、遺精、流感等。", "顏色": "黑色、白色（玄空飛星顏色一白）。", "五味": "咸"},
		{ "卦名": "巽", "係數": 3, "二進制": "011", "拼音": "xùn", "陰陽": "陰", "五行": "木", "卦象": "風", "概念": "巽為風，表示自由活動和滲透性。空虛、柔和、順從、調和、疑惑、輕快、深入、淺出、高度、流動、貨運、迷途、謙遜、徘徊、號令、榮譽、普遍性、滲透性、沒有固定地點、自由運動、忙碌、奔波。", "形態": "煙狀氣態、輕飄輕浮、向下向理發展、上實下虛、神奇的、耳聞鼻嗅的、游動傳輸的、基礎差的、外實內虛的、外剛內柔的、忙碌的、波動的、神奇的、條形的。", "方位": "東南方，西南（先天八卦方位）。", "季節": "春夏之交，農歷三、四月，辰、巳年、月、日、時、立夏至芒種。", "天象": "風、大風、旋風、龍卷風、臭氣、下弦月。", "人物": "在家庭為長女、女兒；<br>在社會為科技人員、教師、僧尼、仙道這人，氣功師、練功者、商人、營業員、木材經營者、手藝人、能工巧匠、額頭寬的人，頭發細長而直的人，優柔寡斷的人，自由職業者。", "地理": "花木茂盛之地、山林、洞穴、草原、寺觀樓台、郵局、過道、長廊、升降機、索道、傳送帶、工藝廠、碼頭、商店、各種管道處、電梯、通風道、出入口、設計院。", "數字": "五（先天八卦數）、四（九宮數）、三、八（五行木數）。", "動物": "雞、鴨、鵝、蜻蜓、蝙蝠、蛤蟆、蜜蜂、壁虎、蜥蜴、蝶、蜻蜓、斑馬、長頸鹿、蛇、蚯蚓、帶魚、鰻魚、鱔魚。", "靜物": "扇子、電風扇、通風機器、樹木、木制品、纖維品、竹木品、香煙、水果、絲繩、藥材、鐵軌、汽艇、帆船、電線杆、氣球、抽屜、屏風、草鞋、椅子、床、風箏、毛巾、紙張、鉛筆、小刀、化妝用具、有香味的東西、拆信、雕刻物、香煙、宣傳品、各種票據、下面有口之物。", "性情": "優柔寡斷、柔和謙虛、心情徘徊、狡猾市儈、虛情假意、超俗世外、華而不實。", "人體": "股、膽、呼吸系統、食道、腸、神經、頭發、血管、腹部、左肩（九宮位）、筋腱、腋下、乳、耳、練功元氣。", "疾病": "傷風感冒、氣管阻塞、哮喘、支氣管炎、中風、肋骨神經痛、神經痛、內臟疾病、肝臟損害、臂部的病、脫肛、膽結石、禿頭病、食道疾病、痔瘡、狐臭、發惡臭的冰、毛髮病、動脈硬化、骨折、中風、受封、潔癖、膽疾、傳染病、坐骨神經痛、淋巴疾病、抽筋、強直強硬症、病情不穩定、左肩痛、脹氣、憂郁症、血管病。", "顏色": "綠色、藍色。", "五味": "酸"},
		{ "卦名": "震", "係數": 4, "二進制": "100", "拼音": "zhèn", "陰陽": "陽", "五行": "木", "卦象": "雷", "概念": "震為雷，表示震動、奮起的性質和狀態。震動、奮起、驚動、奮進、上升、躁動、積極、性急、沖動、顯現、影響、迅速、喧嘩、爭論、轉移、旺盛、發育、果斷、生長。", "形態": "震動、激烈的、有聲有響的、高速的、急躁的、外虛內實的、上虛下實、上大下小、好看而無內容的、粗糙的、移動的、滑動的、勇敢的、競爭的、吃驚的。", "方位": "為東方，東北方（天八卦方位）。", "季節": "春天。農歷二月，春分至谷雨，卯年、月、日、時。", "天象": "大冰雹、閃電、東風、雷雨、雷鳴、地震、海嘯、火山噴發。", "人物": "在國家和單位為當權的二把手；<br>在家庭為長男；<br>在社會為駕駛員、運動員、警察、法官、軍人、飛行員、列車員、社會活動家、舞蹈演員、足球愛好者、狂人、壯士。", "地理": "竹林、樹林、草木茂盛的地方、鬧市、繁華街道、騷亂場所、廣播電台、電影院、歌舞廳、公安機關、軍隊、機場、戰場、運動場、菜市場、停車廠、樂器店、夜總會、音樂學院、噪音大的場所、商店、游樂場、公園。", "數字": "四（先天八卦數）、三（后天八卦數、五行木數）、八（五行木數）。", "動物": "為龍、蛇、善鳴這馬，善鳴之鳥，百虫，鯉魚。", "靜物": "為木、竹、葦、樂器、蔬菜、鮮花、樹木、電話、飛機、汽車、火箭、鞭炮、鬧鐘、花草繁鮮之物、蹄、肉、山林野味。", "性情": "意氣風發、易怒性急、積極果斷、多動少靜、剛愎自用、勤奮直爽、自尊心強、獨斷專行、心煩意亂、寧死不屈。", "人體": "足、大拇指、肝臟、發、喉嚨、聲帶、左肋、神經、舌、左肩臂、左手。", "疾病": "神經病、足疾、扭傷、腳氣、發狂、歇斯底裡症、恐懼、精神失常、神經症、癲癇症、心悸、關節炎、肝臟疾病、氣喘、百日咳、喉嚨疾病、手足麻痺、毛發病、神經衰弱、神經過敏、婦科病、腿痛、多動症、碰撞性外傷。", "顏色": "青、綠、碧色。", "五味": "酸"},
		{ "卦名": "離", "係數": 5, "二進制": "101", "拼音": "lí", "陰陽": "陰", "五行": "火", "卦象": "火", "概念": "離為火，為目，表示光明、美麗的性質和狀態。外剛內柔，光明、美麗、變化、迅速、文明、流行、時尚、枯燥、空虛、尊敬、化妝、妝飾、警惕、文才、遠見、洞察、判斷、鑒定、餐館、暴露、虛偽。", "形態": "鮮艷的、明亮的、發光的、美麗的、中空的、可燃的、冒火的。", "方位": "南方，東方（先天八卦方位）。", "季節": "夏天，為農歷五月，為午年、月、日、時，夏至至大暑。", "天象": "太陽、晴天、熱天、中午、干旱、彩虹、光、閃電、雲霞。", "人物": "在家庭為中女、中年婦女；<br>在單位為中層干部；<br>在社會為中間層次人物，為美人、美容師、文人、作家、藝術家、演員、名星、編輯、偵察員、紀檢人員。", "地理": "朝陽的場所、天文台、電子產品、娛樂廳、電影院、圖書館、印刷廠、冶煉廠、電視台、火車站、火山、教堂、華麗街道、學校、文化部門、美容院、畫廊、殿堂、電廠、廣告牌。", "數字": "三（先天八卦數）、九（九宮數）、二、七（五行火數）。", "動物": "雉、龜、蚌、蟹、鳥、孔雀、火雞、熱帶魚、螢火虫、變色龍、甲殼虫。", "靜物": "報刊、圖書、字畫、文件、票據、証件、契約、執照、照片、電燈、電話、廣告、打火機、手機、電動機、鍋爐、玻璃門窗、電腦、電視、復印機、化妝品、電氣焊工具、電子產品。", "性情": "聰明、名譽、虛心、色情、重禮、愛美、喜歡裝扮、知書達理、易沖動、性急暴躁、內心空虛。", "人體": "眼睛、乳房、頭部、血液、心臟、小腸、神經、女人私處。", "疾病": "心臟病、眼疾、視力減退、近視、色盲、頭痛、精神疲勞、精神錯亂、耳疾、臉部疾病、失眠、幻症、燙傷、熱症。", "顏色": "紅色、赤色，花色，紫色（九紫）", "五味": "苦"},
		{ "卦名": "兌", "係數": 6, "二進制": "110", "拼音": "duì", "陰陽": "陰", "五行": "金", "卦象": "澤", "概念": "兌為澤，為雨，表示喜悅和言詞。口舌、議論、飲食、酒食、舞會、唱歌、慶典、娛樂、色情、接吻、恩惠、和睦、敬愛、偽善、機敏、雄辯、女性、愛欲、魅力。", "形態": "上面開口、外軟內堅、堅硬的、頑固的昂貴的、與口舌說唱有關的、金黃色的、發光發亮的、光滑的、鋒利的。", "方位": "西方，東南（先天八卦方位）。", "季節": "秋天，農歷八月，酉年、月、日、時，秋分到霜降。", "天象": "新月、黃昏、星、潮濕的天氣、氣壓低、露水、陰雨連綿、小雨。", "人物": "在家庭為少女、小女孩；<br>在社會為與嘴有關的職業，如講師、教授、演說家、講解員、翻譯、巫師、佔卜者、媒婆、傳達室人員、歌唱家、音樂家、相聲演員、娛樂場所人員、娼妓、牙科蓬生、外科醫生等。", "地理": "沼澤地、峽谷、澤覃、湖泊、池塘、滑冰場、小路、小巷、路口、門口、游樂場、井坑、洞穴、廢品收購站、咖啡館、茶館、飯店、音樂廳、娛樂場、影劇院、公關部、會議室。", "數字": "二（先天八卦數）、七（九宮數）、四、九（五行金數）。", "動物": "羊、虎、泥鰍、豹、猿猴、水鳥、仙鶴、兔子、沼澤動物。", "靜物": "財寶、金銀首飾、樂器、鍋、碗、瓢、盆、五金工具、帶口之物、金屬制品、破損物、垃圾箱、刀劍、剪刀、手術刀、郵筒。", "性情": "喜悅、口舌是非、拍馬屁奉承、開朗、愛欲、親熱、溫和、多愁善感、重情講義、憂愁口饞。", "人體": "口、舌、牙齒、涎、女性器官、氣管、咽喉、肺、右肋（九宮位）、右肩臂、胸部、大腸、肛門。", "疾病": "口腔疾病、牙病、舌病、咽喉病、氣喘、胸部疾病、結核病、受傷、打傷、創傷、神經衰弱、性病、貧血、尿道病、皮膚病、咳嗽、膀胱病。", "顏色": "白色、赤色（七赤）", "五味": "辛、辣"},
		{ "卦名": "乾", "係數": 7, "二進制": "111", "拼音": "qián", "陰陽": "陽", "五行": "金", "卦象": "天", "概念": "乾為天，代表天的功能。有威嚴、傲慢、權力、戰爭、競爭、膽量、優勝、充實、滿足、模范、正直、尊敬、喜悅、健壯、圓滿、收獲、統帥、永久、創造、法則、本原、高亢、核心、精華、向上、長輩、堅固、激烈等。", "形態": "高檔貴重、精致完美、高大雄偉、堅硬圓滑、趾高氣揚、白色、金黃色。", "方位": "西北方，為南方；為上方，為高處。", "季節": "秋季，農歷九、十月；戊亥年、月、日、時；立冬至大雪。", "天象": "為太陽、晴天、晴空、太陽、寒氣、霜、雪、冰、雹、霰。", "人物": "在國家，為國君，主席，總統；<br>在單位為書記，一把手，主要領導人；<br>在家庭為父親，為大人，為老人，為長輩人；<br>在社會為名人、公門人，宦官；<br>在性別為男，在年齡為老頭。", "地理": "繁華地、首腦集中地、京都、大城市、形勝高亢之所、名勝古跡、大會堂、廣場、寺院、高級住宅、大廈、銀行、警察局、機關、武官、博物館、郵局、金屬工廠、配件商店。", "數字": "一、六、四、九（五行金數）。", "動物": "獅子、大象、老虎、豬、熊、狗、馬、鵝、鯨魚、鷹、龍。", "靜物": "金玉珠寶、高檔用品、金錢、鐘表、鏡子、眼鏡、武器、圓形金屬、帽子、神佛物品、首飾、飛機、火車、轎車、自行車、摩托車、刀劍、帽子、頭巾、面罩、高大物。", "性情": "好動少靜、嚴正威武、重情講義、威嚴豁達、正直勤勉、自尊高傲。", "人體": "頭、頸、面部、肋骨、指甲、右腿（九宮位）、肺、大腸、皮毛、骨骼、男性生殖器、精液、右下腹、胸部。", "疾病": "頭痛、腦淤血、心臟病、肺部疾病、肋膜炎、發腫疾病、神經病、脖子扭傷、皮膚病、骨折、骨病、硬化性疾病、老病、舊病、傷寒、急性暴病、結腸疾病。", "顏色": "白色、大赤色、玄色", "五味": "辛、辣"}
	];

	if(選項===undefined) 選項="元件";
	var 八卦象意註解={
		"卦名": "",
		"係數": -1,
		"二進制": "",
		"拼音": "",
		"陰陽": "",
		"五行": "",
		"卦象": "",
		"概念": "",
		"形態": "",
		"方位": "",
		"季節": "",
		"天象": "",
		"人物": "",
		"地理": "",
		"數字": "",
		"動物": "",
		"靜物": "",
		"性情": "",
		"人體": "",
		"疾病": "",
		"顏色": "",
		"五味": ""
	};

	var 八卦象意索引=_.findIndex(八卦象意矩陣, {卦名: 八卦});
		if (八卦象意索引 != -1) {
			八卦象意註解.卦名=八卦象意矩陣[八卦象意索引].卦名;
			八卦象意註解.係數=八卦象意矩陣[八卦象意索引].係數;
			八卦象意註解.二進制=八卦象意矩陣[八卦象意索引].二進制;
			八卦象意註解.拼音=八卦象意矩陣[八卦象意索引].拼音;
			八卦象意註解.陰陽=八卦象意矩陣[八卦象意索引].陰陽;
			八卦象意註解.五行=八卦象意矩陣[八卦象意索引].五行;
			八卦象意註解.卦象=八卦象意矩陣[八卦象意索引].卦象;
			八卦象意註解.概念=八卦象意矩陣[八卦象意索引].概念;
			八卦象意註解.形態=八卦象意矩陣[八卦象意索引].形態;
			八卦象意註解.方位=八卦象意矩陣[八卦象意索引].方位;
			八卦象意註解.季節=八卦象意矩陣[八卦象意索引].季節;
			八卦象意註解.天象=八卦象意矩陣[八卦象意索引].天象;
			八卦象意註解.人物=八卦象意矩陣[八卦象意索引].人物;
			八卦象意註解.地理=八卦象意矩陣[八卦象意索引].地理;
			八卦象意註解.數字=八卦象意矩陣[八卦象意索引].數字;
			八卦象意註解.動物=八卦象意矩陣[八卦象意索引].動物;
			八卦象意註解.靜物=八卦象意矩陣[八卦象意索引].靜物;
			八卦象意註解.性情=八卦象意矩陣[八卦象意索引].性情;
			八卦象意註解.人體=八卦象意矩陣[八卦象意索引].人體;
			八卦象意註解.疾病=八卦象意矩陣[八卦象意索引].疾病;
			八卦象意註解.顏色=八卦象意矩陣[八卦象意索引].顏色;
			八卦象意註解.五味=八卦象意矩陣[八卦象意索引].五味;
		} //end if 八門形態索引
		else {
			alert(八卦 + "：function 八卦象意 輸入錯誤！");
			return "";
		}  //end else 八門形態索引

	switch (選項){
		case "元件":
			return 八卦象意註解;
			break;
		case "速查":
			var 速查矩陣=[];
				速查矩陣.push("卦名：" + 八卦象意註解.卦名);
				速查矩陣.push("五行：" + 八卦象意註解.陰陽+八卦象意註解.五行);
				速查矩陣.push("卦象：" + 八卦象意註解.卦象);
				速查矩陣.push("二進制：" + 八卦象意註解.二進制);
				速查矩陣.push("方位：" + 八卦象意註解.方位);
				速查矩陣.push("數字：" + 八卦象意註解.數字);
				速查矩陣.push("顏色：" + 八卦象意註解.顏色);
				速查矩陣.push("味道：" + 八卦象意註解.五味);
				速查矩陣.push("概念：<br>" + 八卦象意註解.概念);
				速查矩陣.push("形態：<br>" + 八卦象意註解.形態);
				速查矩陣.push("性情：<br>" + 八卦象意註解.性情);
				速查矩陣.push("人體：<br>" + 八卦象意註解.人體);
				速查矩陣.push("疾病：<br>" + 八卦象意註解.疾病);
				速查矩陣.push("天象：" + 八卦象意註解.天象);
				速查矩陣.push("地理：<br>" + 八卦象意註解.地理);
				速查矩陣.push("動物：<br>" + 八卦象意註解.動物);
				速查矩陣.push("靜物：<br>" + 八卦象意註解.靜物);

				return 速查矩陣.join("<br><br>");
				break;
			break;
		case "卦名":
			return 八卦象意註解.卦名;
			break;
		case "係數":
			return 八卦象意註解.係數;
			break;
		case "二進制":
			return 八卦象意註解.二進制;
			break;
		case "拼音":
			return 八卦象意註解.拼音;
			break;
		default:
			alert(八卦 + "：function 八卦象意 輸入錯誤！");
			return "";
	} // end switch 選項
}  // end 八卦象意 function



// ********************* 速查 數字轉換 滾動 *********************
function 九宮滾動(九宮數, 滾動數) {
    if(九宮數>9 || 九宮數<1) alert("九宮滾動 function 輸入的九宮數錯誤");
    if(滾動數>9 || 滾動數<-9) alert("九宮滾動 function 輸入的滾動數錯誤");

    var 滾動後的九宮數=九宮數+滾動數;
    if(滾動後的九宮數 > 9) 滾動後的九宮數 = 滾動後的九宮數-9;
    if(滾動後的九宮數 < 1) 滾動後的九宮數 = 滾動後的九宮數+9;

    return 滾動後的九宮數;
}

function 八卦字數轉換(八卦){
	//if(地支=="-" || 地支=="x" || 地支=="X" || 地支=="o" || 地支=="O" || 地支==="") return "";
    var 輸入數字=(isNaN(八卦))? "字" : "數";  //輸入的是數還是字

    switch(輸入數字){
        case "字":
            switch(八卦){
                case "坤": return 0;
                case "艮": return 1;
                case "坎": return 2;
                case "巽": return 3;
                case "震": return 4;
                case "離": return 5;
                case "兌": return 6;
                case "乾": return 7;
                default:
                    alert(八卦+"：八卦字數轉值 錯誤！");
                    return "";
            } // end switch 字
        break;
        
        case "數":
            switch(八卦){
                case 0: return "坤";
                case 1: return "艮";
                case 2: return "坎";
                case 3: return "巽";
                case 4: return "震";
                case 5: return "離";
                case 6: return "兌";
                case 7: return "乾";
                default:
                    alert(八卦+"：八卦字數轉值 錯誤！");
                    return "";
            } // end switch 數  
        default:
        	alert(八卦+"：八卦字數轉值 錯誤！");
        	return "";
    } // end switch 輸入數字
} // end function 八卦字數轉換


// ********************* 速查 collapsible 建立 *********************
function 速查表總建設_遁甲(){
	速查表建立_八卦("qmdj-qref-八卦"); //button & div tag define in main HTML
}


function 速查表建立_八卦(GrpPanelAnchorTag){
	//Class attribute has to be "SubGroupName" & "ContentDisplay", using function "DataArrytoPanelGrp(ObjArr, GrpName)" stored at "Plug-Ins" script

	var 八卦速查矩陣=[];
	for(var i=0; i<8; i++){
		var 八卦速查元件={
			"SubGroupName": "",
			"ContentDisplay": ""
		};  //end 八卦速查元件

		八卦速查元件.SubGroupName=八卦字數轉換(i) + "卦";
		八卦速查元件.ContentDisplay=八卦象意(八卦字數轉換(i), "速查");
		八卦速查矩陣.push(八卦速查元件);
	} // end for
	$("#"+GrpPanelAnchorTag).html(DataArrytoPanelGrp(八卦速查矩陣, "八卦"));
} // end function 速查表建立_八卦