
function 天干速查(){
    var 天干速查內容 = [];

    天干速查內容.push('<div class="panel-group" id="QuickRef-十干喜忌">');

    // ------------- 甲 木 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-甲木">甲木</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-甲木" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('🌳甲木在自然界中為純陽高大的喬木，有參天之勢。木的特徵是仁德、柔和、氣勢猛銳，不斷向上攀爬的特性較常在甲木身上體現。<br>🌳甲木為剛木，對環境的感知、寒暖最為敏感。甲木喜溫濕的土壤，太過乾燥難於成長；水多則會腐爛。<br>🌳甲木要做成傢俱，必先砍伐，雕琢才能有用，因此甲木之人必須要忍受苦難磨練方能成才。<br>🌳強健的甲木必須要有陽光〈火〉將內在的寒濕清除，但陽光〈火〉不能過太多卻會把甲木燒成灰炭。<br>🌳有水滋養的甲木為活木，無水滋養的則為死木。活木不能見金（斧頭）的砍伐的，死木喜金砍伐雕刻，令它成為有用的家具。<br>🌳甲木的人一般長相不會太漂亮，要經過美容〈辛金的雕刻〉才能成為美人。<br>');
	天干速查內容.push('<br>'); // spacing
	天干速查內容.push('<strong>四季</strong><br>');
	天干速查內容.push('⭕春天出生的甲木，大多運氣比較好，能遇貴人的幫助而成功。<br>⭕夏天出生的甲木，宜借助年長之人的幫助、栽培〈癸水潤根〉，來獲得成功。夏天的木已經成熟，也喜辛金雕琢而成才，因此一般運程起伏較大。<br>⭕秋天的甲木要依靠朋友〈比它長的更加高大的木〉、年長之人的幫助才能事業成功，秋天的木是禁不起金的雕刻的，所以比較不能吃苦。<br>⭕冬天的甲木要有陽光的照耀與溫暖，才能健康成長。<br>');
	天干速查內容.push('<br>'); // spacing
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅甲木之人屬於比較穩重，天生奮發向上、做事一步一腳印，且不服輸，所以事業上喜歡挑戰刺激、有競爭具領導性的工作。<br>✅甲木之人有志氣和骨氣，重現實，需要被重用才會工作長久，且好計較金錢的得失。<br>✅甲木之人天生具有領導的命格，適合在前線的工作，如有機遇也會建立自己的舞台。<br>✅甲木之人總是給人一種冷漠的外表，但因甲木生火，所以內心總是包藏著一顆熱情如火的感情。<br>✅甲木會照顧人，喜歡領導別人，卻不喜歡被領導，也討厭被人家開玩笑。<br>✅強健的甲木有企圖心，持有慾特強，所以容易疲勞。<br>✅甲木心地善良，性格固執、仁慈心軟，吃軟不吃硬，情緒總是表現在臉上。<br>✅甲木一般不太喜歡結交不健康的酒肉朋友，朋友在精不在多。甲木人的人際關係通常很穩健、很踏實，對事業的幫助也比較大，他們懂得把人際當作他的事業般去經營。<br>✅甲木的人對愛情忠實，但一般戀愛都不是太順利的，要通過破釜沉舟才能順利結婚，一般婚後不會搞婚外情。<br>✅甲木如參天大樹，有遮蔭的特性，看到他人身處困境，總會主動給予對方幫助。甲木也有傲氣和執著之性，如果是自己身處困境，也能獨自面對，堅持原則，不太願意去妥協或尋求幫助。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('💛【甲】不離「庚」（取貴，斫削成大才）<br>💛身強「庚」強用「丁」制或「壬」洩，但忌用丙（丙會破壞庚金）；身強而庚弱時宜用「土」（有癸則用戊，有甲則用己）。身強忌用「癸」侵蝕庚金。<br>💛身強「庚」強用「丁」制或「壬」洩，但忌用「丙」（丙會破壞庚金）；身強而庚弱時宜用「土」（有癸則用戊，有甲則用己）。身強忌用「癸」侵蝕庚金。<br>💛身弱用「壬」、「癸」。<br>💛透出「丁」火，無「庚」金，為人虛偽。<br>💛見「戊」〈財〉利經商；見「己」〈合〉被牽制。<br>💛不喜見「乙」來合「庚」失貴氣。<br>💛「壬」水旺，不見「寅」〈根〉會隨波逐流。<br>💛不喜「辛」金，辛金弱無法斫削甲木成才，反而會被堅強的甲木所折損。<br>💛熱燥宜用「癸」；寒宜見「丙」。<br>💛甲木喜歡亥（甲木的長生〈印〉）、辰（化為青龍〈官〉）、戌（化為祿堂〈財〉）、午（甲木的病地）<br>'); 
	天干速查內容.push('<br>❶不喜乙木的幫助：甲木無論形體的旺衰，究其氣質來說，本性強壯，故此，甲木喜歡自壯，不喜他幫或乙木來幫也不喜歡，反倒喜歡幫助乙木。一是，陽主導陰，陰追隨陽；二來，甲木本來就有惻隱之心。甲木旺，則更是如此，甲木弱也會因為好面子、倔強的性格，而排斥乙木的幫助。<br>❷甲木喜歡以辰、未為根基：甲木為十干之首，本性為陽，本身具有陽渴的特性。故此，甲木之所以喜歡辰這樣的濕土，未這樣的陰土，同樣，辰與未皆為甲木通根之所，陰濕之土亦能養木。<br>❸倘若水分過多時，喜好丙火，但排斥丁火：木要成長，離不開水火，水是癸水，火是丙火，水火相濟，甲木就能茁壯。水多就要火，火多則要水。但不喜歡壬水和丁火。<br>❹喜濕泥(己土、丑土)的滋扶：甲木為稼禾，自然要生長在田園、原野和森林，故此離不開己土和丑土；同時，田園的功用，也是生養稼禾。故此，兩者在一起，互為功顯，能夠相得宜彰。甲與己合，顯出公正和無私。<br>❺木強盛時則喜庚金的砍鑿：甲木成才，才可堪用，成材則要裁量，自然離不開庚金，無金克伐，就只是一道風景，甲木旺，則更要庚金伐其性，量其裁。甲木弱，當然怕庚金來砍伐，不排斥辛金，不過辛金不能過旺。<br>❻活木怕埋金之鐵：甲木性死，如果局中甲木無根，無助，則死木性顯，亦不怕庚金，但如果甲木得根得助，就成為活木，活木弱就怕庚，亦怕埋金之鐵，會傷及本身。所謂埋金之鐵，就是局中申酉之類的合克，或者衝剋甲木之根。當然木旺，亦為不懼。<br>'); 
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('甲日寅月是建祿，卯月羊刃可堪憑。三月財星藏辰庫，巳為食神財暗伏。<br>午月丁火傷官格，未月雜氣取財星。七月申提七殺論，酉為正氣官星得。<br>九月戌中惟雜氣，十月偏印格局真。十一月取正印格，丑中雜氣仔細詳。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<br><strong>人體: </strong>肝、膽、免疫系統<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 乙 木 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-乙木">乙木</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-乙木" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('🌱乙木屬小樹、花草、藤蘿之類，性質軟弱。屬於枝葉繁華之木，秀美而柔弱，喜歡陽光的煦照。<br>🌱見丙火〈陽光〉則綻香開放，無火則是腐爛的肥料；但是乙木遇火太多也不好，葉重根輕會傾其根莖。<br>🌱見癸水〈雨露〉則花團錦簇，遇見過多辛金就會消耗内氣，乙木喜燥忌濕是其特點。<br>🌱遇到壬水〈洪水〉的衝擊就會連根拔起漂浮在水面上，懼怕庚金的砍伐和秋風的凋零。<br>🌱乙木是花草之木，要以癸水的滋潤或濕土根才能生長。乙木是活木，不能做成棟樑之木。<br>🌱乙木邊上如若有著高大的甲木可攀扶，就構成藤蘿繫甲。乙木喜歡甲木，它以攀扶著甲木的軀幹扶搖直上，日後必成大器。<br>🌱乙木的人遇到困難，最好找甲木的人來幫助，乙木柔嫩，離開陽光、雨露、土地便會死亡。它喜丑、臣潤土盤根，忌洪水泛濫，水旺變成漂木，爛木。<br>🌱乙木可見酉金，酉金是柔金，是剪刀，乙木的枝葉經過剪刀的修剪才能枝展葉舒。<br>🌱乙木不喜亥水〈涼水〉，對乙木沒有助益。所以冬天出生的乙木之人要八字中有火，就長漂亮，對人也會溫和有禮。<br>🌱乙木的人見丙火〈陽光〉則美貌，木見火為泄秀，見陽光花才能開放。夏天出生的乙木的女孩子比較漂亮。<br>🌱乙木的人遇到丑土或未土，因木能克土，所以會要求多，也愛翻舊帳。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅乙木的人屬安靜型，好像很溫柔，可是言行舉止間卻又透露出一種倔強不屈的堅韌，讓人有一種孤單的距離感、甚至不好欺負的感覺。乙木是外柔內剛型的。不會欺負別人，而且很善解人意。心性較容易有變化、變動靈敏、機警。雖倔強但沒有攻擊性，且心腸軟。<br>✅乙木的人沉著、蓄勢待發，多心，謀略心高，做事情沒有原則、見風轉舵，懂得隨機應變，善於利用環境、人物來發展。<br>✅乙木之人生活力很強，也是個蠻有野心的人。不喜明爭；精於暗鬥，精於策劃，喜歡當幕後操控者。<br>✅乙木的人表面上看起來比較成熟，而且天生有點自戀，擁有一種既自卑又自戀的特殊氣質。乙木之人忌妒心很強，和人交往時喜歡斤斤計較，不會主動去交友或追求異性。乙木也重視異性的涵養深度。平常不會很開朗，人多的時候，有時卻會表現得很快樂。<br>✅乙木之人會喜歡木質（甲木製造）的物品，比方木製家具，書本，乃至鈔票。<br>✅乙木如藤蘿，如果遇見障礙，容易繞道而行，善於借助外界的力量來解決問題，通過多種途徑去化解危機。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶喜陽支生根：乙木為陰，需要陽輔。故此，乙木最喜依靠甲木，大樹下面好剩涼，也喜歡陰得陽位，借力打力，借陽輔陰，氣顯中和。比如：寅辰之類的陽根。<br>❷ 忌水勢泛濫：花木要水，滋潤就行。比如癸水，滋養花木就已足夠，怕見壬水汪洋，氣勢滔滔。原因就是乙木需要根固，離不開辰丑之類的濕土，水旺必然土流。<br>❸不喜辛金奪伐：乙木本弱，但生性活泛，有根得助，見辰未通根，則活性不改。最怕克伐，庚與乙合，主仁義，因情而活，辛金不美，克伐無情。當然，如果乙木改性，為死木，亦然不懼。<br>❹同時，乙木本性為活，如果活性不改，也最怕埋金之鐵。比如：乙木坐酉，就是埋金之鐵，主人多災，日主坐酉，則要注意身體和災禍，其他六親依然如是。<br>❺弱喜得甲，強喜丙秀：乙木喜甲，乙弱則更喜甲木，得甲則有幫襯，則不孤寂，則為後台，乙木旺見丙則秀，木火通明，為得用，同時，乙木本濕，得丙之曬，亦能去濕。<br>❻運行南方忌火太旺：運行西方則怕土和金過重，乙木為活木，形體偏弱，亦為花草，行運在南方火旺之地，就怕火勢過旺，過旺則木性焦渴，有焚滅之患，故此，需要水火相濟，同樣，行運在北方水地，也怕水勢過旺。<br>❼活木最忌金來克伐，旺之雖不以為患，但也不喜。即使旺，行運在土金方向，也怕土金過旺，奪其活性。<br>❽寒木最喜向陽：八字都要調候。但是，相比其他天干來說，乙木需要調候，則更是迫切特別是冬木，寒木。乙木為陰，屬於陰木，也是生木，陰木最怕寒凝，如果出生在冬天尤其小雪之後的仲冬和季冬，寒氣會閉塞乙木生氣。寒氣不出，性情多疑善變，一生孤寒難料，難以榮發，甚至身體多病多痛。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('乙日寅月號傷官，卯為建祿格中真。三月財官俱雜氣，巳中傷官財星端。<br>午提丁火食神格，未中雜氣日財官。申月正氣官星論，八月酉中作殺推。<br>戌內財官俱雜氣，亥月正印便扶身。子癸之中偏印是，雜氣推來在丑中。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('丙能去陰柔，木火通明格；丁使乙萎蔫，見辛成武貴。戊為剛硬土，柔木無力伐；己土名田園，反哺乙木發。庚來性多疑，難有用武地；辛能絆丙火，難以發秀氣。壬掀浪滔滔，弱木懼漂泊；癸水潤花木，不懼燥火烈。見甲系藤蘿，四時皆相宜。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('丙木火二局，丁反縮乙木，辛殺為剛毅，見戊空費心，乙己四維土。合庚多孤惑，壬旺自飄零，乙癸相益彰，見甲藤蘿吉，四季可稱心。<br>');
	天干速查內容.push('《注》：見丙火為木火通明。遇戊不能擔財。遇辛合丙，難發越。無根遇壬水，主飄零。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<br><strong>人體：</strong>肝、膽、項、肩免疫系統<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 丙 火 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-丙火">丙火</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-丙火" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('☀️丙火為亢烈之火，純陽之性，氣勢猛烈。在天為太陽，在地為溫度，上下光輝，無所不照。含有朝氣蓬勃，熱情開朗之意。<br>☀️能煆庚金，遇強暴而施克伐，遇辛金合而反弱。然而浮水之木，不能生火，濕水之土，既使有太陽的照耀也是無法去其濕寒，濕泥晦火，因此丙火反受其晦。壬水〈江湖之水〉是硬水，其波濤能與丙火輝映。甲木太過旺盛，則丙火反遭其自滅，即所謂木多火焚。<br>☀️丙火代表才華，代表名氣，越旺名氣會越大，見水則成水火既濟，能進退自如，名利雙收。<br>☀️丙火日生人，地支遇寅午戌，若再見甲木就會燒成灰燼。火的能量太強，除了要注意運勢上的突發性的變動之外，另更需多加注意健康。<br>☀️丙陽〈火〉大太陽之火：如強光、大燈、燃燒爐、焚化爐、高熱爐。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>四季</strong><br>');
	天干速查內容.push('⭕春天的丙火不烈，可以除寒意，讓萬物生長。<br>⭕夏天的丙火，是火焰的高峰，火過旺盛則會自焚。<br>⭕秋天的丙火，火勢較弱，容易受到金（財：慾望）的誘惑。<br>⭕冬天的丙火，火氣全退，丙火會變得溫文而雅，富有愛心。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅丙火之人性格急躁，上進，衝動，積極好權，喜歡爭強奪勢。感情豐富，熱情大方，有禮貌，喜歡打抱不平，但是為人太霸道，多以自我為中心。<br>✅丙火的人熱情有禮貌，好客，重朋友，重義氣，喜歡被擁簇著、被人包圍著的感覺。若是被冷落，就會鬧彆扭。脾氣來的快，去的也快。<br>✅丙火之人分不清好人與壞人，常判斷錯誤，容易健忘。內心感情豐富，喜歡照顧別人，不善於表達，待人不拘小節，相交滿天下，是一個忠實的聽眾。<br>✅丙火的人雖然勇於追求，但也是善於放棄的，喜好多變，一生都在追求新的目標之中。<br>✅丙火之人的感情是不容易長久持續的，三分鐘熱度，他們比較重視第一感覺，重視人外在的美。<br>✅丙火最喜巳火，一生必為領導；地支再見寅木，脾氣則會很不好。<br>✅八字缺火的人，運勢難煥發。但獨立性強，但易白手起家，自力更生。缺火的人也適合有一個信仰（文明之火），也可能喜歡吸煙、桑拿等能給身體提供熱能的習慣。<br>✅丙火之人容易急躁，因此容易將自己陷入困境中。但內心也如太陽，越是在困境中，丙火越能發光發熱，也會因為自己的感召力，吸引來眾人的幫助，從而完成人生的蛻變。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶丙火幾乎不接受他干的生克作用，故此，樂見壬水之克，丙火至陽，其形龐大，其性至烈，其位在上，獨立行事，自我主張。故比，其本性不願甲乙之木來生，也不喜丁火來助，亦不懼壬癸來克。如見壬水，則水火相濟，不急不躁，反有水輔陽光之美，能濟萬物。<br>❷太強時易成燥命：無論是丙火是否為日干，只要局中丙火太強過旺，都會令命局走向偏燥。燥者性急，燥者命促，燥者局枯，故此，需要壬水來救。<br>❸太弱時忌見甲木：丙火過弱，不堪其用，亦要從弱，若遇甲木來生，定然失其弱性，但是，陽木見陽火，恩中有怨，恐有變數，不如不見。同時，甲木為十干之首，亦難俯首稱臣。<br>❹透干則可以救助浮木：局中水多木浮，則要丙火出干，一來如果木寒，丙火可以解凍，二來，木遇陽光，可以提升木的生存能力，或者改善其生存條件。<br>❺藏支則不能防止濕泥之害，濕泥，就是水太多是的己土，比如丑土，或者辰丑匯聚很多時的土。因為，他們的吸收熱量能力過強。巳中藏丙，很容易受其危害。<br>❻濕木不能生火，反而晦火：木能生火，但是木多則火塞，塞火的大多是濕木，濕木無炎，生火得要暴曬，也可燥土制水引火。<br>❼己土最能晦丙：丙火的作用於成就，核心在於光芒，而己土陰寒濕泥，晦丙能力最強。故此，如果八字中用丙，而見己土，這個人成就就小了。主一生忙忙碌碌，貪戀私利心重，故此，難以有大的成就。除了有甲乙之木救應。不過，甲木和己，不能緊鄰。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('丙日逢寅偏印生，卯月正印喜官星。辰初雜氣用食神，巳中定取建祿格。<br>午火羊刃又傷官，未取傷官宜傷盡。申是偏財喜旺神，酉月財旺生官格。<br>戌上雜氣為食神，亥月偏印七殺真。子中正官宜官旺，丑宮分明雜氣生。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('逢甲愈剛烈，無庚多招禍；乙木具理智，木火通明格。丁為丙之刃，少金殺氣重；戊來性過剛，取貴壬調節。己可去火燥，卻失光明節；庚生壬抑丙，財富滿倉筐。辛來投懷抱，忘義戀情色；壬可驅炎燥，顯威居權要。烏雲癸遮日，光芒難普照。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('甲庚須並見，缺一不成器，乙木火二局，丁劫須甲庚，壬戌相併吉。己晦自失力，大忌丙辛合，癸水難有貴。<br>');
	天干速查內容.push('《注》：遇甲、丁而無庚，引禍。乙透為木火通明。見己無主見。辛合多情色。遇壬水火既濟，遇癸難發越。<br>');
	天干速查內容.push('<br>');
    天干速查內容.push('<br><strong>人體：</strong>眼睛、心臟、血壓、小腸、肩、額、循環系統<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 丁 火 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-丁火">丁火</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-丁火" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('🔥丁火屬陰火，燈燭之火，爐火，燭火等，火勢不穩定，得力時有力，失力時無力。<br>🔥丁火性柔而不烈，外柔則內剛，見丙則奪其光芒，則丙奪丁輝。如若能遇到生身的甲木，便光輝燦爛，但甲木要有庚金劈之，謂之為劈甲引丁。<br>🔥雖然說庚金是頑金，但全賴丁火之鍛鍊，若遇到乙木〈濕木〉，木再多，也難以致火之光明，反而會湮滅了火，謂之木多火塞〈乙木不生丁火〉。<br>🔥丁火和丙火雖同屬火，丙火像太陽，而丁則像夜空中閃爍的星星。丙火是鎔爐中捲成漩渦的火花，而丁火則是燭火，比較溫和。丙火為外急火，丁火為內急火，品性溫柔。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅丁火為人直覺性強，眼睛敏銳，內心感情豐富，洞察人心，第六感準，依賴性強，且善嫉妒。<br>✅丁火的人個性溫和、熱心，重禮貌、感性、有同情心，具有外靜內進。火人具有雙重性格，容易讓人有捉摸不定的感覺，但無攻擊性，對於不滿的事，處理方式也比較消極。<br>✅丁火之人性格內向，思考細膩，做事穩重考慮很全面，細膩。但喜歡隨波逐流，不喜歡創新，喜歡固定安穩的生活環境，對公共事業感興趣。丁火喜庚金（庚為丁火之財），所以丁火之人喜歡賺錢，也會做生意。<br>✅丁火比較適合小群體的生火。在大群體中，丁火通常是比較沒聲音的人。所以，丁火的人較喜歡兩人世界。丁火之人見到甲木則會纏纏綿棉。<br>✅丁火的人對於感情的態度是浪漫幻想型，重視第一印象，但不善於表達。一生中在愛情方面慾望難以滿足，對於愛情常充滿期待、幻想，渴望有一天會遇到自己的理想情人。<br>✅丁火的人是有著一雙充滿憂鬱的眼睛，會讓初次相識的異性如癡如醉，特別是小齡異性的尊重、喜歡和愛慕。但時間一長，他們總覺得走不進丁火人的心中，丁火的人對於他們像是永遠也讀不懂的書。<br>✅丁火的人比較重視精神層面的滿足，因此，對所交往對象的能力、內涵特別重視。不過因為對愛情的期望高，也比較敏感，總希望另一半永遠把自己擺第一位。<br>✅丁火之人心思細膩，且具有天生的靈性與第六感，如果處在困境，他們會耐心的傾聽內心的聲音，也容易憑借自己的直覺找到問題的答案。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶忌見丙火：丁火雖弱，自會發光發熱，其用在於專，一個範圍、一個圈子，一類人群，丙火強大，光芒四射，普照萬物。如果，命局中丁火的作用，就是發熱、發光，自然不及丙火因為，有了太陽，誰還會圍爐取暖。這樣一來，丁火就顯不出功用，缺乏成就。<br>❷強時能鍛庚金：丁火雖柔，其性綿長，庚金雖堅，其性易脆。自古法則，柔能勝剛，打造庚金，離不開丁火。不過丁火綿長，則需要丁火自強，或者甲木助丁，庚金劈甲引丁，亦為綿長。<br>❸喜甲木扶持：丁火昭融，勢力弱小，最喜扶助。丁火得甲，則有燎原之勢。因為，甲木喜歡幫助弱者，至為大公無私;陰得陽助，情深義重。有了甲木，就不怕水來克，土來晦，見庚來劈甲，亦能功成名就。<br>❹忌濕木塞丁：凡火，均怕過旺的濕木，丁火就更為怯怕。原因就是丁火，性柔體弱。濕木無炎，難以生丁，反而塞丁。這個時候，就離不開丙火翻曬濕木，見丙反而是好事。<br>❺與戊土有相互調整的作用：丁火與戊土之間有相互調整的作用，主要還是因為木，他們之間的關係，屬於陰陽互助、互成、互動的關係。丁火本性柔弱，最大的敵人，就是癸水，而戊土與癸水具有合克的關係，有化火的關係。故此，戊不晦丁。丁火弱，戊土可以助起對抗敵人，同時，戊見辰戌為本根，辰為熱土，可以墓亥，戌為燥土，克制助丁，見寅卯亦不傷丁，丁火強，則戊土可以令丁有去處。<br>❻弱丁則怕己晦：己土陰寒，吸納熱量能力很強。丁火體性偏弱，如果不是很強，又要用丁的話，則怯怕己土來晦。這樣則丁火難有成就，成為命局病灶。<br>❼弱丁也怕風木：所謂風木，就是巽木，乙木，一來，乙木為活木，助火能力不強，二來木多容易火塞，三來木能招風。而丁火，體性過弱，風大則丁熄。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('丁日寅提正印評，卯上偏印格局真。辰初雜氣為傷官，巳上傷官便生財。<br>午中建祿分明取，未月食神獨可嗔。申月正財生官格，酉月偏財可追尋。<br>戌中雜氣未傷官，亥月正官及正印。子月偏官七殺真，丑月雜氣是財官。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('甲現須庚劈，事業可大成；乙生火微弱，丁難鍛頑鐵。丙可去憂郁，命主顯生機；戊遇甲或金，以智成巨富。己為命主壽，心寬好口福；庚金須帶甲，無甲命貧苦。辛透人慷慨，財來似潮涌；壬現合官貴，有甲富貴臨。癸須甲或戊，七殺化權柄。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('甲庚丁三全，乙丁俱無用，己為人仁壽，壬合丁須甲，戊癸不可合。<br>');
	天干速查內容.push('《注》：透甲須見庚。見丙火長壽。透戊土，須見甲庚。有庚要有甲，否則貧困。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<br><strong>人體：</strong>眼睛、心臟、血壓、血液、心、舌、齒、小腸、循環系統<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 戊 土 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-戊土">戊土</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-戊土" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('⛰️戊陽〈土〉城牆之土，山崗高原之土，支撐巨木或森林，乃萬物之源，能阻擋水的奔流，其穩重高厚剛燥為其特性。必須有水滋潤方能成為有用之土，坐下盤根才能振河海而不倒塌。<br>⛰️戊土是陽剛、動態的，但本性是土，遇見濤濤的洪水，則會變成土石流。生於寅、未、申、丑月的戊土人最怕遇到沖。戊土之人見壬水（偏財）會長袖善舞，見癸（正財）則能言善道。<br>⛰️若坐下帶合，則土形堅固；若生於申，有見寅來沖其根基必會傾危。如土本身不旺，遇到金則會漏泄其土氣而有災。土最喜歡行東南運，但是如若原局中印旺再行火地，則形成火焰山，反而會因太過而有禍災。<br>⛰️對於水（財）旺的戊土，要多觀察其言行，因土為信，土不足者易言行無信、無義。<br>⛰️戊癸合而不化的人，容易變臉，常為自身利益而不惜傷害他人。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅戊土的人具有泰山之性，外表柔軟，內在剛烈，性格沉著堅定，有包容力，有耐心，有著極強的容忍力與受苦力。可以為了自己理想而堅韌不拔，願意接受挑戰，默默耕耘，但常懷才不遇者多好怨。<br>✅戊土是含有火性的硬土，需改善的是易固執，不承認，較不容易溝通；好的一面是穩健踏實，很守信義（也不喜歡不守信之人） 敦厚樸實，重信講義，寬大包容，樂於助人。<br>✅戊土之人不喜歡管他人之事，思想保守，不喜歡創新，喜歡按部就班的事業。<br>✅戊土之人，社交能力強，但也易失主見，與人聚合無常，雖然重視外表，但內在卻粗野暴躁，欠缺思慮，喜抱怨。<br>✅戊土之人有比較強的承載力。當戊土遇到困境，內心依然會有足夠的力量，腳踏實地去承受。他們很清楚自己要什麼，不要什麼，默默積攢自己的能量，慢慢創造新的生機。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶有強根可抑制壬水：戊土陽剛，功在制水，圍湖成堰，功用自顯。不過，需要戊土自身強壯，也就是說戊土要發揮這方面的功用，需要戊土有強根。這種強根，就是辰戌丑未。<br>❷月令盛衰很重要：土居四維，力量分散，生而不生，死而不絕，生死相依。故此，土之盛衰，重在月令。盛在四季與長夏，衰在春秋之克泄。<br>❸強時喜庚、辛金之泄，勝過用甲木之克：土性忠信，再強不過逞能：生發為其天性，在五行之中，其生發能力，雖稍遜於水木，亦能勝過其他。故此，即使土強土盛，用甲不如用辛，用木不如用金。<br>❹辰能調節水份：辰戌丑未皆為戊土之根，唯獨辰能調節水分。因為辰為水庫，亦為水墓，其性為陽有不弱的自性。水之泛濫，辰可以發揮墓的作用，水之弱小，則可以打開水庫。但要結合天干情況而定。<br>❺弱則喜戊土幫身：戊土性剛，性燥，弱則要同性來幫，己土陰寒，戊己相混，反弱其性。故此，己土幫身作用甚微。喜午未燥性，寅木不忌。因為，辰戌丑未諸根，獨獨不與寅木發生關係核心就是土之無生，生之為克（木克土），故戊土只是寄生在寅地。<br>❻燥之為病，見癸得藥：戊土本燥，就怕枯燥。枯燥則難生發，有種無收。故此，需見癸則滋潤，局中有癸有子，則有包容之德，能載萬物。不過，戊癸相合，有合化的風險，因此，需要癸水有強根，支見子水，亦要遠離戊土。<br>❼取用要分別土性：土性雖然中正，亦有偏差。比如，四季之土，有虛有實。土虛不過辰、丑，土實不過未、戌。虛見火則實，實見木則虛。土能制水，水旺則土盪，亦為虛。<br>❽亦有燥濕之別。燥不過未、濕不過丑，辰雖濕，亦有熱度，戌雖燥，亦顯溫涼，受周圍環境影響較大。土取其中，故此，寒濕、燥熱亦須平衡。雖然戊土不喜己土，但是，過燥，也需濕土相擊(地支戌見辰，或者未見丑)。<br>❾土厚則可以埋金：戊土厚重，生金之能不及己土。如果局中戊土多旺，其質堅硬，無法生金，反而可以埋金。當然，需要看金是否有根透干，自身的旺衰。同時，戊土偏燥，如果土厚，土燥，脆金埋金之能就大。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('戊藏寅月殺拘印，卯是正官尋貴氣。辰內雜氣財官格，巳上亦取號建祿。<br>午月刃取正印格，未上雜氣作官印。七月食神生財旺，八月傷官喜遇財。<br>戌中雜氣分明取，亥月財殺格中真。子提正財生官格，丑上雜氣號財官。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('甲疏土有用，無甲枉費心；乙官性柔弱，難以成大貴。丙火照頑土，寸草不易生；丁火功在鐵，星火難照明。己逢甲或丙，稼穡成富翁；有庚才華溢，立業建大功。辛須丙癸現，出入顯門中；見壬成堤岸，雖苦事業成。癸財長流水，源源庫能存；巳月祿當權，厭甲喜癸潤。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('甲庚才華立，乙丙俱不成，丁己田舍郎，壬水艱難人，癸辛丙須甲。<br>');
	天干速查內容.push('《注》：戊遇甲大吉，遇乙難成器。遇丁須有庚。己透須甲丙。遇壬受限制。癸來財持久。<br>');
	天干速查內容.push('<br>');    
	天干速查內容.push('<br><strong>人體：</strong>胃、肋脅、腹脅<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 己 土 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-己土">己土</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-己土" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('🏕️己以引申為「紀」，是〈找出事物的條理〉的意思。另外，也可以引伸為「起」，意味著萬物變化而生長，而且伸縮自如的。<br>🏕️己陰〈土〉為田園卑濕、柔軟之土之土，能蓄藏水分，能被揉捏成各種形狀，能栽種樹木。它含有水、金、火等成份，可以納水容火。<br>🏕️己土被稱爲田園之土，喜衝運，遇到刑衝迫害，就好像有犁翻地之用，使己土更加適合農作物和植物的生長，也適合儲藏萬物。<br>🏕️己土忌見壬水，如若失天時，再行金水旺盛之地，土吸足了水就會有流失之患，容易變成爛泥。此時如果出現丙火，就能夠驅除己土裏面的陰溼，就能更好的滋養萬物生長。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>四季</strong><br>');
	天干速查內容.push('⭕春天的己土，體質較弱，被春木吸走養份。<br>⭕夏天的己土，有火補氣，則變得厚實，需要水來滋潤。<br>⭕秋天的己土，旺金洩土氣勢，會讓己土氣勢虛弱，此時需要火的幫助，讓自己氣勢穩固。<br>⭕冬天的己土，變成凍床，要有太陽〈火〉的照射才能解凍，否則則是守財奴。<br>');
	天干速查內容.push('<br>'); 
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅己土中庸、溫和、細心、包容性強、彬彬有禮、可塑性高，有傳統乖孩子的特點。己土的人耳根子軟，有時候顯得沒啥主見，性子慢，守傳統。<br>✅己土旺衰得宜，聰明睿智，處事細心得體，設想周全，工作生活環境整齊有序，非常適合財務等工作；由於日常處事有條理，己土女命又多認同是家中的賢妻，給予微不至的關懷。<br>✅土氣旺之人，主觀意識強，重信用，有才華、能幹、善變化。女性己土旺的容易多愁善感，她的思想容易兩極分化。<br>✅土氣弱之人易憂柔寡斷，宜為輔佐之命，適合做後勤，不能做第一把手。常有懷才不遇之感。<br>✅️己土之人要多擴展視野，最忌狹隘頗、猜疑，考慮東西太多了導致自我封閉，脫離現實，變成孤僻。<br>✅己土的人具有神秘、獨特氣質，甚至善解人意的心，而且還具有俠義之氣，甚至是愛管閒事。己土的人善於營造氣氛，追求異性的方法比較浪漫。己土之人很多是天生的俊男美女，而且氣質獨特，笑容迷人。但己土之人個性有點孤僻、有點憂鬱、對世事常有不滿。<br>✅己土的人是注重人際關係，願意為朋友兩助插刀而四處奔走，卻常得不到相對應的對待，心情會搞得很鬱悶，常感被欺負。對於還不是朋友的人就比較有距離感，人際網路並不會很大。<br>✅己土為濕土，沒有火烤則身弱體寒，久濕傷體，冬天怕冷，夏天怕熱，小病纏身。<br>✅己土的人易對名利執著，不能太過於注重金錢，一旦水〈財〉多，官殺（木）也會多，災難也就會多了。<br>✅己土是柔軟之土，濕潤柔和。能被揉捏成各種形狀，所以己土之人有足夠的包容性和超強的適應能力。遇到困境的時候，也能坦然接受，會順勢而為，跟著環境調整自己的行動，重新開拓一條可行的路徑。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶以辰、戌、丑、未四者為根：無論戊己，生養為德：德之厚薄，重在自身。田園栽植稼禾，亦然需要廣袤、肥沃故此，己土亦要自身強壯有其強根。辰戌丑未四者，皆為己根，有根則能堪用。<br>❷己弱則喜丙、甲資助：己土陰寒，忌怕金水助其陰寒，最需丙火溫養其性，同時，金能泄己，金能助水，水多土盪，水土混流，失去本性。丙能生土，木能耗水固土，丙甲齊來，己土轉危為安。<br>❸強時才可以生金或蝕金：己土強旺，生發能力也強，金能泄土，己土得用，金亦顯其能。但是，己土陰寒濕重，亦能蝕金，特別是辛金。具體是生金，還是蝕金，關鍵是看局中己土，是不是過濕，且濕氣不出，也看金之旺衰。<br>❹己土泄火能力最強：己土陰寒，陰濕，雖然性柔質弱，但是，泄火能力頗大。無論丙丁，見己則晦。特別是己土見辰丑較多，晦火力量也就最強。<br>❺喜戊土來混：與戊土不同，己土喜歡戊土來混。原因就是戊己分工不同，質能體性不同。戊己皆為中正，己土陰寒勢弱，戊土助己之勢，同時，中性不改，自性不失。戊土重在制水，為民謀福興利，己土重在長養稼禾，無論戊己，均有長養之德。<br>❻己土最怕水旺：己土細膩，柔順，中正。水多則財多，身不勝財，說明其人貪慾過重，失其忠信之德，失去給付能力。關鍵是己土柔弱，不具備制水之能，水多水旺，土隨水流，失去本性，其人隨波逐流，苦不堪言。<br>❼亦怕水土混雜：水土混雜，是指水土勢力相當，或者水略微偏盛。水主智，土主信，水土混雜，智信皆不得。特別是己土，無制水之能，反容水混，水不成水，土不為土，視為泥濘、沼澤，乃為無用之己。<br>❽也怕陰濕更勝：己土本陰、本濕，陰濕之性，雖然略遜癸水，但比其他天干為強。故此，己土雖強但怕更陰，更濕。陰濕過重，則中信不足，固執，陰沉有餘。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('己生寅月正官印，卯推七殺便是真。辰是雜氣取財官，己中正印格可清。<br>午中建祿居此位，未土雜氣借財殺。申月傷官真論此，酉中食神亦可尋。<br>戌月借取雜氣格，亥上正財生官格。子月偏財明怕劫，丑月雜氣取財官。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('甲來貴合身，無甲性吊滯；乙乏克伐力，碌碌一無成。丙火照陰土，萬物得滋生；丁為燈燭光，難得顯大功。戊須甲來疏，無甲性頑冥；庚金可泄秀，豁達重信誠。見辛貪財色，處處留情種；見壬則智濁，邪道起歪風。癸水配丙甲，事業方發達。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('合甲失自主，乙壬俱偏門，丙丁火自得，見辛失有情。<br>');
	天干速查內容.push('《注》：遇丙吉祥。丁己可配用，辛己貪色。透壬濁智，癸透須甲丙。<br>');
	天干速查內容.push('<br>');    
	天干速查內容.push('<br><strong>人體：</strong>胃、腹脅、消化系統（腸、脾）腎、牙周病<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 庚 金 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-庚金">庚金</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-庚金" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('🔨庚陽〈金〉斧銊之金：如高大金屬物、大型機械、斧一般，剛烈，頑鈍，堅硬無比。<br>🔨庚金喜劈甲，見到甲木（偏財）就發揮其追逐財利的性質。身強者見甲木（偏財）有能力砍伐，人生有目標，也易有收獲；身弱者則趨於投機，不切實際的追求財利。庚金劈甲，若遇上強健的甲木，庚金的刀刃也會被反傷。若是見乙木來合庚金，會使庚金生情而被牽制，失去原本剛銳之氣。甲木雖強，庚金力足伐之；乙木雖柔，庚金合之而反弱。<br>🔨「庚金帶煞，剛健為最」，故最喜丁火錘煉，使之成才。同時得丁的庚金，煞性受制，能行正道，故無情有義。<br>🔨庚金亦喜見壬，壬水為清，庚金得壬（或亥申），金水自流，流水自清；足以引通庚金剛殺之性，令庚金淬瀝晶瑩。故此，得水而清。癸水不流暢，對庚金無用。<br>🔨己土（潤土）能生金，戊土（燥土）無法生金，反而使金變得脆弱。如若遇到層層之土，則使金埋沒，稱之為土重金埋。<br>🔨庚金制化得宜，方可成才。強健的庚金（如見申酉之根）喜丁、壬。庚金見弱，要逆其性，見旺木火方吉。不可亦順亦逆，則賤不可言。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>四季</strong><br>');
	天干速查內容.push('⭕春季，木正合時令，處於旺，木克土，而土氣虛浮，土生金，但薄土不能起到輔助庚金的作用，因土為印，為目標，所以春金易無目的的空忙。<br>⭕夏季的庚金，陽氣旺盛，火勢猛烈，火克金，庚金處於死絕的狀態。火處於旺處化作為官鬼，傷害庚金的能量。夏季火土的氣勢強且焦躁，就會埋吞沒金的能力。所以此時需要用壬癸水來克火，來救助消解火勢，讓水火既濟，這樣才能稱作水盛呈祥。<br>⭕秋天的庚金，身強有能力剋財，人生會生龍活虎，鋒頭十足<br>⭕庚金在冬季水旺泄庚金，此時必須利用火讓水火既濟。此時的土的性質也寒冷，就算有土來生金，對庚金也沒有幫助。所以要有火暖土，進而生金，此時性質寒冷的金得到火的溫暖和土溫養，才能夠顯示出自己的作用。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅金多主頑固，頑而不化，故不喜過旺而失貴氣，以偏弱為宜。庚金需透過丁火錘煉，才能創造出有用的器皿，故喜用丁火取貴（官）。丁火作為庚金的正官，是對其方向的校正和行為的約束，可以最大限度的開發庚金的能力。<br>然而丙火（太陽）無法煅金，陽光卻能使庚金散發光芒，但庚金的剛與丙火的烈，會形成一直對立的局面，需有辛金或癸水的調解才能平和。<br>✅庚金之人剛毅果決，感覺靈敏，有正義感，重義氣，人倫理道德，是非分明。走運時氣勢旺，威力強。注重物質利益，有經濟手腕，朋友多，喜歡與人合作做事，常委屈自己造就別人。<br>✅庚金之人性格剛烈，鋒利卻稍嫌單薄，固執，容易惱怒，吃軟不吃硬。喜打抱不平，不會掩飾自己內心真正的想法。直來直往，不喜歡拐彎抹角，講話犀利，易傷人而不自知。<br>✅金在五氣屬〈躁〉，若金性太強，則容易鬱悶，不快樂，傷人傷己而招致痛苦。<br>✅庚金不論強弱，錢財問題多。庚金重義時（多比劫），剋財會慷慨，會搶著付錢，也易被騙；身弱者付後會後悔。<br>✅庚金遇壬水長相清秀，遇壬水大運必魅力無窮。<br>✅庚金之人喜家中多放植物，喜養貓〈寅木〉，見大量的甲木才能顯貴。<br>✅庚金之人強硬如剛鐵，抗打壓，剛毅果斷，好勝心強。當庚金身處困境，他們會越挫越勇，越磨越有鬥志，無論多麼辛苦勞累，也會拼盡全力。庚金喜歡變革，不破不立，他們也願意去嘗試新方法去突破目前的瓶頸。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶最喜丁火打造：屬於頑金，性燥情涼，威嚴有餘，慈悲不足。故此，最需丁火，一來，庚金得丁，亦為歷練，亦為成材，得火反銳，二來，庚金得丁，煞性受制，能行正道，故無情有義。<br>❷亦喜見壬得清：壬水為清，庚金得壬，亥申皆壬。金水自流，流水自清，足以引通剛殺之性，足以令庚淬厲晶瑩。故此，得水而清。癸水不流，庚不得清，因此，庚金不太喜歡見癸。<br>❸忌水之太多太旺：金能助水，水旺則奔，奔水則無法生物，同時，水多金沉，金沉則庚失去自性，就是無用之庚。<br>❹亦忌春木再旺：春天木旺金絕，氣絕之金，不足以伐木，不足以施威。木旺金缺，逞凶而取其辱，自找絕路之象。<br>❺也怕土厚土重：土能生金，大多是土金適宜。就如水能載舟，亦能覆舟，土厚土重亦能埋金。金之貴重，其顯有用，土埋之金，難以顯貴。<br>❻最惱水土同旺：水土同旺，就是水多土亦多，水土勢力相差無幾，水不為水，土不為土，水不清，土不固，亦為水土混雜。這樣的局面，就是水不泄金，土不生金，濕泥蝕金，不敗自敗，均不得其利。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('庚到寅宮評財殺，卯月正財便生官。辰初雜氣用偏印，巳火七殺號偏官。<br>午月炎天尋正官，未中雜氣用正印。申中便取建祿格，酉用羊刃格中尋。<br>戌中雜氣用偏印，亥上食神喜身強。子月傷官真可論，丑中只可作雜氣。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('甲財利潤厚，劈之可發榮；乙卻束手腳，吝嗇守財奴。丙為太陽光，雖烈不煉金，丁火鍛成器，顯貴入公門。戊土性干爽，泄秀不污壬；己土陰而濁，貌丑性下品。見辛須甲丁，無則性毒狠；逢壬金水清，才貌最可人。癸來傷丁貴，叛逆成霸匪。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('甲丁必顯貴，乙己濁五田，辛庚同一論，用壬忌癸逢。<br>');
	天干速查內容.push('《注》：甲庚金木相配吉，遇乙守財，束縛手腳。丙為冬季調候，丁透大吉。遇戊不忌壬水。混己為濁而無用。<br>');
	天干速查內容.push('<br>');    
	天干速查內容.push('<br><strong>人體：</strong>喉，鼻，大腸、結腸，臍大腸、筋骨、牙齒、支氣管、肺，呼吸系統、便祕。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 辛 金 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-辛金">辛金</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-辛金" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('💍辛陰〈金〉是珠寶手飾之金，其性溫柔清潤，亦為針尖、刀剪之器具，雖不及庚金鋼銳，外柔內鋼，卻有很強的延展能力。除冬天出生的辛金喜火外，大都不喜歡見火，喜歡壬水淘洗，以潤其柔性之本性。若金弱，土多則會有埋金之嫌，使金失去了光彩奪目的本色。<br>💍辛金經過多重丁火的錘煉，壬水的淘洗、琢磨，才能製成貴重的金屬或珠玉，喻須屢經磨難而終成大事。辛給人一種較平穩，聰明的感覺，儘管外表柔弱，內在卻暗含堅硬，同時也含有頑固之意。<br>💍辛金對甲木無砍伐之力，而乙木遇辛金，莖葉自然有損。辛金雖為珠玉也為刀剪之金，但只能損木之枝葉，不能害其身，此乃陰剋陰之故，如乙木有氣，或坐旺地，則不畏辛金。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>四季</strong><br>');
	天干速查內容.push('⭕春天的辛金，性情固執，易視財如命，跟著木〈財〉起舞。<br>⭕夏天的辛金，跟著火氣走〈丙辛合〉，個性隨合而軟弱。<br>⭕秋天的辛金，有庚金撐腰，耀武揚威，有個性，專橫跋扈。<br>⭕冬天的辛金，外表俊美，內在易感空虛。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅辛金為柔軟之性，其形如美玉，其質似月光，柔潤潔白，有清風明月之喻，為甘泉顯露之相，是外柔內剛，體用雙重之物，有助人之能。<br>✅辛金柔性，說話有技巧，比較神經質，沒有面現實的勇敢，有錢沒錢都反腦。說話冷潮熱諷，重意氣，別人的事情比自己的還來的重要，有氣質（會打扮），拘小節，感情豐富敏銳，比較愛睦虛榮，眼光犀利。<br>✅辛金之人性格好侵略別人，對自己有力的事情會積極參與，看重個人得失，利益心理重。<br>✅辛金雖為陰金，但以生亥水為質，故辛金之人如它的名子一樣，容易比一般人多付出與辛苦，也多具有憂鬱的氣質。<br>✓辛金人大部份的人，具備有「水滴石穿」的恆心，大多善於變通，往往能夠快速的適應周圍環境所發生的改變，而這也導致了他們比一般人要更加適合開拓、進取。<br>✅但辛金日元的人的潛意識裡，大多有著較強的本位觀念，需要經歷磨難才能成就大事。<br>✅辛金象徵凡間金銀，他們懂得圓通，會審時度勢。當辛金遇到困境，即便再難，他們也會在當下的條件之內，努力做到最好。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶最喜丙火耀其光澤：辛金本陰，故此，需火溫暖其性，不過，體小質柔，經不起錘鍊，故此，怯怕丁火敗壞其身，丙火不懼，得丙反而璀璨奪目，光芒四射。喜丙用丙，重在光耀其澤，丙火不能過旺，過旺則類似丁制，制則不美，亦怕丙丁混雜。<br>❷喜壬水流清：辛金雖弱，退氣而已。金見水流，壬水清澈，淘磨可觀，助其銳利，潤其光澤。弱為其道，以泄為生，雖弱亦不懼。同時，弱者怕制，見水實為兒來救母。<br>❸最怯丁火相制：辛乃成熟之金，貴重多嬌，體弱形柔，丁火純粹，最能壞金。偏弱如此，偏強亦然除非辛有庚雜，或者辛金秉令得時，形態轉化。<br>❹辛弱喜生：辛金本弱，要發揮作用，亦要辛金有根得助，就怕局中熱燥脆金壞金，故此《滴天髓》說，熱則喜母，就是濕土生金，比如辰丑，己土之類。不過，弱者以泄為生，助之過旺，也不好，很容易厚土埋金。埋與不埋，核心是辛要得強根出干。這樣才無埋金之患。<br>❺夏辛宜水：辛金本燥，過熱則乾，乾則金枯、金脆，特別是夏月之金，或者局中木火乘勢，這樣的話，最喜西北玄武救應。水火相濟，自得其樂。<br>❻冬辛宜丁：辛金本陰，寒涼為性，冬天水凍金寒，沒有生機可言，冷酷肅殺，難取情義。故此，急需丙丁調候，金溫水暖，情深義重，生機無限。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('辛日寅財旺生官，卯月偏財是福基。辰是雜氣未正印，巳上正官及正印。<br>午月偏官喜梟神，未取雜氣用偏印。申月借取傷官格，酉是建祿怕逢沖。<br>戌中雜氣戊是印，亥日傷官喜見財。子月之中求食神，丑上下旬論偏印。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('甲為剛硬木，日主遭反侮；乙木性柔弱，適制財豐厚。有丙戀財色，壯志被削磨；丁毀珠玉金，易成傷殘身。戊硬不生身，才華受拘禁；己土污水濁，辛金失光澤。壬水金清白，冬生喜丙火；癸為雲雨露，難列富貴格。庚來扶弱生，不懼泄耗克。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('獨喜用甲木，冬生用丙壬，餘干皆無用，大忌丙合辛。<br>');
	天干速查內容.push('《注》：辛忌甲木，乙辛可配。丁辛不可配。戊土不生辛，己土污金。遇壬為金清水白，辛癸無配合。<br>');
	天干速查內容.push('<br>');    
	天干速查內容.push('<br><strong>人體：</strong>胸，股、肺、筋骨、牙齒、支氣管、大腸、呼吸系統。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 壬 水 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-壬水">壬水</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-壬水" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('🌊壬水為海洋、江河、湖泊之水，源源不絕，奔騰流動，有滔滔大江澎湃之勢，得天獨厚的雄才大略。<br>🌊壬水橫掃世間，含有清濁並容，寬容大量之意；反之也有依賴性強，凡事漫不經心。<br>🌊壬水性寒，水越旺盛性越寒，特別喜歡陽光〈丙〉火的照耀而使水面更加絢麗，水裡的生物經陽光的照射而活躍生長。<br>🌊壬水強時喜歡陽土來作提壩，將水引入農田灌溉，或歸入大海。壬水為寒水，喜見丁生戊土。壬水的人生於亥子丑月，便是沖天奔馳之水。壬水弱喜見金生扶。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>四季</strong><br>');
	天干速查內容.push('⭕春天的壬水，聰明有智慧，善解人意。<br>⭕夏天的壬水，夏天水枯，需金來相扶。<br>⭕秋天的壬水，能受到父母的照蔭，會有繼承遺產的機會。<br>⭕冬天的壬水，壬水水勢竄流，奔放無邊。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅壬水的人天生就是一副精力旺盛的樣子，個性上均大事大而化之、爽朗的，平時都體現健康與好心情的狀態。對於追求異性，喜歡明白地表示，比較主動、但也比較沒耐性。<br>✅壬水是個有智慧、高智商但靜不下來的個性，常常會給身邊帶來快樂。不過因為他們的工作表現好，有時也會帶給朋友壓力。<br>✅壬水的人一般聰明（也常反被聰明誤），好勝，不服輸，變化無常，交際廣、人緣佳，能見風轉舵。走運時企圖心強，活潑外向，任性，做事積極，很會把握時機、見風轉舵。但運勢不濟時，如水能載舟，也能覆舟。<br>✅壬水的人善商業經營，膽大心細，順勢為己，精明，大而化之。喜歡當老闆，反應靈敏，事業容易有成就（但下滑的也快）。屬水的人利潤大眾的德性，也會成功身退的把舞台留給後人。<br>✅壬水性寒，也易多煩，是最難了解的人，一般也與子女緣份較弱。<br>✅壬水人對待生活的態度很樂觀、積極，能為自己的理想而奮鬥努力，經歷的好與壞也釋然接受，面對挫折困境也總是能坦然面對。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶宜疏怕塞：壬水本性剛健，易進難退，如果太旺，就是江河、大海之水，只能引導，不能制克惟順其勢，任其性，一往無前。有舟則可揚帆遠航，無舟亦可滌盪陳腐。<br>❷怕忌渾濁：己土陰柔，壬水剛健，如果土不成事，則無法止其任流，故此，壬不懼忌。壬水乾淨，己土來混，壬則失其清澈，己土對壬水還是具有傷害。<br>❸喜兩火相濟：水與火對，是為相濟。故此，壬水喜丙，水輔陽光，萬物得霽，風光秀美。壬與丁合，陰陽周全，仁情皆備，相互相成。<br>❹喜戊來作堤為岸：水無論壬癸，皆為潤下，涵養之德盛矣。但是，壬水奔流，取之不便，奔水盪土，亦為不清，故此，取用壬水，亦要戊土作堤。水靜則清，淨水則取，便於灌溉，便於飲用，潤下之德就會光大。<br>❺壬癸有互助之功：壬癸皆水，本性安靜。各有分工，不與物爭。故此，柔能助剛，剛不欺柔，能相互合作，互不爭利，互不為害。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('壬逢寅地號食神，卯上見印取傷官。辰是雜氣為七殺，巳取偏財並偏官。<br>午月財官正兩全，未上雜氣取財官。申月偏印無別論，酉取正印怕逢財。<br>戌月雜氣為七殺，亥未建祿用食神。子月之中羊刃格，丑中雜氣是財官。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('甲現好灌溉，慧質成大才；乙畏天河倒，隨波不自在。丙火水既濟，財富排天來；見丁酒色客，財從手中過。戊土堪作堤，威武鎮邪惡；己混不清沏，一生昏噩噩。庚為水之源，不懼土木火，辛白水愈清，才華蓋世歌。癸來劫財去，又將妻夫奪。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('甲丙大才器，戊辛亦可所，己癸不留財，合丁一世空。<br>');
	天干速查內容.push('《注》：乙木無用。丙壬水火既濟，遇丁酒色。戊為土水相制，己土混水。庚辛大吉。遇癸劫妻財。<br>');
	天干速查內容.push('<br>');    
	天干速查內容.push('<br><strong>人體:</strong>膀胱、腎臟、泌尿系統、胰島素分泌失調、免疫力差。<br>女性子宮較弱或有生殖器官病痛，生產病。男男性須多注意攝護腺，生殖器官等。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 癸 水 --------------
    天干速查內容.push('<div class="panel panel-default">');
    天干速查內容.push('<div class="panel-heading">');
    天干速查內容.push('<h4 class="panel-title">');
    天干速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-十干喜忌" href="#QR-col-癸水">癸水</a>');
    天干速查內容.push('</h4>');
    天干速查內容.push('</div>');  // div class="panel-heading"
    天干速查內容.push('<div id="QR-col-癸水" class="panel-collapse collapse">');
    天干速查內容.push('<div class="panel-body">');
	天干速查內容.push('<strong>象意</strong><br>');
	天干速查內容.push('💧癸陰〈水〉乃是雨露之水，是純陰至弱之水。小溪、水溝的細細水流、池沼混濁的水，或在草木葉上棲息的露水。是雨露之水，如來的及時的雨水，可以令乾凅的大地起死回生，枯萎的草木重新復甦。<br>💧癸水也是底層的深水，水的表面儘管明亮，但深處依然幽暗。癸水屬靜水，取辛金發其源，再見丙火照耀，為「陰陽和合，萬物發生」之象。<br>💧癸水是五行中最陰最短的氣流，幾乎任何一個五行都可以欺它，逢甲乙木會毫不留情地吸取癸水，逢丙火能化為雲霧遮太陽〈癸為霧〉，見丁火卻有剋制的作用，見戊土則被剋，逢壬水結合成黨，為有持無恐。<br>💧癸水太強時，獨喜丙火，癸水喜見辰的大運或流年，能大有作為（其意象為一個小溪直流向長江匯聚成大海），不愁火土太旺，因其至弱之性，見火土多即從化，癸合戊化火，會對命盤產生顛覆性的變化。<br>💧「癸」原意是「鬼」, 癸水是極陰的水，在八字中癸水日主的人較易有靈異體質。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>四季</strong><br>');
	天干速查內容.push('⭕春天的癸水，花木喜水，癸水被吸走了，水會衰竭，體質變弱。（但癸水見甲為增貴，象徵著提昇）<br>⭕夏天的癸水，見火則溫暖有情，但太猛烈的太陽將水蒸發至乾涸。<br>⭕秋天的癸水，秋天的太陽退氣，秋風帶來的雨水不斷補充癸水的力量。秋天生的癸水能受祖蔭。<br>⭕冬天的癸水，水旺盛與壬水結黨狀威風，能和其樂。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>外在個性</strong><br>');
	天干速查內容.push('✅癸水之人聰明，智慧，冷靜，人緣佳，善交際，善計算，善商業經營，巧於善變，做事保守，不拘小節，反應快，節儉，內向，目美音佳，記憶力好。<br>癸水在天為雨露，在地為泉脈，故有潤下的特性，滋生萬物之德。冷酷無情亦為它的一大特徵。<br>✅癸水之人性格足謀多智，聰明過人，目光高遠，目中無人，喜新厭舊，開拓力強，不喜歡墨守成規的工作，喜自由。其人勤勞節儉，臨機應變能力強，身處逆境也會開拓出道路。<br>✅癸水的人表面沉靜內向、忍耐，內心深暗藏漩渦，隱藏了深沉的性格。表面上雖然溫和，但內心卻是倔強，自我，容易吃醋、鬧彆扭。甚至陰沉多詐，不切實際，也缺乏收拾殘局的能力。<br>✅癸水的人是個憧憬戀愛，但是比較被動、膽子比較小，他們也比較喜歡開朗、能帶給他們快樂心情的人，內向的人通常不會是他們的選擇。<br>✅癸水的人身強必保守，膽小節儉；身弱內向，陰沉，膚色微黑，常會因身弱而引起靈性疾病。<br>✅癸水之人頭腦靈活，反應很快，會留意事項的細節。當他們遇到困難，總能在商討之中，或者其它渠道獲得突破現狀的靈感，找到解決的辦法。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌</strong><br>'); 
	天干速查內容.push('❶柔為德用，順逆皆可：癸水至弱，柔為其德，順則有用，不用亦可獨善其身。因為，癸水至弱，抗壓性就好，故此，癸水不懼弱，再弱也有用，柔能克剛，不失其德，火土再旺，見水則雲施雨濟，只要癸水有根得助就行，即使無根無助，亦可順從，癸水依然顯其德用，有調候的作用。<br>❷癸水最喜乙木生發：癸水的生發能力很強，適宜澆灌花木，栽種稼禾，故此，癸水最喜見乙，弱以泄為生，乙木因癸水而枝繁葉茂，癸水因乙木殺敵顯功，晶瀅清澈本性不改。<br>❸亦喜辛金發源：癸水至弱，清澈乾淨明亮，雖不懼克制，但亦不喜渾濁，比如己土。故此，最好見辛金發源，金白水清，源遠流長，無辛庚也可以。這樣癸水便可以保持自己的體性。<br>☆故此，癸水之干，只要有乙木和辛金這兩樣東西，便可以獨善其身。<br>❹最患己土來制來濁：癸水與世無爭，戊己均可欺侮。戊土強壯，陰陽作合，癸水可以委屈求全，亦可心甘情願，己土污穢，為癸水之不喜，癸水雖弱，見己也有脾氣。好在癸水喜靜，能講道理喜歡和平，會主動讓步，平息爭端。<br>❺喜壬水相助：癸水弱，則壬水相助，因為癸水依靠性大，潤下之德，比壬水更強，兩者均不喜爭利，得壬水之助，亦不為患。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>天干定格歌訣：</strong><br>');
	天干速查內容.push('癸日寅月取傷官，卯月食神定是真。辰中雜氣是正官，巳月正財官便是。<br>午月偏財又偏官，六月雜氣是七殺。申月正印怕逢寅，酉月偏印忌見比。<br>戌中雜氣是財官，亥月借取傷官格。子中建祿定其真，丑中雜氣為七殺。<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('<strong>喜忌 I：</strong><br>');
    天干速查內容.push('甲木參天樹，雨露無奈何；乙木為花草，滴水不干渴。丙火映彩雲，絢麗壯山河；丁火光微弱，有財能幾何？戊來合俊秀，老翁或丑婆；見己水不清，智商打對折。庚生怕太過，金多水必濁；辛癸兩相見，金白水清格。壬兄助身旺，不怕火土多。<br>');
	天干速查內容.push('<br><strong>喜忌 II：</strong><br>');
	天干速查內容.push('獨喜辛癸全，冬生用丙扶，餘皆不宜透，只忌火土多。<br>');
	天干速查內容.push('《注》：喜甲，遇乙守財。丙吉丁不久。戊為異樣婚姻，己必混水。庚金多水濁，辛則金白水清。<br>');
	天干速查內容.push('<br>');    
	天干速查內容.push('<br><strong>人體：</strong>膀胱、腎臟、精、泌尿系統、足<br>');
	天干速查內容.push('<br>');
	天干速查內容.push('</div>');  //div class="panel-body"
    天干速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    天干速查內容.push('</div>');  //<div class="panel panel-default">
    
    
    天干速查內容.push('</div>');  // div class="panel-group"

    return 天干速查內容.join("");
}  // end function 天干速查


function 地支速查(){
    var 地支速查內容 = [];

    地支速查內容.push('<div class="panel-group" id="QuickRef-地支速查">');

    // ------------- 子水 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-子水">子水「鼠」〈十一月〉（23-01時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-子水" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>善於保護自己，警覺多疑，膽小，雙重個性，橫跨陰陽，反覆無常，捉摸不定，比較沒有原則，善變，狡猾，極端，聰明絕頂，隱藏實力，心想的和做的不同，常常錯失機會。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>癸100%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>流動的水、河流、泉水、井、流動、流轉；引申為江湖、走江湖的、車船、貿易、文墨、玄學、圓潤、聰明、技能、算計、淫邪、種子、細小、細節的計算。是冬季、陽氣開始、表創始人、繁殖生息、根源、追本求源。於人體為腎、膀胱、泌尿、血液、精、腰、喉嚨、耳朵。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>申子辰：三合水</li><li>亥子丑：三會水</li><li>子丑：六合</li><li>子午：沖</li><li>子卯：無禮之刑</li><li>子未：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病: </strong>會陰、膀胱，生殖器官，耳、腰、液、溺<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 丑土 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-丑土">丑土「牛」〈十二月〉（01-03時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-丑土" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>任勞任怨，腳踏實地，牛脾氣，固執，苦幹型，一步一腳印，隱藏實力，追根究底，打破砂鍋在哪裡，堅持，忍辱負重，有耐心，學習能力較差，經過挫折才能成長，喜翻舊帳。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>己60%，癸30%，辛10%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>寒土、泥巴、濕土、沼澤、堤壩、地下室、下水道、廁所、黑暗、隱蔽、礦井、煤炭、墳墓、牢獄、黑社會、私情、淫亂、玄學、抽象、銀行、軍營、廠礦、田園。人體為腹、脾胃、腎、性器官、肌肉、腫塊。引申為見不得人的地方，陽光照不到的地方。土為財庫，就可能為銀行，是羊刃庫就是軍營了。丑土還主牢獄，黑社會。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>巳酉丑：三合金</li><li>亥子丑：三會水</li><li>子丑：六合</li><li>丑未：沖</li><li>丑未戌：恃勢之刑</li><li>丑午：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>肚、腹、脾、肌、肉，四肢<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 寅木 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-寅木">寅木「虎」〈一月〉（03-05時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-寅木" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>愛自由，行動派，樂觀、積極、仁慈、慈悲，愛漂亮、不易老，好動，坐不住、不服輸，較霸道，很會做事、沒事做會很難過、有克服困難的毅力，喜歡變化居家環境、勞碌命，行銷高手，不服輸的個性，喜歡當老大、喜歡別人聽他的話！喜歡照顧週遭的人，肉食主義，權威的象徵，食量大（勸盡量少吃，心情不好不要就一直吃），保護心強，行動力、開創力、持續力不足、野心大，不安於室，做大事業型。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>甲60%，丙30%，戊10%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>樹木、家俱、山林；堂廟、會所、樓宇、神龕、寺廟、政府機關、文化場所、高雅、生發；人體為頭、手、肢體、肝膽、毛髮、指甲、經絡、脈、筋、神經。兩寅可表眼睛。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>寅午戌：三合火</li><li>寅卯辰：三會木</li><li>寅亥：六合</li><li>寅申：沖</li><li>寅巳申：無恩之刑</li><li>寅巳：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>臂、肢、肺、膽、筋、脈、毛髮、風門穴，神經系統、關節炎<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 卯木 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-卯木">卯木「兔」〈二月〉（05-07時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-卯木" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>仁慈，內藏慈悲，心地善良，善變，不易老，龜毛，沒有膽子，狡猾（狡兔有三窟），防衛性強，文靜，代表桃花，有機警、愛乾淨的習慣，特別十神帶〈傷官〉潔癖多、靈敏度高。人緣好、眼光高，但會好高騖遠，也注重第一印象，第六感強，閒不住，做事細心有衝勁，不喜歡做事半途停下來，不能受挫，喜歡把自己的東西搬動的習慣。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>乙100%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>草木、繩索、兵器（帶羊刃時）、織物、木材、建材、曲線、波紋、彎折、門窗、床、籬笆、車船、網絡、傳播、機構；人體為肝膽、四肢、手臂、手指、腰、筋、毛髮；卯戌合為建築，土木工程；在門戶又為印星時可表車。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>亥卯未：三合木</li><li>寅卯辰：三會木</li><li>卯戌：六合</li><li>卯酉：沖</li><li>卯子：無禮之刑</li><li>卯辰：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>大腸、肝、十指、胸、目、手、十指、筋，顏面神經、神經衰弱<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 辰土 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-辰土">辰土「龍」〈三月〉（07-09時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-辰土" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>非常固執，喜歡奉承，喜歡巴結，喜歡聽好聽話，思想變化快，不好溝通，點子多，須別人來完成，很聰明，非常自責，喜當老大，不切實際，好高騖遠、常神龍見首不見尾，眼睛長在頭頂上，不信算命，一旦認同卻會很投入。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>戊60%，乙30%，癸10%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>濕土、泥、水庫、池塘、水井、建築、土產；牢獄、車輛、機器、大機構、中藥、思想、網絡；人體為膀胱、內分泌、肌膚、肩、胸、腹、胃。丙辰日主，食神又是智慧集中處，表思想。甲辰、庚辰為車象。辰酉合為病人。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>申子辰：三合水</li><li>寅卯辰：三會木</li><li>辰酉：六合</li><li>辰戌：沖</li><li>辰辰：自刑</li><li>卯辰：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>背、項、肩、消化系統、脊髓、皮膚、胸腔<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 巳火 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-巳火">巳火「蛇」〈四月〉（09-11時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-巳火" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>喜歡聊天，好辯，不服輸，驚覺性高，猜疑心重（變才無礙），行動快持久，冷靜，分析力強，足智多謀，外表冷靜，內心熱情，很會鑽研，城府深，業務推廣高手。巳火有變化莫測，柱中有巳火的人，性格可能有變色龍的傾向。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>丙60%，戊30%，庚10%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>溫暖、色彩、影像、鬧市、漂亮、網絡；文化、文章、思想、幻想、務虛、玄學、變化。人體為心臟、咽喉、面、齒、眼目、神經、小腸、肛門。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>巳酉丑：三合金</li><li>巳午未：三會火</li><li>巳申：六合</li><li>巳亥：沖</li><li>寅巳申：無恩之刑</li><li>寅巳：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>脾、面部、咽喉、牙齒、肛門、尾抵、心胞絡、三焦、感冒<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 午火 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-午火">午火「馬」〈五月〉（11-13時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-午火" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>需有舞台發揮，好勝心強，禁不起刺激，好鬥，火爆脾氣，但脾氣發過就好了，閒不住，不受拘束，喜別人拍馬屁，極端急躁，易翻臉，唱反調，易被設計，勞碌，奔波，無方向感，脾氣很拗，要給他一個目標讓他去執行才好，適做業務，司機。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>丁70%，己30%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>陽火、大火、血光、光彩、電子、信息、廣告、文學、語言、文章；劇場、體育場、熱鬧的地方；熱情、激動、強烈、衝動、機動、直來直去。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>寅午戌：三合火</li><li>巳午未：三會火</li><li>午未：六合</li><li>子午：沖</li><li>午午：自刑</li><li>丑午：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>心臟、精神、血液、眼目、頭痛、心腹、小腸、舌、神氣<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 未土 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-未土">未土「羊」〈六月〉（13-15時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-未土" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>很孝順但不懂表現（尤其帶印的人），不擅言詞，追根究底型，打破砂鍋問到底，還問砂鍋在哪理，喜往外跑，喜鑽牛角尖，感情專注，不易變心，注重外表，較膽小，喜依靠他人，忠貞，內心想當領導人物，需依附他人才會成功。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>己60%，丁30%，乙10%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>溫土、田園、公園、庭院、土產、建築物、房地產；果實、林場、酒店、食品、醫藥、化工、休閒；人體為脾胃、脘腹、口腔、肌膚。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>亥卯未：三合木</li><li>巳午未：三會火</li><li>午未：六合</li><li>丑未：沖</li><li>丑未戌：恃勢之刑</li><li>子未：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>小腸、胸膈、脊梁、脾胃、腹、口、唇、齒，消化系統、健忘症、容易倦怠<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 申金 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-申金">申金「猴」〈七月〉（15-17時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-申金" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>學習，模仿能力強，善變，沒有耐心，喜走捷徑，好動，坐不住，閒不佳，有衝勁，急性子，膽大，重義氣，做事持續力不足，亦是五術高手，唯我獨尊。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>庚60%，壬30%，戊10%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>收斂、肅殺、冷峻、物理、理性、礦物、車輛、金融、數學；刀、劍、手術、兵、司法、軍隊、公檢法。等。人體為肺、大腸、脊、牙齒、氣管。與火相配主武職象、帶上羊刃七殺傷官，也主武職。帶傷官為檢察院、紀委，帶羊刃為公安、軍隊。申是物理學；辰+子是化學；壬、亥、戌都是數學；木火是文科，金水為理科。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>申子辰：三合水</li><li>申酉戌：三會金</li><li>巳申：六合</li><li>寅申：沖</li><li>寅巳申：無恩之刑</li><li>申亥：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病:</strong>膀胱、肺經、聲咳、肺、大腸、筋骨、音聲、呼吸系統<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 酉金 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-酉金">酉金「雞」〈八月〉（17-19時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-酉金" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>有衝勁，悲觀，個性雞婆，熱心助人，喜自由，急躁，雙重個性，第六感強，喜服務人群，勤勞，守（藏）不住秘密，如會喝酒就是很會喝，如不會喝酒則滴酒不沾。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>辛100%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>金石、朱玉、小飾品、器皿、鐘錶、器械。銀行、酒店、信息、技術、法律、玄學，技巧。肺、小腸、耳朵、牙齒、骨骼。另表：病人、死人、奸邪、妓，因為酉是太陽落山之時，陽氣消亡之狀態，醫生八字中常帶酉字。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>巳酉丑：三合金</li><li>申酉戌：三會金</li><li>辰酉：六合</li><li>卯酉：沖</li><li>酉酉：自刑</li><li>酉戌：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>腎精，血，小腸、肺、鼻、皮毛、聲<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
    
    // ------------- 戌土 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-戌土">戌土「狗」〈九月〉（19-21時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-戌土" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>固執、頑固、鐵齒、忠心，講義氣，重感情，較無開創力，享受成果，較現實，好鬥，不到絕境決不輕易覺醒，領悟力強，喜當老大（狗眼看人低），做事小心謹慎，不信算命，一旦相信易堅信不移，對五術有獨特的見解與天賦。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>戊60%，辛30%，丁10%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>燥土、火爐、槍彈、火藥、動力、牢獄、刑罰；墳墓、廟宇、加油站、電站、學校、編輯部、影院、鬧市、市場、歌舞、色情、夜總會、網際網路、建築、高樓、建材、室內裝潢、化工、數學；人體為心、心包、命門、背、胃、鼻、肌肉、腿、踝足。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>寅午戌：三合火</li><li>申酉戌：三會金</li><li>卯戌：六合</li><li>辰戌：沖</li><li>丑未戌：恃勢之刑</li><li>酉戌：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>腿、命門、胸、筋、臀、腿、膝、足踝，下半身患疾（風濕病痛）；男命，瘡；女命，子宮<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">

    // ------------- 亥水 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-亥水">亥水「豬」〈十月〉（21-23時）</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-亥水" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<br><strong>個性: </strong><br>有口福，頭腦聰明，智慧高，人明理，堅持己見，重原則，常扮豬吃老虎，好享受，開創力低，報喜不抱憂，最會鑽牛角尖，鬱卒，比較會有想不開的念頭，不講道理，很番，不易溝通，善用別人（借力使力），生意高手，追根究底，口才佳，好辯，眼光獨特。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>藏干: </strong>壬70%，甲30%');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>地支類化象: </strong><br>池塘裡不流動的水、灌溉、溝道、筆墨、酒、水產、毒藥、科技、運算、數字、思想、網絡；人體為頭、腎、膀胱、尿道、血脈、經血。亥容易當會計，總和數字打交道。');
	地支速查內容.push('<br>');
	地支速查內容.push('<br><strong>刑衝合會害: </strong><br><ul><li>亥卯未：三合木</li><li>亥子丑：三會水</li><li>寅亥：六合</li><li>巳亥：沖</li><li>亥亥 ：自刑</li><li>申亥：害</li></ul>');
	地支速查內容.push('<br><strong>人體疾病：</strong>三焦、腎、頭、陰囊、髓、精，尿道炎、排洩機能<br>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	// ------------- 三會 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-三會">三會</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-三會" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<strong>三會</strong><ul><li>地支三會，是指春夏秋冬四季會一方之旺氣，蓋取一方連貫氣勢。它包括：寅卯辰三會木局、巳午火三會火局、申酉戌三會金局、亥子丑三會水局。</li><li>如果地支同一方位的三者齊備，不管天干有無三會局的化神透出否，都論會局成功論；若天干透出會神的五行，更是力量強大、所向披靡。</li><li>三會局的地支均按會後之五行論事，會成用神則吉，會成忌神則凶。若三會局少一支，待歲運補起時，也論三會成功。</li><li>寅卯辰會方，如生於寅月，以會成陽木視為之，如出生在卯月，則以會成陰木而論；如出生在辰月，則看天干所透定義會木的性質。同理，如果三會方生於不當令的月份，天干透出會方之神，則以該干為所會之五行；如果天干雙透陰陽會神，或者全然不透會神，則以三會方中的四正位其所會之五行。</li></ul><br>');
	地支速查內容.push('<strong>寅卯辰會東方木: </strong><ul><li>正月、二月、三月為春季。萬物發生。</li></ul>');
	地支速查內容.push('<strong>巳午未會南方火: </strong><ul><li>四月、五月、六月為夏季。萬物茂盛。</li></ul>');
	地支速查內容.push('<strong>申酉戌會西方金: </strong><ul><li>七月、八月、九月為秋季。萬物收成。</li></ul>');
	地支速查內容.push('<strong>亥子丑會北方水: </strong><ul><li>十月、十一月、十二月為冬季。萬物閉藏。</li></ul>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	// ------------- 三合 --------------
	// https://new.qq.com/omn/20210327/20210327A01H5N00.html
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-三合">三合</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-三合" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<strong>三合: </strong><ul><li>即是長生、帝旺、墓庫之合。代表溫順、乖巧得長輩緣。合則為順、為助，代表諸事順暢、順心，又為互助互惠。</li><li>三合又表示恩愛、情合、圓融、喜慶、財祿、合夥、擴增、發展、旺氣、利益，為一分耕耘，一分收穫。</li><li>地支三合局成立條件：地支「生旺庫」三者齊備，只要天干透出三合局的化神五行；或者化神當令逢生，即可論合化成功。</li><li>地支三合合化後，一般情況下，可直接按合化後的新五行論生剋吉凶，合化之五行為命局之喜為吉，為命局之忌則凶。</li><li>三合局中多一支，則為增力不作爭合論，比如寅午戌三合局，多一寅支，以寅午戌三合火局增力論。三合局中，若見同氣之字，亦同此論。</li><li>三合局三支全，有一閒字間隔，仍作合論；半合與拱合，應以緊貼為要，中間如有沖字間隔，一般多論沖不論合。</li><li>凡天干沒有透出三合局的化神五行；且化神又不稟令逢生者，則不能論合化，則論三合絆。</li><li>合絆的五行均按原五行論，得生五行增力，被化洩的五行減力，比如：寅午戌三合絆，寅木生中神只留下本氣甲木、寅木生午火被減力。旺神午火中只留下本氣丁火，午火生墓神戌土減力；墓神戌土中只留下戊土本氣，戌土得寅木生午火、午火生戌土，最終受益的是戌土。也就是戌土增力最大，寅木、午火均減力，其中寅木減力最大，午火稍次。</li><li>當三合絆的化神五行在歲運出現時，此時三合局合化成功。</li><li>生旺半三合（「寅午」、「巳酉」、「申子」、「亥卯」）、旺墓半三合（「午戌」、「酉丑」、「子辰」、「卯未」）與生墓半三合（「寅戌」、「巳丑」、「申辰」、「亥未」），一般論合絆，當歲運補齊三合局所缺一支，並見天干化神五行透出時，才按合化成功論。</li></ul><br>');
	地支速查內容.push('<strong>申子辰合水局：</strong><ul><li>生在申，旺在子，庫在辰。 多元化智慧，變化大，冷眼旁觀，臨時改變，冷漠自私。</li></ul>');
	地支速查內容.push('<strong>巳酉丑合金局：</strong><ul><li>生在巳，旺在酉，庫在丑。指揮性佳，講義氣，外表威嚴較酷，有血光，肅殺之氣，講話會修飾。</li></ul>');
	地支速查內容.push('<strong>寅午戌合火局： </strong><ul><li>生在寅，旺在午，庫在戌。 熱情，前熱後冷，行動派，急性子。</li></ul>');
	地支速查內容.push('<strong>亥卯未合木局：</strong><ul><li>生在亥，旺在卯，庫在未。 幻想，不切實際，心地軟，計畫一堆，大部分無法實現。</li></ul>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	// ------------- 六合 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-六合">六合</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-六合" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<strong>六合</strong><ul><li>有計劃能力，合得來，會有收成，守成，同心協力，好溝通。合：代表隨和、圓融異性緣佳。</li><li>凡干支被合，遇沖有解；但衰沖旺神、不能解合，只有旺神才能解沖。命局為先，歲運為後；大運為先，流年為後。</li><li>地支所合化之五行旺相成勢時，也無需天干引化，照樣可以合化成功；但只是力量稍微差一些而已。</li><li>有些命局，合化的狀態，可能處於接近半化不化的狀態，或者不徹底合化，就要以生剋為主線，來加以判斷。</li><li>不管三合、三會、六合、五合，都存在加力，減力的問題，至於什麼情況下加力，什麼情況下減力，要由他們的性質來決定。比如：命中有寅午，如遇到丙戌，則是火旺；這時的戌，對於火來說，就是加力。如果遇到壬戌、庚戌，此時戌不能加大火的力量，反而減弱火的力量。</li><li>無論干合，或者支合，合化成功，被合化的五行，就不能發揮出本五行的生剋職能，實質上就是受傷了。</li><li>若是用神被合化為其他的五行，用神受傷，就會有災了。就是用神所代表的人，或者事物上的災；不僅應驗在命主的六親方面，更會應驗到命主自身。</li><li>其實，就是忌神被合化，相應的六親也會有災，只不過，這種六親或者與自己緣份少，或者感情淡薄而已。</li></ul>');
	地支速查內容.push('<br><strong>子丑合水：</strong><ul><li>子丑合，子為玄武，丑為貴神，子為水，丑為稀泥，這種合就是把水和稀泥合在一塊，所以叫做泥合。</li><li>（註）玄武為曖昧之神，向貴神求合，主要目的是未害子求丑來護衛，玄武曖昧不淨，代表一種陰暗之象，但是子合的同時會被丑克住，所以子水本身有損失，這代表一種不情願的合，因此子丑合代表因小失大，和聚散不能自主之象。</li><li>（註）子水有暗昧的性質，同時玄武有貪婬之象，在年月，代表長輩中有服毒，不正之人，在日時同樣如此，一般情況下有子丑合的人你斷他是個因小失大的傢伙通常不會錯的。</li></ul>');
	地支速查內容.push('<strong>寅亥合木：</strong><ul><li>寅亥合，同時寅亥也帶破，這個合叫做破合。同時又叫義合，因為寅亥中都含甲木，為兄弟合作共同抵禦外敵之象。因為義合，所以非常同心，又因為是破合，所以他也帶有不好的象，一般在年柱出現，都會有英年早逝的祖輩和殘疾之人。</li></ul>');
	地支速查內容.push('<strong>卯戌合土：</strong><ul><li>卯戌合，叫做淫合，因為卯為花草，戌為火爐，合化火，其像意為卯木自焚。代表一種無自控能力，意志不堅定，缺乏主見之象。在六合裡面，卯戌合最能代表未婚同居。</li></ul>');
	地支速查內容.push('<strong>辰酉合金：</strong><ul><li>辰酉合，為融合。辰為天罡，貴人不臨，酉為太陰，主陰私之事，這種合代表一種私下約定，女命在感情上一般是自由戀愛，在古代就說是容易私奔。辰為天罡主訟，酉為門戶，這還代表著一種象，就是家有鬥訟，展開來說就是有牢獄官非等。</li><li>（註）繼續展開還有很多延展出來的象。具體結合他的位置和十神神煞來確定，比如辰酉合，辰是一種低賤的將神，代表的是一種逆反抗上精神，所以如果在時柱出現的話，他還可能代表子女不聽話。</li></ul>');
	地支速查內容.push('<strong>巳申合水：</strong><ul><li>巳申合，叫做刑合，巳申同時也是三刑中的一種。這個代表的意思跟寅亥合有點類似，合同時又刑，好中有壞，就好像矛盾夫妻，分開就思念，在一起又爭吵。申為刀劍，巳為金的長生處，因此有火金鑄劍之象，代表一種家裡出武職的象。</li></ul>');
	地支速查內容.push('<strong>午未合火：</strong><ul><li>午未合，午為爐火，未為碳，這種合叫做和合。代表一種光明燃燒之象，因此為人光明正大，同時午火為文印，在神將中代表公門和文筆，未為小吉，這代表家門中出文人之象。未又為少婦，還代表家門中出重婚之人。</li></ul>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	// ------------- 六沖 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-六沖">六沖</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-六沖" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<strong>六沖：</strong><ul><li>代表衝動、魯莽欠考慮。代表意見不合、容易有沖突、彼此相沖。同陰同陽之相剋，為無情沖剋，沖力大而激，逢之大凶；相沖謂沖入，代表拖拉、虛耗、事多阻礙、打擊、壓制、不順、失敗、反背、破壞、肅殺、凶險、六親緣薄或受傷害、受連累、使身心不安之種種現象。具有撞擊力，播種，很會做事，有執行力，有沖勁。</li><li>沖動，意見不合，反目。走運逢沖則發，不走運逢沖則墬。太歲流年沖向命盤較嚴重，命盤沖向流年太歲則較輕。根忌沖，逢沖小心「財」。</li><li>相沖實際上就是相剋，真正的相沖，只有在體現出五行本性時，才能完成。比如：子午沖，子需要的天干則是逢壬庚；午需要的天干則是甲丙。</li><li>干支完全對立時，相沖才能完成。如果子水午火，天干不是體現對立的五行時，相沖則沒有完成。</li></ul><br>');
	地支速查內容.push('<strong>子午沖：</strong><ul><li>水火不容，情緒不穩定，脾氣不好，個性極端。人緣很好，異性緣佳。較有發瘋機率，腦神經衰弱的現象。子午的人通常都很漂亮。</li></ul>');
	地支速查內容.push('<strong>丑未沖：</strong><ul><li>愛追根究底，打破砂鍋問到底，主觀意識強烈。易賠錢，財庫沖開，開銷大。愛問，鑽牛角尖。較會跟鄰居吵架，女命易流產。</li></ul>');
	地支速查內容.push('<strong>寅申沖：</strong><ul><li>忙碌，閒不住，勞碌命。開車很快，較會走大馬路。有車關，易生車禍。六親較無緣，一輩子靠自己。（同傷官見官，一生大起大落）</li></ul>');
	地支速查內容.push('<strong>卯酉沖：</strong><ul><li>做事俐落，很敏銳，有第六感，眼睛銳利，人緣好，異性緣佳，心性不定（桃花沖），陰易近身。</li></ul>');
	地支速查內容.push('<strong>辰戌沖：</strong><ul><li>辰與戌屬現金，庫沖庫，撞到事業宮的話，投資會失敗。不服輸，自圓其說，自找台階。喜做老大，脾氣不好，理由多，會將錯就錯，歸錯於別人，做事野心大，開銷大。須注意婚姻問題。</li></ul>');
	地支速查內容.push('<strong>巳亥沖：</strong><ul><li>辯才無礙，口才佳，很會辯，愛聊天，常常禍從口出。追根究底，較會鑽小巷，有車關。</li></ul>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	// ------------- 六破 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-六破">六破</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-六破" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<strong>六破：</strong><ul><li>地支隔十相破，十乃變數，破局而出。破只有相互貼身之時才有此關係。地支相破，為互相破壞；亦戰剋之意。為破壞、破產、搗亂、內部矛盾衝突。</li><li>破年者，早別雙親。破月者，中少年期間居住地點、工作、職業轉變頻多。破日者，孤立，多與配偶緣淺。破時者，晚年寂寥不遇。月/日 相破者，傷配偶。女性易與公婆不合。</li></ul><br>');
	地支速查內容.push('<strong>子酉破：</strong><ul><li>遇小人，有晦災。</li></ul>');
	地支速查內容.push('<strong>卯午破：</strong><ul><li>主門戶破敗。</li></ul>');
	地支速查內容.push('<strong>子酉、卯午</strong>，本為相生，協調合作是天經地義的事，但雙方都是帝旺，旺而不生，原因是都認為自己最厲害(帝旺)，又得不到好處（泄），所以不去履行自己的職責。一般情況下，酉金不生子水，卯木不生午火，子水不生卯木。<br>');
	地支速查內容.push('<strong>巳申破：</strong><ul><li>又刑又破又合，主先敗而後成。不免波折，高潮迭起，聚散倆依依。</li><li>寅、亥相破是生中帶破，亥中壬水剋寅木中的丙火，寅木中的甲木脫亥水中的壬水。</li></ul>');
	地支速查內容.push('<strong>寅亥破：</strong><ul><li>又破又合，主先敗而後成，先離後又復合。</li><li>巳、申相破是合中帶破，巳火中的丙火和戊土剋申中的庚金和壬水，申中的壬水剋巳中的丙火。</li></ul>');
	地支速查內容.push('<strong>辰丑破：</strong><ul><li>主家牆壁、墓地頹廢。</li><li>辰中乙木破壞丑中的己土，丑土中的辛金破壞辰中的乙木。</li></ul>');
	地支速查內容.push('<strong>未戌破：</strong><ul><li>主人物刑傷</li><li>未中的丁火破壞戌中的辛金，戌中的辛金破壞未中的乙木。</li></ul>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	// ------------- 六害 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-六害">六害</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-六害" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<strong>六害：</strong><ul><li>代表多疑、善變不一致。意見不合，爭吵(結怨)、爭鬥、失敗之象。劫煞臨身，為感情、金錢、精神之破失、傷身、傷財、又傷心。分離(指人的生離死別)，變卦，聚少離多，同床異夢，要收成時，會收不到。</li><li>若相害的字相鄰，則害之力較大，若相隔，則害之力較輕。八字中有某字，而大運或流年走另一個相害的字，亦會構成相害情況。</li></ul>');
	地支速查內容.push('<strong>子未害：</strong><ul><li>個性極端，容易犯小人，易換工作。貌合神離，無話可說，會要求對方。（最嚴重的害，又稱天地害，南北害）</li></ul>');
	地支速查內容.push('<strong>丑午害：</strong><ul><li>耐性差，容易生氣，貌合神離。</li></ul>');
	地支速查內容.push('<strong>寅巳害：</strong><ul><li>是非多，無恩情（人情），易犯小人，冷眼旁觀的態度，屬驛馬害，辯才無礙。如果離婚，也可能同住一屋簷下。</li></ul>');
	地支速查內容.push('<strong>申亥害：</strong><ul><li>是非多，無恩情，易犯小人。（比喻相見不如懷念，相見就吵，不見又懷念）屬驛馬害。</li></ul>');
	地支速查內容.push('<strong>卯辰害：</strong><ul><li>本身要注意，易遭周邊親人相害，殺傷力很大，好朋友扯後腿，兄弟無緣，手足無助，要他好，反而害他，愈親近的人，反駁力越大。</li></ul>');
	地支速查內容.push('<strong>酉戌害：</strong><ul><li>與卯辰害相似，容易被近親戲弄。雞犬不寧，哭笑不得，離婚率高。</li></ul>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	// ------------- 三刑、自刑 --------------
    地支速查內容.push('<div class="panel panel-default">');
    地支速查內容.push('<div class="panel-heading">');
    地支速查內容.push('<h4 class="panel-title">');
    地支速查內容.push('<a data-toggle="collapse" data-parent="#QuickRef-地支速查" href="#QR-col-三刑">三刑、自刑</a>');
    地支速查內容.push('</h4>');
    地支速查內容.push('</div>');  // div class="panel-heading"
    地支速查內容.push('<div id="QR-col-三刑" class="panel-collapse collapse">');
    地支速查內容.push('<div class="panel-body">');
	地支速查內容.push('<strong>刑：</strong><ul><li>代表霸道、專制不妥協。代表個性不合、互有刑剋 。刑我者為積欠、為還、互相欠債。精神方面的壓力與挫折。</li><li>刑還代表突然凶災和牢獄，所以在運年遇見的時候十有八九都論凶。</li><li>身強有氣，就不甘心被刑傷，往往是牢獄之象。身弱無氣容易被刑傷，多見傷災。刑也可以被解開，如果逢空亡、貴人往往只有一場虛驚。</li></ul><br>');
	地支速查內容.push('<strong>子卯相刑：</strong><ul><li>無禮之刑，剋六親，婦女逢之易損孕、損胎。</li><li>沒氣質，眼光高，講話沒禮貌，說話不客氣，不隨便與人交談，自視清高，看到不喜歡的人，他就不會去理會對方，脾氣不好，沒禮貌。</li><li>刑中最凶兆，不孝不悌，相妒不睦，剋損六親，婦人有此刑，翁姑不合，且易損孕。命局有此刑者，好色淫亂，卑鄙無恥，有色情之傾向。</li><li>不論男女命，命帶此刑，性情殘暴，不守禮法。命帶子午卯三刑全，必出生寒微，短壽之兆。</li></ul>');
	地支速查內容.push('<strong>丑戌未三刑：</strong><ul><li>未丑刑（沖）、未戌刑（破）。丑刑戌，丑對戌太有信心，自認戌可幫己一切搞定，但往往事與願違。為持勢之刑，剛毅太過，易遭挫折、易罹災，傷人傷己，婦女逢之易孤獨。</li><li>做到累死，別人也不會感激你，替別人打江山。做憨工，沒有恩惠。你有十分力，勸你留三分可收尾。你會嫌人，別人也會嫌你。做事可以做的成功，但只要有一小點做不好，就會被修理。性情冷酷薄義，易遭陷害及惡事發生，女子有此刑，易損孕。</li><li>丑戌未三刑形成就代表被人欺負。命局有此刑者（日干非土金者尤驗），持勢猛進，易受挫折，易成易敗，身體衰弱，夫妻互相敵視等凶兆。婦女變成孤獨。</li><li>不論男女命，命帶戌丑未三刑者，必出生寒微，終必病亡。為旺盛之極，全滿而缺變衰弱，這是五行的理法。俗稱四惑十惡，就是三刑，順行四位叫四惑，逆行十位叫十惡。</li></ul>');
	地支速查內容.push('<strong>巳申寅三刑：</strong><ul><li>寅巳刑（害），巳申刑（破）。寅刑巳，巳做到流汗，被寅嫌到流口水，寅不懂得感恩。看寅、巳的六親宮位推論誰會對誰不知感恩。</li><li>無恩之刑，逢之勞而無獲，易遭小人陷害、施恩無功、受拖累、災禍頻仍，女人逢之易損孕、損胎。</li><li>巳申寅一般就代表被人坑害，或者工作上恩將仇報。命局有此刑者，性情冷酷，薄情無義，有叛逆的傾向。因太過有自信，過於猛進，易遭挫折，無惻隱之心，剛毅且易罹災。婦人有此刑，易孤獨。</li><li>男命有此刑，必招怨仇，殺傷，械斗等災禍；女命有此刑，必招流產，離婚，傷殘等兇災。論男女命，命帶寅申巳三刑全，必出生寒微，異地凶終。</li></ul>');
	地支速查內容.push('<br><strong>自刑：</strong><ul><li>辰午酉亥自刑形成代表自尋煩惱自殘肢體等。因自信不足，缺乏獨立性，過於依賴又固執己見，行事眼光短淺，易有始無終。</li><li>心裡的鬱悶，不知道要向誰說，找不到對象說，有話不想跟別人說，有話說不出口，在心裡一點一點的累積。</li><li>尤其是亥月生者，明知不可為而為之，常拿石頭砸自己的腳，會想不開，內心鬱悶不知找誰訴說，自卑。「亥」若在月令更嚴重。「酉」，「午」較亥來得輕微，辰的自刑最輕微。</li><li>命帶自刑的人，缺乏獨立精神，做事不能有始有終。敵視他人，喜組黨派。自私自利，內心陰險，自謀發展，只可共患難，不能共享福。太過旺盛而變成刑，本身就會損害家門，遊蕩及離家出走。</li></ul>');
	地支速查內容.push('<strong>辰刑辰：</strong><ul><li>固執，有原則，不喜歡別人左右他，喜歡獨立，作老大，懷才不遇，做事有頭無尾。鬱卒型。</li></ul>');
	地支速查內容.push('<strong>午刑午：</strong><ul><li>好勝心強，不喜歡別人用話刺激他。個性極端，沒耐性，健忘。屬「馬」者，喜歡別人拍他馬屁，所以要說好聽的話，要好好溝通。</li></ul>');
	地支速查內容.push('<strong>酉刑酉：</strong><ul><li>講義氣，較雞婆，遇到懶散的人或不講義氣（不講理）的人，他會生氣，所以乾脆不說。太過熱情，變成憂鬱。</li></ul>');
	地支速查內容.push('<strong>亥刑亥 ：</strong><ul><li>聰明，智慧，明理。有事不說，鬱卒型。易有自殺傾向。</li></ul>');
	地支速查內容.push('<br>');
	地支速查內容.push('</div>');  //div class="panel-body"
    地支速查內容.push('</div>');  // <div id="QR-col-xx" class="panel-collapse collapse">
    地支速查內容.push('</div>');  //<div class="panel panel-default">
	
	
    地支速查內容.push('</div>');  // div class="panel-group"

    return 地支速查內容.join("");
}  // end function 地支速查速查

// https://coolsymbol.com/
// https://home.unicode.org/emoji/emoji-frequency/
// 💚green❤️red💛yellow💙blue💜purple
// ✔️❌✅☑️❎⭕🔵⛔⏺️🔼⏹️🔸🔹 💥☀️🌍🌙⚡💧
// 💊🎈🔥👍🚀💎🔔🌳🥕
// 「」〈〉
// ⓪ ① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ⑩ ⑪ ⑫ ⑬ ⑭ ⑮ ⑯ ⑰ ⑱ ⑲ ⑳
// ⓿ ❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ⓫ ⓬ ⓭ ⓮ ⓯ ⓰ ⓱ ⓲ ⓳ ⓴
// ⓵ ⓶ ⓷ ⓸ ⓹ ⓺ ⓻ ⓼ ⓽ ⓾

// <br><ul></ul>