function 五虎擇日元件(){
    this.名 = "";
    this.喜 = "";
    this.忌 ="";
    this.註解 ="";
    this.備註 =""; 
} // end function 擇日元件

function 五虎遁曆法編輯(運算日期){
    
    var 曆法 = {
        "運算西曆": 運算日期,
        "城市": "吉隆坡",
        "節氣用區域時間": false,
        "節氣用軌道太陽時": false,
        
        //use by 西曆轉換農曆 function
        "夜子時": false,
        "生日用真太陽時": false,
        "二十八宿資料": true // required 二十八宿.js
    };
    
    // *************** 建立 曆法 數據 ***************
    曆法.干支曆 = 西曆轉換干支曆(曆法);
    曆法.農曆 = 西曆轉換農曆(曆法.運算西曆, "吉隆坡", 曆法.夜子時, false, false, false, 曆法.生日用真太陽時, 曆法.二十八宿資料);
    
    var 閏年字 = (曆法.農曆.閏年) ? "（閏）": "";
    var 閏月字 = (曆法.農曆.閏月) ? "閏": "";
    
    var 五虎簡易曆法 = {
        "運算西曆": 曆法.運算西曆,
        "中文西曆": 曆法.運算西曆.getFullYear() + "年" + Number(曆法.運算西曆.getMonth()+1) + "月" + 曆法.運算西曆.getDate() + "日",
        "星期天": 曆法.農曆.星期天,
        "datestring": 曆法.運算西曆.getFullYear() + "-" + Number(曆法.運算西曆.getMonth()+1) + "-" + 曆法.運算西曆.getDate(),
        "週數": 曆法.農曆.週數,
        "農曆": { "日期": 曆法.農曆.干支年 + 閏年字 + "年" + 閏月字 + 曆法.農曆.月中文 + "月" + 曆法.農曆.日中文 + "日", "年": 曆法.農曆.干支年, "月": 曆法.農曆.月, "日": 曆法.農曆.日, "閏年": 曆法.農曆.閏年, "閏月": 曆法.農曆.閏月, "生肖": 曆法.農曆.生肖 } ,
        "干支曆": { "年柱": 曆法.干支曆.年柱, "月柱": 曆法.干支曆.月柱, "日柱": 曆法.干支曆.日柱, "生月數": 曆法.干支曆.生月數, "月令": 曆法.干支曆.月令, "司令": 曆法.干支曆.司令, "四季": 曆法.干支曆.四季, "節令": 曆法.干支曆.節令, "節氣": 曆法.干支曆.節氣, "節氣旬": 曆法.干支曆.節氣旬, "閏年": 曆法.干支曆.閏年, "騎年": 曆法.干支曆.騎年, "交節日": 曆法.干支曆.交節, "交節": {} },
        //"干支曆曆": 曆法.干支曆,
        //"農曆曆": 曆法.農曆,
        "七曜日": 曆法.農曆.二十八宿.七曜日,
        "太歲": {}, 
        //"黃道黑道神煞": 黃道黑道神煞(干支曆.日柱.substr(1,1)),
        "擇日": { "二十八宿": new 五虎擇日元件(), "歲建十二神": new 五虎擇日元件(), 彭祖百忌: {} },
        "備註": ""
    } // end 五虎簡易曆法
    
    五虎簡易曆法.干支曆.交節.成立 = 曆法.干支曆.交節;
    五虎簡易曆法.干支曆.交節.交節字 = 曆法.干支曆.交節或交氣;
    五虎簡易曆法.干支曆.交節.節令 = 曆法.干支曆.交節日節令;
    五虎簡易曆法.干支曆.交節.日期 = 曆法.干支曆.交節日期;
    五虎簡易曆法.干支曆.交節.時分 = (五虎簡易曆法.干支曆.交節.成立) ? 曆法.干支曆.交節日期.getHours() + ":" + 曆法.干支曆.交節日期.getMinutes(): "";
    
    五虎簡易曆法.擇日.二十八宿.名 = 曆法.農曆.二十八宿.動物;
    五虎簡易曆法.擇日.二十八宿.喜 = 曆法.農曆.二十八宿.值日宜;
    五虎簡易曆法.擇日.二十八宿.忌 = 曆法.農曆.二十八宿.值日忌;
    五虎簡易曆法.擇日.二十八宿.註解 = 曆法.農曆.二十八宿.值日詩註釋;
    
    五虎簡易曆法.擇日.歲建十二神.名 = 建除十二神查詢(五虎簡易曆法.干支曆.月柱.substr(1,1), 五虎簡易曆法.干支曆.日柱.substr(1,1));
    var 歲建資料 = 建除十二神含義(五虎簡易曆法.擇日.歲建十二神.名);
    五虎簡易曆法.擇日.歲建十二神.喜 = 歲建資料.喜;
    五虎簡易曆法.擇日.歲建十二神.忌 = 歲建資料.忌;
    五虎簡易曆法.擇日.歲建十二神.註解 = 歲建資料.註解;
    五虎簡易曆法.擇日.歲建十二神.吉凶 = 歲建資料.吉凶;
    
    五虎簡易曆法.擇日.彭祖百忌 = 彭祖百忌含義(五虎簡易曆法.干支曆.日柱.substr(0,1), 五虎簡易曆法.干支曆.日柱.substr(1,1), 五虎簡易曆法.擇日.歲建十二神.名);
    
    console.log(五虎簡易曆法);

    return 五虎簡易曆法;
} // function 五虎遁曆法編輯


