function 星君元辰(生年干支, 性別) {
    var 星君元辰元件 = {"本命生辰": 生年干支, "北斗數": 0, 北斗星: "", 本命星君: "", "星君號": "", "元辰干支": "", "元辰星君": "", "本命星官": "", "元辰星官":"", "驛馬":"", "總結":""};
    var 生年地支 = 生年干支.substr(1,1);
    var 陽年 = false, 陰年 = false;
    var 陽男陰女 = false;
    
    if(生年地支 == "子" || 生年地支 == "寅" || 生年地支 == "辰" || 生年地支 == "午" || 生年地支 == "申" || 生年地支 == "戌")  陽年 = true; else 陰年 = true;
    if ((陽年 && 性別 == "男") || (陰年 && 性別 == "女")) 陽男陰女 = true;
    
    switch(生年地支) {
        case "子":
            星君元辰元件.北斗數 = 1;
            星君元辰元件.北斗星 = "天樞";
            星君元辰元件.本命星君 = "貪狼";
            星君元辰元件.星君號 = "陽明貪狼太星君";
            break;
        case "丑": case "亥":
            星君元辰元件.北斗數 = 2;
            星君元辰元件.北斗星 = "天璇";
            星君元辰元件.本命星君 = "巨門";
            星君元辰元件.星君號 = "陰精巨門元星君";
            break;
        case "寅": case "戌":
            星君元辰元件.北斗數 = 3;
            星君元辰元件.北斗星 = "天璣";
            星君元辰元件.本命星君 = "祿存";
            星君元辰元件.星君號 = "真人祿存真星君";
            break;
        case "卯": case "酉":
            星君元辰元件.北斗數 = 4;
            星君元辰元件.北斗星 = "天權";
            星君元辰元件.本命星君 = "文曲";
            星君元辰元件.星君號 = "玄冥文曲紐星君";
            break;
        case "辰": case "申":
            星君元辰元件.北斗數 = 5;
            星君元辰元件.北斗星 = "玉衡";
            星君元辰元件.本命星君 = "廉貞";
            星君元辰元件.星君號 = "丹元廉貞綱星君";
            break;
        case "巳": case "未":
            星君元辰元件.北斗數 = 6;
            星君元辰元件.北斗星 = "開陽";
            星君元辰元件.本命星君 = "武曲";
            星君元辰元件.星君號 = "北極武曲紀星君";
            break;
        case "午":
            星君元辰元件.北斗數 = 7;
            星君元辰元件.北斗星 = "瑤光";
            星君元辰元件.本命星君 = "破軍";
            星君元辰元件.星君號 = "天關破軍關星君";
            break;
    }  // end switch
    
    if(陽男陰女) 星君元辰元件.元辰星君 = "左輔"; else 星君元辰元件.元辰星君 ="右弼";
    
    var 六十甲子本命元辰 = [
        { "干支": "甲子", "本命星官": "王文卿", "星官從官": "從官十八人", "本命星君": "貪狼星", "男命元辰干支": "乙未", "男命元辰星官": "杜仲陽", "男命元辰從官": "從官十六人", "女命元辰干支": "癸巳", "女命元辰星官": "史公來", "女命元辰從官": "從官九人"},
        { "干支": "乙丑", "本命星官": "龍季卿", "星官從官": "從官十六人", "本命星君": "巨門星", "男命元辰干支": "甲午", "男命元辰星官": "衛上卿", "男命元辰從官": "從官十八人", "女命元辰干支": "丙申", "女命元辰星官": "朱伯衆", "女命元辰從官": "從官十四人"},
        { "干支": "丙寅", "本命星官": "張仲卿", "星官從官": "從官十四人", "本命星君": "祿存星", "男命元辰干支": "丁酉", "男命元辰星官": "臧文公", "男命元辰從官": "從官十二人", "女命元辰干支": "乙未", "女命元辰星官": "杜仲陽", "女命元辰從官": "從官十六人"},
        { "干支": "丁卯", "本命星官": "司馬卿", "星官從官": "從官十二人", "本命星君": "文曲星", "男命元辰干支": "丙申", "男命元辰星官": "朱伯衆", "男命元辰從官": "從官十四人", "女命元辰干支": "戊戌", "女命元辰星官": "范少卿", "女命元辰從官": "從官十人"},
        { "干支": "戊辰", "本命星官": "季楚卿", "星官從官": "從官十人", "本命星君": "廉貞星", "男命元辰干支": "己亥", "男命元辰星官": "鄧都卿", "男命元辰從官": "從官十三人", "女命元辰干支": "丁酉", "女命元辰星官": "臧文公", "女命元辰從官": "從官十二人"},
        { "干支": "己巳", "本命星官": "何文昌", "星官從官": "從官十三人", "本命星君": "武曲星", "男命元辰干支": "戊戌", "男命元辰星官": "范少卿", "男命元辰從官": "從官十人", "女命元辰干支": "庚子", "女命元辰星官": "楊仲昇", "女命元辰從官": "從官十七人"},
        { "干支": "庚午", "本命星官": "馮仲卿", "星官從官": "從官十七人", "本命星君": "破軍星", "男命元辰干支": "辛丑", "男命元辰星官": "林衛卿", "男命元辰從官": "從官十五人", "女命元辰干支": "己亥", "女命元辰星官": "鄧都卿", "女命元辰從官": "從官十三人"},
        { "干支": "辛未", "本命星官": "王文章", "星官從官": "從官十五人", "本命星君": "武曲星", "男命元辰干支": "庚子", "男命元辰星官": "楊仲昇", "男命元辰從官": "從官十七人", "女命元辰干支": "壬寅", "女命元辰星官": "丘孟卿", "女命元辰從官": "從官十三人"},
        { "干支": "壬申", "本命星官": "侯博卿", "星官從官": "從官十三人", "本命星君": "廉貞星", "男命元辰干支": "癸卯", "男命元辰星官": "蘇他家", "男命元辰從官": "從官十一人", "女命元辰干支": "辛丑", "女命元辰星官": "林衛公", "女命元辰從官": "從官十五人"},
        { "干支": "癸酉", "本命星官": "孫仲房", "星官從官": "從官十一人", "本命星君": "文曲星", "男命元辰干支": "壬寅", "男命元辰星官": "丘孟卿", "男命元辰從官": "從官十三人", "女命元辰干支": "甲辰", "女命元辰星官": "孟非卿", "女命元辰從官": "從官十四人"},
        { "干支": "甲戌", "本命星官": "展子江", "星官從官": "從官十四人", "本命星君": "祿存星", "男命元辰干支": "乙巳", "男命元辰星官": "唐文卿", "男命元辰從官": "從官十二人", "女命元辰干支": "癸卯", "女命元辰星官": "蘇他家", "女命元辰從官": "從官十一人"},
        { "干支": "乙亥", "本命星官": "龐明心", "星官從官": "從官十二人", "本命星君": "巨門星", "男命元辰干支": "甲辰", "男命元辰星官": "孟非卿", "男命元辰從官": "從官十四人", "女命元辰干支": "丙午", "女命元辰星官": "魏文公", "女命元辰從官": "從官十六人"},
        { "干支": "丙子", "本命星官": "邢孫卿", "星官從官": "從官十六人", "本命星君": "貪狼星", "男命元辰干支": "丁未", "男命元辰星官": "石叔通", "男命元辰從官": "從官十四人", "女命元辰干支": "乙巳", "女命元辰星官": "唐文卿", "女命元辰從官": "從官十二人"},
        { "干支": "丁丑", "本命星官": "趙子玉", "星官從官": "從官十四人", "本命星君": "巨門星", "男命元辰干支": "丙午", "男命元辰星官": "魏文公", "男命元辰從官": "從官十六人", "女命元辰干支": "戊申", "女命元辰星官": "范伯陽", "女命元辰從官": "從官十二人"},
        { "干支": "戊寅", "本命星官": "虞子張", "星官從官": "從官十二人", "本命星君": "祿存星", "男命元辰干支": "己酉", "男命元辰星官": "成文長", "男命元辰從官": "從官十五人", "女命元辰干支": "丁未", "女命元辰星官": "石叔通", "女命元辰從官": "從官十四人"},
        { "干支": "巳卯", "本命星官": "石文陽", "星官從官": "從官十五人", "本命星君": "文曲星", "男命元辰干支": "戊申", "男命元辰星官": "范伯陽", "男命元辰從官": "從官十二人", "女命元辰干支": "庚戌", "女命元辰星官": "史子仁", "女命元辰從官": "從官十三人"},
        { "干支": "庚辰", "本命星官": "尹佳卿", "星官從官": "從官十三人", "本命星君": "廉貞星", "男命元辰干支": "辛亥", "男命元辰星官": "左子行", "男命元辰從官": "從官十一人", "女命元辰干支": "己酉", "女命元辰星官": "成文長", "女命元辰從官": "從官十五人"},
        { "干支": "辛巳", "本命星官": "陽仲公", "星官從官": "從官十一人", "本命星君": "武曲星", "男命元辰干支": "庚戌", "男命元辰星官": "史子仁", "男命元辰從官": "從官十三人", "女命元辰干支": "壬子", "女命元辰星官": "宿上卿", "女命元辰從官": "從官十五人"},
        { "干支": "壬午", "本命星官": "馬子明", "星官從官": "從官十五人", "本命星君": "破軍星", "男命元辰干支": "癸丑", "男命元辰星官": "江漢卿", "男命元辰從官": "從官十三人", "女命元辰干支": "辛亥", "女命元辰星官": "左子行", "女命元辰從官": "從官十一人"},
        { "干支": "癸未", "本命星官": "呂威明", "星官從官": "從官十三人", "本命星君": "武曲星", "男命元辰干支": "壬子", "男命元辰星官": "宿上卿", "男命元辰從官": "從官十五人", "女命元辰干支": "甲寅", "女命元辰星官": "明文章", "女命元辰從官": "從官十六人"},
        { "干支": "甲申", "本命星官": "扈文長", "星官從官": "從官十六人", "本命星君": "廉貞星", "男命元辰干支": "乙卯", "男命元辰星官": "戴公陽", "男命元辰從官": "從官十四人", "女命元辰干支": "癸丑", "女命元辰星官": "江漢卿", "女命元辰從官": "從官十三人"},
        { "干支": "乙酉", "本命星官": "孔利公", "星官從官": "從官十四人", "本命星君": "文曲星", "男命元辰干支": "甲寅", "男命元辰星官": "明文章", "男命元辰從官": "從官十六人", "女命元辰干支": "丙辰", "女命元辰星官": "霍叔英", "女命元辰從官": "從官十二人"},
        { "干支": "丙戌", "本命星官": "車元昇", "星官從官": "從官十二人", "本命星君": "綠存星", "男命元辰干支": "丁巳", "男命元辰星官": "崔巨卿", "男命元辰從官": "從官十人女", "女命元辰干支": "戴公", "女命元辰星官": "戴公陽", "女命元辰從官": "從官十四人"},
        { "干支": "丁亥", "本命星官": "張文通", "星官從官": "從官十人", "本命星君": "巨門星", "男命元辰干支": "丙辰", "男命元辰星官": "霍叔英", "男命元辰從官": "從官十二人", "女命元辰干支": "戊午", "女命元辰星官": "從元光", "女命元辰從官": "從官十四人"},
        { "干支": "戊子", "本命星官": "樂石陽", "星官從官": "從官十四人", "本命星君": "貪狼星", "男命元辰干支": "己未", "男命元辰星官": "時通卿", "男命元辰從官": "從官十七人", "女命元辰干支": "丁已", "女命元辰星官": "崔巨卿", "女命元辰從官": "從官十人"},
        { "干支": "己丑", "本命星官": "范仲陽", "星官從官": "從官十七人", "本命星君": "巨門星", "男命元辰干支": "戊午", "男命元辰星官": "從元光", "男命元辰從官": "從官十四人", "女命元辰干支": "庚申", "女命元辰星官": "華文陽", "女命元辰從官": "從官十五人"},
        { "干支": "庚寅", "本命星官": "褚進卿", "星官從官": "從官十五人", "本命星君": "綠存星", "男命元辰干支": "辛酉", "男命元辰星官": "郵元玉", "男命元辰從官": "從官十三人", "女命元辰干支": "己未", "女命元辰星官": "時通卿", "女命元辰從官": "從官十七人"},
        { "干支": "辛卯", "本命星官": "郭子良", "星官從官": "從官十三人", "本命星君": "文曲星", "男命元辰干支": "庚申", "男命元辰星官": "華文陽", "男命元辰從官": "從官十五人", "女命元辰干支": "壬戌", "女命元辰星官": "樂進卿", "女命元辰從官": "從官十一人"},
        { "干支": "壬辰", "本命星官": "武稚卿", "星官從官": "從官十一人", "本命星君": "廉貞星", "男命元辰干支": "癸亥", "男命元辰星官": "左石松", "男命元辰從官": "從官九人", "女命元辰干支": "辛酉", "女命元辰星官": "郵元玉", "女命元辰從官": "從官十三人"},
        { "干支": "癸巳", "本命星官": "史公來", "星官從官": "從官九人", "本命星君": "武曲星", "男命元辰干支": "壬戌", "男命元辰星官": "樂進卿", "男命元辰從官": "從官十一人", "女命元辰干支": "甲子", "女命元辰星官": "王文卿", "女命元辰從官": "從官十八人"},
        { "干支": "甲午", "本命星官": "衛上卿", "星官從官": "從官十八人", "本命星君": "破軍星", "男命元辰干支": "乙丑", "男命元辰星官": "龍季卿", "男命元辰從官": "從官十六人", "女命元辰干支": "癸亥", "女命元辰星官": "左石松", "女命元辰從官": "從官九人"},
        { "干支": "乙未", "本命星官": "杜仲陽", "星官從官": "從官十六人", "本命星君": "武曲星", "男命元辰干支": "甲子", "男命元辰星官": "王文卿", "男命元辰從官": "從官十八人", "女命元辰干支": "丙寅", "女命元辰星官": "張仲卿", "女命元辰從官": "從官十四人"},
        { "干支": "丙申", "本命星官": "朱伯眾", "星官從官": "從官十四人", "本命星君": "廉貞星", "男命元辰干支": "丁卯", "男命元辰星官": "司馬卿", "男命元辰從官": "從官十一人", "女命元辰干支": "乙丑", "女命元辰星官": "龍季卿", "女命元辰從官": "從官十六人"},
        { "干支": "丁酉", "本命星官": "臧文公", "星官從官": "從官十二人", "本命星君": "文曲星", "男命元辰干支": "丙寅", "男命元辰星官": "張仲卿", "男命元辰從官": "從官十四人", "女命元辰干支": "戊辰", "女命元辰星官": "季楚卿", "女命元辰從官": "從官十人"},
        { "干支": "戊戌", "本命星官": "范少卿", "星官從官": "從官十人", "本命星君": "祿存星", "男命元辰干支": "己巳", "男命元辰星官": "何文昌", "男命元辰從官": "從官十三人", "女命元辰干支": "丁卯", "女命元辰星官": "司馬卿", "女命元辰從官": "從官十二人"},
        { "干支": "己亥", "本命星官": "鄧都卿", "星官從官": "從官十三人", "本命星君": "巨門星", "男命元辰干支": "戊辰", "男命元辰星官": "季楚卿", "男命元辰從官": "從官十人", "女命元辰干支": "庚午", "女命元辰星官": "馮仲卿", "女命元辰從官": "從官十七人"},
        { "干支": "庚子", "本命星官": "楊仲昇", "星官從官": "從官十七人", "本命星君": "貪狼星", "男命元辰干支": "辛未", "男命元辰星官": "王文章", "男命元辰從官": "從官十五人", "女命元辰干支": "己巳", "女命元辰星官": "何文昌", "女命元辰從官": "從官十三人"},
        { "干支": "辛丑", "本命星官": "林衛公", "星官從官": "從官十五人", "本命星君": "巨門星", "男命元辰干支": "庚午", "男命元辰星官": "馮仲卿", "男命元辰從官": "從官十七人", "女命元辰干支": "壬申", "女命元辰星官": "侯博卿", "女命元辰從官": "從官十三人"},
        { "干支": "壬寅", "本命星官": "丘孟卿", "星官從官": "從官十三人", "本命星君": "祿存星", "男命元辰干支": "癸酉", "男命元辰星官": "孫仲房", "男命元辰從官": "從官十一人", "女命元辰干支": "辛未", "女命元辰星官": "王文章", "女命元辰從官": "從官十五人"},
        { "干支": "癸卯", "本命星官": "蘇他家", "星官從官": "從官十一人", "本命星君": "文曲星", "男命元辰干支": "壬申", "男命元辰星官": "侯博卿", "男命元辰從官": "從官十三人", "女命元辰干支": "甲戌", "女命元辰星官": "展子江", "女命元辰從官": "從官十四人"},
        { "干支": "甲辰", "本命星官": "孟非卿", "星官從官": "從官十四人", "本命星君": "廉貞星", "男命元辰干支": "乙亥", "男命元辰星官": "龐明心", "男命元辰從官": "從官十二人", "女命元辰干支": "癸酉", "女命元辰星官": "孫仲房", "女命元辰從官": "從官十一人"},
        { "干支": "乙巳", "本命星官": "唐文卿", "星官從官": "從官十二人", "本命星君": "武曲星", "男命元辰干支": "甲戌", "男命元辰星官": "展子江", "男命元辰從官": "從官十四人", "女命元辰干支": "丙子", "女命元辰星官": "邢孫卿", "女命元辰從官": "從官十六人"},
        { "干支": "丙午", "本命星官": "魏文公", "星官從官": "從官十六人", "本命星君": "破軍星", "男命元辰干支": "丁丑", "男命元辰星官": "趙子玉", "男命元辰從官": "從官十四人", "女命元辰干支": "乙亥", "女命元辰星官": "龐明心", "女命元辰從官": "從官十二人"},
        { "干支": "丁未", "本命星官": "石叔通", "星官從官": "從官十四人", "本命星君": "武曲星", "男命元辰干支": "丙子", "男命元辰星官": "邢孫卿", "男命元辰從官": "從官十六人", "女命元辰干支": "戊寅", "女命元辰星官": "虞子張", "女命元辰從官": "從官十二人"},
        { "干支": "戊申", "本命星官": "范伯陽", "星官從官": "從官十二人", "本命星君": "廉貞星", "男命元辰干支": "己卯", "男命元辰星官": "石文陽", "男命元辰從官": "從官十五人", "女命元辰干支": "丁丑", "女命元辰星官": "趙子玉", "女命元辰從官": "從官十四人"},
        { "干支": "己酉", "本命星官": "成文長", "星官從官": "從官十五人", "本命星君": "文曲星", "男命元辰干支": "戊寅", "男命元辰星官": "虞子張", "男命元辰從官": "從官十二人", "女命元辰干支": "庚辰", "女命元辰星官": "尹佳卿", "女命元辰從官": "從官十三人"},
        { "干支": "庚戌", "本命星官": "史子仁", "星官從官": "從官十三人", "本命星君": "祿存星", "男命元辰干支": "辛巳", "男命元辰星官": "楊仲公", "男命元辰從官": "從官十一人", "女命元辰干支": "己卯", "女命元辰星官": "石文陽", "女命元辰從官": "從官十五人"},
        { "干支": "辛亥", "本命星官": "左子行", "星官從官": "從官十一人", "本命星君": "巨門星", "男命元辰干支": "庚辰", "男命元辰星官": "尹佳卿", "男命元辰從官": "從官十三人", "女命元辰干支": "壬午", "女命元辰星官": "馬子明", "女命元辰從官": "從官十五人"},
        { "干支": "壬子", "本命星官": "宿上卿", "星官從官": "從官十五人", "本命星君": "貪狼星", "男命元辰干支": "癸未", "男命元辰星官": "呂威明", "男命元辰從官": "從官十三人", "女命元辰干支": "辛巳", "女命元辰星官": "楊仲公", "女命元辰從官": "從官十一人"},
        { "干支": "癸丑", "本命星官": "江漢卿", "星官從官": "從官十三人", "本命星君": "巨門星", "男命元辰干支": "壬午", "男命元辰星官": "馬子明", "男命元辰從官": "從官十五人", "女命元辰干支": "甲申", "女命元辰星官": "扈文長", "女命元辰從官": "從官十六人"},
        { "干支": "甲寅", "本命星官": "明文章", "星官從官": "從官十六人", "本命星君": "祿存星", "男命元辰干支": "乙酉", "男命元辰星官": "孔利公", "男命元辰從官": "從官十四人", "女命元辰干支": "癸未", "女命元辰星官": "呂威明", "女命元辰從官": "從官十三人"},
        { "干支": "乙卯", "本命星官": "戴公陽", "星官從官": "從官十四人", "本命星君": "文曲星", "男命元辰干支": "甲申", "男命元辰星官": "扈文長", "男命元辰從官": "從官十六人", "女命元辰干支": "丙戌", "女命元辰星官": "車元昇", "女命元辰從官": "從官十二人"},
        { "干支": "丙辰", "本命星官": "霍叔英", "星官從官": "從官十二人", "本命星君": "廉貞星", "男命元辰干支": "丁亥", "男命元辰星官": "張文通", "男命元辰從官": "從官十人", "女命元辰干支": "酉孔", "女命元辰星官": "孔利公", "女命元辰從官": "從官十四人"},
        { "干支": "丁巳", "本命星官": "崔巨卿", "星官從官": "從官十人", "本命星君": "武曲星", "男命元辰干支": "丙戌", "男命元辰星官": "車元昇", "男命元辰從官": "從官十二人", "女命元辰干支": "戊子", "女命元辰星官": "樂石陽", "女命元辰從官": "從官十四人"},
        { "干支": "戊午", "本命星官": "從天光", "星官從官": "從官十四人", "本命星君": "破軍星", "男命元辰干支": "己丑", "男命元辰星官": "范仲陽", "男命元辰從官": "從官十七人", "女命元辰干支": "丁亥", "女命元辰星官": "張文通", "女命元辰從官": "從官十人"},
        { "干支": "己未", "本命星官": "時通卿", "星官從官": "從官十七人", "本命星君": "武曲星", "男命元辰干支": "戊子", "男命元辰星官": "樂石陽", "男命元辰從官": "從官十四人", "女命元辰干支": "庚寅", "女命元辰星官": "褚進卿", "女命元辰從官": "從官十五人"},
        { "干支": "庚申", "本命星官": "華文陽", "星官從官": "從官十五人", "本命星君": "廉貞星", "男命元辰干支": "辛卯", "男命元辰星官": "郭子良", "男命元辰從官": "從官十三人", "女命元辰干支": "己丑", "女命元辰星官": "范仲陽", "女命元辰從官": "從官十七人"},
        { "干支": "辛酉", "本命星官": "邴元玉", "星官從官": "從官十三人", "本命星君": "文曲星", "男命元辰干支": "庚寅", "男命元辰星官": "褚進卿", "男命元辰從官": "從官十五人", "女命元辰干支": "壬辰", "女命元辰星官": "武稚卿", "女命元辰從官": "從官十一人"},
        { "干支": "壬戌", "本命星官": "樂進卿", "星官從官": "從官十一人", "本命星君": "祿存星", "男命元辰干支": "癸巳", "男命元辰星官": "史公來", "男命元辰從官": "從官九人", "女命元辰干支": "辛卯", "女命元辰星官": "郭子良", "女命元辰從官": "從官十三人"},
        { "干支": "癸亥", "本命星官": "左石松", "星官從官": "從官九人", "本命星君": "巨門星", "男命元辰干支": "壬辰", "男命元辰星官": "武稚卿", "男命元辰從官": "從官十一人", "女命元辰干支": "甲午", "女命元辰星官": "衛上卿", "女命元辰從官": "從官十八人"}
    ];
    
    var 資料索引=_.findIndex(六十甲子本命元辰, {干支: 生年干支});
    
    if (資料索引 != -1) { 
        星君元辰元件.本命星官 = 六十甲子本命元辰[資料索引]["本命星官"];
        
        if(性別=="男") {
            星君元辰元件.元辰干支 = 六十甲子本命元辰[資料索引]["男命元辰干支"];
            星君元辰元件.元辰星官 = 六十甲子本命元辰[資料索引]["男命元辰星官"];
        }  // 男命
        
    if(性別=="女") {
            星君元辰元件.元辰干支 = 六十甲子本命元辰[資料索引]["女命元辰干支"];
            星君元辰元件.元辰星官 = 六十甲子本命元辰[資料索引]["女命元辰星官"];
        }  // 女命
    } // end if 資料索引
    
    
    // 五福驛馬神君，本命之吉神也，申子辰人在寅位，巳酉丑人在亥位，寅午戌人在申位，亥卯未人在巳位，以本旬所生為正位也
    switch(生年地支) {
        case "申": case "子": case "辰": 
            星君元辰元件.驛馬 = "寅";
            break;
        case "巳": case "酉": case "丑": 
            星君元辰元件.驛馬 = "亥";
            break;
        case "寅": case "午": case "戌": 
            星君元辰元件.驛馬 = "申";
            break;
        case "亥": case "卯": case "未": 
            星君元辰元件.驛馬 = "巳";
    }  // end switch 生年地支 驛馬
    
    星君元辰元件.總結 = "本命生辰：" + 星君元辰元件.本命生辰 + "日，" + "北斗星：" + 星君元辰元件.北斗星 + "，本命星君：" + 星君元辰元件.星君號 + "，本命元辰：" + 星君元辰元件.元辰星君 + "<br>本命星官：" + 星君元辰元件.本命星官 + "，元辰星官：" + 星君元辰元件.元辰星官 + "(" + 星君元辰元件.元辰干支 + ")" + "，驛馬：" + 星君元辰元件.驛馬;    
    
    return 星君元辰元件;
}  // end function 星君元辰
