function 建除十二神查詢(查詢月支, 查詢日支) {
	var 資料索引;
    //console.log(查詢月 + "/" + 查詢日);
    
	var 建除資料 = [
        { "月支": "寅", "寅": "建", "卯": "除", "辰": "滿", "巳": "平", "午": "定", "未": "執", "申": "破", "酉": "危", "戌": "成", "亥": "收", "子": "開", "丑": "閉"},
        { "月支": "卯", "寅": "閉", "卯": "建", "辰": "除", "巳": "滿", "午": "平", "未": "定", "申": "執", "酉": "破", "戌": "危", "亥": "成", "子": "收", "丑": "開"},
        { "月支": "辰", "寅": "開", "卯": "閉", "辰": "建", "巳": "除", "午": "滿", "未": "平", "申": "定", "酉": "執", "戌": "破", "亥": "危", "子": "成", "丑": "收"},
        { "月支": "巳", "寅": "收", "卯": "開", "辰": "閉", "巳": "建", "午": "除", "未": "滿", "申": "平", "酉": "定", "戌": "執", "亥": "破", "子": "危", "丑": "成"},
        { "月支": "午", "寅": "成", "卯": "收", "辰": "開", "巳": "閉", "午": "建", "未": "除", "申": "滿", "酉": "平", "戌": "定", "亥": "執", "子": "破", "丑": "危"},
        { "月支": "未", "寅": "危", "卯": "成", "辰": "收", "巳": "開", "午": "閉", "未": "建", "申": "除", "酉": "滿", "戌": "平", "亥": "定", "子": "執", "丑": "破"},
        { "月支": "申", "寅": "破", "卯": "危", "辰": "成", "巳": "收", "午": "開", "未": "閉", "申": "建", "酉": "除", "戌": "滿", "亥": "平", "子": "定", "丑": "執"},
        { "月支": "酉", "寅": "執", "卯": "破", "辰": "危", "巳": "成", "午": "收", "未": "開", "申": "閉", "酉": "建", "戌": "除", "亥": "滿", "子": "平", "丑": "定"},
        { "月支": "戌", "寅": "定", "卯": "執", "辰": "破", "巳": "危", "午": "成", "未": "收", "申": "開", "酉": "閉", "戌": "建", "亥": "除", "子": "滿", "丑": "平"},
        { "月支": "亥", "寅": "平", "卯": "定", "辰": "執", "巳": "破", "午": "危", "未": "成", "申": "收", "酉": "開", "戌": "閉", "亥": "建", "子": "除", "丑": "滿"},
        { "月支": "子", "寅": "滿", "卯": "平", "辰": "定", "巳": "執", "午": "破", "未": "危", "申": "成", "酉": "收", "戌": "開", "亥": "閉", "子": "建", "丑": "除"},
        { "月支": "丑", "寅": "除", "卯": "滿", "辰": "平", "巳": "定", "午": "執", "未": "破", "申": "危", "酉": "成", "戌": "收", "亥": "開", "子": "閉", "丑": "建"}
	];

	資料索引=_.findIndex(建除資料, {月支: 查詢月支});
    
    var 建除十二神字;
    
    if (資料索引 != -1) {
        return 建除資料[資料索引][查詢日支];
    } else console.log(查詢月 + " / " + 查詢日);  //2019-08-10
}  //end function 建除十二神


function 建除十二神含義(建除十二神) {
	var 資料索引;
	var 歲建資料 = [
        { "歲建": "建", "吉凶": "不利", "註解1": "建者，健也。屬於健旺之氣。宜見官、練武藝、教馬。在五月、四月、七月及十一月，不宜作遠行的出發日子，忌落葬，否則，子孫出愚蠢、沉迷酒色之人。建日屬於不利的日子。", "註解2": "建日與王日官日同義，古宜詔命公卿，舉賢招士，又宜上官赴任、臨政親民、出行移徙。建日氣專，故不宜婚嫁喜慶用事。", "喜": "入學、出行、赴任、祭祀", "忌": "動土、開倉", "備註": ""},
        { "歲建": "除", "吉凶": "吉利", "註解1": "除者除也，有除舊生新之義。宜進行一個醫療程序的開始，捉賊、治鬼、驅邪、斷白蟻、塞鼠穴，告貪官或犯法之人。最忌上任當官、結婚、葬埋、開張、搬遷、動土、遠行的出發日子。不過，除日屬於吉星，結婚、葬埋、修造（裝修）亦作吉論。", "註解2": "除日取義解除，有破舊立新之意，曆書註宜沐浴、剃頭、整手足甲、求醫療病、掃舍宇；今可擇此日整容、解除合約、摒除舊物、分手、離婚、除服、搬運、動土裝修等。", "喜": "祭祀、祈褔、出行、搬遷、出貨、動土、求醫、交易", "忌": "結婚、赴任、簽約", "備註": ""},
        { "歲建": "滿", "吉凶": "不利", "註解1": "滿者，豐豫盈溢之象。故宜造貨倉，安設保險箱。此星名土瘟，忌動土、葬埋。在正、四、七、十月忌搬遷及開張。", "註解2": "滿取豐豫之義，又與天巫及福德義同，宜進人口、開市立券、交易納財，今可擇此日置產業、開張、聘家傭，但不宜婚嫁喜慶用事。", "喜": "嫁娶、開市、交易、求財、立契、祭祀、祈福、出行、牧養", "忌": "喪葬、赴任、求醫", "備註": ""},
        { "歲建": "平", "吉凶": "不利", "註解1": "繩糾齊一之義，宜行船、打獵、裝修、除災、結婚，造葬用平日，只屬平平。", "註解2": "取義平，古人平治道涂用此日，平日不宜婚嫁。", "喜": "嫁娶、移徒、建造、修飾房屋", "忌": "栽種、掘溝", "備註": ""},
        { "歲建": "定", "吉凶": "吉利", "註解1": "定者，死氣也。忌搬遷、開張種植植物。但宜安床、祈福、結婚。", "註解2": "古以定日宜冠帶，因定日與月令三合，取其成局之義，冠帶是古人冠上的帶，男子二十行成人之禮，謂之冠帶，今可用作畢業謝日。", "喜": "祭祀、祈褔、嫁娶、造屋、裝修、修路、開市、入學、上任", "忌": "官訟、出行、詞訟、交涉", "備註": ""},
        { "歲建": "執", "吉凶": "吉利", "註解1": "執者，固執之謂，有威儀權勢，宜捕賊擒兇、結婚。除非為年破，否則不算是凶日。", "註解2": "執日取義守成，即是守住成果，不宜冒進。《星歷考原》將執日定吉日，是因為這一日的日支帶「支德」，但同時又是月內的「小耗」，主有小破耗，故執日宜祭祀、修垣、捕獵，忌開市立約、訂親嫁娶。", "喜": "嫁娶、收購、立契、捕捉、造屋、裝修、祭祀", "忌": "開市、交易、搬遷、出行、求財", "備註": ""},
        { "歲建": "破", "吉凶": "不利", "註解1": "破者，剛旺破敗，凡事耗凶。最忌結婚、開張、交易，原則上是諸事不宜。但以下的行事卻不怕，疾病療程的第一天、針灸、破屋，驅賊等。", "註解2": "破日是日月支沖之日，相衝謂破，主動，又是月中虛耗之神，名「大耗」。故凡喜慶、婚嫁、開張、立約、置產業等，均忌破日。破日取義破舊，曆書宜破日用事者，有破屋壞垣（裝修拆牆）、求醫療病、入院動手術用破日，反不為忌。", "喜": "破土、求醫、拆卸", "忌": "出行、嫁娶、簽約、交涉、搬遷、諸事無果。動土尤忌", "備註": ""},
        { "歲建": "危", "吉凶": "吉利", "註解1": "危者，危險之形，高大之貌，最忌登山，容易發生危險之事情。如遇吉星，宜安床、經營。至於結婚、造葬仍是不吉利。", "註解2": "危是二十八宿之一，危三星主天府、天市、架屋，是極富之星。故危日是十二神中的吉神，不危反安，宜用天祈福、安床、入宅。", "喜": "官司了解、逃脫、解脫、破土、拆卸", "忌": "登山、乘船、出行、嫁娶、造葬、遷徒", "備註": ""},
        { "歲建": "成", "吉凶": "吉利", "註解1": "成者，結果成就之義，凡事皆成，但主先難後易，終成和合。再遇吉星，結婚則生貴子，開張則得到大利益，其他一般行事都非常吉利。", "註解2": "成日是月支的三合日，又稱「天醫」及「天喜」，取義三合能令萬物死而復生、損而復益，十二神中的吉神。通宜開市立約、婚姻嫁娶、祈福求謀、入學求職等，取其三合安合、有志者事竟成也。", "喜": "嫁娶、移徙、出行、立約、結婚、開市、修造、破土、安葬、搬遷、交易", "忌": "官訟、詞訟", "備註": ""},
        { "歲建": "收", "吉凶": "不利", "註解1": "雖有收成之義，但必須配合吉星才作吉利論。宜搬遷、遠行、埋葬、購樓買地。至於官非方面，宜我告人，贏的機會甚大；忌被人告，因為輸的機會甚大。", "註解2": "收日為河魁、天罡，兇惡之神，若見吉神尚可，再遇兇神則更兇。曆書取義收，又有修意，宜納財、進人口、捕捉、納畜，亦宜修造。", "喜": "開市、納財、捕捉、祈褔、求嗣、嫁娶、安床、修造、動土、交易、買賣、立契", "忌": "新車下地、出行、放債、行喪", "備註": ""},
        { "歲建": "開", "吉凶": "吉利", "註解1": "生氣之意，宜結婚、搬遷、交易、開張及各類一般行事。最忌埋葬，反主大凶。三、六、九、十二月忌動土。", "註解2": "開日是一陽始生之日，又為生氣之日，最吉，通宜祈福祭祀、宣政行惠、雪冤枉、緩刑獄、上任出行、動土上梁、開市置產；忌破土安葬、伐木取魚；開日無合義，雖吉，婚嫁不用。", "喜": "開市、上任、上訴、祭祀、祈褔、入學、修造、動土、安床、交易、出行", "忌": "破土、安葬、出行、求醫", "備註": ""},
        { "歲建": "閉", "吉凶": "不利", "註解1": "閉者，堅閉之義，宜埋葬，主子孫富貴，將貴重物品收藏起來，不會被偷盜，亦宜殺白蟻、塞鼠穴，娶妻則妻子賢淑。最忌商鋪開張、搬遷。", "註解2": "取義土氣阻泄，生氣未發，故築隄防、捕垣塞穴，忌吉慶用事。", "喜": "休息，調養、生息、安葬、埋穴、立牌", "忌": "開市、出行、動土、出行、求官、求財、求醫、手術、嫁娶", "備註": ""}
	];

	資料索引=_.findIndex(歲建資料, {歲建: 建除十二神});
    
    var 歲建含義 = {};
    if (資料索引 != -1) { 
        歲建含義.名 = 建除十二神;
        歲建含義.吉凶 = 歲建資料[資料索引]["吉凶"];
        歲建含義.註解 = 歲建資料[資料索引]["註解1"];
        歲建含義.喜 = 歲建資料[資料索引]["喜"];
        歲建含義.忌 = 歲建資料[資料索引]["忌"];
        
        return 歲建含義;
    } // end if
    
}  //end function 建除十二神含義


function 彭祖百忌含義(查詢天干, 查詢地支, 查詢歲建) {
	var 天干資料索引, 地支資料索引, 歲建資料索引;
    
	var 天干資料 = [
        { "天干": "甲", "彭祖百忌": "甲不開倉，財物耗亡。"},
        { "天干": "乙", "彭祖百忌": "乙不栽植，千株不長。"},
        { "天干": "丙", "彭祖百忌": "丙不修灶，必見災殃。"},
        { "天干": "丁", "彭祖百忌": "丁不剃頭，頭主生瘡。"},
        { "天干": "戊", "彭祖百忌": "戊不受田，田主不祥。"},
        { "天干": "己", "彭祖百忌": "己不破券，二比並亡。"},
        { "天干": "庚", "彭祖百忌": "庚不經絡，織機虛張。"},
        { "天干": "辛", "彭祖百忌": "辛不合醬，主人不嘗。"},
        { "天干": "壬", "彭祖百忌": "壬不決水，更難提防。"},
        { "天干": "癸", "彭祖百忌": "癸不詞訟，理弱敵強。"}
	];

 	var 地支資料 = [
        { "地支": "子", "彭祖百忌": "子不問卜，自惹禍殃。"},
        { "地支": "丑", "彭祖百忌": "丑不冠帶，主不還鄉。"},
        { "地支": "寅", "彭祖百忌": "寅不祭祀，神鬼不嘗。"},
        { "地支": "卯", "彭祖百忌": "卯不穿井，水泉不香。"},
        { "地支": "辰", "彭祖百忌": "辰不哭泣，必主重喪。"},
        { "地支": "巳", "彭祖百忌": "巳不遠行，財物伏藏。"},
        { "地支": "午", "彭祖百忌": "午不苫蓋，屋主更張。"},
        { "地支": "未", "彭祖百忌": "未不服藥，毒氣入腸。"},
        { "地支": "申", "彭祖百忌": "申不安床，鬼祟入房。"},
        { "地支": "酉", "彭祖百忌": "酉不宴客，醉坐顛狂。"},
        { "地支": "戌", "彭祖百忌": "戌不吃犬，作怪上床。"},
        { "地支": "亥", "彭祖百忌": "亥不嫁娶，不利新郎。"}
	];

 	var 歲建資料 = [
        { "歲建": "建", "彭祖百忌": "建宜出行，不可開倉。"},
        { "歲建": "除", "彭祖百忌": "除可服藥，針炙宜良。"},
        { "歲建": "滿", "彭祖百忌": "滿可肆市，服藥遭殃。"},
        { "歲建": "平", "彭祖百忌": "平可涂泥，安機吉昌。"},
        { "歲建": "定", "彭祖百忌": "定宜進畜，入學名揚。"},
        { "歲建": "執", "彭祖百忌": "執可捕捉，盜賊難藏。"},
        { "歲建": "破", "彭祖百忌": "破宜治病，主必安康。"},
        { "歲建": "危", "彭祖百忌": "危可捕魚，不利行船。"},
        { "歲建": "成", "彭祖百忌": "成可入學，爭訟不強。"},
        { "歲建": "收", "彭祖百忌": "收宜納財，卻忌安葬。"},
        { "歲建": "開", "彭祖百忌": "開可求仕，安葬不詳。"},
        { "歲建": "閉", "彭祖百忌": "閉不豎造，只許安床。"}
	];
    
	天干資料索引=_.findIndex(天干資料, {天干: 查詢天干});
    地支資料索引=_.findIndex(地支資料, {地支: 查詢地支});
    歲建資料索引=_.findIndex(歲建資料, {歲建: 查詢歲建});
    
    var 彭祖百忌 = {"天干": "", "地支": "", "歲建": ""};
    
    if (天干資料索引 != -1) 彭祖百忌.天干 = 天干資料[天干資料索引]["彭祖百忌"];
    if (地支資料索引 != -1) 彭祖百忌.地支 = 地支資料[地支資料索引]["彭祖百忌"];
    if (歲建資料索引 != -1) 彭祖百忌.歲建 = 歲建資料[歲建資料索引]["彭祖百忌"];
        
    return 彭祖百忌;
    
}  //end function 彭祖百忌含義


function 黃道黑道神煞(查詢地支) {
    var 黃黑神煞 = {};
    黃黑神煞.神煞= ""; 黃黑神煞.註解 = ""; 黃黑神煞.黃道吉日 = false;
    
    switch(查詢地支) {
        case "子":
            黃黑神煞.神煞 = "青龍";
            黃黑神煞.註解 = "吉，青龍黃道，天乙星，天貴星，利有攸往，所作必成，所求皆得。";
            黃黑神煞.黃道吉日 = true;
            break;
        case "丑":
            黃黑神煞.神煞 = "明堂";
            黃黑神煞.註解 = "吉，明堂黃道，貴人星，明輔星，利見大人，利有攸往，怕作必成。";
            黃黑神煞.黃道吉日 = true;
            break;
        case "寅":
            黃黑神煞.神煞 = "天刑";
            黃黑神煞.註解 = "驛馬強動，天刑黑道，天刑星，利於出師，戰無不克，其他動作謀為皆不宜用，大忌詞訟。";
            break;
        case "卯":
            黃黑神煞.神煞 = "朱雀";
            黃黑神煞.註解 = "口舌，朱雀黑道，天訟星，利用公事，常人凶，諸事忌用，謹防爭訟。";
            break;
        case "辰":
            黃黑神煞.神煞 = "金貴";
            黃黑神煞.註解 = "財星吉。金匱黃道，福德星，月仙星，利釋道用事，閽者女子用事，吉；宜嫁娶，不宜整戎伍。";
            黃黑神煞.黃道吉日 = true;
            break;
        case "巳":
            黃黑神煞.神煞 = "天德";
            黃黑神煞.註解 = "官貴吉，天德黃道，寶光星，天德星，其時大郭，作事有成，利有攸往，出行吉。";
            黃黑神煞.黃道吉日 = true;
            break;
        case "午":
            黃黑神煞.神煞 = "白虎";
            黃黑神煞.註解 = "口舌官非，白虎黑道，天殺星，宜出師畋獵祭祀，皆吉，其餘都不利。";
            break;
        case "未":
            黃黑神煞.神煞 = "玉堂";
            黃黑神煞.註解 = "吉，玉堂黃道，少微星，天開星，百事吉，求事成，出行有財，宜文書喜慶之事，利見大人，利安葬，不利泥灶。";
            黃黑神煞.黃道吉日 = true;
            break;
        case "申":
            黃黑神煞.神煞 = "天牢";
            黃黑神煞.註解 = "凶星宜忌，天牢黑道，鎮神星，陰人用事皆吉，其餘都不利。";
            break;
        case "酉":
            黃黑神煞.神煞 = "玄武";
            黃黑神煞.註解 = "內小人盜賊暗害，玄武黑道，天獄星，君子用之吉，小人用之凶，忌詞訟博戲。";
            break;
        case "戌":
            黃黑神煞.神煞 = "司命";
            黃黑神煞.註解 = "官長吉，司命黃道，鳳輦星，月仙星，此時從寅至申時用事大吉，從酉至丑時有事不吉，即白天吉，晚上不利。";
            黃黑神煞.黃道吉日 = true;
            break;
        case "亥":
            黃黑神煞.神煞 = "勾陳";
            黃黑神煞.註解 = "口舌牽連，勾陳黑道，地獄星，此時所作一切事，有始無終，先喜後悲，不利攸往；起造安葬，犯此不利。";
            break;
    } // end switch
    
    if(黃黑神煞.神煞!="") return 黃黑神煞;
} // end function 黃道黑道神煞